{
  "Champ Round 1 (32 Man)": "<section class=\"tw-list\">\n<h1>Champ Round 1 (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Michael Cullen (Wrestling Factory) won by fall over Ruben Garza (Riverdale Jr Rams WC) Fall 1:52</li>\n<li>Champ. Round 1 - Kyle Akins (Sycamore WC) won by decision over Conrad Zaucha (Waubonsie WC) Dec 3-0</li>\n<li>Champ. Round 1 - Grant Sutton (Wrestling Factory) won by decision over AJ Villarreal (Hinsdale Red Devils Wc) Dec 2-0</li>\n<li>Champ. Round 1 - Sean Cannon (Crystal Lake Wizards) won by decision over Keneth Baldridge (Yorkville Wrestling Club) Dec 4-1</li>\n<li>Champ. Round 1 - Dylan Cramer (Force Wrestling) won by major decision over Sean McMahon (Tinley Park Bulldogs) Maj 10-0</li>\n<li>Champ. Round 1 - Justin Nelson (GC Jr Warriors) won by fall over Cameron Schwing (Fisher WC) Fall 2:01</li>\n<li>Champ. Round 1 - Francis Edelen (Oak Forest Warriors) won by tech fall over Stephen West (O`Fallon Little Panthers) TF 17-1</li>\n<li>Champ. Round 1 - Brian Rossi (Falcon WC) won by fall over Noah McBee (Vermilion Valley Elite) Fall 1:49</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Joshua Boggess (Arlington Cardinals) won by major decision over Austin Olalde (Sauk Valley WC) Maj 15-3</li>\n<li>Champ. Round 1 - Tom Ward (Hinsdale Red Devils Wc) won by fall over Nathan Jozsa (Mt. Zion WC) Fall 2:03</li>\n<li>Champ. Round 1 - Richard Browne (Gomez Wrestling Academy) won by fall over Javon McGrown (Lionheart Intense Wrestling) Fall 0:54</li>\n<li>Champ. Round 1 - Tyler Svestka (Martinez Fox Valley Elite) won by decision over Brady Ruden (Rocket Fuel WC-Rock Ridge) Dec 9-6</li>\n<li>Champ. Round 1 - Dominic Naso (Lemont Bears WC) won by decision over Brandon Ahlgrim (Xtreme Wrestling) Dec 5-2</li>\n<li>Champ. Round 1 - Brad Wood (Orland Park Pioneers) won by tech fall over Hayden Grammer (Edwardsville WC) TF 17-2</li>\n<li>Champ. Round 1 - Reuben Reyes (Force Wrestling) won by decision over Jonathan Gahagan (Vittum Cats) Dec 4-0</li>\n<li>Champ. Round 1 - Devin Tortorice (Wolves WC) won by decision over Keith McDonough (Bethalto Bulls WC) Dec 2-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Kyle Fugiel (Crystal Lake Wizards) won by fall over Randall Hornbaker (Tiger WC) Fall 3:59</li>\n<li>Champ. Round 1 - Ben Clifford (Gomez Wrestling Academy) won by fall over Jake Henson (Bethalto Bulls WC) Fall 2:29</li>\n<li>Champ. Round 1 - Martin Martinez (Waukegan Youth WC) won by major decision over Dylan Donner (Falcon Youth WC) Maj 12-2</li>\n<li>Champ. Round 1 - Briar King (GC Jr Warriors) won by decision over Wade Lardy (Crystal Lake Wizards) Dec 6-1</li>\n<li>Champ. Round 1 - Austin Graham (Waubonsie WC) won by decision over Haley Augello (Lemont Bears WC) Dec 2-0</li>\n<li>Champ. Round 1 - Joshua Fuqua (Crosstown WC) won by major decision over Zechariah Smith (Rocket Fuel WC-Rock Ridge) Maj 8-0</li>\n<li>Champ. Round 1 - Joey Shump (Batavia Pinners) won by decision over Isaiah Stedwill (Chilli Dawgs WC) Dec 2-1</li>\n<li>Champ. Round 1 - Quinton Starzyk (Vittum Cats) won by tech fall over Malcolm Hill (Minooka Little Indians) TF 17-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Kegan Wakefield (Wrestling Factory) won by fall over Jacob Wever (L-P Crunching Cavs) Fall 0:59</li>\n<li>Champ. Round 1 - Flynn Nagel (Vittum Cats) won by decision over Max Burling (Central Elite Rebels) Dec 8-2</li>\n<li>Champ. Round 1 - Nathan Newman (Midwest Central Youth) won by major decision over Seth Bowman (Argenta/Oreana Kids Club) Maj 9-0</li>\n<li>Champ. Round 1 - Jordan Scalice (Gomez Wrestling Academy) won by fall over Ignacio Frias (Lemont Bears WC) Fall 0:12</li>\n<li>Champ. Round 1 - Alphonse Vruno (Martinez Fox Valley Elite) won by fall over Ryan Hessler (Edwardsville WC) Fall 0:26</li>\n<li>Champ. Round 1 - Jake Messink (Harlem Cougars) won by decision over Cole Ferguson (Hilltoppers WC) Dec 2-1</li>\n<li>Champ. Round 1 - Adrian Gonzalez (Dundee Highlanders) won by major decision over Jason Soto (SCN Youth WC) Maj 9-0</li>\n<li>Champ. Round 1 - Chase Vosburgh (Mt. Vernon Lions) won by decision over Alante Walker (Orland Park Pioneers) Dec 5-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Steven Galiardo (Shamrock WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Tony Rossi (Falcon WC) won by decision over Ryan Crum (Crystal Lake Wizards) Dec 6-1</li>\n<li>Champ. Round 1 - Rob Mikenis (Lincoln-way WC) won in double overtime over Sean Wetherell (Alleman Jr Pioneer WC) 2-OT 2-1</li>\n<li>Champ. Round 1 - Sal Annoreno (Gomez Wrestling Academy) won by decision over Nicholas Peters (Crystal Lake Wizards) Dec 3-1</li>\n<li>Champ. Round 1 - Robert Bromberek (Lemont Bears WC) won by fall over Troy Welch (Champaign Kids Wrestling) Fall 2:24</li>\n<li>Champ. Round 1 - Eduardo Gonzalez (Tomcat WC) won by decision over Nate Higgins (GC Jr Warriors) Dec 6-0</li>\n<li>Champ. Round 1 - Steve Turner (O`Fallon Little Panthers) won by fall over Dion Unzicker (Fisher WC) Fall 1:56</li>\n<li>Champ. Round 1 - Josh Arnold (Bur-Oak Wildcats WC) won by major decision over Mitchell Riggs (SCN Youth WC) Maj 13-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Michael O`Connor (Gomez Wrestling Academy) won by fall over Jeremy Beal (Limestone Youth WC) Fall 3:01</li>\n<li>Champ. Round 1 - Patrick McFadden (Fox Valley WC) won by decision over Jack Wilcox (Herrin Junior WC) Dec 6-0</li>\n<li>Champ. Round 1 - Steph`fon Scales (Arlington Cardinals) won by major decision over Allister Gunter (GC Jr Warriors) Maj 14-6</li>\n<li>Champ. Round 1 - Frank Yattoni (Martinez Fox Valley Elite) won by decision over Clayton Bass (Yorkville Wrestling Club) Dec 7-2</li>\n<li>Champ. Round 1 - Peter Andreotti (Orland Park Pioneers) won by decision over Gregory Adkins (Belvidere Bandits) Dec 4-1</li>\n<li>Champ. Round 1 - Colin Holler (Tinley Park Bulldogs) won by fall over Luke Allen (Vermilion Valley Elite) Fall 2:05</li>\n<li>Champ. Round 1 - Brandon Lizer (Dakota WC) won by major decision over Dalton Coleman (Mt. Zion WC) Maj 14-2</li>\n<li>Champ. Round 1 - Devin Mahnke (Harvey Park Dist Twisters) won by decision over Blake Tisza (Crosstown WC) Dec 9-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Eric Lovill (Mad Dog Wrestling Academy) won by major decision over Vincent Ambrose (Orland Park Pioneers) Maj 12-0</li>\n<li>Champ. Round 1 - Angelo Silvestro (SCN Youth WC) won by decision over John Anderson (Tinley Park Bulldogs) Dec 7-0</li>\n<li>Champ. Round 1 - Nathan Jackson (Harvey Park Dist Twisters) won by major decision over Marc Talavera (Gomez Wrestling Academy) Maj 9-1</li>\n<li>Champ. Round 1 - Corbett Oughton (Minooka Little Indians) won by fall over Alex Valentine (Martinez Fox Valley Elite) Fall 4:12</li>\n<li>Champ. Round 1 - Brock Elliott (Mt. Zion WC) won by decision over Ramon Deavila (Collinsville Raiders) Dec 5-2</li>\n<li>Champ. Round 1 - Dan Goress (Knights WC) won by decision over Mitchell Dite (Little Redskins WC) Dec 9-2</li>\n<li>Champ. Round 1 - Jonathon Evetts (Herrin Junior WC) won by fall over Drake Dryfhout (Little Redskins WC) Fall 0:53</li>\n<li>Champ. Round 1 - Jake Baxter (Hecox Team Benaiah) won by fall over Blaine Haines (Tiger WC) Fall 0:56</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Ryder Belzer (Zee Bee Stingers) won by decision over Daniel Toth (Central WC) Dec 12-5</li>\n<li>Champ. Round 1 - Jason Locker (Pontiac Pythons) won by fall over Jameer Thurman (Gladiators) Fall 2:11</li>\n<li>Champ. Round 1 - Tyler Nagel (Vittum Cats) won by fall over Michael Paloian (Maine Eagles WC) Fall 3:05</li>\n<li>Champ. Round 1 - Aaron Bonnell (Xtreme Wrestling) won by decision over Alex Friedman (Pontiac Pythons) Dec 8-6</li>\n<li>Champ. Round 1 - Zach Lehman (Dixon WC) won by fall over Jacob Meeder (Force Wrestling) Fall 0:48</li>\n<li>Champ. Round 1 - Fabian Lara (SCN Youth WC) won by decision over Ethan Pullum (Herrin Junior WC) Dec 4-1</li>\n<li>Champ. Round 1 - Josh Prescher (Waubonsie WC) won by fall over Tyler Schneider (Falcon WC) Fall 0:31</li>\n<li>Champ. Round 1 - Micheal Cudemo (Murphysboro Wrestling) won by major decision over Ammon Morrill (Geneseo Spider WC) Maj 11-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Cameron Singler (Highland Bulldog Jr WC) won by fall over Peter Hrobowski (Gladiators) Fall 2:51</li>\n<li>Champ. Round 1 - Joey Dedick (Gomez Wrestling Academy) won by major decision over Bruce Pearl (Crystal Lake Wizards) Maj 10-2</li>\n<li>Champ. Round 1 - Nick Shealy (Barrington Broncos) won in overtime over Hadin Restivo (West Frankfort Jr Wrestling) OT 6-4</li>\n<li>Champ. Round 1 - Joseph Galason (Redhawk  WC) won by decision over Manuel Silva (Hononegah Kids WC) Dec 9-2</li>\n<li>Champ. Round 1 - Steven Franke (WW Tiger WC) won by decision over Dakota Downs (Quincy WC) Dec 10-5</li>\n<li>Champ. Round 1 - Mitchell Murphy (Orland Park Pioneers) won by fall over Brady Clendenen (Oakwood WC) Fall 2:19</li>\n<li>Champ. Round 1 - Jacob Residori (Minooka Little Indians) won by fall over Jarrod Rockhold (Macomb Little Bombers) Fall 0:47</li>\n<li>Champ. Round 1 - Nathan Zinzer (Blackhawk WC) won by fall over Dakota Kidd (Unity Youth WC) Fall 3:10</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Timothy Sennett (Bison WC) won by fall over Tyler Hanke (Highland Bulldog Jr WC) Fall 3:59</li>\n<li>Champ. Round 1 - Maxwell Brozovich (Minooka Little Indians) won by decision over Andrew Mahone (Macomb Little Bombers) Dec 12-10</li>\n<li>Champ. Round 1 - Drake Holland (Herrin Junior WC) won by fall over Trevor Humphrey (Mendota Mat Masters) Fall 3:43</li>\n<li>Champ. Round 1 - Nick Countryman (Little Celtic WC) won by fall over Cody Pych (Villa Lombard Cougars) Fall 1:53</li>\n<li>Champ. Round 1 - Colin Griffin (Oswego East Junior Wolves) won by fall over Deonte Adams (Lionheart Intense Wrestling) Fall 1:29</li>\n<li>Champ. Round 1 - Tyrone Sally Jr. (Harvey Park Dist Twisters) won by fall over Jake Turk (Central WC) Fall 1:55</li>\n<li>Champ. Round 1 - Zach Hicks (Hoopeston Area WC) won by decision over Sam Klenske (Marengo Shooters WC) Dec 11-6</li>\n<li>Champ. Round 1 - Joe Dominick (Vittum Cats) won by decision over Alex Anaya (Downers Grove Cougars) Dec 3-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Brett O`Kane (Richmond WC) won by decision over Andrew Gonzalez (Waukegan Youth WC) Dec 9-5</li>\n<li>Champ. Round 1 - Alexander Torres (Brawlers WC) won by major decision over Dakota Finley (Collinsville Raiders) Maj 12-1</li>\n<li>Champ. Round 1 - Matthew Schneider (Lincoln-way WC) won by fall over Duke Wegner (Villa Lombard Cougars) Fall 0:49</li>\n<li>Champ. Round 1 - Zack Hagemann (Polo WC) won by fall over Hunter Sonberger (Herrin Junior WC) Fall 1:56</li>\n<li>Champ. Round 1 - Jack Sears (Vittum Cats) won by major decision over Joe Smith (Oswego East Junior Wolves) Maj 10-2</li>\n<li>Champ. Round 1 - William Wenger (El Paso/Gridley WC) won by decision over Nicholas Stoddard (Erie Middle School WC) Dec 4-0</li>\n<li>Champ. Round 1 - Jenner Clark (WW Tiger WC) won by fall over Zach Krueger (Rocket Fuel WC-Rock Ridge) Fall 0:49</li>\n<li>Champ. Round 1 - Ivan Castro (Fenwick Falcons WC) won by decision over Joey Kauffman (Prairie Central-Chenoa Hawks) Dec 9-4</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Hunter Barry (Little Redskins WC) won by decision over Nathan Cowan (Crystal Lake Wizards) Dec 3-1</li>\n<li>Champ. Round 1 - Matthew Zabrin (Bison WC) won by major decision over Jacob Meyer (Falcon Youth WC) Maj 8-0</li>\n<li>Champ. Round 1 - Wardell Rosemon Jr. (Dundee Highlanders) won by fall over Sammy Klukas (Maine Eagles WC) Fall 2:17</li>\n<li>Champ. Round 1 - Nick Rude (Sauk Valley WC) won by decision over Jesse Campbell (Charleston WC) Dec 5-1</li>\n<li>Champ. Round 1 - Jake Spinell (Fox Valley WC) won by fall over Tyler Reed (Mt. Vernon Lions) Fall 0:34</li>\n<li>Champ. Round 1 - Dalton Major (Brawlers WC) won by decision over Alec Brown (Oak Forest Warriors) Dec 8-3</li>\n<li>Champ. Round 1 - Nicholas Williams (Crosstown WC) won by fall over Brad Carr (Southern Illinois United Thundercats) Fall 3:11</li>\n<li>Champ. Round 1 - Eric Krieger (Fox Valley WC) won by tech fall over Brian Hettiger (Bur-Oak Wildcats WC) TF 20-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Ryan Walsh (St. Tarcissus) won by major decision over Timothy O`Sullivan (Force Wrestling) Maj 10-0</li>\n<li>Champ. Round 1 - Jack Dechow (Richmond WC) won by fall over Matt Chlebek (Glenbard East Jr Rams) Fall 1:19</li>\n<li>Champ. Round 1 - Alexander Sullivan (Maine Eagles WC) won by fall over Kyle Cluskey (Glenbard East Jr Rams) Fall 3:39</li>\n<li>Champ. Round 1 - Kolton Kuczynski (Harlem Cougars) won by fall over John-David Villasenor (Plainfield WC) Fall 1:55</li>\n<li>Champ. Round 1 - Jared Levan (Roxana Kids WC) won by decision over Derek Schultz (Mt. Zion WC) Dec 8-2</li>\n<li>Champ. Round 1 - Tyson Ashbaugh (Seneca Irish Cadets) won by fall over Alec Gordon (Tinley Park Bulldogs) Fall 3:34</li>\n<li>Champ. Round 1 - Chance Dowds (Midwest Central Youth) won by fall over Danny Campos (Triad Little Knights) Fall 1:28</li>\n<li>Champ. Round 1 - Travis Crnich-Amenell (Oak Forest Warriors) won by fall over Wesley Ellis (Warrensburg WC) Fall 1:36</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>Champ. Round 1 - Riley Mugerditchian (Hoffman Estates WC) won by fall over Mitch Torrence (Barrington Broncos) Fall 2:35</li>\n<li>Champ. Round 1 - Nickolas Kowalczuk (Little Huskie WC) won by decision over Calvin Campbell (Chilli Dawgs WC) Dec 1-0</li>\n<li>Champ. Round 1 - Joshua Hickey (Vittum Cats) won by fall over Ryan Berman (Little Celtic WC) Fall 0:35</li>\n<li>Champ. Round 1 - Emilio Gonzalez (Dixon WC) won by decision over Joe Bansfield (Arlington Cardinals) Dec 7-5</li>\n<li>Champ. Round 1 - Matt Cannella (Rockford WC) won by fall over Sam Marshall (Downers Grove Cougars) Fall 2:25</li>\n<li>Champ. Round 1 - Griffin McQuality (Mt. Zion WC) won by fall over Hamilton Cordle (Collinsville Raiders) Fall 1:30</li>\n<li>Champ. Round 1 - James Lowery (Bronco Wrestling) won by tech fall over Cole Whitford (GC Jr Warriors) TF 19-4</li>\n<li>Champ. Round 1 - Sean Jones (Harlem Cougars) won by fall over Archie Williams Jr. (Champaign Kids Wrestling) Fall 3:02</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>Champ. Round 1 - Channing Dolliger (Brawlers WC) won by fall over Kevin Kaufhold (Team West Wolves) Fall 1:46</li>\n<li>Champ. Round 1 - Joshua Wallick (Fisher WC) won by decision over Drake Whitlow (Benton Jr WC) Dec 9-2</li>\n<li>Champ. Round 1 - Aaron Ford (Warrensburg WC) won by fall over Dakota Pratt (West Frankfort Jr Wrestling) Fall 0:06</li>\n<li>Champ. Round 1 - Grant Bartell (Lincoln-way WC) won by decision over Blake Blair (Collinsville Raiders) Dec 3-0</li>\n<li>Champ. Round 1 - Darnell Toney (Gladiators) won by fall over Peyton Mudd (West Hancock Titan WC) Fall 1:44</li>\n<li>Champ. Round 1 - James Kuczynski (Dundee Highlanders) won by fall over Daniel Draski (Villa Park Young Warriors) Fall 0:35</li>\n<li>Champ. Round 1 - Zachary Ziegler (Timberwolves WC) won by fall over Jacob Weltzin (Renegades (Stockton)) Fall 2:54</li>\n<li>Champ. Round 1 - Justin Wynn (Little Huskie WC) won by fall over Bram Harris (Kane County Grapplers) Fall 1:46</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Peter Brancaleon (Naperville Huskie WC) won by decision over Matthew Villalobos (Waukegan Youth WC) Dec 2-0</li>\n<li>Champ. Round 1 - Nathen Zurzolo (Orland Park Pioneers) won by decision over Evan Casey (Cumberland Youth WC) Dec 6-5</li>\n<li>Champ. Round 1 - Adam Szott (Waubonsie WC) won by fall over Brandon Minniti (Plainfield WC) Fall 0:26</li>\n<li>Champ. Round 1 - Jake Cochrane (Lakeland Predators) won by decision over Trae Ford (Westville Youth WC) Dec 4-3</li>\n<li>Champ. Round 1 - Matthew Rheintgen (Downers Grove Cougars) won in overtime over Connor Jones (Harlem Cougars) OT 4-2</li>\n<li>Champ. Round 1 - Alexander Lopez (Bethalto Bulls WC) won by fall over Deandre Fox (Calumet Memorial P.D. Wolverines) Fall 2:09</li>\n<li>Champ. Round 1 - Hector Trevino (Fenwick Falcons WC) won by fall over Christopher Bartels (Dundee Highlanders) Fall 0:12</li>\n<li>Champ. Round 1 - Jorrian Sutton (Carbondale WC) won by fall over Benjamin Staton (Tigertown Tanglers) Fall 3:29</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Champ. Round 1 - Matthew Sommers (Arlington Cardinals) won by fall over Joshua Harvill (GC Jr Warriors) Fall 1:14</li>\n<li>Champ. Round 1 - Andrew Campbell (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Brian Cullen (Wrestling Factory) won by fall over Jacob Field (SCN Youth WC) Fall 0:54</li>\n<li>Champ. Round 1 - Antony Felix-Reyes (Chicago Wolves Den) received a bye   () Bye</li>\n<li>Champ. Round 1 - Kevon Powell (Harvey Park Dist Twisters) won by fall over Jim Panozzo (Orland Park Pioneers) Fall 3:39</li>\n<li>Champ. Round 1 - Alex Anderson (Edwardsville WC) won by decision over Justin Allen (Badger WC) Dec 5-3</li>\n<li>Champ. Round 1 - Ryan Conlin (Oak Forest Warriors) won by fall over Alex Hinrichs (Edwardsville WC) Fall 2:25</li>\n<li>Champ. Round 1 - Nate Fay (Bethalto Bulls WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Luke Padesky (Moline WC) won by fall over Angelo Giannos (Sharks WC) Fall 3:18</li>\n<li>Champ. Round 1 - Evan Christianson (Batavia Pinners) received a bye   () Bye</li>\n<li>Champ. Round 1 - Chris Maier (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Champ. Round 1 - Sean Parvin (Sauk Valley WC) won by decision over Rusian Mamedov (Little Falcons WC) Dec 6-3</li>\n<li>Champ. Round 1 - Zachary Denny (Harlem Cougars) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jeremy Brown (Force Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Daniel Ruettiger (Minooka Little Indians) received a bye   () Bye</li>\n<li>Champ. Round 1 - Devon Graville (Sons of Thunder) won by fall over Connor Lewis (Golden Eagles) Fall 2:15</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Mitchel Kennington (Harlem Renegades) won by fall over Clyde Miller (Edwardsville WC) Fall 3:50</li>\n<li>Champ. Round 1 - Steve Licina (Brawlers WC) won by major decision over Josh Dare (Southern Illinois United Thundercats) Maj 12-0</li>\n<li>Champ. Round 1 - Evan Trapino (Richmond WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jeremiah Shearer (Xtreme Wrestling) won by fall over Tayler Young (Aces WC) Fall 0:45</li>\n<li>Champ. Round 1 - Jon Williamson (Naperville WC) won by decision over Douglas Davis (Harvey Park Dist Twisters) Dec 11-9</li>\n<li>Champ. Round 1 - Austin Rhodenbaugh (Dixon WC) won by decision over Jack Maton (Force Wrestling) Dec 4-0</li>\n<li>Champ. Round 1 - Chris Denning (Sauk Valley WC) won by decision over Kristof Larsen (SCN Youth WC) Dec 7-5</li>\n<li>Champ. Round 1 - Kevin Golden (Vittum Cats) won by decision over Frank Voltattorni (Crosstown WC) Dec 10-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Anthony Ferraris Jr (Maine Eagles WC) won by decision over Nicholas Drendel (Blackhawk WC) Dec 11-4</li>\n<li>Champ. Round 1 - Ryan Martini (Orland Park Pioneers) won by major decision over Ernest Willis (Harvey Park Dist Twisters) Maj 15-6</li>\n<li>Champ. Round 1 - Michael Mizaur (Vittum Cats) won by fall over Nolan Presmyk (Barrington Broncos) Fall 1:50</li>\n<li>Champ. Round 1 - Nathan Davis (Plainfield WC) won by fall over Andrew Geffs (Cumberland Youth WC) Fall 0:23</li>\n<li>Champ. Round 1 - Trevor Jauch (Crystal Lake Wizards) won by fall over Christian Pratt (Southern Illinois United Thundercats) Fall 0:18</li>\n<li>Champ. Round 1 - Mark Savenok (WW Tiger WC) won by decision over Kyle Carstens (Rock Island WC) Dec 5-4</li>\n<li>Champ. Round 1 - Kyle Graumenz (Triad Little Knights) won by decision over Brandon Walz (Blackhawk WC) Dec 3-2</li>\n<li>Champ. Round 1 - Patrick Sullivan (Crystal Lake Wizards) won by decision over Sam Kellett (Yorkville Wrestling Club) Dec 6-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Vince Gottardo (Mad Dog Wrestling Academy) won by fall over Jeffrey Dornbush (Erie Middle School WC) Fall 0:18</li>\n<li>Champ. Round 1 - Kevin Moylan (Vittum Cats) won by fall over Colby Cohoon (Unity Youth WC) Fall 1:42</li>\n<li>Champ. Round 1 - Maxx Hubbard (Sauk Valley WC) won by major decision over Nicholas Ostendorf (Collinsville Raiders) Maj 10-1</li>\n<li>Champ. Round 1 - Eric Oliver (Harvey Park Dist Twisters) won by tech fall over Johnny Delmedico (Iron Man) TF 15-0</li>\n<li>Champ. Round 1 - Frank McKeown (Naperville Huskie WC) won by major decision over Kyle Littlefield (Highland Bulldog Jr WC) Maj 10-1</li>\n<li>Champ. Round 1 - Steven Bradtmueller (Force Wrestling) won by major decision over Joey Klinger (Golden Eagles) Maj 8-0</li>\n<li>Champ. Round 1 - Brady Schlueter (Dakota WC) won by major decision over William Templin (Martinez Fox Valley Elite) Maj 16-4</li>\n<li>Champ. Round 1 - Kevin Skrzypiec (Orland Park Pioneers) won by decision over Skyler Procasky (GC Jr Warriors) Dec 7-4</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Shane Hafner (Mad Dog Wrestling Academy) won by decision over Trent Morgan (Rock Island WC) Dec 10-5</li>\n<li>Champ. Round 1 - Frank Abitua (Golden Eagles) won by decision over Ryan Whitten (Force Wrestling) Dec 4-2</li>\n<li>Champ. Round 1 - Jacob Fuqua (Crosstown WC) won by decision over Braeden Kurzrock (Dixon WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jason Fugiel (Crystal Lake Wizards) won by decision over Nicholas Jankowski (Junior Gators WC) Dec 9-2</li>\n<li>Champ. Round 1 - Casey Rzechula (Bur-Oak Wildcats WC) won by fall over John Morris (Fisher WC) Fall 0:54</li>\n<li>Champ. Round 1 - Jose Jimenez (Bronco Wrestling) won by major decision over Levi Fortner (Herrin Junior WC) Maj 16-3</li>\n<li>Champ. Round 1 - Jared Morrow (Bethalto Bulls WC) won by fall over Jared Braaten (Fisher WC) Fall 2:00</li>\n<li>Champ. Round 1 - Michael Murphy (Vittum Cats) won by decision over Alex Contini (Blackhawk WC) Dec 3-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Joey Gosinski (Villa Lombard Cougars) won by fall over Shane Bormann (Geneseo Spider WC) Fall 2:01</li>\n<li>Champ. Round 1 - Dylan Anderson (GC Jr Warriors) won by fall over Danny Seiton (Batavia Pinners) Fall 3:32</li>\n<li>Champ. Round 1 - Dylon Viglasky (Belleville Little Devils) won by decision over Wade Hazard (Villa Lombard Cougars) Dec 4-1</li>\n<li>Champ. Round 1 - Sam Apland (Downers Grove Cougars) won by decision over James McCarter (Peoria Heights Minutemen) Dec 5-3</li>\n<li>Champ. Round 1 - Kyle Culton (Sycamore WC) won by decision over Kevin Akers (Minooka Little Indians) Dec 6-3</li>\n<li>Champ. Round 1 - Stephen Burling (Central Elite Rebels) won by decision over Matt Nora (Lions WC) Dec 6-4</li>\n<li>Champ. Round 1 - Steven Lalowski (Sycamore WC) won by major decision over Alex Jones (Shelbyville Jr Rams Wrestling) Maj 16-4</li>\n<li>Champ. Round 1 - Sean Raddatz (Oak Forest Warriors) won by fall over Travis Mahoney (L-P Crunching Cavs) Fall 2:32</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - David Price (Rock Island WC) won by decision over Joseph Graziano (Bur-Oak Wildcats WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jameel Carter (Chicago Crusaders) won by major decision over Nicholas Scheel (Edwardsville WC) Maj 9-0</li>\n<li>Champ. Round 1 - Derek Nagel (Vittum Cats) won by fall over Lusiano Cantu Jr. (Gomez Wrestling Academy) Fall 2:30</li>\n<li>Champ. Round 1 - Brandon Lee (Yorkville Wrestling Club) won by decision over Stephen Rensing (Highland Bulldog Jr WC) Dec 7-6</li>\n<li>Champ. Round 1 - Andrew Hoselton (Prairie Central-Chenoa Hawks) won by decision over Scott Crosby (Falcon WC) Dec 3-2</li>\n<li>Champ. Round 1 - Zack Patnou (Harlem Renegades) won by fall over Zachary Striplin (Little Falcons WC) Fall 0:55</li>\n<li>Champ. Round 1 - Tyler Mahan (Taylorville WC) won by decision over Thaddues Hawley (Xtreme Wrestling) Dec 6-4</li>\n<li>Champ. Round 1 - Ryan Soraghan (Orland Park Pioneers) won by fall over Dan Simmons (Little Falcons WC) Fall 1:45</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Dakota Wapotish (Barrington Broncos) won by fall over Keith Thomas (Rich Rattlers WC) Fall 0:46</li>\n<li>Champ. Round 1 - Robert Guillen (West Chicago Junior Wildcats) won by decision over Jack Windmoeller (Lions WC) Dec 8-4</li>\n<li>Champ. Round 1 - Austin Carlson (Wrestling Factory) won by major decision over Joshua Griffin (Proviso PowerHouse WC) Maj 12-2</li>\n<li>Champ. Round 1 - Spartak Chino (WW Tiger WC) won by decision over John Magee (Plainfield WC) Dec 8-1</li>\n<li>Champ. Round 1 - Levi Ulmer (Vandalia Jr Wrestling) won by fall over Ethan Ervin (Hoopeston Area WC) Fall 2:57</li>\n<li>Champ. Round 1 - Colbey Vance (Riverdale Jr Rams WC) won by tech fall over Josh Folk (Harlem Cougars) TF 15-0</li>\n<li>Champ. Round 1 - Nick Armstrong (Sons of Thunder) won by decision over Chris Ledbetter (Moline WC) Dec 7-6</li>\n<li>Champ. Round 1 - Zack Spiewak (Sycamore WC) won by decision over Patrick Root (Springfield Capital Kids WC) Dec 6-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Drew Bates (Lions WC) won by fall over Oshea Smith-Traylor (Sons of Thunder) Fall 3:18</li>\n<li>Champ. Round 1 - Joey Caprio (Arlington Cardinals) won by decision over Dillon Cowan (Crystal Lake Wizards) Dec 4-2</li>\n<li>Champ. Round 1 - Mason McBride (Edwardsville WC) won by fall over Brandon Lopez (Iron Man) Fall 0:46</li>\n<li>Champ. Round 1 - Donald Miller (Proviso PowerHouse WC) won by major decision over Kyle Davidson (Knights WC) Maj 15-2</li>\n<li>Champ. Round 1 - Beau George (SCN Youth WC) won by decision over Richard Laskowski (Dixon WC) Dec 7-6</li>\n<li>Champ. Round 1 - Tyler Argue (Rich Rattlers WC) won by decision over Clay Wilson (Cumberland Youth WC) Dec 7-2</li>\n<li>Champ. Round 1 - Sheldon Magee (Plainfield WC) won by decision over Kevin Wetherell (Alleman Jr Pioneer WC) Dec 7-4</li>\n<li>Champ. Round 1 - Mike Trizzino (St. Charles East WC) won by major decision over Aaron Batchelder (Warrensburg WC) Maj 10-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Austin Smith (Road Warriors) won by decision over Chris Butz (Animal WC) Dec 2-1</li>\n<li>Champ. Round 1 - Luke Pigott (Fox Valley WC) won by decision over Tristan Rivera (Champaign Kids Wrestling) Dec 7-0</li>\n<li>Champ. Round 1 - Michael Semmens (Batavia Pinners) won by major decision over Patrick Foley (Sharks WC) Maj 9-0</li>\n<li>Champ. Round 1 - Henry Lecrone (Unity Youth WC) won by fall over Matthew Berg (Herrin Junior WC) Fall 1:55</li>\n<li>Champ. Round 1 - Eric Hulihan (Fenwick Falcons WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Kalvin Whitener-Hill (Minooka Little Indians) won by decision over Branson Cain (Riverdale Jr Rams WC) Dec 6-4</li>\n<li>Champ. Round 1 - Zach Paterson (Xtreme Wrestling) won by fall over Jared Carroll (Chilli Dawgs WC) Fall 3:57</li>\n<li>Champ. Round 1 - Andrew Elliot (Little Celtic WC) won by decision over Rodney Johnson (Harvey Park Dist Twisters) Dec 5-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Max Andersen (Edwardsville WC) won by decision over Brandon Brown (Grapplin` Devils WC) Dec 5-2</li>\n<li>Champ. Round 1 - Eric Sirvid (Orland Park Pioneers) won by fall over Thomas Sigwalt (Geneseo Spider WC) Fall 0:55</li>\n<li>Champ. Round 1 - Larry Sanders (Herrin Junior WC) won by fall over Jake Yost (Limestone Youth WC) Fall 3:30</li>\n<li>Champ. Round 1 - Jeff Koepke (Arlington Cardinals) won by fall over Ivory Blackwell (Fairmont Rough Riders) Fall 3:07</li>\n<li>Champ. Round 1 - Andrew Winkler (Bismarck Henning WC) won by major decision over Aaron Hett (Blackhawk WC) Maj 11-1</li>\n<li>Champ. Round 1 - Dimitri Willis (Gladiators) won by major decision over Cody Churkey (Golden Eagles) Maj 14-2</li>\n<li>Champ. Round 1 - Josh Isaac (Belvidere Bandits) won by decision over Harley Davis (Holy Family School) Dec 4-2</li>\n<li>Champ. Round 1 - Luke Polka (Lions WC) won by fall over Makhaddin Khasanov (Little Falcons WC) Fall 3:46</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Virgil Houston (Black Kats WC) won by tech fall over Andrew Pfiffner (Marengo Indians Youth Wrestling) TF 17-0</li>\n<li>Champ. Round 1 - Colin Haney (Force Wrestling) won by decision over Andrew Altenberger (Collinsville Raiders) Dec 9-5</li>\n<li>Champ. Round 1 - Joshua Marchok (Gomez Wrestling Academy) won by decision over Kyle Wood (Orland Park Pioneers) Dec 9-4</li>\n<li>Champ. Round 1 - Trey Griffin (Crystal Lake Wizards) won by fall over Aaron Fink (Carbondale WC) Fall 1:47</li>\n<li>Champ. Round 1 - Julius Johnson (Gladiators) won by fall over Colin Guttosch (Naperville WC) Fall 0:38</li>\n<li>Champ. Round 1 - Xavier Brent (Champaign Kids Wrestling) won by fall over Matt McDonnell (Morrison Stallions WC) Fall 0:21</li>\n<li>Champ. Round 1 - Alex Sadauskas (Little Falcons WC) won by fall over Kyle Nelson (Alleman Jr Pioneer WC) Fall 1:42</li>\n<li>Champ. Round 1 - Tyler Farney (Prairie Central-Chenoa Hawks) won by major decision over Tom Higgins (Oak Forest Warriors) Maj 17-6</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Ronnie Webb (Seneca Irish Cadets) won by decision over Lars Wallace (Hononegah Kids WC) Dec 6-5</li>\n<li>Champ. Round 1 - Giuseppe Lamanna (Mad Dog Wrestling Academy) won by fall over Joshua Kessler (Bismarck Henning WC) Fall 1:29</li>\n<li>Champ. Round 1 - Tim Maroder (Crystal Lake Wizards) won by tech fall over Jason Dalessandro (Shamrock WC) TF 15-0</li>\n<li>Champ. Round 1 - Jacob Nunez (El Paso/Gridley WC) won by decision over Peter Mickiewicz (Moline WC) Dec 8-5</li>\n<li>Champ. Round 1 - Justin Hill (Edwardsville WC) won by fall over Marc Smith (Tiger WC) Fall 2:01</li>\n<li>Champ. Round 1 - Brian Gibbs (Harvey Park Dist Twisters) received a bye   () Bye</li>\n<li>Champ. Round 1 - Carlos Gentil (Plainfield WC) won by fall over Austin White (Road Warriors) Fall 1:32</li>\n<li>Champ. Round 1 - Giovanny Martinez (Oak Forest Warriors) won by major decision over Patrick Conway (Naperville Huskie WC) Maj 15-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Knudsen (Villa Lombard Cougars) won by major decision over Andrew Weaver (Knights WC) Maj 10-1</li>\n<li>Champ. Round 1 - Michael Kang (Naperville Huskie WC) won by fall over Adonis Currin (Gladiators) Fall 2:02</li>\n<li>Champ. Round 1 - Justin Wallace (Palatine Panthers WC) won by fall over Eric Tecuanhuehue (Waubonsie WC) Fall 0:59</li>\n<li>Champ. Round 1 - Austin Marsden (Crystal Lake Wizards) won by fall over Michael Raleigh (Little Huskie WC) Fall 1:44</li>\n<li>Champ. Round 1 - Hans Schaeffer (Moline WC) won by fall over Chris Kisala (Badger WC) Fall 0:20</li>\n<li>Champ. Round 1 - Michael Pulley (Sons of Thunder) won by fall over Brett Noyd (Joliet Junior Steelmen) Fall 0:51</li>\n<li>Champ. Round 1 - Tyler Cravens (Herrin Junior WC) won by fall over Preston Butner (Metamora Kids WC) Fall 2:56</li>\n<li>Champ. Round 1 - Cody Weaver (Little Celtic WC) won by decision over Holbart Burns (Midwest Central Youth) Dec 11-5</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Seth Springsteen (Junior Vikings) won by fall over Charlie Kappos (Sharks WC) Fall 2:56</li>\n<li>Champ. Round 1 - Richard Kersten (Crystal Lake Wizards) won by fall over Bobby Rundlett (Arlington Cardinals) Fall 2:14</li>\n<li>Champ. Round 1 - Javonta Black (Blackhawk WC) won by major decision over Francesco Lombardo (Iron Man) Maj 12-0</li>\n<li>Champ. Round 1 - Ricky Castillo (Crosstown WC) won by decision over Dominick Lopiccolo (Central WC) Dec 7-4</li>\n<li>Champ. Round 1 - Taylor McGiffen (Little Redbird WC) won by fall over Kurt Layman (Villa Lombard Cougars) Fall 1:20</li>\n<li>Champ. Round 1 - Joshua Naber (Golden Eagles) won by fall over Taelor Hufford (Rock Island WC) Fall 3:11</li>\n<li>Champ. Round 1 - Mitchell Keppy (Riverdale Jr Rams WC) won by fall over Tyler Mabry (Herrin Junior WC) Fall 0:42</li>\n<li>Champ. Round 1 - Jeff Carter (Tiger WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Carlos Martinez (Shamrock WC) won by fall over Albin Sterneman (Tiger WC) Fall 0:31</li>\n<li>Champ. Round 1 - Alexander Carney (Geneseo Spider WC) won by fall over Rayfield Smith (Calumet Memorial P.D. Wolverines) Fall 1:30</li>\n<li>Champ. Round 1 - Daniel Muehlfelt (Palatine Panthers WC) won by fall over Jack Bauer (Lincoln-way WC) Fall 1:43</li>\n<li>Champ. Round 1 - Connor Flaherty (Peoria Razorbacks Youth WC) won by major decision over Mario Verzillo (Driscoll Junior Highlanders) Maj 12-4</li>\n<li>Champ. Round 1 - Glen Buckwinkler (Marengo Indians Youth Wrestling) won by fall over Joseph Davison (Tomcat WC) Fall 3:40</li>\n<li>Champ. Round 1 - Derek Jenkins (Collinsville Raiders) won by fall over Jason Hardin (Lionheart Intense Wrestling) Fall 0:44</li>\n<li>Champ. Round 1 - Trent Grossman (Little Falcons WC) won by fall over Rachel Phillips (Carbondale WC) Fall 1:34</li>\n<li>Champ. Round 1 - Rey Rodriguez (Taylorville WC) won by fall over Dean Tiepelman (Edwardsville WC) Fall 0:29</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Antwyone Brown Jr. (Crosstown WC) won by decision over John Guffey (Waukegan Youth WC) Dec 4-0</li>\n<li>Champ. Round 1 - Mitchell Curry (Unity Youth WC) won by fall over Demetrius Hopkins (Edwardsville WC) Fall 3:07</li>\n<li>Champ. Round 1 - Mohammed Abbed (El Paso/Gridley WC) won by decision over Fredrick Scales (Arlington Cardinals) Dec 7-1</li>\n<li>Champ. Round 1 - Kyle Bastilla (Belleville Little Devils) won by major decision over Ryan Ludwig (Little Celtic WC) Maj 10-0</li>\n<li>Champ. Round 1 - Cristian Guzman (Morton Little Mustangs) won by fall over Matt Hugenberg (Quincy WC) Fall 0:16</li>\n<li>Champ. Round 1 - Alex Mares (Little Celtic WC) won by fall over John Fischer (Hononegah Kids WC) Fall 2:14</li>\n<li>Champ. Round 1 - Martell Smith (Peoria Razorbacks Youth WC) won by fall over Chris Gennaro (Harlem Cougars) Fall 0:33</li>\n<li>Champ. Round 1 - Michael Homeier (Redhawk  WC) won by decision over Anthony Dezutter (Tinley Park Bulldogs) Dec 2-1</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Brian Bobek (Palatine Panthers WC) won by fall over Michael Foreman (Downers Grove Cougars) Fall 3:12</li>\n<li>Champ. Round 1 - Gerrardo Cisneros (Little Celtic WC) won by fall over Ethan Linder (Hoopeston Area WC) Fall 2:04</li>\n<li>Champ. Round 1 - Rocco Zinanni (Brawlers WC) won by decision over Deonte Harris (Little Falcons WC) Dec 5-4</li>\n<li>Champ. Round 1 - Andy Heredia (Iron Man) won by fall over Michael Gavel (Unity Youth WC) Fall 0:28</li>\n<li>Champ. Round 1 - Wren Goff (Metamora Kids WC) won by fall over Zach Boettjer (Richmond WC) Fall 1:16</li>\n<li>Champ. Round 1 - Ethan Buford (Edwardsville WC) won by fall over Rashad Edwards (Harvey Park Dist Twisters) Fall 0:45</li>\n<li>Champ. Round 1 - Zachary Lowe (Grapplin` Devils WC) won by fall over WIlliaml Sroka (Badger WC) Fall 2:48</li>\n<li>Champ. Round 1 - Nick Towner (Edwardsville WC) won by fall over Alex Wilson (Alleman Jr Pioneer WC) Fall 2:00</li>\n</ul>\n</section>",
  "Champ Round 2 (32 Man)": "<section class=\"tw-list\">\n<h1>Champ Round 2 (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Michael Cullen (Wrestling Factory) won by major decision over Austin Daniels (Mattoon Youth WC) Maj 13-1</li>\n<li>Champ. Round 2 - Mark Duda (Crosstown WC) won by decision over Kyle Akins (Sycamore WC) Dec 3-2</li>\n<li>Champ. Round 2 - Jabari Moody (Harvey Park Dist Twisters) won by major decision over Grant Sutton (Wrestling Factory) Maj 9-0</li>\n<li>Champ. Round 2 - Dillion Chase (Sons of Thunder) won by major decision over Sean Cannon (Crystal Lake Wizards) Maj 9-1</li>\n<li>Champ. Round 2 - Dylan Cramer (Force Wrestling) won by decision over Aaron Halligan (Riverdale Jr Rams WC) Dec 7-1</li>\n<li>Champ. Round 2 - Jeffery Morrow (Crystal Lake Wizards) won by fall over Justin Nelson (GC Jr Warriors) Fall 2:51</li>\n<li>Champ. Round 2 - Tommy Pawelski (Bronco Wrestling) won by fall over Francis Edelen (Oak Forest Warriors) Fall 0:32</li>\n<li>Champ. Round 2 - Jon Marmolejo (Gomez Wrestling Academy) won by fall over Brian Rossi (Falcon WC) Fall 2:45</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Jason Moerlien (GC Jr Warriors) won by decision over Joshua Boggess (Arlington Cardinals) Dec 8-6</li>\n<li>Champ. Round 2 - Josh Alber (Dakota WC) won by major decision over Tom Ward (Hinsdale Red Devils Wc) Maj 15-2</li>\n<li>Champ. Round 2 - Rudolph Johnson (Harvey Park Dist Twisters) won by major decision over Richard Browne (Gomez Wrestling Academy) Maj 14-6</li>\n<li>Champ. Round 2 - Jimmy Pellegrino (Orland Park Pioneers) won by fall over Tyler Svestka (Martinez Fox Valley Elite) Fall 1:59</li>\n<li>Champ. Round 2 - Jake Snow (Sauk Valley WC) won by fall over Dominic Naso (Lemont Bears WC) Fall 1:29</li>\n<li>Champ. Round 2 - George Fisher (SCN Youth WC) won by injury default over Brad Wood (Orland Park Pioneers) Inj. 0:00</li>\n<li>Champ. Round 2 - Reuben Reyes (Force Wrestling) won by major decision over Alex Tackett (Rochester WC) Maj 13-1</li>\n<li>Champ. Round 2 - Cameron Kennedy (Wrestling Factory) won by fall over Devin Tortorice (Wolves WC) Fall 0:23</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Kyle Fugiel (Crystal Lake Wizards) won by decision over Jack Diana (Mustang WC) Dec 7-2</li>\n<li>Champ. Round 2 - Joey Nelson (Little Celtic WC) won by decision over Ben Clifford (Gomez Wrestling Academy) Dec 6-1</li>\n<li>Champ. Round 2 - Anthony Devriese (Moline WC) won by major decision over Martin Martinez (Waukegan Youth WC) Maj 13-0</li>\n<li>Champ. Round 2 - Briar King (GC Jr Warriors) won by decision over Sonny Saiz (Fox Valley WC) Dec 4-0</li>\n<li>Champ. Round 2 - Demechico Spraggins (GC Jr Warriors) won by major decision over Austin Graham (Waubonsie WC) Maj 9-1</li>\n<li>Champ. Round 2 - Zachary Synon (Cary Jr Trojan Matmen) won by decision over Joshua Fuqua (Crosstown WC) Dec 6-0</li>\n<li>Champ. Round 2 - Eric Demattia (Pontiac Pythons) won by decision over Joey Shump (Batavia Pinners) Dec 7-2</li>\n<li>Champ. Round 2 - Sean Lynch (Wrestling Factory) won by major decision over Quinton Starzyk (Vittum Cats) Maj 8-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Kegan Wakefield (Wrestling Factory) won by decision over Jordan Northrup (Harlem Cougars) Dec 5-1</li>\n<li>Champ. Round 2 - Clayton Shelton (Force Wrestling) won by decision over Flynn Nagel (Vittum Cats) Dec 5-2</li>\n<li>Champ. Round 2 - Nathan Newman (Midwest Central Youth) won by fall over Matthew Reed (Mt. Vernon Lions) Fall 2:08</li>\n<li>Champ. Round 2 - Jordan Scalice (Gomez Wrestling Academy) won by decision over Matt Garelli (Bronco Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Notay Jackson (Harvey Park Dist Twisters) won by decision over Alphonse Vruno (Martinez Fox Valley Elite) Dec 6-0</li>\n<li>Champ. Round 2 - Jordan Lind (Pontiac Pythons) won by fall over Jake Messink (Harlem Cougars) Fall 3:45</li>\n<li>Champ. Round 2 - Mitchell Mallary (Erie Middle School WC) won by decision over Adrian Gonzalez (Dundee Highlanders) Dec 2-0</li>\n<li>Champ. Round 2 - Garrett Sutton (Wrestling Factory) won by fall over Chase Vosburgh (Mt. Vernon Lions) Fall 0:41</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Steven Galiardo (Shamrock WC) won by decision over Trever Pyle (Vandalia Jr Wrestling) Dec 4-0</li>\n<li>Champ. Round 2 - Bryce Brill (Fox Valley WC) won by fall over Tony Rossi (Falcon WC) Fall 3:22</li>\n<li>Champ. Round 2 - Brendan Tyler Hall (Harvey Park Dist Twisters) won by major decision over Rob Mikenis (Lincoln-way WC) Maj 13-2</li>\n<li>Champ. Round 2 - Sal Annoreno (Gomez Wrestling Academy) won by decision over Chet McClure (Falcon Youth WC) Dec 8-1</li>\n<li>Champ. Round 2 - Erik Nord (Belvidere Bandits) won by major decision over Robert Bromberek (Lemont Bears WC) Maj 10-1</li>\n<li>Champ. Round 2 - Johnny Pellegrino (Orland Park Pioneers) won by decision over Eduardo Gonzalez (Tomcat WC) Dec 6-3</li>\n<li>Champ. Round 2 - Connor Bass (Yorkville Wrestling Club) won by fall over Steve Turner (O`Fallon Little Panthers) Fall 4:52</li>\n<li>Champ. Round 2 - Brian Murphy (Villa Lombard Cougars) won by major decision over Josh Arnold (Bur-Oak Wildcats WC) Maj 8-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Nuntreae Jackson (Harvey Park Dist Twisters) won by fall over Michael O`Connor (Gomez Wrestling Academy) Fall 2:23</li>\n<li>Champ. Round 2 - Mitchell Dearing (Central Elite Rebels) won by decision over Patrick McFadden (Fox Valley WC) Dec 2-0</li>\n<li>Champ. Round 2 - Austin Culton (Sycamore WC) won by fall over Steph`fon Scales (Arlington Cardinals) Fall 1:42</li>\n<li>Champ. Round 2 - Kyle Langenderfer (Orland Park Pioneers) won by injury default over Frank Yattoni (Martinez Fox Valley Elite) Inj. 0:00</li>\n<li>Champ. Round 2 - Peter Andreotti (Orland Park Pioneers) won by decision over Austin Metz (GC Jr Warriors) Dec 8-4</li>\n<li>Champ. Round 2 - Ernest Battaglia (Fox Valley WC) won by decision over Colin Holler (Tinley Park Bulldogs) Dec 3-1</li>\n<li>Champ. Round 2 - Brandon Lizer (Dakota WC) won by fall over Gage Stephens (Quincy WC) Fall 3:13</li>\n<li>Champ. Round 2 - Devin Mahnke (Harvey Park Dist Twisters) won by decision over Jake McCabe (Wolfpak WC) Dec 3-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - JJ Whaley (Xtreme Wrestling) won by fall over Eric Lovill (Mad Dog Wrestling Academy) Fall 3:00</li>\n<li>Champ. Round 2 - Angelo Silvestro (SCN Youth WC) won by decision over Francis Anastasia (Champaign Kids Wrestling) Dec 10-8</li>\n<li>Champ. Round 2 - Lonne Cleveland III (GC Jr Warriors) won by fall over Nathan Jackson (Harvey Park Dist Twisters) Fall 2:12</li>\n<li>Champ. Round 2 - Corbett Oughton (Minooka Little Indians) won by major decision over Christopher Carton (Alleman Jr Pioneer WC) Maj 10-2</li>\n<li>Champ. Round 2 - Jacob Deklerk (Minooka Little Indians) won by decision over Brock Elliott (Mt. Zion WC) Dec 6-4</li>\n<li>Champ. Round 2 - Michael Sepke (Bronco Wrestling) won by decision over Dan Goress (Knights WC) Dec 9-3</li>\n<li>Champ. Round 2 - Richard Robertson (Vittum Cats) won by fall over Jonathon Evetts (Herrin Junior WC) Fall 3:21</li>\n<li>Champ. Round 2 - Danny Brewster (Maine Eagles WC) won by decision over Jake Baxter (Hecox Team Benaiah) Dec 9-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Ryder Belzer (Zee Bee Stingers) won by decision over Chad Whitford (GC Jr Warriors) Dec 5-1</li>\n<li>Champ. Round 2 - Jason Locker (Pontiac Pythons) won by decision over Scott Parks (Moline WC) Dec 4-3</li>\n<li>Champ. Round 2 - Tyler Nagel (Vittum Cats) won by decision over Nick Dinardo (Force Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Nick Ruffino (SCN Youth WC) won by fall over Aaron Bonnell (Xtreme Wrestling) Fall 1:23</li>\n<li>Champ. Round 2 - Zach Lehman (Dixon WC) won by major decision over Damon Cloe (Marengo Indians Youth Wrestling) Maj 16-7</li>\n<li>Champ. Round 2 - Colton Gladwell (Central Elite Rebels) won by decision over Fabian Lara (SCN Youth WC) Dec 3-1</li>\n<li>Champ. Round 2 - Timothy Corse (Tinley Park Bulldogs) won by decision over Josh Prescher (Waubonsie WC) Dec 8-1</li>\n<li>Champ. Round 2 - Micheal Cudemo (Murphysboro Wrestling) won by fall over Coord Wiseman (Wrestling Factory) Fall 2:15</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Steve Congenie (Hinsdale Red Devils Wc) won by fall over Cameron Singler (Highland Bulldog Jr WC) Fall 2:00</li>\n<li>Champ. Round 2 - Brett Meyer (Central Elite Rebels) won by fall over Joey Dedick (Gomez Wrestling Academy) Fall 1:18</li>\n<li>Champ. Round 2 - Adrian Palacios (Joliet Junior Steelmen) won by fall over Nick Shealy (Barrington Broncos) Fall 0:16</li>\n<li>Champ. Round 2 - Nick Georgean (Erie Middle School WC) won by fall over Joseph Galason (Redhawk  WC) Fall 2:06</li>\n<li>Champ. Round 2 - Brandon Sklavanitis (Xtreme Wrestling) won by fall over Steven Franke (WW Tiger WC) Fall 3:16</li>\n<li>Champ. Round 2 - Taje Frazier (Renegade WC (NFP)) won by fall over Mitchell Murphy (Orland Park Pioneers) Fall 1:27</li>\n<li>Champ. Round 2 - Zane Richards (Carbondale WC) won by major decision over Jacob Residori (Minooka Little Indians) Maj 13-5</li>\n<li>Champ. Round 2 - Nathan Zinzer (Blackhawk WC) won by decision over Joe Cortese (Maine Eagles WC) Dec 4-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Tony Cashmore (Richmond WC) won by fall over Timothy Sennett (Bison WC) Fall 2:45</li>\n<li>Champ. Round 2 - Jordan Ellingwood (Vittum Cats) won by major decision over Maxwell Brozovich (Minooka Little Indians) Maj 13-0</li>\n<li>Champ. Round 2 - Jared Jayne (Bronco Wrestling) won by tech fall over Drake Holland (Herrin Junior WC) TF 17-2</li>\n<li>Champ. Round 2 - Cameron Mammen (Tiger WC) won by fall over Nick Countryman (Little Celtic WC) Fall 0:45</li>\n<li>Champ. Round 2 - Kyle Ledbetter (Force Wrestling) won by fall over Colin Griffin (Oswego East Junior Wolves) Fall 0:58</li>\n<li>Champ. Round 2 - Tyrone Sally Jr. (Harvey Park Dist Twisters) won by fall over R.J. Troye (Sauk Valley WC) Fall 3:08</li>\n<li>Champ. Round 2 - Zach Hicks (Hoopeston Area WC) won by decision over Eric Tiller (Carlinville Kids WC) Dec 6-5</li>\n<li>Champ. Round 2 - Max Ellis (Zee Bee Stingers) won by decision over Joe Dominick (Vittum Cats) Dec 4-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Robbie Irvin (Hoopeston Area WC) won by major decision over Brett O`Kane (Richmond WC) Maj 13-1</li>\n<li>Champ. Round 2 - Alexander Torres (Brawlers WC) won by major decision over Robert Schillinger (Yorkville Wrestling Club) Maj 13-5</li>\n<li>Champ. Round 2 - Matthew Schneider (Lincoln-way WC) won by decision over Ben Karmis (Little Falcons WC) Dec 8-3</li>\n<li>Champ. Round 2 - Sam Brooks (Little Huskie WC) won by fall over Zack Hagemann (Polo WC) Fall 2:27</li>\n<li>Champ. Round 2 - Shaunqae McMurtry (Little Celtic WC) won by decision over Jack Sears (Vittum Cats) Dec 5-2</li>\n<li>Champ. Round 2 - Blake Stricklin (Mt. Vernon Lions) won by fall over William Wenger (El Paso/Gridley WC) Fall 1:48</li>\n<li>Champ. Round 2 - Logan Staver (Panther Cub WC) won by fall over Jenner Clark (WW Tiger WC) Fall 3:00</li>\n<li>Champ. Round 2 - Ivan Castro (Fenwick Falcons WC) won by decision over Aaron Brewton II (Waukegan Youth WC) Dec 2-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Hunter Barry (Little Redskins WC) won by decision over Michael Swider (Bronco Wrestling) Dec 3-1</li>\n<li>Champ. Round 2 - AJ Vargas (Tinley Park Bulldogs) won by decision over Matthew Zabrin (Bison WC) Dec 7-1</li>\n<li>Champ. Round 2 - Alex Eagle-Martinez (Romeoville WC) won by decision over Wardell Rosemon Jr. (Dundee Highlanders) Dec 4-2</li>\n<li>Champ. Round 2 - Nick Rude (Sauk Valley WC) won by decision over Samuel Wampler (Aces WC) Dec 5-1</li>\n<li>Champ. Round 2 - Andy Bensyl (SJO Spartan Youth WC) won by fall over Jake Spinell (Fox Valley WC) Fall 2:23</li>\n<li>Champ. Round 2 - Brian Bahrs (Sauk Valley WC) won by fall over Dalton Major (Brawlers WC) Fall 2:01</li>\n<li>Champ. Round 2 - Mitchell Jordan (Sycamore WC) won by decision over Nicholas Williams (Crosstown WC) Dec 7-2</li>\n<li>Champ. Round 2 - Eric Krieger (Fox Valley WC) won by decision over Joey Lamantia (Arlington Cardinals) Dec 9-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Cody Rozek (Dixon WC) won by fall over Ryan Walsh (St. Tarcissus) Fall 2:00</li>\n<li>Champ. Round 2 - Jack Dechow (Richmond WC) won by decision over Josh Pruitt (Oak Forest Warriors) Dec 7-1</li>\n<li>Champ. Round 2 - Nathaniel Volk (Champaign Kids Wrestling) won by fall over Alexander Sullivan (Maine Eagles WC) Fall 1:32</li>\n<li>Champ. Round 2 - Rhett Evans (Vandalia Jr Wrestling) won by fall over Kolton Kuczynski (Harlem Cougars) Fall 0:17</li>\n<li>Champ. Round 2 - Brian Allen (Hinsdale Red Devils Wc) won by fall over Jared Levan (Roxana Kids WC) Fall 0:56</li>\n<li>Champ. Round 2 - Austin Smith (Fightin Titan WC) won by tech fall over Tyson Ashbaugh (Seneca Irish Cadets) TF 18-3</li>\n<li>Champ. Round 2 - Brenden Pindel (Orland Park Pioneers) won by fall over Chance Dowds (Midwest Central Youth) Fall 1:40</li>\n<li>Champ. Round 2 - Lucas Cartwright (Waukegan Youth WC) won by fall over Travis Crnich-Amenell (Oak Forest Warriors) Fall 1:37</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>Champ. Round 2 - Mason Wright (Central Elite Rebels) won by fall over Riley Mugerditchian (Hoffman Estates WC) Fall 1:53</li>\n<li>Champ. Round 2 - Scott Riggins (Highland Bulldog Jr WC) won by decision over Nickolas Kowalczuk (Little Huskie WC) Dec 5-0</li>\n<li>Champ. Round 2 - Nicholas Mokodanski (Kane County Grapplers) won by decision over Joshua Hickey (Vittum Cats) Dec 7-1</li>\n<li>Champ. Round 2 - Mark Hendricks (Marengo Indians Youth Wrestling) won by decision over Emilio Gonzalez (Dixon WC) Dec 11-9</li>\n<li>Champ. Round 2 - Mario Carretto (L-P Crunching Cavs) won by decision over Matt Cannella (Rockford WC) Dec 8-3</li>\n<li>Champ. Round 2 - Brad Johnson (Lemont Bears WC) won by fall over Griffin McQuality (Mt. Zion WC) Fall 0:45</li>\n<li>Champ. Round 2 - James Lowery (Bronco Wrestling) won by tech fall over Tyler Chu (Junior Vikings) TF 19-3</li>\n<li>Champ. Round 2 - Jimmy Prince (Lakeland Predators) won by decision over Sean Jones (Harlem Cougars) Dec 6-3</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>Champ. Round 2 - Channing Dolliger (Brawlers WC) won by major decision over Andrew Geers (Fox Valley WC) Maj 9-0</li>\n<li>Champ. Round 2 - Jordan Pena (Dundee Highlanders) won by fall over Joshua Wallick (Fisher WC) Fall 2:59</li>\n<li>Champ. Round 2 - Aaron Ford (Warrensburg WC) won by fall over Cal Breedlove (Geneseo Spider WC) Fall 2:02</li>\n<li>Champ. Round 2 - Daniel Goree (Gladiators) won by fall over Grant Bartell (Lincoln-way WC) Fall 0:44</li>\n<li>Champ. Round 2 - Kenny Lindsey (SJO Spartan Youth WC) won by fall over Darnell Toney (Gladiators) Fall 0:43</li>\n<li>Champ. Round 2 - Coltyn Pease (Saukee Youth WC) won by major decision over James Kuczynski (Dundee Highlanders) Maj 9-0</li>\n<li>Champ. Round 2 - Nick Kelly (Little Celtic WC) won by fall over Zachary Ziegler (Timberwolves WC) Fall 0:52</li>\n<li>Champ. Round 2 - Daniel Davidson (Barrington Broncos) won by fall over Justin Wynn (Little Huskie WC) Fall 1:43</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - David Denne (Calumet Memorial P.D. Wolverines) won by fall over Peter Brancaleon (Naperville Huskie WC) Fall 1:23</li>\n<li>Champ. Round 2 - Dustin Rosborough (Highland Bulldog Jr WC) won by fall over Nathen Zurzolo (Orland Park Pioneers) Fall 1:23</li>\n<li>Champ. Round 2 - Adam Szott (Waubonsie WC) won by fall over Justin Jones (Chilli Dawgs WC) Fall 1:00</li>\n<li>Champ. Round 2 - Jake Cochrane (Lakeland Predators) won by fall over Kerwin May (Fightin Titan WC) Fall 1:26</li>\n<li>Champ. Round 2 - Michael Behrends (Warrensburg WC) won by fall over Matthew Rheintgen (Downers Grove Cougars) Fall 1:14</li>\n<li>Champ. Round 2 - Delasse Lanier (Romeoville WC) won by fall over Alexander Lopez (Bethalto Bulls WC) Fall 3:02</li>\n<li>Champ. Round 2 - Hector Trevino (Fenwick Falcons WC) won in overtime over Alex Fritz (SCN Youth WC) OT 6-4</li>\n<li>Champ. Round 2 - Jesse Cantu (Gomez Wrestling Academy) won by fall over Jorrian Sutton (Carbondale WC) Fall 2:07</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Champ. Round 2 - Matthew Sommers (Arlington Cardinals) won by decision over Jay Muller (Oak Forest Warriors) Dec 8-1</li>\n<li>Champ. Round 2 - Jesse McLain (Orland Park Pioneers) won by fall over Andrew Campbell (Edwardsville WC) Fall 1:45</li>\n<li>Champ. Round 2 - Brian Cullen (Wrestling Factory) won by decision over Nkosi Moody (Harvey Park Dist Twisters) Dec 7-4</li>\n<li>Champ. Round 2 - Cain Salas (Sons of Thunder) won by fall over Antony Felix-Reyes (Chicago Wolves Den) Fall 1:54</li>\n<li>Champ. Round 2 - Kevon Powell (Harvey Park Dist Twisters) won by fall over Dillon Cameron (Streator Bulldog WC) Fall 0:17</li>\n<li>Champ. Round 2 - Matthew Rader (Hononegah Kids WC) won by tech fall over Alex Anderson (Edwardsville WC) TF 15-0</li>\n<li>Champ. Round 2 - Michael Gibson (Bronco Wrestling) won by fall over Ryan Conlin (Oak Forest Warriors) Fall 1:07</li>\n<li>Champ. Round 2 - Aaron Kohlberg (Arlington Cardinals) won by major decision over Nate Fay (Bethalto Bulls WC) Maj 10-0</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - David Pearce (Bethalto Bulls WC) won by fall over Luke Padesky (Moline WC) Fall 0:29</li>\n<li>Champ. Round 2 - Nick Fontanetta (Crystal Lake Wizards) won by fall over Evan Christianson (Batavia Pinners) Fall 1:34</li>\n<li>Champ. Round 2 - Chris Maier (Crystal Lake Wizards) won by decision over Jake Latanski (Lemont Bears WC) Dec 2-1</li>\n<li>Champ. Round 2 - Andrew Murphy (Little Celtic WC) won by major decision over Sean Parvin (Sauk Valley WC) Maj 11-2</li>\n<li>Champ. Round 2 - Adam Wyeth (Yorkville Wrestling Club) won by decision over Zachary Denny (Harlem Cougars) Dec 9-2</li>\n<li>Champ. Round 2 - Jeremy Brown (Force Wrestling) won by decision over Erin Golston (Martinez Fox Valley Elite) Dec 3-1</li>\n<li>Champ. Round 2 - Zachary Martin (Central Elite Rebels) won by decision over Daniel Ruettiger (Minooka Little Indians) Dec 6-5</li>\n<li>Champ. Round 2 - Devon Graville (Sons of Thunder) won by decision over John Gosinski (Villa Lombard Cougars) Dec 7-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Nick Fishback (Vittum Cats) won by decision over Mitchel Kennington (Harlem Renegades) Dec 4-0</li>\n<li>Champ. Round 2 - Stephen Myers (Plainfield WC) won by tech fall over Steve Licina (Brawlers WC) TF 16-1</li>\n<li>Champ. Round 2 - Adam Hay (Moline WC) won by fall over Evan Trapino (Richmond WC) Fall 1:52</li>\n<li>Champ. Round 2 - Jeremiah Shearer (Xtreme Wrestling) won by decision over Tyler Simmons (Little Falcons WC) Dec 3-0</li>\n<li>Champ. Round 2 - Josh Bennett (Sons of Thunder) won by tech fall over Jon Williamson (Naperville WC) TF 16-1</li>\n<li>Champ. Round 2 - Cullen Smith (Crystal Lake Wizards) won by decision over Austin Rhodenbaugh (Dixon WC) Dec 9-7</li>\n<li>Champ. Round 2 - Chris Denning (Sauk Valley WC) won by fall over Zachery Barnes (Vermilion Valley Elite) Fall 1:40</li>\n<li>Champ. Round 2 - Matthew Ornoff (Wrestling Factory) won by tech fall over Kevin Golden (Vittum Cats) TF 15-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Ferraris Jr (Maine Eagles WC) won by decision over Garrett Webb (Dixon WC) Dec 5-4</li>\n<li>Champ. Round 2 - Eduardo Greco (SCN Youth WC) won by fall over Ryan Martini (Orland Park Pioneers) Fall 2:21</li>\n<li>Champ. Round 2 - Michael Mizaur (Vittum Cats) won by decision over Drake Chase (Sons of Thunder) Dec 5-4</li>\n<li>Champ. Round 2 - Derek Elmore (Harlem Cougars) won by decision over Nathan Davis (Plainfield WC) Dec 11-6</li>\n<li>Champ. Round 2 - Trevor Jauch (Crystal Lake Wizards) won by fall over Andrew Mason (Lemont Bears WC) Fall 2:04</li>\n<li>Champ. Round 2 - Leo Ruettiger (Minooka Little Indians) won by decision over Mark Savenok (WW Tiger WC) Dec 3-0</li>\n<li>Champ. Round 2 - Kyle Graumenz (Triad Little Knights) won by fall over Josh Johnson (Central Elite Rebels) Fall 3:03</li>\n<li>Champ. Round 2 - Jesse McCabe (Wolfpak WC) won by decision over Patrick Sullivan (Crystal Lake Wizards) Dec 4-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Chris Kerwin (Sycamore WC) won by fall over Vince Gottardo (Mad Dog Wrestling Academy) Fall 0:25</li>\n<li>Champ. Round 2 - Eddie Klimara (Little Celtic WC) won by tech fall over Kevin Moylan (Vittum Cats) TF 17-0</li>\n<li>Champ. Round 2 - Chris Williams (Bethalto Bulls WC) won by fall over Maxx Hubbard (Sauk Valley WC) Fall 2:46</li>\n<li>Champ. Round 2 - Troy Valdez (Bronco Wrestling) won by decision over Eric Oliver (Harvey Park Dist Twisters) Dec 7-2</li>\n<li>Champ. Round 2 - Lance Hosman (Tinley Park Bulldogs) won by decision over Frank McKeown (Naperville Huskie WC) Dec 9-3</li>\n<li>Champ. Round 2 - Steven Bradtmueller (Force Wrestling) won by fall over Alexander Ostermeier (Taylorville WC) Fall 1:29</li>\n<li>Champ. Round 2 - Mike Soris (Yorkville Wrestling Club) won by decision over Brady Schlueter (Dakota WC) Dec 4-2</li>\n<li>Champ. Round 2 - Kevin Skrzypiec (Orland Park Pioneers) won by decision over Benjamin Schwartz (Wolfpak WC) Dec 5-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Shane Hafner (Mad Dog Wrestling Academy) won by decision over Garrett Grantom (Triad Little Knights) Dec 4-0</li>\n<li>Champ. Round 2 - Jimmy Nehls (Downers Grove Cougars) won by decision over Frank Abitua (Golden Eagles) Dec 7-0</li>\n<li>Champ. Round 2 - Eamon Przekwas (Oak Forest Warriors) won by fall over Jacob Fuqua (Crosstown WC) Fall 1:56</li>\n<li>Champ. Round 2 - Jason Fugiel (Crystal Lake Wizards) won by tech fall over Gerald Lanning (Pontiac Pythons) TF 16-0</li>\n<li>Champ. Round 2 - Joe Ladick (Golden Eagles) won by decision over Casey Rzechula (Bur-Oak Wildcats WC) Dec 7-0</li>\n<li>Champ. Round 2 - Edwin Cooper (Little Celtic WC) won by decision over Jose Jimenez (Bronco Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Tyler Schilson (West Hancock Titan WC) won by major decision over Jared Morrow (Bethalto Bulls WC) Maj 14-3</li>\n<li>Champ. Round 2 - Danny Sabatello (Arlington Cardinals) won by decision over Michael Murphy (Vittum Cats) Dec 7-6</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Joey Gosinski (Villa Lombard Cougars) won by decision over Ryan Fitzpatrick (Vittum Cats) Dec 3-2</li>\n<li>Champ. Round 2 - Wesley Patton (Oakwood WC) won by decision over Dylan Anderson (GC Jr Warriors) Dec 1-0</li>\n<li>Champ. Round 2 - Dylon Viglasky (Belleville Little Devils) won by decision over Blaise Butler (Fightin Titan WC) Dec 4-2</li>\n<li>Champ. Round 2 - Michael Togher (Little Celtic WC) won by decision over Sam Apland (Downers Grove Cougars) Dec 6-0</li>\n<li>Champ. Round 2 - Dominic Chase (Sons of Thunder) won by major decision over Kyle Culton (Sycamore WC) Maj 10-0</li>\n<li>Champ. Round 2 - Daniel Aguado (Martinez Fox Valley Elite) won by decision over Stephen Burling (Central Elite Rebels) Dec 8-6</li>\n<li>Champ. Round 2 - Steven Lalowski (Sycamore WC) won by decision over Steven Pozeg (Yorkville Wrestling Club) Dec 11-4</li>\n<li>Champ. Round 2 - Lucas Smith (Bison WC) won by fall over Sean Raddatz (Oak Forest Warriors) Fall 2:50</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Joe Souder (Falcon WC) won by major decision over David Price (Rock Island WC) Maj 8-0</li>\n<li>Champ. Round 2 - Jameel Carter (Chicago Crusaders) won by decision over Conor Winel (Bronco Wrestling) Dec 4-3</li>\n<li>Champ. Round 2 - Nick Harrison (Xtreme Wrestling) won by decision over Derek Nagel (Vittum Cats) Dec 7-0</li>\n<li>Champ. Round 2 - Brandon Rice (Central Elite Rebels) won by decision over Brandon Lee (Yorkville Wrestling Club) Dec 5-0</li>\n<li>Champ. Round 2 - Andrew Hoselton (Prairie Central-Chenoa Hawks) won by decision over Nolberto Deavila (Collinsville Raiders) Dec 6-4</li>\n<li>Champ. Round 2 - Zack Patnou (Harlem Renegades) won by decision over Mark McDonnell (Morrison Stallions WC) Dec 10-4</li>\n<li>Champ. Round 2 - Jameson Oster (Lemont Bears WC) won by fall over Tyler Mahan (Taylorville WC) Fall 0:58</li>\n<li>Champ. Round 2 - Stephen Robertson (Team West Wolves) won by decision over Ryan Soraghan (Orland Park Pioneers) Dec 5-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Zach Mutton (Rockford WC) won by decision over Dakota Wapotish (Barrington Broncos) Dec 4-2</li>\n<li>Champ. Round 2 - Robert Guillen (West Chicago Junior Wildcats) won by fall over Buddy Daly (Unity Youth WC) Fall 2:00</li>\n<li>Champ. Round 2 - Bo Schlosser (Sons of Thunder) won by major decision over Austin Carlson (Wrestling Factory) Maj 9-0</li>\n<li>Champ. Round 2 - Spartak Chino (WW Tiger WC) won by decision over Jordan McCartney (Yorkville Wrestling Club) Dec 7-5</li>\n<li>Champ. Round 2 - Mitchell Brozovich (Minooka Little Indians) won by decision over Levi Ulmer (Vandalia Jr Wrestling) Dec 10-3</li>\n<li>Champ. Round 2 - Jordan Thompson (Martinez Fox Valley Elite) won by decision over Colbey Vance (Riverdale Jr Rams WC) Dec 5-1</li>\n<li>Champ. Round 2 - Malik - Jabri Taylor (Harvey Park Dist Twisters) won by major decision over Nick Armstrong (Sons of Thunder) Maj 12-0</li>\n<li>Champ. Round 2 - Eddie Scanlon (Bison WC) won by decision over Zack Spiewak (Sycamore WC) Dec 4-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Frank Baer (Bronco Wrestling) won by tech fall over Drew Bates (Lions WC) TF 16-1</li>\n<li>Champ. Round 2 - Elliott McClure (Falcon Youth WC) won by decision over Joey Caprio (Arlington Cardinals) Dec 7-6</li>\n<li>Champ. Round 2 - Blake Montella (Minooka Little Indians) won by decision over Mason McBride (Edwardsville WC) Dec 5-2</li>\n<li>Champ. Round 2 - Donald Miller (Proviso PowerHouse WC) won by decision over Brant Corwin (Yorkville Wrestling Club) Dec 6-3</li>\n<li>Champ. Round 2 - Steven Bradley (Xtreme Wrestling) won by fall over Beau George (SCN Youth WC) Fall 0:59</li>\n<li>Champ. Round 2 - Tyler Argue (Rich Rattlers WC) won by fall over Christopher Wright (Harvey Park Dist Twisters) Fall 3:31</li>\n<li>Champ. Round 2 - Jacob Gregerson (Sons of Thunder) won by fall over Sheldon Magee (Plainfield WC) Fall 1:36</li>\n<li>Champ. Round 2 - Joey Kubica (Gomez Wrestling Academy) won by major decision over Mike Trizzino (St. Charles East WC) Maj 13-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Travis Tomac (Force Wrestling) won by decision over Austin Smith (Road Warriors) Dec 8-4</li>\n<li>Champ. Round 2 - Andrew Messenger (Yorkville Wrestling Club) won by major decision over Luke Pigott (Fox Valley WC) Maj 15-2</li>\n<li>Champ. Round 2 - Kean Loupee (Crystal Lake Wizards) won by decision over Michael Semmens (Batavia Pinners) Dec 3-0</li>\n<li>Champ. Round 2 - Michael Avelar (Morton Little Mustangs) won by fall over Henry Lecrone (Unity Youth WC) Fall 0:56</li>\n<li>Champ. Round 2 - Eric Hulihan (Fenwick Falcons WC) won by decision over Willie Anaya (Downers Grove Cougars) Dec 4-1</li>\n<li>Champ. Round 2 - Dylan Reel (Central Elite Rebels) won by fall over Kalvin Whitener-Hill (Minooka Little Indians) Fall 2:25</li>\n<li>Champ. Round 2 - Dustin Ventimiglia (Sons of Thunder) won by fall over Zach Paterson (Xtreme Wrestling) Fall 3:59</li>\n<li>Champ. Round 2 - Andrew Elliot (Little Celtic WC) won by fall over Jimmy Wallenberg (Notre Dame Wrestling) Fall 3:26</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Joey Kielbasa (Crystal Lake Wizards) won by fall over Max Andersen (Edwardsville WC) Fall 3:39</li>\n<li>Champ. Round 2 - Brian Strenk (Oak Forest Warriors) won by major decision over Eric Sirvid (Orland Park Pioneers) Maj 13-2</li>\n<li>Champ. Round 2 - Larry Sanders (Herrin Junior WC) won by fall over Michael Caddy (SCN Youth WC) Fall 2:05</li>\n<li>Champ. Round 2 - John Bozarth (Central Elite Rebels) won by decision over Jeff Koepke (Arlington Cardinals) Dec 9-5</li>\n<li>Champ. Round 2 - Tyler Ledbetter (Force Wrestling) won by fall over Andrew Winkler (Bismarck Henning WC) Fall 2:13</li>\n<li>Champ. Round 2 - Dimitri Willis (Gladiators) won by fall over Michael Aldrich Jr (Peoria Razorbacks Youth WC) Fall 2:55</li>\n<li>Champ. Round 2 - Josh Isaac (Belvidere Bandits) won by decision over James Souza (Little Redbird WC) Dec 7-2</li>\n<li>Champ. Round 2 - Charles Doyle (Notre Dame Wrestling) won by decision over Luke Polka (Lions WC) Dec 6-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Noah Murray (Springfield Capital Kids WC) won by decision over Virgil Houston (Black Kats WC) Dec 9-4</li>\n<li>Champ. Round 2 - Colin Haney (Force Wrestling) won by decision over Jakob Jepson (Erie Middle School WC) Dec 9-3</li>\n<li>Champ. Round 2 - Stephen Walz (Blackhawk WC) won by decision over Joshua Marchok (Gomez Wrestling Academy) Dec 7-6</li>\n<li>Champ. Round 2 - Jahwon Akui (Gladiators) won by tech fall over Trey Griffin (Crystal Lake Wizards) TF 19-4</li>\n<li>Champ. Round 2 - Malik Snapp (Joliet Junior Steelmen) won by tech fall over Julius Johnson (Gladiators) TF 17-0</li>\n<li>Champ. Round 2 - Brendan Brooks (Sons of Thunder) won by fall over Xavier Brent (Champaign Kids Wrestling) Fall 2:04</li>\n<li>Champ. Round 2 - Joshua Anthony (Harlem Cougars) won by decision over Alex Sadauskas (Little Falcons WC) Dec 10-3</li>\n<li>Champ. Round 2 - Brian Kent (Bison WC) won by decision over Tyler Farney (Prairie Central-Chenoa Hawks) Dec 4-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Ronnie Webb (Seneca Irish Cadets) won by decision over Joseph Drozd (WW Tiger WC) Dec 13-10</li>\n<li>Champ. Round 2 - Rasheed Lemon (Gladiators) won by major decision over Giuseppe Lamanna (Mad Dog Wrestling Academy) Maj 10-1</li>\n<li>Champ. Round 2 - Tim Maroder (Crystal Lake Wizards) won by major decision over Joshua Cull (Crosstown WC) Maj 11-1</li>\n<li>Champ. Round 2 - JD Cox (Sons of Thunder) won by fall over Jacob Nunez (El Paso/Gridley WC) Fall 1:24</li>\n<li>Champ. Round 2 - Ryan Redmon (Cumberland Youth WC) won by decision over Justin Hill (Edwardsville WC) Dec 6-1</li>\n<li>Champ. Round 2 - Wes Cathcart (Geneseo Spider WC) won by fall over Brian Gibbs (Harvey Park Dist Twisters) Fall 3:26</li>\n<li>Champ. Round 2 - Gage Harrah (Crystal Lake Wizards) won by fall over Carlos Gentil (Plainfield WC) Fall 0:28</li>\n<li>Champ. Round 2 - Anthony Ibarra (Gomez Wrestling Academy) won by decision over Giovanny Martinez (Oak Forest Warriors) Dec 6-3</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Daniel Holman (Fairmont Rough Riders) won by major decision over Tyler Knudsen (Villa Lombard Cougars) Maj 12-1</li>\n<li>Champ. Round 2 - Blake Novack (Bethalto Bulls WC) won by fall over Michael Kang (Naperville Huskie WC) Fall 1:50</li>\n<li>Champ. Round 2 - Daniel Massengill (Central Elite Rebels) won by major decision over Justin Wallace (Palatine Panthers WC) Maj 16-7</li>\n<li>Champ. Round 2 - Austin Marsden (Crystal Lake Wizards) won by decision over Nicholas Havemann (Rock Island WC) Dec 2-0</li>\n<li>Champ. Round 2 - Vinny Lamontagna (WW Tiger WC) won by decision over Hans Schaeffer (Moline WC) Dec 5-3</li>\n<li>Champ. Round 2 - Michael Pulley (Sons of Thunder) won by decision over Nick Peltier (Vittum Cats) Dec 8-4</li>\n<li>Champ. Round 2 - Jared Koch (Golden Eagles) won by fall over Tyler Cravens (Herrin Junior WC) Fall 0:47</li>\n<li>Champ. Round 2 - Jake Randich (Driscoll Junior Highlanders) won by decision over Cody Weaver (Little Celtic WC) Dec 5-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Chris Montez (Peoria Razorbacks Youth WC) won by fall over Seth Springsteen (Junior Vikings) Fall 2:29</li>\n<li>Champ. Round 2 - Richard Kersten (Crystal Lake Wizards) won by fall over Kyle Clark (Oak Forest Warriors) Fall 2:46</li>\n<li>Champ. Round 2 - Javonta Black (Blackhawk WC) won by fall over Connor Cook (Rochester WC) Fall 0:34</li>\n<li>Champ. Round 2 - Kevin Rowett (Collinsville Raiders) won by fall over Ricky Castillo (Crosstown WC) Fall 0:41</li>\n<li>Champ. Round 2 - Jack Allen (Hinsdale Red Devils Wc) won by fall over Taylor McGiffen (Little Redbird WC) Fall 1:54</li>\n<li>Champ. Round 2 - Michael Sojka (Harlem Cougars) won by fall over Joshua Naber (Golden Eagles) Fall 0:20</li>\n<li>Champ. Round 2 - Mitchell Godfrey (Little Celtic WC) won by fall over Mitchell Keppy (Riverdale Jr Rams WC) Fall 0:49</li>\n<li>Champ. Round 2 - Daniel Eldridge (Villa Lombard Cougars) won by fall over Jeff Carter (Tiger WC) Fall 0:35</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Dakota Patton (Bismarck Henning WC) won by decision over Carlos Martinez (Shamrock WC) Dec 3-1</li>\n<li>Champ. Round 2 - Alexander Carney (Geneseo Spider WC) won by fall over Samuel Pirtle (Roxana Kids WC) Fall 1:50</li>\n<li>Champ. Round 2 - John Taylor (Blackhawk WC) won by fall over Daniel Muehlfelt (Palatine Panthers WC) Fall 1:32</li>\n<li>Champ. Round 2 - Zachary Didriksen (Crystal Lake Wizards) won by fall over Connor Flaherty (Peoria Razorbacks Youth WC) Fall 0:59</li>\n<li>Champ. Round 2 - George Canales (Dixon WC) won by fall over Glen Buckwinkler (Marengo Indians Youth Wrestling) Fall 0:57</li>\n<li>Champ. Round 2 - Andrew Crivellone (Bur-Oak Wildcats WC) won by fall over Derek Jenkins (Collinsville Raiders) Fall 1:41</li>\n<li>Champ. Round 2 - Shaquille McMurtry (Little Celtic WC) won by fall over Trent Grossman (Little Falcons WC) Fall 2:22</li>\n<li>Champ. Round 2 - Ross Ferraro III (Gomez Wrestling Academy) won by fall over Rey Rodriguez (Taylorville WC) Fall 1:59</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Michael Bernardo (Little Falcons WC) won by fall over Antwyone Brown Jr. (Crosstown WC) Fall 2:27</li>\n<li>Champ. Round 2 - James Boyle (Knights WC) won by major decision over Mitchell Curry (Unity Youth WC) Maj 11-2</li>\n<li>Champ. Round 2 - Kodie Schilson (West Hancock Titan WC) won by fall over Mohammed Abbed (El Paso/Gridley WC) Fall 1:57</li>\n<li>Champ. Round 2 - Alvin Foster III (Harvey Park Dist Twisters) won by fall over Kyle Bastilla (Belleville Little Devils) Fall 0:13</li>\n<li>Champ. Round 2 - Mitchell McElroy (Mt. Zion WC) won by decision over Cristian Guzman (Morton Little Mustangs) Dec 6-2</li>\n<li>Champ. Round 2 - Tanner Crum (Aces WC) won by fall over Alex Mares (Little Celtic WC) Fall 1:17</li>\n<li>Champ. Round 2 - Martell Smith (Peoria Razorbacks Youth WC) won by fall over Conor McHale (Orland Park Pioneers) Fall 2:29</li>\n<li>Champ. Round 2 - Christopher Lopez (Iron Man) won by fall over Michael Homeier (Redhawk  WC) Fall 0:54</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Brian Bobek (Palatine Panthers WC) won by fall over Nathaniel Whittington (Harvey Park Dist Twisters) Fall 1:53</li>\n<li>Champ. Round 2 - Sean Martin (Sons of Thunder) won by decision over Gerrardo Cisneros (Little Celtic WC) Dec 10-3</li>\n<li>Champ. Round 2 - Travis Blecher (Rock Island WC) won by decision over Rocco Zinanni (Brawlers WC) Dec 4-3</li>\n<li>Champ. Round 2 - Andy Heredia (Iron Man) won by fall over Larry Bryant (Harlem Cougars) Fall 2:22</li>\n<li>Champ. Round 2 - Zachary Burton (Charleston WC) won by fall over Wren Goff (Metamora Kids WC) Fall 1:19</li>\n<li>Champ. Round 2 - Kyle Ryan (Force Wrestling) won by fall over Ethan Buford (Edwardsville WC) Fall 1:25</li>\n<li>Champ. Round 2 - Deshawn Berry (Tomcat WC) won by fall over Zachary Lowe (Grapplin` Devils WC) Fall 0:55</li>\n<li>Champ. Round 2 - Joshua Dust (Grapplin` Devils WC) won by fall over Nick Towner (Edwardsville WC) Fall 0:52</li>\n</ul>\n</section>",
  "Quarters (32 Man)": "<section class=\"tw-list\">\n<h1>Quarters (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Mark Duda (Crosstown WC) won by decision over Michael Cullen (Wrestling Factory) Dec 3-1</li>\n<li>Quarterfinal - Jabari Moody (Harvey Park Dist Twisters) won by decision over Dillion Chase (Sons of Thunder) Dec 6-4</li>\n<li>Quarterfinal - Dylan Cramer (Force Wrestling) won by decision over Jeffery Morrow (Crystal Lake Wizards) Dec 5-1</li>\n<li>Quarterfinal - Jon Marmolejo (Gomez Wrestling Academy) won by decision over Tommy Pawelski (Bronco Wrestling) Dec 3-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Josh Alber (Dakota WC) won by major decision over Jason Moerlien (GC Jr Warriors) Maj 9-0</li>\n<li>Quarterfinal - Jimmy Pellegrino (Orland Park Pioneers) won by decision over Rudolph Johnson (Harvey Park Dist Twisters) Dec 3-1</li>\n<li>Quarterfinal - George Fisher (SCN Youth WC) won by major decision over Jake Snow (Sauk Valley WC) Maj 13-0</li>\n<li>Quarterfinal - Cameron Kennedy (Wrestling Factory) won by major decision over Reuben Reyes (Force Wrestling) Maj 13-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Kyle Fugiel (Crystal Lake Wizards) won by decision over Joey Nelson (Little Celtic WC) Dec 2-1</li>\n<li>Quarterfinal - Anthony Devriese (Moline WC) won by decision over Briar King (GC Jr Warriors) Dec 2-1</li>\n<li>Quarterfinal - Demechico Spraggins (GC Jr Warriors) won by decision over Zachary Synon (Cary Jr Trojan Matmen) Dec 8-4</li>\n<li>Quarterfinal - Sean Lynch (Wrestling Factory) won in overtime over Eric Demattia (Pontiac Pythons) OT 4-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Kegan Wakefield (Wrestling Factory) won by decision over Clayton Shelton (Force Wrestling) Dec 7-0</li>\n<li>Quarterfinal - Jordan Scalice (Gomez Wrestling Academy) won by decision over Nathan Newman (Midwest Central Youth) Dec 5-1</li>\n<li>Quarterfinal - Notay Jackson (Harvey Park Dist Twisters) won by decision over Jordan Lind (Pontiac Pythons) Dec 5-0</li>\n<li>Quarterfinal - Garrett Sutton (Wrestling Factory) won by decision over Mitchell Mallary (Erie Middle School WC) Dec 5-1</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Bryce Brill (Fox Valley WC) won by fall over Steven Galiardo (Shamrock WC) Fall 3:44</li>\n<li>Quarterfinal - Brendan Tyler Hall (Harvey Park Dist Twisters) won by fall over Sal Annoreno (Gomez Wrestling Academy) Fall 3:00</li>\n<li>Quarterfinal - Erik Nord (Belvidere Bandits) won by decision over Johnny Pellegrino (Orland Park Pioneers) Dec 8-4</li>\n<li>Quarterfinal - Brian Murphy (Villa Lombard Cougars) won by major decision over Connor Bass (Yorkville Wrestling Club) Maj 9-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Nuntreae Jackson (Harvey Park Dist Twisters) won by decision over Mitchell Dearing (Central Elite Rebels) Dec 4-1</li>\n<li>Quarterfinal - Kyle Langenderfer (Orland Park Pioneers) won by decision over Austin Culton (Sycamore WC) Dec 5-1</li>\n<li>Quarterfinal - Ernest Battaglia (Fox Valley WC) won by decision over Peter Andreotti (Orland Park Pioneers) Dec 3-0</li>\n<li>Quarterfinal - Devin Mahnke (Harvey Park Dist Twisters) won by decision over Brandon Lizer (Dakota WC) Dec 3-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - JJ Whaley (Xtreme Wrestling) won by decision over Angelo Silvestro (SCN Youth WC) Dec 6-3</li>\n<li>Quarterfinal - Corbett Oughton (Minooka Little Indians) won by decision over Lonne Cleveland III (GC Jr Warriors) Dec 9-3</li>\n<li>Quarterfinal - Michael Sepke (Bronco Wrestling) won by decision over Jacob Deklerk (Minooka Little Indians) Dec 8-2</li>\n<li>Quarterfinal - Richard Robertson (Vittum Cats) won by decision over Danny Brewster (Maine Eagles WC) Dec 8-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Jason Locker (Pontiac Pythons) won by fall over Ryder Belzer (Zee Bee Stingers) Fall 2:26</li>\n<li>Quarterfinal - Nick Ruffino (SCN Youth WC) won by decision over Tyler Nagel (Vittum Cats) Dec 6-0</li>\n<li>Quarterfinal - Zach Lehman (Dixon WC) won by decision over Colton Gladwell (Central Elite Rebels) Dec 5-4</li>\n<li>Quarterfinal - Timothy Corse (Tinley Park Bulldogs) won by tech fall over Micheal Cudemo (Murphysboro Wrestling) TF 20-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Steve Congenie (Hinsdale Red Devils Wc) won by fall over Brett Meyer (Central Elite Rebels) Fall 2:04</li>\n<li>Quarterfinal - Adrian Palacios (Joliet Junior Steelmen) won by decision over Nick Georgean (Erie Middle School WC) Dec 12-7</li>\n<li>Quarterfinal - Brandon Sklavanitis (Xtreme Wrestling) won by fall over Taje Frazier (Renegade WC (NFP)) Fall 2:28</li>\n<li>Quarterfinal - Zane Richards (Carbondale WC) won by fall over Nathan Zinzer (Blackhawk WC) Fall 1:49</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Jordan Ellingwood (Vittum Cats) won by fall over Tony Cashmore (Richmond WC) Fall 0:41</li>\n<li>Quarterfinal - Jared Jayne (Bronco Wrestling) won by major decision over Cameron Mammen (Tiger WC) Maj 10-1</li>\n<li>Quarterfinal - Tyrone Sally Jr. (Harvey Park Dist Twisters) won by decision over Kyle Ledbetter (Force Wrestling) Dec 6-2</li>\n<li>Quarterfinal - Zach Hicks (Hoopeston Area WC) won by major decision over Max Ellis (Zee Bee Stingers) Maj 12-4</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Robbie Irvin (Hoopeston Area WC) won by fall over Alexander Torres (Brawlers WC) Fall 3:21</li>\n<li>Quarterfinal - Sam Brooks (Little Huskie WC) won by tech fall over Matthew Schneider (Lincoln-way WC) TF 19-3</li>\n<li>Quarterfinal - Shaunqae McMurtry (Little Celtic WC) won by decision over Blake Stricklin (Mt. Vernon Lions) Dec 8-3</li>\n<li>Quarterfinal - Ivan Castro (Fenwick Falcons WC) won by decision over Logan Staver (Panther Cub WC) Dec 7-4</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - AJ Vargas (Tinley Park Bulldogs) won by fall over Hunter Barry (Little Redskins WC) Fall 1:45</li>\n<li>Quarterfinal - Alex Eagle-Martinez (Romeoville WC) won by fall over Nick Rude (Sauk Valley WC) Fall 2:31</li>\n<li>Quarterfinal - Andy Bensyl (SJO Spartan Youth WC) won by decision over Brian Bahrs (Sauk Valley WC) Dec 3-2</li>\n<li>Quarterfinal - Mitchell Jordan (Sycamore WC) won by decision over Eric Krieger (Fox Valley WC) Dec 4-1</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Jack Dechow (Richmond WC) won by decision over Cody Rozek (Dixon WC) Dec 8-3</li>\n<li>Quarterfinal - Nathaniel Volk (Champaign Kids Wrestling) won by fall over Rhett Evans (Vandalia Jr Wrestling) Fall 2:21</li>\n<li>Quarterfinal - Austin Smith (Fightin Titan WC) won by fall over Brian Allen (Hinsdale Red Devils Wc) Fall 1:39</li>\n<li>Quarterfinal - Lucas Cartwright (Waukegan Youth WC) won by decision over Brenden Pindel (Orland Park Pioneers) Dec 14-9</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>Quarterfinal - Mason Wright (Central Elite Rebels) won by major decision over Scott Riggins (Highland Bulldog Jr WC) Maj 13-5</li>\n<li>Quarterfinal - Mark Hendricks (Marengo Indians Youth Wrestling) won by decision over Nicholas Mokodanski (Kane County Grapplers) Dec 3-2</li>\n<li>Quarterfinal - Brad Johnson (Lemont Bears WC) won by fall over Mario Carretto (L-P Crunching Cavs) Fall 1:55</li>\n<li>Quarterfinal - James Lowery (Bronco Wrestling) won by major decision over Jimmy Prince (Lakeland Predators) Maj 23-9</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>Quarterfinal - Jordan Pena (Dundee Highlanders) won by fall over Channing Dolliger (Brawlers WC) Fall 0:47</li>\n<li>Quarterfinal - Aaron Ford (Warrensburg WC) won by decision over Daniel Goree (Gladiators) Dec 5-1</li>\n<li>Quarterfinal - Kenny Lindsey (SJO Spartan Youth WC) won by decision over Coltyn Pease (Saukee Youth WC) Dec 4-0</li>\n<li>Quarterfinal - Nick Kelly (Little Celtic WC) won by fall over Daniel Davidson (Barrington Broncos) Fall 0:34</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - David Denne (Calumet Memorial P.D. Wolverines) won by fall over Dustin Rosborough (Highland Bulldog Jr WC) Fall 4:37</li>\n<li>Quarterfinal - Jake Cochrane (Lakeland Predators) won by fall over Adam Szott (Waubonsie WC) Fall 2:41</li>\n<li>Quarterfinal - Delasse Lanier (Romeoville WC) won by fall over Michael Behrends (Warrensburg WC) Fall 1:30</li>\n<li>Quarterfinal - Hector Trevino (Fenwick Falcons WC) won by decision over Jesse Cantu (Gomez Wrestling Academy) Dec 3-2</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Quarterfinal - Jesse McLain (Orland Park Pioneers) won by decision over Matthew Sommers (Arlington Cardinals) Dec 4-0</li>\n<li>Quarterfinal - Cain Salas (Sons of Thunder) won by major decision over Brian Cullen (Wrestling Factory) Maj 8-0</li>\n<li>Quarterfinal - Kevon Powell (Harvey Park Dist Twisters) won by major decision over Matthew Rader (Hononegah Kids WC) Maj 10-2</li>\n<li>Quarterfinal - Michael Gibson (Bronco Wrestling) won by major decision over Aaron Kohlberg (Arlington Cardinals) Maj 14-3</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Nick Fontanetta (Crystal Lake Wizards) won by decision over David Pearce (Bethalto Bulls WC) Dec 6-3</li>\n<li>Quarterfinal - Andrew Murphy (Little Celtic WC) won by decision over Chris Maier (Crystal Lake Wizards) Dec 6-0</li>\n<li>Quarterfinal - Jeremy Brown (Force Wrestling) won by decision over Adam Wyeth (Yorkville Wrestling Club) Dec 8-3</li>\n<li>Quarterfinal - Devon Graville (Sons of Thunder) won by fall over Zachary Martin (Central Elite Rebels) Fall 0:37</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Stephen Myers (Plainfield WC) won by decision over Nick Fishback (Vittum Cats) Dec 6-1</li>\n<li>Quarterfinal - Jeremiah Shearer (Xtreme Wrestling) won by decision over Adam Hay (Moline WC) Dec 6-4</li>\n<li>Quarterfinal - Josh Bennett (Sons of Thunder) won by decision over Cullen Smith (Crystal Lake Wizards) Dec 6-4</li>\n<li>Quarterfinal - Matthew Ornoff (Wrestling Factory) won by fall over Chris Denning (Sauk Valley WC) Fall 0:39</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Eduardo Greco (SCN Youth WC) won by decision over Anthony Ferraris Jr (Maine Eagles WC) Dec 8-7</li>\n<li>Quarterfinal - Derek Elmore (Harlem Cougars) won by decision over Michael Mizaur (Vittum Cats) Dec 10-5</li>\n<li>Quarterfinal - Trevor Jauch (Crystal Lake Wizards) won by fall over Leo Ruettiger (Minooka Little Indians) Fall 2:05</li>\n<li>Quarterfinal - Jesse McCabe (Wolfpak WC) won by decision over Kyle Graumenz (Triad Little Knights) Dec 3-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Eddie Klimara (Little Celtic WC) won by decision over Chris Kerwin (Sycamore WC) Dec 8-1</li>\n<li>Quarterfinal - Chris Williams (Bethalto Bulls WC) won by fall over Troy Valdez (Bronco Wrestling) Fall 3:59</li>\n<li>Quarterfinal - Lance Hosman (Tinley Park Bulldogs) won by decision over Steven Bradtmueller (Force Wrestling) Dec 3-1</li>\n<li>Quarterfinal - Kevin Skrzypiec (Orland Park Pioneers) won by decision over Mike Soris (Yorkville Wrestling Club) Dec 5-4</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Jimmy Nehls (Downers Grove Cougars) won by decision over Shane Hafner (Mad Dog Wrestling Academy) Dec 7-0</li>\n<li>Quarterfinal - Jason Fugiel (Crystal Lake Wizards) won by fall over Eamon Przekwas (Oak Forest Warriors) Fall 0:59</li>\n<li>Quarterfinal - Edwin Cooper (Little Celtic WC) won by major decision over Joe Ladick (Golden Eagles) Maj 11-2</li>\n<li>Quarterfinal - Danny Sabatello (Arlington Cardinals) won by decision over Tyler Schilson (West Hancock Titan WC) Dec 4-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Joey Gosinski (Villa Lombard Cougars) won by decision over Wesley Patton (Oakwood WC) Dec 7-0</li>\n<li>Quarterfinal - Dylon Viglasky (Belleville Little Devils) won by fall over Michael Togher (Little Celtic WC) Fall 2:53</li>\n<li>Quarterfinal - Dominic Chase (Sons of Thunder) won by tech fall over Daniel Aguado (Martinez Fox Valley Elite) TF 15-0</li>\n<li>Quarterfinal - Lucas Smith (Bison WC) won by injury default over Steven Lalowski (Sycamore WC) Inj. 0:00</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Joe Souder (Falcon WC) won by fall over Jameel Carter (Chicago Crusaders) Fall 2:10</li>\n<li>Quarterfinal - Nick Harrison (Xtreme Wrestling) won by major decision over Brandon Rice (Central Elite Rebels) Maj 11-1</li>\n<li>Quarterfinal - Andrew Hoselton (Prairie Central-Chenoa Hawks) won by major decision over Zack Patnou (Harlem Renegades) Maj 8-0</li>\n<li>Quarterfinal - Stephen Robertson (Team West Wolves) won by decision over Jameson Oster (Lemont Bears WC) Dec 3-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Zach Mutton (Rockford WC) won by major decision over Robert Guillen (West Chicago Junior Wildcats) Maj 14-4</li>\n<li>Quarterfinal - Bo Schlosser (Sons of Thunder) won by decision over Spartak Chino (WW Tiger WC) Dec 4-1</li>\n<li>Quarterfinal - Mitchell Brozovich (Minooka Little Indians) won by decision over Jordan Thompson (Martinez Fox Valley Elite) Dec 3-1</li>\n<li>Quarterfinal - Malik - Jabri Taylor (Harvey Park Dist Twisters) won by major decision over Eddie Scanlon (Bison WC) Maj 11-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Frank Baer (Bronco Wrestling) won by fall over Elliott McClure (Falcon Youth WC) Fall 2:23</li>\n<li>Quarterfinal - Blake Montella (Minooka Little Indians) won by decision over Donald Miller (Proviso PowerHouse WC) Dec 6-0</li>\n<li>Quarterfinal - Tyler Argue (Rich Rattlers WC) won by decision over Steven Bradley (Xtreme Wrestling) Dec 6-4</li>\n<li>Quarterfinal - Jacob Gregerson (Sons of Thunder) won by fall over Joey Kubica (Gomez Wrestling Academy) Fall 2:58</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Andrew Messenger (Yorkville Wrestling Club) won by decision over Travis Tomac (Force Wrestling) Dec 6-0</li>\n<li>Quarterfinal - Michael Avelar (Morton Little Mustangs) won by decision over Kean Loupee (Crystal Lake Wizards) Dec 2-0</li>\n<li>Quarterfinal - Dylan Reel (Central Elite Rebels) won by major decision over Eric Hulihan (Fenwick Falcons WC) Maj 14-3</li>\n<li>Quarterfinal - Dustin Ventimiglia (Sons of Thunder) won by major decision over Andrew Elliot (Little Celtic WC) Maj 10-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Joey Kielbasa (Crystal Lake Wizards) won by decision over Brian Strenk (Oak Forest Warriors) Dec 8-5</li>\n<li>Quarterfinal - John Bozarth (Central Elite Rebels) won by major decision over Larry Sanders (Herrin Junior WC) Maj 13-2</li>\n<li>Quarterfinal - Dimitri Willis (Gladiators) won by decision over Tyler Ledbetter (Force Wrestling) Dec 5-0</li>\n<li>Quarterfinal - Charles Doyle (Notre Dame Wrestling) won by decision over Josh Isaac (Belvidere Bandits) Dec 4-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Noah Murray (Springfield Capital Kids WC) won by fall over Colin Haney (Force Wrestling) Fall 3:54</li>\n<li>Quarterfinal - Jahwon Akui (Gladiators) won by tech fall over Stephen Walz (Blackhawk WC) TF 23-8</li>\n<li>Quarterfinal - Malik Snapp (Joliet Junior Steelmen) won by fall over Brendan Brooks (Sons of Thunder) Fall 2:11</li>\n<li>Quarterfinal - Brian Kent (Bison WC) won by fall over Joshua Anthony (Harlem Cougars) Fall 3:05</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Rasheed Lemon (Gladiators) won by tech fall over Ronnie Webb (Seneca Irish Cadets) TF 15-0</li>\n<li>Quarterfinal - Tim Maroder (Crystal Lake Wizards) won by fall over JD Cox (Sons of Thunder) Fall 2:04</li>\n<li>Quarterfinal - Wes Cathcart (Geneseo Spider WC) won by fall over Ryan Redmon (Cumberland Youth WC) Fall 3:18</li>\n<li>Quarterfinal - Gage Harrah (Crystal Lake Wizards) won by fall over Anthony Ibarra (Gomez Wrestling Academy) Fall 1:21</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Daniel Holman (Fairmont Rough Riders) won by fall over Blake Novack (Bethalto Bulls WC) Fall 1:26</li>\n<li>Quarterfinal - Daniel Massengill (Central Elite Rebels) won by decision over Austin Marsden (Crystal Lake Wizards) Dec 4-3</li>\n<li>Quarterfinal - Vinny Lamontagna (WW Tiger WC) won by major decision over Michael Pulley (Sons of Thunder) Maj 10-1</li>\n<li>Quarterfinal - Jake Randich (Driscoll Junior Highlanders) won by decision over Jared Koch (Golden Eagles) Dec 5-4</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Chris Montez (Peoria Razorbacks Youth WC) won by decision over Richard Kersten (Crystal Lake Wizards) Dec 6-1</li>\n<li>Quarterfinal - Javonta Black (Blackhawk WC) won by decision over Kevin Rowett (Collinsville Raiders) Dec 8-7</li>\n<li>Quarterfinal - Michael Sojka (Harlem Cougars) won by decision over Jack Allen (Hinsdale Red Devils Wc) Dec 5-0</li>\n<li>Quarterfinal - Mitchell Godfrey (Little Celtic WC) won by decision over Daniel Eldridge (Villa Lombard Cougars) Dec 6-5</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Dakota Patton (Bismarck Henning WC) won by decision over Alexander Carney (Geneseo Spider WC) Dec 5-1</li>\n<li>Quarterfinal - John Taylor (Blackhawk WC) won by fall over Zachary Didriksen (Crystal Lake Wizards) Fall 3:39</li>\n<li>Quarterfinal - George Canales (Dixon WC) won by fall over Andrew Crivellone (Bur-Oak Wildcats WC) Fall 0:59</li>\n<li>Quarterfinal - Shaquille McMurtry (Little Celtic WC) won by fall over Ross Ferraro III (Gomez Wrestling Academy) Fall 0:39</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Michael Bernardo (Little Falcons WC) won by fall over James Boyle (Knights WC) Fall 3:41</li>\n<li>Quarterfinal - Alvin Foster III (Harvey Park Dist Twisters) won by fall over Kodie Schilson (West Hancock Titan WC) Fall 0:54</li>\n<li>Quarterfinal - Tanner Crum (Aces WC) won by fall over Mitchell McElroy (Mt. Zion WC) Fall 2:01</li>\n<li>Quarterfinal - Martell Smith (Peoria Razorbacks Youth WC) won by decision over Christopher Lopez (Iron Man) Dec 12-7</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Sean Martin (Sons of Thunder) won by decision over Brian Bobek (Palatine Panthers WC) Dec 9-5</li>\n<li>Quarterfinal - Andy Heredia (Iron Man) won by decision over Travis Blecher (Rock Island WC) Dec 7-6</li>\n<li>Quarterfinal - Kyle Ryan (Force Wrestling) won by fall over Zachary Burton (Charleston WC) Fall 0:47</li>\n<li>Quarterfinal - Deshawn Berry (Tomcat WC) won by decision over Joshua Dust (Grapplin` Devils WC) Dec 6-1</li>\n</ul>\n</section>",
  "1st Wrestleback (32 Man)": "<section class=\"tw-list\">\n<h1>1st Wrestleback (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Kyle Akins (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Grant Sutton (Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean McMahon (Tinley Park Bulldogs) won by major decision over Aaron Halligan (Riverdale Jr Rams WC) Maj 15-3</li>\n<li>Cons. Round 1 - Brian Rossi (Falcon WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Tom Ward (Hinsdale Red Devils Wc) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Svestka (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brad Wood (Orland Park Pioneers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Devin Tortorice (Wolves WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Randall Hornbaker (Tiger WC) won by decision over Jack Diana (Mustang WC) Dec 4-2</li>\n<li>Cons. Round 1 - Martin Martinez (Waukegan Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Graham (Waubonsie WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Quinton Starzyk (Vittum Cats) received a bye   () Bye</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Jordan Northrup (Harlem Cougars) won by fall over Jacob Wever (L-P Crunching Cavs) Fall 0:54</li>\n<li>Cons. Round 1 - Matt Garelli (Bronco Wrestling) won by decision over Ignacio Frias (Lemont Bears WC) Dec 6-0</li>\n<li>Cons. Round 1 - Alphonse Vruno (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chase Vosburgh (Mt. Vernon Lions) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Tony Rossi (Falcon WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Rob Mikenis (Lincoln-way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Robert Bromberek (Lemont Bears WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Josh Arnold (Bur-Oak Wildcats WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Michael O`Connor (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Frank Yattoni (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colin Holler (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Blake Tisza (Crosstown WC) won by decision over Jake McCabe (Wolfpak WC) Dec 4-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Eric Lovill (Mad Dog Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christopher Carton (Alleman Jr Pioneer WC) won by major decision over Alex Valentine (Martinez Fox Valley Elite) Maj 9-0</li>\n<li>Cons. Round 1 - Dan Goress (Knights WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jonathon Evetts (Herrin Junior WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Jameer Thurman (Gladiators) won by decision over Scott Parks (Moline WC) Dec 3-1</li>\n<li>Cons. Round 1 - Aaron Bonnell (Xtreme Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Meeder (Force Wrestling) won by tech fall over Damon Cloe (Marengo Indians Youth Wrestling) TF 21-6</li>\n<li>Cons. Round 1 - Josh Prescher (Waubonsie WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Cameron Singler (Highland Bulldog Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nick Shealy (Barrington Broncos) received a bye   () Bye</li>\n<li>Cons. Round 1 - Steven Franke (WW Tiger WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Residori (Minooka Little Indians) received a bye   () Bye</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Maxwell Brozovich (Minooka Little Indians) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drake Holland (Herrin Junior WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - R.J. Troye (Sauk Valley WC) won by fall over Jake Turk (Central WC) Fall 0:57</li>\n<li>Cons. Round 1 - Eric Tiller (Carlinville Kids WC) won by decision over Sam Klenske (Marengo Shooters WC) Dec 4-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Brett O`Kane (Richmond WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zack Hagemann (Polo WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Sears (Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aaron Brewton II (Waukegan Youth WC) won by fall over Joey Kauffman (Prairie Central-Chenoa Hawks) Fall 0:41</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Matthew Zabrin (Bison WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Wardell Rosemon Jr. (Dundee Highlanders) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Spinell (Fox Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Williams (Crosstown WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Josh Pruitt (Oak Forest Warriors) won by fall over Matt Chlebek (Glenbard East Jr Rams) Fall 0:33</li>\n<li>Cons. Round 1 - Alexander Sullivan (Maine Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyson Ashbaugh (Seneca Irish Cadets) received a bye   () Bye</li>\n<li>Cons. Round 1 - Travis Crnich-Amenell (Oak Forest Warriors) received a bye   () Bye</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>Cons. Round 1 - Riley Mugerditchian (Hoffman Estates WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Emilio Gonzalez (Dixon WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Griffin McQuality (Mt. Zion WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cole Whitford (GC Jr Warriors) won by fall over Tyler Chu (Junior Vikings) Fall 2:11</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>Cons. Round 1 - Joshua Wallick (Fisher WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cal Breedlove (Geneseo Spider WC) won by fall over Dakota Pratt (West Frankfort Jr Wrestling) Fall 0:09</li>\n<li>Cons. Round 1 - Darnell Toney (Gladiators) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Ziegler (Timberwolves WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Peter Brancaleon (Naperville Huskie WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trae Ford (Westville Youth WC) won by fall over Kerwin May (Fightin Titan WC) Fall 2:59</li>\n<li>Cons. Round 1 - Alexander Lopez (Bethalto Bulls WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Fritz (SCN Youth WC) won by fall over Christopher Bartels (Dundee Highlanders) Fall 0:33</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Cons. Round 1 - Andrew Campbell (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Antony Felix-Reyes (Chicago Wolves Den) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jim Panozzo (Orland Park Pioneers) won by fall over Dillon Cameron (Streator Bulldog WC) Fall 3:23</li>\n<li>Cons. Round 1 - Ryan Conlin (Oak Forest Warriors) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Evan Christianson (Batavia Pinners) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean Parvin (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Erin Golston (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - John Gosinski (Villa Lombard Cougars) won by decision over Connor Lewis (Golden Eagles) Dec 4-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Steve Licina (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Simmons (Little Falcons WC) won by decision over Tayler Young (Aces WC) Dec 6-1</li>\n<li>Cons. Round 1 - Jon Williamson (Naperville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kevin Golden (Vittum Cats) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Ryan Martini (Orland Park Pioneers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Davis (Plainfield WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Mason (Lemont Bears WC) won by fall over Christian Pratt (Southern Illinois United Thundercats) Fall 2:22</li>\n<li>Cons. Round 1 - Patrick Sullivan (Crystal Lake Wizards) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Kevin Moylan (Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Maxx Hubbard (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Frank McKeown (Naperville Huskie WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Skyler Procasky (GC Jr Warriors) won by decision over Benjamin Schwartz (Wolfpak WC) Dec 9-8</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Frank Abitua (Golden Eagles) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Jankowski (Junior Gators WC) won by major decision over Gerald Lanning (Pontiac Pythons) Maj 10-2</li>\n<li>Cons. Round 1 - Jose Jimenez (Bronco Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Murphy (Vittum Cats) received a bye   () Bye</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Ryan Fitzpatrick (Vittum Cats) won by fall over Shane Bormann (Geneseo Spider WC) Fall 1:36</li>\n<li>Cons. Round 1 - Blaise Butler (Fightin Titan WC) won by major decision over Wade Hazard (Villa Lombard Cougars) Maj 9-1</li>\n<li>Cons. Round 1 - Kyle Culton (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean Raddatz (Oak Forest Warriors) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - David Price (Rock Island WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Derek Nagel (Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nolberto Deavila (Collinsville Raiders) won by decision over Scott Crosby (Falcon WC) Dec 8-2</li>\n<li>Cons. Round 1 - Ryan Soraghan (Orland Park Pioneers) received a bye   () Bye</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Dakota Wapotish (Barrington Broncos) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Carlson (Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Levi Ulmer (Vandalia Jr Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nick Armstrong (Sons of Thunder) received a bye   () Bye</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Drew Bates (Lions WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mason McBride (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christopher Wright (Harvey Park Dist Twisters) won by fall over Clay Wilson (Cumberland Youth WC) Fall 0:21</li>\n<li>Cons. Round 1 - Sheldon Magee (Plainfield WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Luke Pigott (Fox Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Henry Lecrone (Unity Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kalvin Whitener-Hill (Minooka Little Indians) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zach Paterson (Xtreme Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Max Andersen (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeff Koepke (Arlington Cardinals) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cody Churkey (Golden Eagles) won by decision over Michael Aldrich Jr (Peoria Razorbacks Youth WC) Dec 8-7</li>\n<li>Cons. Round 1 - Luke Polka (Lions WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Virgil Houston (Black Kats WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trey Griffin (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Julius Johnson (Gladiators) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Farney (Prairie Central-Chenoa Hawks) received a bye   () Bye</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Giuseppe Lamanna (Mad Dog Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Cull (Crosstown WC) won by major decision over Jason Dalessandro (Shamrock WC) Maj 17-3</li>\n<li>Cons. Round 1 - Brian Gibbs (Harvey Park Dist Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Carlos Gentil (Plainfield WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Tyler Knudsen (Villa Lombard Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Justin Wallace (Palatine Panthers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hans Schaeffer (Moline WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cody Weaver (Little Celtic WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Seth Springsteen (Junior Vikings) received a bye   () Bye</li>\n<li>Cons. Round 1 - Francesco Lombardo (Iron Man) won by fall over Connor Cook (Rochester WC) Fall 2:57</li>\n<li>Cons. Round 1 - Joshua Naber (Golden Eagles) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mitchell Keppy (Riverdale Jr Rams WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Carlos Martinez (Shamrock WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Daniel Muehlfelt (Palatine Panthers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Glen Buckwinkler (Marengo Indians Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trent Grossman (Little Falcons WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Antwyone Brown Jr. (Crosstown WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Bastilla (Belleville Little Devils) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Mares (Little Celtic WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Conor McHale (Orland Park Pioneers) won by major decision over Chris Gennaro (Harlem Cougars) Maj 9-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Gerrardo Cisneros (Little Celtic WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Larry Bryant (Harlem Cougars) won by fall over Michael Gavel (Unity Youth WC) Fall 1:10</li>\n<li>Cons. Round 1 - Ethan Buford (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Lowe (Grapplin` Devils WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "2nd Wrestleback (32 Man)": "<section class=\"tw-list\">\n<h1>2nd Wrestleback (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Kyle Akins (Sycamore WC) won by decision over Michael Cullen (Wrestling Factory) Dec 4-0</li>\n<li>Cons. Round 2 - Dillion Chase (Sons of Thunder) won by major decision over Grant Sutton (Wrestling Factory) Maj 12-1</li>\n<li>Cons. Round 2 - Jeffery Morrow (Crystal Lake Wizards) won by major decision over Sean McMahon (Tinley Park Bulldogs) Maj 11-1</li>\n<li>Cons. Round 2 - Tommy Pawelski (Bronco Wrestling) won by decision over Brian Rossi (Falcon WC) Dec 5-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Tom Ward (Hinsdale Red Devils Wc) won by decision over Jason Moerlien (GC Jr Warriors) Dec 9-7</li>\n<li>Cons. Round 2 - Rudolph Johnson (Harvey Park Dist Twisters) won by major decision over Tyler Svestka (Martinez Fox Valley Elite) Maj 17-5</li>\n<li>Cons. Round 2 - Brad Wood (Orland Park Pioneers) won by decision over Jake Snow (Sauk Valley WC) Dec 5-2</li>\n<li>Cons. Round 2 - Reuben Reyes (Force Wrestling) won by fall over Devin Tortorice (Wolves WC) Fall 0:57</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Joey Nelson (Little Celtic WC) won by fall over Randall Hornbaker (Tiger WC) Fall 3:54</li>\n<li>Cons. Round 2 - Briar King (GC Jr Warriors) won by major decision over Martin Martinez (Waukegan Youth WC) Maj 14-4</li>\n<li>Cons. Round 2 - Zachary Synon (Cary Jr Trojan Matmen) won by decision over Austin Graham (Waubonsie WC) Dec 9-2</li>\n<li>Cons. Round 2 - Eric Demattia (Pontiac Pythons) won by decision over Quinton Starzyk (Vittum Cats) Dec 4-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Jordan Northrup (Harlem Cougars) won by decision over Clayton Shelton (Force Wrestling) Dec 6-0</li>\n<li>Cons. Round 2 - Matt Garelli (Bronco Wrestling) won by decision over Nathan Newman (Midwest Central Youth) Dec 6-0</li>\n<li>Cons. Round 2 - Alphonse Vruno (Martinez Fox Valley Elite) won by decision over Jordan Lind (Pontiac Pythons) Dec 2-0</li>\n<li>Cons. Round 2 - Mitchell Mallary (Erie Middle School WC) won by major decision over Chase Vosburgh (Mt. Vernon Lions) Maj 9-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Tony Rossi (Falcon WC) won by decision over Steven Galiardo (Shamrock WC) Dec 4-3</li>\n<li>Cons. Round 2 - Sal Annoreno (Gomez Wrestling Academy) won by decision over Rob Mikenis (Lincoln-way WC) Dec 7-2</li>\n<li>Cons. Round 2 - Johnny Pellegrino (Orland Park Pioneers) won by major decision over Robert Bromberek (Lemont Bears WC) Maj 10-2</li>\n<li>Cons. Round 2 - Connor Bass (Yorkville Wrestling Club) won by decision over Josh Arnold (Bur-Oak Wildcats WC) Dec 2-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Michael O`Connor (Gomez Wrestling Academy) won by decision over Mitchell Dearing (Central Elite Rebels) Dec 2-0</li>\n<li>Cons. Round 2 - Austin Culton (Sycamore WC) won by injury default over Frank Yattoni (Martinez Fox Valley Elite) Inj. 0:00</li>\n<li>Cons. Round 2 - Colin Holler (Tinley Park Bulldogs) won by major decision over Peter Andreotti (Orland Park Pioneers) Maj 10-1</li>\n<li>Cons. Round 2 - Blake Tisza (Crosstown WC) won by decision over Brandon Lizer (Dakota WC) Dec 4-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Angelo Silvestro (SCN Youth WC) won by fall over Eric Lovill (Mad Dog Wrestling Academy) Fall 3:17</li>\n<li>Cons. Round 2 - Lonne Cleveland III (GC Jr Warriors) won by decision over Christopher Carton (Alleman Jr Pioneer WC) Dec 8-5</li>\n<li>Cons. Round 2 - Jacob Deklerk (Minooka Little Indians) won by major decision over Dan Goress (Knights WC) Maj 12-1</li>\n<li>Cons. Round 2 - Danny Brewster (Maine Eagles WC) won by fall over Jonathon Evetts (Herrin Junior WC) Fall 3:20</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Jameer Thurman (Gladiators) won by fall over Ryder Belzer (Zee Bee Stingers) Fall 3:39</li>\n<li>Cons. Round 2 - Tyler Nagel (Vittum Cats) won by fall over Aaron Bonnell (Xtreme Wrestling) Fall 0:46</li>\n<li>Cons. Round 2 - Colton Gladwell (Central Elite Rebels) won by decision over Jacob Meeder (Force Wrestling) Dec 9-3</li>\n<li>Cons. Round 2 - Micheal Cudemo (Murphysboro Wrestling) won by fall over Josh Prescher (Waubonsie WC) Fall 1:32</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Brett Meyer (Central Elite Rebels) won by decision over Cameron Singler (Highland Bulldog Jr WC) Dec 11-4</li>\n<li>Cons. Round 2 - Nick Georgean (Erie Middle School WC) won by fall over Nick Shealy (Barrington Broncos) Fall 3:09</li>\n<li>Cons. Round 2 - Steven Franke (WW Tiger WC) won by fall over Taje Frazier (Renegade WC (NFP)) Fall 3:50</li>\n<li>Cons. Round 2 - Nathan Zinzer (Blackhawk WC) won by decision over Jacob Residori (Minooka Little Indians) Dec 5-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Tony Cashmore (Richmond WC) won by fall over Maxwell Brozovich (Minooka Little Indians) Fall 3:10</li>\n<li>Cons. Round 2 - Cameron Mammen (Tiger WC) won by major decision over Drake Holland (Herrin Junior WC) Maj 12-0</li>\n<li>Cons. Round 2 - R.J. Troye (Sauk Valley WC) won by fall over Kyle Ledbetter (Force Wrestling) Fall 3:06</li>\n<li>Cons. Round 2 - Eric Tiller (Carlinville Kids WC) won by fall over Max Ellis (Zee Bee Stingers) Fall 1:23</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Alexander Torres (Brawlers WC) won by decision over Brett O`Kane (Richmond WC) Dec 9-8</li>\n<li>Cons. Round 2 - Matthew Schneider (Lincoln-way WC) won by fall over Zack Hagemann (Polo WC) Fall 3:25</li>\n<li>Cons. Round 2 - Blake Stricklin (Mt. Vernon Lions) won by major decision over Jack Sears (Vittum Cats) Maj 17-4</li>\n<li>Cons. Round 2 - Aaron Brewton II (Waukegan Youth WC) won by tech fall over Logan Staver (Panther Cub WC) TF 15-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Matthew Zabrin (Bison WC) won by decision over Hunter Barry (Little Redskins WC) Dec 4-3</li>\n<li>Cons. Round 2 - Wardell Rosemon Jr. (Dundee Highlanders) won by fall over Nick Rude (Sauk Valley WC) Fall 1:40</li>\n<li>Cons. Round 2 - Brian Bahrs (Sauk Valley WC) won by major decision over Jake Spinell (Fox Valley WC) Maj 12-0</li>\n<li>Cons. Round 2 - Eric Krieger (Fox Valley WC) won by decision over Nicholas Williams (Crosstown WC) Dec 8-1</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Cody Rozek (Dixon WC) won by decision over Josh Pruitt (Oak Forest Warriors) Dec 4-2</li>\n<li>Cons. Round 2 - Alexander Sullivan (Maine Eagles WC) won by fall over Rhett Evans (Vandalia Jr Wrestling) Fall 1:28</li>\n<li>Cons. Round 2 - Tyson Ashbaugh (Seneca Irish Cadets) won in overtime over Brian Allen (Hinsdale Red Devils Wc) OT 8-6</li>\n<li>Cons. Round 2 - Brenden Pindel (Orland Park Pioneers) won by fall over Travis Crnich-Amenell (Oak Forest Warriors) Fall 2:07</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>Cons. Round 2 - Scott Riggins (Highland Bulldog Jr WC) won by fall over Riley Mugerditchian (Hoffman Estates WC) Fall 2:15</li>\n<li>Cons. Round 2 - Nicholas Mokodanski (Kane County Grapplers) won by decision over Emilio Gonzalez (Dixon WC) Dec 7-3</li>\n<li>Cons. Round 2 - Mario Carretto (L-P Crunching Cavs) won by fall over Griffin McQuality (Mt. Zion WC) Fall 1:46</li>\n<li>Cons. Round 2 - Jimmy Prince (Lakeland Predators) won by fall over Cole Whitford (GC Jr Warriors) Fall 3:49</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>Cons. Round 2 - Channing Dolliger (Brawlers WC) won by fall over Joshua Wallick (Fisher WC) Fall 1:49</li>\n<li>Cons. Round 2 - Cal Breedlove (Geneseo Spider WC) won by fall over Daniel Goree (Gladiators) Fall 3:39</li>\n<li>Cons. Round 2 - Coltyn Pease (Saukee Youth WC) won by fall over Darnell Toney (Gladiators) Fall 3:54</li>\n<li>Cons. Round 2 - Zachary Ziegler (Timberwolves WC) won by fall over Daniel Davidson (Barrington Broncos) Fall 1:26</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Dustin Rosborough (Highland Bulldog Jr WC) won by major decision over Peter Brancaleon (Naperville Huskie WC) Maj 8-0</li>\n<li>Cons. Round 2 - Adam Szott (Waubonsie WC) won by fall over Trae Ford (Westville Youth WC) Fall 2:02</li>\n<li>Cons. Round 2 - Alexander Lopez (Bethalto Bulls WC) won by decision over Michael Behrends (Warrensburg WC) Dec 16-12</li>\n<li>Cons. Round 2 - Jesse Cantu (Gomez Wrestling Academy) won by fall over Alex Fritz (SCN Youth WC) Fall 2:02</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Cons. Round 2 - Matthew Sommers (Arlington Cardinals) won by major decision over Andrew Campbell (Edwardsville WC) Maj 9-0</li>\n<li>Cons. Round 2 - Brian Cullen (Wrestling Factory) won by forfeit over Antony Felix-Reyes (Chicago Wolves Den) FF</li>\n<li>Cons. Round 2 - Matthew Rader (Hononegah Kids WC) won by major decision over Jim Panozzo (Orland Park Pioneers) Maj 13-0</li>\n<li>Cons. Round 2 - Ryan Conlin (Oak Forest Warriors) won by decision over Aaron Kohlberg (Arlington Cardinals) Dec 7-0</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - David Pearce (Bethalto Bulls WC) won by fall over Evan Christianson (Batavia Pinners) Fall 1:21</li>\n<li>Cons. Round 2 - Sean Parvin (Sauk Valley WC) won by decision over Chris Maier (Crystal Lake Wizards) Dec 9-3</li>\n<li>Cons. Round 2 - Erin Golston (Martinez Fox Valley Elite) won by decision over Adam Wyeth (Yorkville Wrestling Club) Dec 3-1</li>\n<li>Cons. Round 2 - John Gosinski (Villa Lombard Cougars) won by tech fall over Zachary Martin (Central Elite Rebels) TF 16-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Nick Fishback (Vittum Cats) won by major decision over Steve Licina (Brawlers WC) Maj 9-0</li>\n<li>Cons. Round 2 - Tyler Simmons (Little Falcons WC) won by decision over Adam Hay (Moline WC) Dec 6-4</li>\n<li>Cons. Round 2 - Cullen Smith (Crystal Lake Wizards) won by decision over Jon Williamson (Naperville WC) Dec 7-2</li>\n<li>Cons. Round 2 - Kevin Golden (Vittum Cats) won by fall over Chris Denning (Sauk Valley WC) Fall 3:56</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Anthony Ferraris Jr (Maine Eagles WC) won by major decision over Ryan Martini (Orland Park Pioneers) Maj 13-2</li>\n<li>Cons. Round 2 - Michael Mizaur (Vittum Cats) won by fall over Nathan Davis (Plainfield WC) Fall 2:27</li>\n<li>Cons. Round 2 - Leo Ruettiger (Minooka Little Indians) won by decision over Andrew Mason (Lemont Bears WC) Dec 4-0</li>\n<li>Cons. Round 2 - Kyle Graumenz (Triad Little Knights) won by major decision over Patrick Sullivan (Crystal Lake Wizards) Maj 13-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Kevin Moylan (Vittum Cats) won by decision over Chris Kerwin (Sycamore WC) Dec 1-0</li>\n<li>Cons. Round 2 - Troy Valdez (Bronco Wrestling) won by tech fall over Maxx Hubbard (Sauk Valley WC) TF 18-3</li>\n<li>Cons. Round 2 - Steven Bradtmueller (Force Wrestling) won by major decision over Frank McKeown (Naperville Huskie WC) Maj 11-2</li>\n<li>Cons. Round 2 - Mike Soris (Yorkville Wrestling Club) won by decision over Skyler Procasky (GC Jr Warriors) Dec 9-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Frank Abitua (Golden Eagles) won by decision over Shane Hafner (Mad Dog Wrestling Academy) Dec 3-1</li>\n<li>Cons. Round 2 - Eamon Przekwas (Oak Forest Warriors) won by fall over Nicholas Jankowski (Junior Gators WC) Fall 2:44</li>\n<li>Cons. Round 2 - Jose Jimenez (Bronco Wrestling) won by decision over Joe Ladick (Golden Eagles) Dec 5-2</li>\n<li>Cons. Round 2 - Michael Murphy (Vittum Cats) won by decision over Tyler Schilson (West Hancock Titan WC) Dec 4-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Ryan Fitzpatrick (Vittum Cats) won by decision over Wesley Patton (Oakwood WC) Dec 11-6</li>\n<li>Cons. Round 2 - Michael Togher (Little Celtic WC) won by decision over Blaise Butler (Fightin Titan WC) Dec 3-1</li>\n<li>Cons. Round 2 - Kyle Culton (Sycamore WC) won by fall over Daniel Aguado (Martinez Fox Valley Elite) Fall 3:57</li>\n<li>Cons. Round 2 - Sean Raddatz (Oak Forest Warriors) won by injury default over Steven Lalowski (Sycamore WC) Inj. 0:00</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Jameel Carter (Chicago Crusaders) won by decision over David Price (Rock Island WC) Dec 4-2</li>\n<li>Cons. Round 2 - Derek Nagel (Vittum Cats) won by decision over Brandon Rice (Central Elite Rebels) Dec 7-1</li>\n<li>Cons. Round 2 - Nolberto Deavila (Collinsville Raiders) won by decision over Zack Patnou (Harlem Renegades) Dec 9-2</li>\n<li>Cons. Round 2 - Jameson Oster (Lemont Bears WC) won by decision over Ryan Soraghan (Orland Park Pioneers) Dec 4-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Dakota Wapotish (Barrington Broncos) won by forfeit over Robert Guillen (West Chicago Junior Wildcats) FF</li>\n<li>Cons. Round 2 - Spartak Chino (WW Tiger WC) won by fall over Austin Carlson (Wrestling Factory) Fall 1:24</li>\n<li>Cons. Round 2 - Jordan Thompson (Martinez Fox Valley Elite) won by major decision over Levi Ulmer (Vandalia Jr Wrestling) Maj 12-2</li>\n<li>Cons. Round 2 - Eddie Scanlon (Bison WC) won by decision over Nick Armstrong (Sons of Thunder) Dec 7-4</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Drew Bates (Lions WC) won by decision over Elliott McClure (Falcon Youth WC) Dec 5-0</li>\n<li>Cons. Round 2 - Donald Miller (Proviso PowerHouse WC) won by fall over Mason McBride (Edwardsville WC) Fall 0:42</li>\n<li>Cons. Round 2 - Christopher Wright (Harvey Park Dist Twisters) won by decision over Steven Bradley (Xtreme Wrestling) Dec 5-2</li>\n<li>Cons. Round 2 - Joey Kubica (Gomez Wrestling Academy) won by major decision over Sheldon Magee (Plainfield WC) Maj 11-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Travis Tomac (Force Wrestling) won by decision over Luke Pigott (Fox Valley WC) Dec 9-3</li>\n<li>Cons. Round 2 - Kean Loupee (Crystal Lake Wizards) won by fall over Henry Lecrone (Unity Youth WC) Fall 2:13</li>\n<li>Cons. Round 2 - Kalvin Whitener-Hill (Minooka Little Indians) won by decision over Eric Hulihan (Fenwick Falcons WC) Dec 7-6</li>\n<li>Cons. Round 2 - Zach Paterson (Xtreme Wrestling) won by decision over Andrew Elliot (Little Celtic WC) Dec 11-8</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Brian Strenk (Oak Forest Warriors) won by major decision over Max Andersen (Edwardsville WC) Maj 14-5</li>\n<li>Cons. Round 2 - Jeff Koepke (Arlington Cardinals) won by fall over Larry Sanders (Herrin Junior WC) Fall 2:18</li>\n<li>Cons. Round 2 - Tyler Ledbetter (Force Wrestling) won by decision over Cody Churkey (Golden Eagles) Dec 10-5</li>\n<li>Cons. Round 2 - Luke Polka (Lions WC) won by fall over Josh Isaac (Belvidere Bandits) Fall 1:25</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Colin Haney (Force Wrestling) won by decision over Virgil Houston (Black Kats WC) Dec 7-6</li>\n<li>Cons. Round 2 - Trey Griffin (Crystal Lake Wizards) won by major decision over Stephen Walz (Blackhawk WC) Maj 11-0</li>\n<li>Cons. Round 2 - Brendan Brooks (Sons of Thunder) won by fall over Julius Johnson (Gladiators) Fall 0:35</li>\n<li>Cons. Round 2 - Joshua Anthony (Harlem Cougars) won by major decision over Tyler Farney (Prairie Central-Chenoa Hawks) Maj 11-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Giuseppe Lamanna (Mad Dog Wrestling Academy) won by major decision over Ronnie Webb (Seneca Irish Cadets) Maj 10-1</li>\n<li>Cons. Round 2 - JD Cox (Sons of Thunder) won by fall over Joshua Cull (Crosstown WC) Fall 2:05</li>\n<li>Cons. Round 2 - Ryan Redmon (Cumberland Youth WC) won by fall over Brian Gibbs (Harvey Park Dist Twisters) Fall 3:14</li>\n<li>Cons. Round 2 - Anthony Ibarra (Gomez Wrestling Academy) won by major decision over Carlos Gentil (Plainfield WC) Maj 16-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Knudsen (Villa Lombard Cougars) won by fall over Blake Novack (Bethalto Bulls WC) Fall 4:15</li>\n<li>Cons. Round 2 - Austin Marsden (Crystal Lake Wizards) won by major decision over Justin Wallace (Palatine Panthers WC) Maj 12-2</li>\n<li>Cons. Round 2 - Hans Schaeffer (Moline WC) won by decision over Michael Pulley (Sons of Thunder) Dec 6-4</li>\n<li>Cons. Round 2 - Jared Koch (Golden Eagles) won by decision over Cody Weaver (Little Celtic WC) Dec 7-5</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Richard Kersten (Crystal Lake Wizards) won by decision over Seth Springsteen (Junior Vikings) Dec 8-3</li>\n<li>Cons. Round 2 - Kevin Rowett (Collinsville Raiders) won by fall over Francesco Lombardo (Iron Man) Fall 0:55</li>\n<li>Cons. Round 2 - Jack Allen (Hinsdale Red Devils Wc) won by fall over Joshua Naber (Golden Eagles) Fall 0:39</li>\n<li>Cons. Round 2 - Daniel Eldridge (Villa Lombard Cougars) won by fall over Mitchell Keppy (Riverdale Jr Rams WC) Fall 3:48</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Carlos Martinez (Shamrock WC) won by fall over Alexander Carney (Geneseo Spider WC) Fall 3:09</li>\n<li>Cons. Round 2 - Zachary Didriksen (Crystal Lake Wizards) won by decision over Daniel Muehlfelt (Palatine Panthers WC) Dec 7-3</li>\n<li>Cons. Round 2 - Andrew Crivellone (Bur-Oak Wildcats WC) won by fall over Glen Buckwinkler (Marengo Indians Youth Wrestling) Fall 3:39</li>\n<li>Cons. Round 2 - Ross Ferraro III (Gomez Wrestling Academy) won by decision over Trent Grossman (Little Falcons WC) Dec 7-2</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - James Boyle (Knights WC) won by fall over Antwyone Brown Jr. (Crosstown WC) Fall 3:22</li>\n<li>Cons. Round 2 - Kodie Schilson (West Hancock Titan WC) won by fall over Kyle Bastilla (Belleville Little Devils) Fall 1:42</li>\n<li>Cons. Round 2 - Mitchell McElroy (Mt. Zion WC) won by fall over Alex Mares (Little Celtic WC) Fall 3:27</li>\n<li>Cons. Round 2 - Christopher Lopez (Iron Man) won by fall over Conor McHale (Orland Park Pioneers) Fall 0:47</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Gerrardo Cisneros (Little Celtic WC) won by fall over Brian Bobek (Palatine Panthers WC) Fall 2:19</li>\n<li>Cons. Round 2 - Larry Bryant (Harlem Cougars) won by fall over Travis Blecher (Rock Island WC) Fall 2:01</li>\n<li>Cons. Round 2 - Zachary Burton (Charleston WC) won by fall over Ethan Buford (Edwardsville WC) Fall 2:05</li>\n<li>Cons. Round 2 - Joshua Dust (Grapplin` Devils WC) won by fall over Zachary Lowe (Grapplin` Devils WC) Fall 25:00</li>\n</ul>\n</section>",
  "Semis & WB (32 Man)": "<section class=\"tw-list\">\n<h1>Semis &amp; WB (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Jabari Moody (Harvey Park Dist Twisters) won by major decision over Mark Duda (Crosstown WC) Maj 13-4</li>\n<li>Semifinal - Jon Marmolejo (Gomez Wrestling Academy) won by major decision over Dylan Cramer (Force Wrestling) Maj 10-0</li>\n<li>Cons. Round 3 - Dillion Chase (Sons of Thunder) won by decision over Kyle Akins (Sycamore WC) Dec 7-2</li>\n<li>Cons. Round 3 - Tommy Pawelski (Bronco Wrestling) won by decision over Jeffery Morrow (Crystal Lake Wizards) Dec 12-5</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Josh Alber (Dakota WC) won by decision over Jimmy Pellegrino (Orland Park Pioneers) Dec 5-0</li>\n<li>Semifinal - Cameron Kennedy (Wrestling Factory) won by major decision over George Fisher (SCN Youth WC) Maj 14-3</li>\n<li>Cons. Round 3 - Tom Ward (Hinsdale Red Devils Wc) won by decision over Rudolph Johnson (Harvey Park Dist Twisters) Dec 2-1</li>\n<li>Cons. Round 3 - Brad Wood (Orland Park Pioneers) won by decision over Reuben Reyes (Force Wrestling) Dec 2-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Anthony Devriese (Moline WC) won by decision over Kyle Fugiel (Crystal Lake Wizards) Dec 7-0</li>\n<li>Semifinal - Demechico Spraggins (GC Jr Warriors) won by decision over Sean Lynch (Wrestling Factory) Dec 10-6</li>\n<li>Cons. Round 3 - Briar King (GC Jr Warriors) won by fall over Joey Nelson (Little Celtic WC) Fall 0:59</li>\n<li>Cons. Round 3 - Zachary Synon (Cary Jr Trojan Matmen) won by fall over Eric Demattia (Pontiac Pythons) Fall 2:06</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Kegan Wakefield (Wrestling Factory) won by decision over Jordan Scalice (Gomez Wrestling Academy) Dec 6-0</li>\n<li>Semifinal - Notay Jackson (Harvey Park Dist Twisters) won by decision over Garrett Sutton (Wrestling Factory) Dec 5-3</li>\n<li>Cons. Round 3 - Jordan Northrup (Harlem Cougars) won by decision over Matt Garelli (Bronco Wrestling) Dec 2-0</li>\n<li>Cons. Round 3 - Alphonse Vruno (Martinez Fox Valley Elite) won by major decision over Mitchell Mallary (Erie Middle School WC) Maj 10-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Bryce Brill (Fox Valley WC) won by major decision over Brendan Tyler Hall (Harvey Park Dist Twisters) Maj 10-0</li>\n<li>Semifinal - Brian Murphy (Villa Lombard Cougars) won by fall over Erik Nord (Belvidere Bandits) Fall 3:22</li>\n<li>Cons. Round 3 - Sal Annoreno (Gomez Wrestling Academy) won by fall over Tony Rossi (Falcon WC) Fall 2:01</li>\n<li>Cons. Round 3 - Johnny Pellegrino (Orland Park Pioneers) won by decision over Connor Bass (Yorkville Wrestling Club) Dec 8-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Nuntreae Jackson (Harvey Park Dist Twisters) won by decision over Kyle Langenderfer (Orland Park Pioneers) Dec 7-5</li>\n<li>Semifinal - Ernest Battaglia (Fox Valley WC) won by decision over Devin Mahnke (Harvey Park Dist Twisters) Dec 4-3</li>\n<li>Cons. Round 3 - Michael O`Connor (Gomez Wrestling Academy) won by decision over Austin Culton (Sycamore WC) Dec 5-3</li>\n<li>Cons. Round 3 - Colin Holler (Tinley Park Bulldogs) won by major decision over Blake Tisza (Crosstown WC) Maj 8-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - JJ Whaley (Xtreme Wrestling) won by decision over Corbett Oughton (Minooka Little Indians) Dec 6-4</li>\n<li>Semifinal - Richard Robertson (Vittum Cats) won by decision over Michael Sepke (Bronco Wrestling) Dec 3-2</li>\n<li>Cons. Round 3 - Lonne Cleveland III (GC Jr Warriors) won by decision over Angelo Silvestro (SCN Youth WC) Dec 5-4</li>\n<li>Cons. Round 3 - Jacob Deklerk (Minooka Little Indians) won in double overtime over Danny Brewster (Maine Eagles WC) 2-OT 9-7</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Nick Ruffino (SCN Youth WC) won by major decision over Jason Locker (Pontiac Pythons) Maj 15-6</li>\n<li>Semifinal - Timothy Corse (Tinley Park Bulldogs) won by decision over Zach Lehman (Dixon WC) Dec 5-1</li>\n<li>Cons. Round 3 - Tyler Nagel (Vittum Cats) won by decision over Jameer Thurman (Gladiators) Dec 6-0</li>\n<li>Cons. Round 3 - Colton Gladwell (Central Elite Rebels) won by decision over Micheal Cudemo (Murphysboro Wrestling) Dec 5-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Steve Congenie (Hinsdale Red Devils Wc) won by major decision over Adrian Palacios (Joliet Junior Steelmen) Maj 13-2</li>\n<li>Semifinal - Zane Richards (Carbondale WC) won by major decision over Brandon Sklavanitis (Xtreme Wrestling) Maj 9-1</li>\n<li>Cons. Round 3 - Nick Georgean (Erie Middle School WC) won by fall over Brett Meyer (Central Elite Rebels) Fall 3:51</li>\n<li>Cons. Round 3 - Nathan Zinzer (Blackhawk WC) won by fall over Steven Franke (WW Tiger WC) Fall 3:44</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Jared Jayne (Bronco Wrestling) won by decision over Jordan Ellingwood (Vittum Cats) Dec 2-1</li>\n<li>Semifinal - Tyrone Sally Jr. (Harvey Park Dist Twisters) won by fall over Zach Hicks (Hoopeston Area WC) Fall 1:29</li>\n<li>Cons. Round 3 - Cameron Mammen (Tiger WC) won by major decision over Tony Cashmore (Richmond WC) Maj 10-1</li>\n<li>Cons. Round 3 - R.J. Troye (Sauk Valley WC) won by fall over Eric Tiller (Carlinville Kids WC) Fall 3:21</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Sam Brooks (Little Huskie WC) won by fall over Robbie Irvin (Hoopeston Area WC) Fall 3:31</li>\n<li>Semifinal - Shaunqae McMurtry (Little Celtic WC) won by decision over Ivan Castro (Fenwick Falcons WC) Dec 4-3</li>\n<li>Cons. Round 3 - Matthew Schneider (Lincoln-way WC) won by major decision over Alexander Torres (Brawlers WC) Maj 12-1</li>\n<li>Cons. Round 3 - Blake Stricklin (Mt. Vernon Lions) won by major decision over Aaron Brewton II (Waukegan Youth WC) Maj 13-3</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Alex Eagle-Martinez (Romeoville WC) won by decision over AJ Vargas (Tinley Park Bulldogs) Dec 5-0</li>\n<li>Semifinal - Andy Bensyl (SJO Spartan Youth WC) won by decision over Mitchell Jordan (Sycamore WC) Dec 5-2</li>\n<li>Cons. Round 3 - Wardell Rosemon Jr. (Dundee Highlanders) won by decision over Matthew Zabrin (Bison WC) Dec 4-3</li>\n<li>Cons. Round 3 - Brian Bahrs (Sauk Valley WC) won by decision over Eric Krieger (Fox Valley WC) Dec 3-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Jack Dechow (Richmond WC) won in overtime over Nathaniel Volk (Champaign Kids Wrestling) OT 5-2</li>\n<li>Semifinal - Austin Smith (Fightin Titan WC) won by tech fall over Lucas Cartwright (Waukegan Youth WC) TF 19-2</li>\n<li>Cons. Round 3 - Cody Rozek (Dixon WC) won by fall over Alexander Sullivan (Maine Eagles WC) Fall 2:17</li>\n<li>Cons. Round 3 - Brenden Pindel (Orland Park Pioneers) won by major decision over Tyson Ashbaugh (Seneca Irish Cadets) Maj 11-3</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>Semifinal - Mason Wright (Central Elite Rebels) won by decision over Mark Hendricks (Marengo Indians Youth Wrestling) Dec 8-4</li>\n<li>Semifinal - Brad Johnson (Lemont Bears WC) won by fall over James Lowery (Bronco Wrestling) Fall 2:28</li>\n<li>Cons. Round 3 - Nicholas Mokodanski (Kane County Grapplers) won by decision over Scott Riggins (Highland Bulldog Jr WC) Dec 5-1</li>\n<li>Cons. Round 3 - Mario Carretto (L-P Crunching Cavs) won by decision over Jimmy Prince (Lakeland Predators) Dec 10-5</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>Semifinal - Aaron Ford (Warrensburg WC) won by major decision over Jordan Pena (Dundee Highlanders) Maj 12-1</li>\n<li>Semifinal - Kenny Lindsey (SJO Spartan Youth WC) won by decision over Nick Kelly (Little Celtic WC) Dec 3-1</li>\n<li>Cons. Round 3 - Cal Breedlove (Geneseo Spider WC) won by fall over Channing Dolliger (Brawlers WC) Fall 1:43</li>\n<li>Cons. Round 3 - Coltyn Pease (Saukee Youth WC) won by fall over Zachary Ziegler (Timberwolves WC) Fall 3:13</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Jake Cochrane (Lakeland Predators) won by fall over David Denne (Calumet Memorial P.D. Wolverines) Fall 2:15</li>\n<li>Semifinal - Hector Trevino (Fenwick Falcons WC) won by fall over Delasse Lanier (Romeoville WC) Fall 2:26</li>\n<li>Cons. Round 3 - Dustin Rosborough (Highland Bulldog Jr WC) won by decision over Adam Szott (Waubonsie WC) Dec 2-1</li>\n<li>Cons. Round 3 - Alexander Lopez (Bethalto Bulls WC) won by fall over Jesse Cantu (Gomez Wrestling Academy) Fall 0:24</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Semifinal - Cain Salas (Sons of Thunder) won by decision over Jesse McLain (Orland Park Pioneers) Dec 6-3</li>\n<li>Semifinal - Michael Gibson (Bronco Wrestling) won by fall over Kevon Powell (Harvey Park Dist Twisters) Fall 1:51</li>\n<li>Cons. Round 3 - Brian Cullen (Wrestling Factory) won by fall over Matthew Sommers (Arlington Cardinals) Fall 3:39</li>\n<li>Cons. Round 3 - Ryan Conlin (Oak Forest Warriors) won by major decision over Matthew Rader (Hononegah Kids WC) Maj 11-2</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Nick Fontanetta (Crystal Lake Wizards) won by fall over Andrew Murphy (Little Celtic WC) Fall 3:55</li>\n<li>Semifinal - Devon Graville (Sons of Thunder) won by fall over Jeremy Brown (Force Wrestling) Fall 3:17</li>\n<li>Cons. Round 3 - David Pearce (Bethalto Bulls WC) won by tech fall over Sean Parvin (Sauk Valley WC) TF 17-1</li>\n<li>Cons. Round 3 - Erin Golston (Martinez Fox Valley Elite) won by decision over John Gosinski (Villa Lombard Cougars) Dec 4-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Jeremiah Shearer (Xtreme Wrestling) won by fall over Stephen Myers (Plainfield WC) Fall 3:24</li>\n<li>Semifinal - Josh Bennett (Sons of Thunder) won by decision over Matthew Ornoff (Wrestling Factory) Dec 4-2</li>\n<li>Cons. Round 3 - Nick Fishback (Vittum Cats) won by decision over Tyler Simmons (Little Falcons WC) Dec 3-0</li>\n<li>Cons. Round 3 - Cullen Smith (Crystal Lake Wizards) won by major decision over Kevin Golden (Vittum Cats) Maj 9-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Derek Elmore (Harlem Cougars) won by decision over Eduardo Greco (SCN Youth WC) Dec 4-2</li>\n<li>Semifinal - Trevor Jauch (Crystal Lake Wizards) won by decision over Jesse McCabe (Wolfpak WC) Dec 2-1</li>\n<li>Cons. Round 3 - Michael Mizaur (Vittum Cats) won by decision over Anthony Ferraris Jr (Maine Eagles WC) Dec 5-3</li>\n<li>Cons. Round 3 - Leo Ruettiger (Minooka Little Indians) won by decision over Kyle Graumenz (Triad Little Knights) Dec 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Chris Williams (Bethalto Bulls WC) won by decision over Eddie Klimara (Little Celtic WC) Dec 3-1</li>\n<li>Semifinal - Kevin Skrzypiec (Orland Park Pioneers) won by decision over Lance Hosman (Tinley Park Bulldogs) Dec 4-0</li>\n<li>Cons. Round 3 - Kevin Moylan (Vittum Cats) won by decision over Troy Valdez (Bronco Wrestling) Dec 4-2</li>\n<li>Cons. Round 3 - Steven Bradtmueller (Force Wrestling) won by decision over Mike Soris (Yorkville Wrestling Club) Dec 6-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Jimmy Nehls (Downers Grove Cougars) won by decision over Jason Fugiel (Crystal Lake Wizards) Dec 6-4</li>\n<li>Semifinal - Edwin Cooper (Little Celtic WC) won by fall over Danny Sabatello (Arlington Cardinals) Fall 1:30</li>\n<li>Cons. Round 3 - Eamon Przekwas (Oak Forest Warriors) won by decision over Frank Abitua (Golden Eagles) Dec 4-0</li>\n<li>Cons. Round 3 - Jose Jimenez (Bronco Wrestling) won by decision over Michael Murphy (Vittum Cats) Dec 3-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Joey Gosinski (Villa Lombard Cougars) won by decision over Dylon Viglasky (Belleville Little Devils) Dec 8-1</li>\n<li>Semifinal - Dominic Chase (Sons of Thunder) won by decision over Lucas Smith (Bison WC) Dec 2-0</li>\n<li>Cons. Round 3 - Ryan Fitzpatrick (Vittum Cats) won by decision over Michael Togher (Little Celtic WC) Dec 1-0</li>\n<li>Cons. Round 3 - Kyle Culton (Sycamore WC) won by decision over Sean Raddatz (Oak Forest Warriors) Dec 9-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Nick Harrison (Xtreme Wrestling) won by decision over Joe Souder (Falcon WC) Dec 8-2</li>\n<li>Semifinal - Stephen Robertson (Team West Wolves) won by major decision over Andrew Hoselton (Prairie Central-Chenoa Hawks) Maj 10-1</li>\n<li>Cons. Round 3 - Derek Nagel (Vittum Cats) won by fall over Jameel Carter (Chicago Crusaders) Fall 2:00</li>\n<li>Cons. Round 3 - Jameson Oster (Lemont Bears WC) won by fall over Nolberto Deavila (Collinsville Raiders) Fall 0:29</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Bo Schlosser (Sons of Thunder) won by major decision over Zach Mutton (Rockford WC) Maj 12-2</li>\n<li>Semifinal - Malik - Jabri Taylor (Harvey Park Dist Twisters) won by major decision over Mitchell Brozovich (Minooka Little Indians) Maj 9-0</li>\n<li>Cons. Round 3 - Spartak Chino (WW Tiger WC) won by fall over Dakota Wapotish (Barrington Broncos) Fall 3:09</li>\n<li>Cons. Round 3 - Eddie Scanlon (Bison WC) won by decision over Jordan Thompson (Martinez Fox Valley Elite) Dec 3-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Frank Baer (Bronco Wrestling) won by decision over Blake Montella (Minooka Little Indians) Dec 6-3</li>\n<li>Semifinal - Jacob Gregerson (Sons of Thunder) won by fall over Tyler Argue (Rich Rattlers WC) Fall 1:22</li>\n<li>Cons. Round 3 - Drew Bates (Lions WC) won by decision over Donald Miller (Proviso PowerHouse WC) Dec 5-2</li>\n<li>Cons. Round 3 - Christopher Wright (Harvey Park Dist Twisters) won by decision over Joey Kubica (Gomez Wrestling Academy) Dec 3-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Michael Avelar (Morton Little Mustangs) won by decision over Andrew Messenger (Yorkville Wrestling Club) Dec 5-0</li>\n<li>Semifinal - Dylan Reel (Central Elite Rebels) won by major decision over Dustin Ventimiglia (Sons of Thunder) Maj 14-5</li>\n<li>Cons. Round 3 - Kean Loupee (Crystal Lake Wizards) won by decision over Travis Tomac (Force Wrestling) Dec 8-3</li>\n<li>Cons. Round 3 - Kalvin Whitener-Hill (Minooka Little Indians) won by decision over Zach Paterson (Xtreme Wrestling) Dec 6-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Joey Kielbasa (Crystal Lake Wizards) won by decision over John Bozarth (Central Elite Rebels) Dec 9-4</li>\n<li>Semifinal - Dimitri Willis (Gladiators) won by major decision over Charles Doyle (Notre Dame Wrestling) Maj 9-0</li>\n<li>Cons. Round 3 - Brian Strenk (Oak Forest Warriors) won by decision over Jeff Koepke (Arlington Cardinals) Dec 4-3</li>\n<li>Cons. Round 3 - Luke Polka (Lions WC) won by fall over Tyler Ledbetter (Force Wrestling) Fall 1:58</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Jahwon Akui (Gladiators) won by fall over Noah Murray (Springfield Capital Kids WC) Fall 3:49</li>\n<li>Semifinal - Malik Snapp (Joliet Junior Steelmen) won by decision over Brian Kent (Bison WC) Dec 7-6</li>\n<li>Cons. Round 3 - Trey Griffin (Crystal Lake Wizards) won by fall over Colin Haney (Force Wrestling) Fall 3:30</li>\n<li>Cons. Round 3 - Joshua Anthony (Harlem Cougars) won by fall over Brendan Brooks (Sons of Thunder) Fall 3:22</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Tim Maroder (Crystal Lake Wizards) won by decision over Rasheed Lemon (Gladiators) Dec 9-4</li>\n<li>Semifinal - Gage Harrah (Crystal Lake Wizards) won by fall over Wes Cathcart (Geneseo Spider WC) Fall 2:08</li>\n<li>Cons. Round 3 - JD Cox (Sons of Thunder) won by decision over Giuseppe Lamanna (Mad Dog Wrestling Academy) Dec 14-7</li>\n<li>Cons. Round 3 - Ryan Redmon (Cumberland Youth WC) won by decision over Anthony Ibarra (Gomez Wrestling Academy) Dec 7-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Daniel Massengill (Central Elite Rebels) won by decision over Daniel Holman (Fairmont Rough Riders) Dec 6-4</li>\n<li>Semifinal - Jake Randich (Driscoll Junior Highlanders) won by fall over Vinny Lamontagna (WW Tiger WC) Fall 1:50</li>\n<li>Cons. Round 3 - Austin Marsden (Crystal Lake Wizards) won by decision over Tyler Knudsen (Villa Lombard Cougars) Dec 1-0</li>\n<li>Cons. Round 3 - Hans Schaeffer (Moline WC) won by major decision over Jared Koch (Golden Eagles) Maj 11-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Chris Montez (Peoria Razorbacks Youth WC) won by decision over Javonta Black (Blackhawk WC) Dec 7-4</li>\n<li>Semifinal - Michael Sojka (Harlem Cougars) won by decision over Mitchell Godfrey (Little Celtic WC) Dec 4-1</li>\n<li>Cons. Round 3 - Kevin Rowett (Collinsville Raiders) won by fall over Richard Kersten (Crystal Lake Wizards) Fall 1:58</li>\n<li>Cons. Round 3 - Jack Allen (Hinsdale Red Devils Wc) won by major decision over Daniel Eldridge (Villa Lombard Cougars) Maj 10-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Dakota Patton (Bismarck Henning WC) won by fall over John Taylor (Blackhawk WC) Fall 2:10</li>\n<li>Semifinal - Shaquille McMurtry (Little Celtic WC) won by fall over George Canales (Dixon WC) Fall 3:30</li>\n<li>Cons. Round 3 - Carlos Martinez (Shamrock WC) won by decision over Zachary Didriksen (Crystal Lake Wizards) Dec 8-1</li>\n<li>Cons. Round 3 - Ross Ferraro III (Gomez Wrestling Academy) won by fall over Andrew Crivellone (Bur-Oak Wildcats WC) Fall 2:22</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Alvin Foster III (Harvey Park Dist Twisters) won by fall over Michael Bernardo (Little Falcons WC) Fall 1:27</li>\n<li>Semifinal - Tanner Crum (Aces WC) won by decision over Martell Smith (Peoria Razorbacks Youth WC) Dec 3-2</li>\n<li>Cons. Round 3 - Kodie Schilson (West Hancock Titan WC) won by decision over James Boyle (Knights WC) Dec 6-5</li>\n<li>Cons. Round 3 - Christopher Lopez (Iron Man) won by fall over Mitchell McElroy (Mt. Zion WC) Fall 1:34</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Sean Martin (Sons of Thunder) won by decision over Andy Heredia (Iron Man) Dec 9-2</li>\n<li>Semifinal - Kyle Ryan (Force Wrestling) won by fall over Deshawn Berry (Tomcat WC) Fall 2:59</li>\n<li>Cons. Round 3 - Gerrardo Cisneros (Little Celtic WC) won by fall over Larry Bryant (Harlem Cougars) Fall 0:59</li>\n<li>Cons. Round 3 - Zachary Burton (Charleston WC) won by fall over Joshua Dust (Grapplin` Devils WC) Fall 2:02</li>\n</ul>\n</section>",
  "Cons. Semis (32 Man)": "<section class=\"tw-list\">\n<h1>Cons. Semis (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Dillion Chase (Sons of Thunder) won by major decision over Mark Duda (Crosstown WC) Maj 10-1</li>\n<li>Cons. Semi - Tommy Pawelski (Bronco Wrestling) won by decision over Dylan Cramer (Force Wrestling) Dec 7-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Jimmy Pellegrino (Orland Park Pioneers) won by major decision over Tom Ward (Hinsdale Red Devils Wc) Maj 15-7</li>\n<li>Cons. Semi - George Fisher (SCN Youth WC) won by no contest over Brad Wood (Orland Park Pioneers) NC</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Briar King (GC Jr Warriors) won by decision over Kyle Fugiel (Crystal Lake Wizards) Dec 2-0</li>\n<li>Cons. Semi - Zachary Synon (Cary Jr Trojan Matmen) won by decision over Sean Lynch (Wrestling Factory) Dec 8-6</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Jordan Northrup (Harlem Cougars) won by decision over Jordan Scalice (Gomez Wrestling Academy) Dec 8-4</li>\n<li>Cons. Semi - Garrett Sutton (Wrestling Factory) won by decision over Alphonse Vruno (Martinez Fox Valley Elite) Dec 5-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Brendan Tyler Hall (Harvey Park Dist Twisters) won by no contest over Sal Annoreno (Gomez Wrestling Academy) NC</li>\n<li>Cons. Semi - Erik Nord (Belvidere Bandits) won by no contest over Johnny Pellegrino (Orland Park Pioneers) NC</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Kyle Langenderfer (Orland Park Pioneers) won by fall over Michael O`Connor (Gomez Wrestling Academy) Fall 0:56</li>\n<li>Cons. Semi - Colin Holler (Tinley Park Bulldogs) won by decision over Devin Mahnke (Harvey Park Dist Twisters) Dec 4-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Corbett Oughton (Minooka Little Indians) won by no contest over Lonne Cleveland III (GC Jr Warriors) NC</li>\n<li>Cons. Semi - Michael Sepke (Bronco Wrestling) won by no contest over Jacob Deklerk (Minooka Little Indians) NC</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Jason Locker (Pontiac Pythons) won by decision over Tyler Nagel (Vittum Cats) Dec 4-2</li>\n<li>Cons. Semi - Zach Lehman (Dixon WC) won by no contest over Colton Gladwell (Central Elite Rebels) NC</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Adrian Palacios (Joliet Junior Steelmen) won by no contest over Nick Georgean (Erie Middle School WC) NC</li>\n<li>Cons. Semi - Nathan Zinzer (Blackhawk WC) won by decision over Brandon Sklavanitis (Xtreme Wrestling) Dec 8-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Jordan Ellingwood (Vittum Cats) won by decision over Cameron Mammen (Tiger WC) Dec 8-2</li>\n<li>Cons. Semi - R.J. Troye (Sauk Valley WC) won by decision over Zach Hicks (Hoopeston Area WC) Dec 13-7</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Robbie Irvin (Hoopeston Area WC) won by fall over Matthew Schneider (Lincoln-way WC) Fall 1:57</li>\n<li>Cons. Semi - Ivan Castro (Fenwick Falcons WC) won by decision over Blake Stricklin (Mt. Vernon Lions) Dec 10-8</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - AJ Vargas (Tinley Park Bulldogs) won by major decision over Wardell Rosemon Jr. (Dundee Highlanders) Maj 12-2</li>\n<li>Cons. Semi - Mitchell Jordan (Sycamore WC) won by decision over Brian Bahrs (Sauk Valley WC) Dec 6-4</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Nathaniel Volk (Champaign Kids Wrestling) won by decision over Cody Rozek (Dixon WC) Dec 4-0</li>\n<li>Cons. Semi - Lucas Cartwright (Waukegan Youth WC) won by no contest over Brenden Pindel (Orland Park Pioneers) NC</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>Cons. Semi - Mark Hendricks (Marengo Indians Youth Wrestling) won by no contest over Nicholas Mokodanski (Kane County Grapplers) NC</li>\n<li>Cons. Semi - Mario Carretto (L-P Crunching Cavs) won by fall over James Lowery (Bronco Wrestling) Fall 0:37</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>Cons. Semi - Cal Breedlove (Geneseo Spider WC) won by major decision over Jordan Pena (Dundee Highlanders) Maj 11-2</li>\n<li>Cons. Semi - Nick Kelly (Little Celtic WC) won by fall over Coltyn Pease (Saukee Youth WC) Fall 0:50</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - David Denne (Calumet Memorial P.D. Wolverines) won by no contest over Dustin Rosborough (Highland Bulldog Jr WC) NC</li>\n<li>Cons. Semi - Delasse Lanier (Romeoville WC) won by no contest over Alexander Lopez (Bethalto Bulls WC) NC</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Cons. Semi - Jesse McLain (Orland Park Pioneers) won by decision over Brian Cullen (Wrestling Factory) Dec 3-2</li>\n<li>Cons. Semi - Kevon Powell (Harvey Park Dist Twisters) won by decision over Ryan Conlin (Oak Forest Warriors) Dec 8-4</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - David Pearce (Bethalto Bulls WC) won by decision over Andrew Murphy (Little Celtic WC) Dec 7-0</li>\n<li>Cons. Semi - Jeremy Brown (Force Wrestling) won by no contest over Erin Golston (Martinez Fox Valley Elite) NC</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Stephen Myers (Plainfield WC) won by no contest over Nick Fishback (Vittum Cats) NC</li>\n<li>Cons. Semi - Cullen Smith (Crystal Lake Wizards) won by injury default over Matthew Ornoff (Wrestling Factory) Inj. 0:00</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Eduardo Greco (SCN Youth WC) won by decision over Michael Mizaur (Vittum Cats) Dec 7-5</li>\n<li>Cons. Semi - Jesse McCabe (Wolfpak WC) won by decision over Leo Ruettiger (Minooka Little Indians) Dec 4-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Eddie Klimara (Little Celtic WC) won by no contest over Kevin Moylan (Vittum Cats) NC</li>\n<li>Cons. Semi - Lance Hosman (Tinley Park Bulldogs) won by no contest over Steven Bradtmueller (Force Wrestling) NC</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Jason Fugiel (Crystal Lake Wizards) won by no contest over Eamon Przekwas (Oak Forest Warriors) NC</li>\n<li>Cons. Semi - Danny Sabatello (Arlington Cardinals) won by decision over Jose Jimenez (Bronco Wrestling) Dec 3-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Dylon Viglasky (Belleville Little Devils) won by decision over Ryan Fitzpatrick (Vittum Cats) Dec 4-3</li>\n<li>Cons. Semi - Lucas Smith (Bison WC) won by tech fall over Kyle Culton (Sycamore WC) TF 16-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Derek Nagel (Vittum Cats) won by decision over Joe Souder (Falcon WC) Dec 7-0</li>\n<li>Cons. Semi - Jameson Oster (Lemont Bears WC) won by major decision over Andrew Hoselton (Prairie Central-Chenoa Hawks) Maj 14-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Zach Mutton (Rockford WC) won by decision over Spartak Chino (WW Tiger WC) Dec 6-4</li>\n<li>Cons. Semi - Mitchell Brozovich (Minooka Little Indians) won by decision over Eddie Scanlon (Bison WC) Dec 8-6</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Blake Montella (Minooka Little Indians) won by decision over Drew Bates (Lions WC) Dec 7-1</li>\n<li>Cons. Semi - Tyler Argue (Rich Rattlers WC) won by no contest over Christopher Wright (Harvey Park Dist Twisters) NC</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Andrew Messenger (Yorkville Wrestling Club) won by decision over Kean Loupee (Crystal Lake Wizards) Dec 2-0</li>\n<li>Cons. Semi - Dustin Ventimiglia (Sons of Thunder) won by fall over Kalvin Whitener-Hill (Minooka Little Indians) Fall 2:03</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Brian Strenk (Oak Forest Warriors) won by fall over John Bozarth (Central Elite Rebels) Fall 3:17</li>\n<li>Cons. Semi - Charles Doyle (Notre Dame Wrestling) won by no contest over Luke Polka (Lions WC) NC</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Noah Murray (Springfield Capital Kids WC) won by decision over Trey Griffin (Crystal Lake Wizards) Dec 7-4</li>\n<li>Cons. Semi - Brian Kent (Bison WC) won by no contest over Joshua Anthony (Harlem Cougars) NC</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Rasheed Lemon (Gladiators) won by fall over JD Cox (Sons of Thunder) Fall 0:48</li>\n<li>Cons. Semi - Wes Cathcart (Geneseo Spider WC) won by no contest over Ryan Redmon (Cumberland Youth WC) NC</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Austin Marsden (Crystal Lake Wizards) won by fall over Daniel Holman (Fairmont Rough Riders) Fall 1:34</li>\n<li>Cons. Semi - Vinny Lamontagna (WW Tiger WC) won by no contest over Hans Schaeffer (Moline WC) NC</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Javonta Black (Blackhawk WC) won by no contest over Kevin Rowett (Collinsville Raiders) NC</li>\n<li>Cons. Semi - Jack Allen (Hinsdale Red Devils Wc) won by decision over Mitchell Godfrey (Little Celtic WC) Dec 5-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Carlos Martinez (Shamrock WC) won by fall over John Taylor (Blackhawk WC) Fall 10:56</li>\n<li>Cons. Semi - George Canales (Dixon WC) won by fall over Ross Ferraro III (Gomez Wrestling Academy) Fall 0:41</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Kodie Schilson (West Hancock Titan WC) won by fall over Michael Bernardo (Little Falcons WC) Fall 2:45</li>\n<li>Cons. Semi - Martell Smith (Peoria Razorbacks Youth WC) won by no contest over Christopher Lopez (Iron Man) NC</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Gerrardo Cisneros (Little Celtic WC) won by disqualification over Andy Heredia (Iron Man) DQ</li>\n<li>Cons. Semi - Zachary Burton (Charleston WC) won by fall over Deshawn Berry (Tomcat WC) Fall 1:23</li>\n</ul>\n</section>",
  "Placement Matches (32 Man)": "<section class=\"tw-list\">\n<h1>Placement Matches (32 Man)</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Jon Marmolejo (Gomez Wrestling Academy) won by decision over Jabari Moody (Harvey Park Dist Twisters) Dec 4-2</li>\n<li>3rd Place Match - Dillion Chase (Sons of Thunder) won by disqualification over Tommy Pawelski (Bronco Wrestling) DQ</li>\n<li>5th Place Match - Mark Duda (Crosstown WC) won in overtime over Dylan Cramer (Force Wrestling) OT 4-3</li>\n<li>7th Place Match - Jeffery Morrow (Crystal Lake Wizards) won by major decision over Kyle Akins (Sycamore WC) Maj 15-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Cameron Kennedy (Wrestling Factory) won by major decision over Josh Alber (Dakota WC) Maj 12-2</li>\n<li>3rd Place Match - George Fisher (SCN Youth WC) won by fall over Jimmy Pellegrino (Orland Park Pioneers) Fall 1:59</li>\n<li>5th Place Match - Tom Ward (Hinsdale Red Devils Wc) won by decision over Brad Wood (Orland Park Pioneers) Dec 7-1</li>\n<li>7th Place Match - Reuben Reyes (Force Wrestling) won by decision over Rudolph Johnson (Harvey Park Dist Twisters) Dec 5-4</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Demechico Spraggins (GC Jr Warriors) won by decision over Anthony Devriese (Moline WC) Dec 8-6</li>\n<li>3rd Place Match - Zachary Synon (Cary Jr Trojan Matmen) won by decision over Briar King (GC Jr Warriors) Dec 7-6</li>\n<li>5th Place Match - Kyle Fugiel (Crystal Lake Wizards) won by decision over Sean Lynch (Wrestling Factory) Dec 12-9</li>\n<li>7th Place Match - Eric Demattia (Pontiac Pythons) won by decision over Joey Nelson (Little Celtic WC) Dec 9-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Notay Jackson (Harvey Park Dist Twisters) won by decision over Kegan Wakefield (Wrestling Factory) Dec 1-0</li>\n<li>3rd Place Match - Jordan Northrup (Harlem Cougars) won by decision over Garrett Sutton (Wrestling Factory) Dec 10-3</li>\n<li>5th Place Match - Alphonse Vruno (Martinez Fox Valley Elite) won by decision over Jordan Scalice (Gomez Wrestling Academy) Dec 5-3</li>\n<li>7th Place Match - Matt Garelli (Bronco Wrestling) won by decision over Mitchell Mallary (Erie Middle School WC) Dec 5-1</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Brian Murphy (Villa Lombard Cougars) won by decision over Bryce Brill (Fox Valley WC) Dec 5-4</li>\n<li>3rd Place Match - Brendan Tyler Hall (Harvey Park Dist Twisters) won by decision over Erik Nord (Belvidere Bandits) Dec 4-3</li>\n<li>5th Place Match - Sal Annoreno (Gomez Wrestling Academy) won by decision over Johnny Pellegrino (Orland Park Pioneers) Dec 8-2</li>\n<li>7th Place Match - Tony Rossi (Falcon WC) won by major decision over Connor Bass (Yorkville Wrestling Club) Maj 9-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Nuntreae Jackson (Harvey Park Dist Twisters) won by decision over Ernest Battaglia (Fox Valley WC) Dec 3-2</li>\n<li>3rd Place Match - Colin Holler (Tinley Park Bulldogs) won by decision over Kyle Langenderfer (Orland Park Pioneers) Dec 4-3</li>\n<li>5th Place Match - Devin Mahnke (Harvey Park Dist Twisters) won by major decision over Michael O`Connor (Gomez Wrestling Academy) Maj 12-0</li>\n<li>7th Place Match - Blake Tisza (Crosstown WC) won by decision over Austin Culton (Sycamore WC) Dec 3-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Richard Robertson (Vittum Cats) won by fall over JJ Whaley (Xtreme Wrestling) Fall 1:52</li>\n<li>3rd Place Match - Michael Sepke (Bronco Wrestling) won by decision over Corbett Oughton (Minooka Little Indians) Dec 3-0</li>\n<li>5th Place Match - Lonne Cleveland III (GC Jr Warriors) won in overtime over Jacob Deklerk (Minooka Little Indians) OT 8-6</li>\n<li>7th Place Match - Angelo Silvestro (SCN Youth WC) won by major decision over Danny Brewster (Maine Eagles WC) Maj 10-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Nick Ruffino (SCN Youth WC) won by decision over Timothy Corse (Tinley Park Bulldogs) Dec 8-2</li>\n<li>3rd Place Match - Jason Locker (Pontiac Pythons) won by decision over Zach Lehman (Dixon WC) Dec 7-2</li>\n<li>5th Place Match - Tyler Nagel (Vittum Cats) won in overtime over Colton Gladwell (Central Elite Rebels) OT 4-2</li>\n<li>7th Place Match - Micheal Cudemo (Murphysboro Wrestling) won by major decision over Jameer Thurman (Gladiators) Maj 9-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Zane Richards (Carbondale WC) won by decision over Steve Congenie (Hinsdale Red Devils Wc) Dec 3-1</li>\n<li>3rd Place Match - Nathan Zinzer (Blackhawk WC) won by decision over Adrian Palacios (Joliet Junior Steelmen) Dec 9-6</li>\n<li>5th Place Match - Nick Georgean (Erie Middle School WC) won by decision over Brandon Sklavanitis (Xtreme Wrestling) Dec 7-0</li>\n<li>7th Place Match - Brett Meyer (Central Elite Rebels) won by fall over Steven Franke (WW Tiger WC) Fall 3:04</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Jared Jayne (Bronco Wrestling) won by fall over Tyrone Sally Jr. (Harvey Park Dist Twisters) Fall 2:20</li>\n<li>3rd Place Match - Jordan Ellingwood (Vittum Cats) won by decision over R.J. Troye (Sauk Valley WC) Dec 6-3</li>\n<li>5th Place Match - Cameron Mammen (Tiger WC) won by major decision over Zach Hicks (Hoopeston Area WC) Maj 17-3</li>\n<li>7th Place Match - Eric Tiller (Carlinville Kids WC) won by fall over Tony Cashmore (Richmond WC) Fall 2:37</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Sam Brooks (Little Huskie WC) won by decision over Shaunqae McMurtry (Little Celtic WC) Dec 6-4</li>\n<li>3rd Place Match - Ivan Castro (Fenwick Falcons WC) won by decision over Robbie Irvin (Hoopeston Area WC) Dec 7-3</li>\n<li>5th Place Match - Blake Stricklin (Mt. Vernon Lions) won by fall over Matthew Schneider (Lincoln-way WC) Fall 3:30</li>\n<li>7th Place Match - Alexander Torres (Brawlers WC) won by fall over Aaron Brewton II (Waukegan Youth WC) Fall 3:22</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Alex Eagle-Martinez (Romeoville WC) won by decision over Andy Bensyl (SJO Spartan Youth WC) Dec 6-1</li>\n<li>3rd Place Match - Mitchell Jordan (Sycamore WC) won by decision over AJ Vargas (Tinley Park Bulldogs) Dec 6-0</li>\n<li>5th Place Match - Brian Bahrs (Sauk Valley WC) won by decision over Wardell Rosemon Jr. (Dundee Highlanders) Dec 9-3</li>\n<li>7th Place Match - Eric Krieger (Fox Valley WC) won by decision over Matthew Zabrin (Bison WC) Dec 2-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Jack Dechow (Richmond WC) won by major decision over Austin Smith (Fightin Titan WC) Maj 13-5</li>\n<li>3rd Place Match - Nathaniel Volk (Champaign Kids Wrestling) won by fall over Lucas Cartwright (Waukegan Youth WC) Fall 2:16</li>\n<li>5th Place Match - Cody Rozek (Dixon WC) won by fall over Brenden Pindel (Orland Park Pioneers) Fall 3:58</li>\n<li>7th Place Match - Alexander Sullivan (Maine Eagles WC) won by decision over Tyson Ashbaugh (Seneca Irish Cadets) Dec 5-2</li>\n</ul>\n<h2>Novice 147</h2>\n<ul>\n<li>1st Place Match - Brad Johnson (Lemont Bears WC) won by decision over Mason Wright (Central Elite Rebels) Dec 1-0</li>\n<li>3rd Place Match - Mark Hendricks (Marengo Indians Youth Wrestling) won by decision over Mario Carretto (L-P Crunching Cavs) Dec 2-0</li>\n<li>5th Place Match - Nicholas Mokodanski (Kane County Grapplers) won by decision over James Lowery (Bronco Wrestling) Dec 5-3</li>\n<li>7th Place Match - Jimmy Prince (Lakeland Predators) won by decision over Scott Riggins (Highland Bulldog Jr WC) Dec 7-2</li>\n</ul>\n<h2>Novice 166</h2>\n<ul>\n<li>1st Place Match - Kenny Lindsey (SJO Spartan Youth WC) won by decision over Aaron Ford (Warrensburg WC) Dec 2-1</li>\n<li>3rd Place Match - Nick Kelly (Little Celtic WC) won by fall over Cal Breedlove (Geneseo Spider WC) Fall 0:44</li>\n<li>5th Place Match - Jordan Pena (Dundee Highlanders) won by fall over Coltyn Pease (Saukee Youth WC) Fall 2:28</li>\n<li>7th Place Match - Channing Dolliger (Brawlers WC) won by tech fall over Zachary Ziegler (Timberwolves WC) TF 17-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Hector Trevino (Fenwick Falcons WC) won by fall over Jake Cochrane (Lakeland Predators) Fall 3:21</li>\n<li>3rd Place Match - David Denne (Calumet Memorial P.D. Wolverines) won by fall over Delasse Lanier (Romeoville WC) Fall 1:27</li>\n<li>5th Place Match - Dustin Rosborough (Highland Bulldog Jr WC) won by fall over Alexander Lopez (Bethalto Bulls WC) Fall 1:17</li>\n<li>7th Place Match - Jesse Cantu (Gomez Wrestling Academy) won by fall over Adam Szott (Waubonsie WC) Fall 2:19</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>1st Place Match - Cain Salas (Sons of Thunder) won by tech fall over Michael Gibson (Bronco Wrestling) TF 15-0</li>\n<li>3rd Place Match - Jesse McLain (Orland Park Pioneers) won by decision over Kevon Powell (Harvey Park Dist Twisters) Dec 4-0</li>\n<li>5th Place Match - Brian Cullen (Wrestling Factory) won by decision over Ryan Conlin (Oak Forest Warriors) Dec 9-8</li>\n<li>7th Place Match - Matthew Rader (Hononegah Kids WC) won by decision over Matthew Sommers (Arlington Cardinals) Dec 9-8</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Nick Fontanetta (Crystal Lake Wizards) won by tech fall over Devon Graville (Sons of Thunder) TF 16-1</li>\n<li>3rd Place Match - David Pearce (Bethalto Bulls WC) won by decision over Jeremy Brown (Force Wrestling) Dec 6-4</li>\n<li>5th Place Match - Erin Golston (Martinez Fox Valley Elite) won by decision over Andrew Murphy (Little Celtic WC) Dec 1-0</li>\n<li>7th Place Match - John Gosinski (Villa Lombard Cougars) won by fall over Sean Parvin (Sauk Valley WC) Fall 0:51</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Josh Bennett (Sons of Thunder) won by major decision over Jeremiah Shearer (Xtreme Wrestling) Maj 9-0</li>\n<li>3rd Place Match - Cullen Smith (Crystal Lake Wizards) won by decision over Stephen Myers (Plainfield WC) Dec 3-0</li>\n<li>5th Place Match - Matthew Ornoff (Wrestling Factory) won by decision over Nick Fishback (Vittum Cats) Dec 5-1</li>\n<li>7th Place Match - Kevin Golden (Vittum Cats) won by decision over Tyler Simmons (Little Falcons WC) Dec 6-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Trevor Jauch (Crystal Lake Wizards) won by decision over Derek Elmore (Harlem Cougars) Dec 3-0</li>\n<li>3rd Place Match - Eduardo Greco (SCN Youth WC) won by decision over Jesse McCabe (Wolfpak WC) Dec 5-3</li>\n<li>5th Place Match - Leo Ruettiger (Minooka Little Indians) won by decision over Michael Mizaur (Vittum Cats) Dec 4-0</li>\n<li>7th Place Match - Kyle Graumenz (Triad Little Knights) won by decision over Anthony Ferraris Jr (Maine Eagles WC) Dec 8-4</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Chris Williams (Bethalto Bulls WC) won by decision over Kevin Skrzypiec (Orland Park Pioneers) Dec 6-1</li>\n<li>3rd Place Match - Eddie Klimara (Little Celtic WC) won by major decision over Lance Hosman (Tinley Park Bulldogs) Maj 10-1</li>\n<li>5th Place Match - Kevin Moylan (Vittum Cats) won by decision over Steven Bradtmueller (Force Wrestling) Dec 2-0</li>\n<li>7th Place Match - Troy Valdez (Bronco Wrestling) won by fall over Mike Soris (Yorkville Wrestling Club) Fall 2:45</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Edwin Cooper (Little Celtic WC) won by decision over Jimmy Nehls (Downers Grove Cougars) Dec 7-3</li>\n<li>3rd Place Match - Danny Sabatello (Arlington Cardinals) won by decision over Jason Fugiel (Crystal Lake Wizards) Dec 6-4</li>\n<li>5th Place Match - Jose Jimenez (Bronco Wrestling) won by decision over Eamon Przekwas (Oak Forest Warriors) Dec 2-1</li>\n<li>7th Place Match - Michael Murphy (Vittum Cats) won by decision over Frank Abitua (Golden Eagles) Dec 5-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Dominic Chase (Sons of Thunder) won by decision over Joey Gosinski (Villa Lombard Cougars) Dec 5-0</li>\n<li>3rd Place Match - Lucas Smith (Bison WC) won by decision over Dylon Viglasky (Belleville Little Devils) Dec 5-4</li>\n<li>5th Place Match - Ryan Fitzpatrick (Vittum Cats) won by major decision over Kyle Culton (Sycamore WC) Maj 9-0</li>\n<li>7th Place Match - Michael Togher (Little Celtic WC) won by decision over Sean Raddatz (Oak Forest Warriors) Dec 5-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Nick Harrison (Xtreme Wrestling) won by decision over Stephen Robertson (Team West Wolves) Dec 1-0</li>\n<li>3rd Place Match - Jameson Oster (Lemont Bears WC) won by decision over Derek Nagel (Vittum Cats) Dec 2-0</li>\n<li>5th Place Match - Joe Souder (Falcon WC) won by decision over Andrew Hoselton (Prairie Central-Chenoa Hawks) Dec 1-0</li>\n<li>7th Place Match - Nolberto Deavila (Collinsville Raiders) won by fall over Jameel Carter (Chicago Crusaders) Fall 0:39</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Malik - Jabri Taylor (Harvey Park Dist Twisters) won by decision over Bo Schlosser (Sons of Thunder) Dec 4-3</li>\n<li>3rd Place Match - Zach Mutton (Rockford WC) won by fall over Mitchell Brozovich (Minooka Little Indians) Fall 0:21</li>\n<li>5th Place Match - Spartak Chino (WW Tiger WC) won by decision over Eddie Scanlon (Bison WC) Dec 6-4</li>\n<li>7th Place Match - Dakota Wapotish (Barrington Broncos) won by decision over Jordan Thompson (Martinez Fox Valley Elite) Dec 1-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Jacob Gregerson (Sons of Thunder) won by major decision over Frank Baer (Bronco Wrestling) Maj 8-0</li>\n<li>3rd Place Match - Blake Montella (Minooka Little Indians) won by decision over Tyler Argue (Rich Rattlers WC) Dec 2-1</li>\n<li>5th Place Match - Christopher Wright (Harvey Park Dist Twisters) won by major decision over Drew Bates (Lions WC) Maj 9-1</li>\n<li>7th Place Match - Joey Kubica (Gomez Wrestling Academy) won by major decision over Donald Miller (Proviso PowerHouse WC) Maj 10-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Michael Avelar (Morton Little Mustangs) won by decision over Dylan Reel (Central Elite Rebels) Dec 7-3</li>\n<li>3rd Place Match - Andrew Messenger (Yorkville Wrestling Club) won by decision over Dustin Ventimiglia (Sons of Thunder) Dec 5-1</li>\n<li>5th Place Match - Kean Loupee (Crystal Lake Wizards) won by decision over Kalvin Whitener-Hill (Minooka Little Indians) Dec 3-1</li>\n<li>7th Place Match - Travis Tomac (Force Wrestling) won by decision over Zach Paterson (Xtreme Wrestling) Dec 7-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Dimitri Willis (Gladiators) won by decision over Joey Kielbasa (Crystal Lake Wizards) Dec 5-1</li>\n<li>3rd Place Match - Brian Strenk (Oak Forest Warriors) won by decision over Charles Doyle (Notre Dame Wrestling) Dec 5-4</li>\n<li>5th Place Match - Luke Polka (Lions WC) won by decision over John Bozarth (Central Elite Rebels) Dec 8-6</li>\n<li>7th Place Match - Jeff Koepke (Arlington Cardinals) won by decision over Tyler Ledbetter (Force Wrestling) Dec 2-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Jahwon Akui (Gladiators) won by tech fall over Malik Snapp (Joliet Junior Steelmen) TF 19-4</li>\n<li>3rd Place Match - Noah Murray (Springfield Capital Kids WC) won by decision over Brian Kent (Bison WC) Dec 11-4</li>\n<li>5th Place Match - Trey Griffin (Crystal Lake Wizards) won by decision over Joshua Anthony (Harlem Cougars) Dec 10-5</li>\n<li>7th Place Match - Colin Haney (Force Wrestling) won by decision over Brendan Brooks (Sons of Thunder) Dec 4-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Gage Harrah (Crystal Lake Wizards) won by decision over Tim Maroder (Crystal Lake Wizards) Dec 7-0</li>\n<li>3rd Place Match - Rasheed Lemon (Gladiators) won by decision over Wes Cathcart (Geneseo Spider WC) Dec 6-4</li>\n<li>5th Place Match - JD Cox (Sons of Thunder) won by major decision over Ryan Redmon (Cumberland Youth WC) Maj 12-4</li>\n<li>7th Place Match - Giuseppe Lamanna (Mad Dog Wrestling Academy) won by decision over Anthony Ibarra (Gomez Wrestling Academy) Dec 8-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Jake Randich (Driscoll Junior Highlanders) won by decision over Daniel Massengill (Central Elite Rebels) Dec 6-4</li>\n<li>3rd Place Match - Vinny Lamontagna (WW Tiger WC) won by decision over Austin Marsden (Crystal Lake Wizards) Dec 11-6</li>\n<li>5th Place Match - Hans Schaeffer (Moline WC) won by decision over Daniel Holman (Fairmont Rough Riders) Dec 1-0</li>\n<li>7th Place Match - Jared Koch (Golden Eagles) won by decision over Tyler Knudsen (Villa Lombard Cougars) Dec 6-5</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Michael Sojka (Harlem Cougars) won by decision over Chris Montez (Peoria Razorbacks Youth WC) Dec 5-2</li>\n<li>3rd Place Match - Jack Allen (Hinsdale Red Devils Wc) won by fall over Javonta Black (Blackhawk WC) Fall 2:02</li>\n<li>5th Place Match - Mitchell Godfrey (Little Celtic WC) won by fall over Kevin Rowett (Collinsville Raiders) Fall 0:44</li>\n<li>7th Place Match - Daniel Eldridge (Villa Lombard Cougars) won by decision over Richard Kersten (Crystal Lake Wizards) Dec 7-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Shaquille McMurtry (Little Celtic WC) won by fall over Dakota Patton (Bismarck Henning WC) Fall 1:29</li>\n<li>3rd Place Match - George Canales (Dixon WC) won by fall over Carlos Martinez (Shamrock WC) Fall 2:19</li>\n<li>5th Place Match - Ross Ferraro III (Gomez Wrestling Academy) won by fall over John Taylor (Blackhawk WC) Fall 2:30</li>\n<li>7th Place Match - Zachary Didriksen (Crystal Lake Wizards) won by decision over Andrew Crivellone (Bur-Oak Wildcats WC) Dec 7-5</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Alvin Foster III (Harvey Park Dist Twisters) won by fall over Tanner Crum (Aces WC) Fall 3:02</li>\n<li>3rd Place Match - Kodie Schilson (West Hancock Titan WC) won by fall over Martell Smith (Peoria Razorbacks Youth WC) Fall 0:52</li>\n<li>5th Place Match - Christopher Lopez (Iron Man) won by fall over Michael Bernardo (Little Falcons WC) Fall 1:12</li>\n<li>7th Place Match - Mitchell McElroy (Mt. Zion WC) won by decision over James Boyle (Knights WC) Dec 1-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Sean Martin (Sons of Thunder) won by fall over Kyle Ryan (Force Wrestling) Fall 1:59</li>\n<li>3rd Place Match - Zachary Burton (Charleston WC) won by fall over Gerrardo Cisneros (Little Celtic WC) Fall 1:22</li>\n<li>5th Place Match - Deshawn Berry (Tomcat WC) won by decision over Andy Heredia (Iron Man) Dec 6-3</li>\n<li>7th Place Match - Joshua Dust (Grapplin` Devils WC) won by fall over Larry Bryant (Harlem Cougars) Fall 0:20</li>\n</ul>\n</section>"
}
