{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Jimmy Silva (HF Spartan Elite WC) won by tech fall over Blayke Axnix (Moline WC) TF 16-0</li>\n<li>Champ. Round 1 - Colin Dvorak (Stockton Renegades) won by fall over Sean Larkin (Fox Valley WC) Fall 0:41</li>\n<li>Champ. Round 1 - Ronald Kruse (Hinsdale Falcon WC) won by decision over Solomon Lewis (Crosstown Wrestling) Dec 6-4</li>\n<li>Champ. Round 1 - Joseph Roberts (Yorkville WC) won by decision over Cameron Wolf (Sycamore WC) Dec 4-2</li>\n<li>Champ. Round 1 - Brandon Laux (Harvey Twisters WC) won by decision over Quentin Hart (The Wrestling Factory) Dec 8-1</li>\n<li>Champ. Round 1 - Collier Neville (Panther Powerhouse Wrestling) won by decision over Kaunyae Pillows (Lionheart Intense Wrestling) Dec 6-2</li>\n<li>Champ. Round 1 - Isaiah Willett (Renegade WC (NFP)) won by major decision over Jack Evans (Edwardsville WC) Maj 9-1</li>\n<li>Champ. Round 1 - George Marre (Gomez Wrestling Academy) won by tech fall over Cade Enerson (Dwight WC) TF 19-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Dado (Orland Park Pioneers) won by fall over Mundo Meyer (Little Redskins WC) Fall 2:18</li>\n<li>Champ. Round 1 - Daemyen Middlebrooks (Little Huskies WC) won by major decision over Tyler Bobnick (Maddog Wrestling Academy) Maj 15-4</li>\n<li>Champ. Round 1 - Ryan McGeever (Villa-Lombard Cougars) won by decision over Jakob Wheeler (Celtic Elite) Dec 9-8</li>\n<li>Champ. Round 1 - Colin Tracy (Redhawk WC) won by decision over Jackson Murphy (Yorkville WC) Dec 4-0</li>\n<li>Champ. Round 1 - Maxwell Kristoff (Crusaders` Elite) won by major decision over Cooper Reed (Unity Youth WC) Maj 9-1</li>\n<li>Champ. Round 1 - Chase Clark (Hawk WC) won by fall over Joe Parrish (Fox Valley WC) Fall 0:36</li>\n<li>Champ. Round 1 - Phillip Sims (Carbondale WC) won by major decision over Tommy Hoy (Wolves WC Inc) Maj 14-5</li>\n<li>Champ. Round 1 - Kyle Guttosch (Naperville WC) won by fall over Egan Bender (A &amp; M Youth Wrestling) Fall 1:22</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Brant DeMoss (SCN Youth WC) won by fall over Matthew Mahalik (Junior Porters WC) Fall 2:09</li>\n<li>Champ. Round 1 - Jordan Chisum (Zee-Bee Stingers WC) won by major decision over Zachary Katula (Yorkville WC) Maj 14-6</li>\n<li>Champ. Round 1 - Alexander Perez (Hinsdale Falcon WC) won by tech fall over Victor Guzman (Rock Island WC) TF 15-0</li>\n<li>Champ. Round 1 - Peter Christensen (Windy City Wrestling of Notre Dame) won by fall over Gustave Christensen (Lincoln Way WC) Fall 3:45</li>\n<li>Champ. Round 1 - Stephen Bushy (Crystal Lake Wizards) won by injury default over Norman Harris (Edwardsville WC) Inj. 3:04</li>\n<li>Champ. Round 1 - Michael Rhodes (Tinley Park Bulldogs) won by decision over Miguel Barrett (Prairie Central Hawks WC) Dec 3-2</li>\n<li>Champ. Round 1 - Austin Herkert (Taylorville WC) won by tech fall over Marc Catama (Golden Eagles WC) TF 18-3</li>\n<li>Champ. Round 1 - Caleb Grau (Crusaders` Elite) won by fall over Anthony Bitner (Burbank Titans) Fall 2:56</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Trent Johnson (Scorpion WC) won by major decision over Noah Alsguson (Harvey Twisters WC) Maj 13-4</li>\n<li>Champ. Round 1 - Mario Leon (Lincoln Way WC) won by fall over Cooper Palmore (Prairie Central Hawks WC) Fall 0:37</li>\n<li>Champ. Round 1 - Luke Russell (Naperville WC) won by major decision over Daemon McMurtry (Celtic Elite) Maj 11-1</li>\n<li>Champ. Round 1 - Zachary Gleeson (Rochester WC) won by decision over Dominic Murphy (Mustang WC) Dec 9-4</li>\n<li>Champ. Round 1 - Zeke Waltz (Jersey Junior Panthers Wrestling) won by decision over Christopher Medina (Macomb Bombers WC) Dec 10-8</li>\n<li>Champ. Round 1 - Michael Wellman (Villa-Lombard Cougars) won by decision over Draven Wells (Polo WC) Dec 7-6</li>\n<li>Champ. Round 1 - Anthony Glauser (The Wrestling Factory) won by fall over Ke`shawn Hess (Peoria Razorbacks WC) Fall 0:57</li>\n<li>Champ. Round 1 - Brenden Parks (Kaneland Knights WC) won by fall over Tavaris Macklin (Carbondale WC) Fall 2:03</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Tristen Burns (Carlinville WC) won by decision over Jacob Shipla (Indians Elite) Dec 9-2</li>\n<li>Champ. Round 1 - Connor Beesing (Xtreme WC) won by fall over Alexander Aguirre (Martinez Fox Valley Elite) Fall 0:27</li>\n<li>Champ. Round 1 - William Ingraham (Waubonsie WC) won by fall over Lexi Mitsdarffer (Little Boilers WC) Fall 1:20</li>\n<li>Champ. Round 1 - Colton Ingram (Xtreme WC) won by fall over Deshawn Hayes (East St. Louis Wrestling) Fall 4:09</li>\n<li>Champ. Round 1 - Devin Erickson (Prairie Central Hawks WC) won by fall over Jaiden Vancoillie (Rock Island WC) Fall 2:45</li>\n<li>Champ. Round 1 - Ryan Wahrman (Villa-Lombard Cougars) won by major decision over Gianfranco Montalto (Lemont Bears) Maj 14-3</li>\n<li>Champ. Round 1 - Dontaice Roberson (Champaign WC) won by decision over Nikolas Mishka (Tinley Park Bulldogs) Dec 4-0</li>\n<li>Champ. Round 1 - Jacob Fitzsimmons (Windy City Wrestling of Notre Dame) won by decision over Max Pannell (River Bend WC) Dec 5-3</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Andrew Fetzer (Bison WC) won by fall over Louie Mancinas (Rochelle WC) Fall 4:04</li>\n<li>Champ. Round 1 - Angel Alverio (Crosstown Wrestling) won by fall over James Cagnina (Little Huskies WC) Fall 1:02</li>\n<li>Champ. Round 1 - Thomas Collins (Vittum Cats WC) won by fall over Joseph Jens (Grayslake WC) Fall 0:46</li>\n<li>Champ. Round 1 - Will Bernstein (Lions WC) won by major decision over Samuel Lamonica (Hononegah WC) Maj 9-0</li>\n<li>Champ. Round 1 - Justin Allen (Dwight WC) won by fall over Brock Donati (St. Charles East WC) Fall 0:40</li>\n<li>Champ. Round 1 - Noah Bellini (Sauk Valley WC) won by fall over William Zupanci (Edwardsville WC) Fall 3:31</li>\n<li>Champ. Round 1 - Jalon Nolan-LaGrone (Murphysboro WC) won by decision over Alexis Aguirre (Martinez Fox Valley Elite) Dec 11-5</li>\n<li>Champ. Round 1 - Maximus Conn (Hoopeston Youth Wrestling) won by decision over Jared Dowell (Pekin Boys &amp; Girls Club) Dec 7-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Vince Ochoa (Bolingbrook Junior Raiders) won by fall over Xavier Sierra (Headlock Wrestling Academy) Fall 1:57</li>\n<li>Champ. Round 1 - Gabriel Pierce (Dawgs WC) won by fall over Elijah Cannon (Champaign WC) Fall 4:29</li>\n<li>Champ. Round 1 - Grant Daykin (Riverton Youth Wrestling) won by fall over Matthew Lemke (Little Tigers WC) Fall 0:32</li>\n<li>Champ. Round 1 - Julian Yap (Waukegan Youth WC) won by decision over Eli Pannell (River Bend WC) Dec 5-4</li>\n<li>Champ. Round 1 - Colten Everman (Fisher WC) won by decision over Matthew Hart (Stillman Valley WC) Dec 6-3</li>\n<li>Champ. Round 1 - Jiovanni Martinez (Tomcat WC) won by major decision over Ryan Norwood (Crusaders` Elite) Maj 10-0</li>\n<li>Champ. Round 1 - Geno Lukowski (Martinez Fox Valley Elite) won by decision over Dillon Johnson (St. Charles East WC) Dec 8-2</li>\n<li>Champ. Round 1 - Ryan Johnson (Aces WC) won by fall over Jack Lucarz (Junior Cougar WC) Fall 0:15</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Mason Baker (O`Fallon Little Panthers WC) won by fall over James Allen (Celtic Elite) Fall 0:41</li>\n<li>Champ. Round 1 - Ethan Torres (Grayslake WC) won by fall over Hayden Copass (Storm Youth WC) Fall 3:47</li>\n<li>Champ. Round 1 - Julian Harshbarger (Carbondale WC) won by fall over Peter Gianaris (Maine Eagles WC) Fall 4:13</li>\n<li>Champ. Round 1 - Quinn Stewart (A &amp; M Youth Wrestling) won by fall over Dillon Deneau (Little Boilers WC) Fall 0:32</li>\n<li>Champ. Round 1 - Sonny Blanco (Morton Little Mustangs) won by decision over Justin Hull (St. Charles East WC) Dec 8-3</li>\n<li>Champ. Round 1 - Jason Bridgewater (Midwest Central Youth WC) won by fall over Joey Wolny (Sycamore WC) Fall 5:15</li>\n<li>Champ. Round 1 - Jaylin Garay (Falcons Elite) won by decision over Kaleb Etnyre (Hononegah WC) Dec 7-0</li>\n<li>Champ. Round 1 - Lawrence Smith (Little Huskies WC) won by decision over Dallas Hill (Tiger Town Tanglers WC) Dec 17-10</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Samuel Martin (Edwardsville WC) won by fall over Jacob Weller (East Alton Wood River Jr. Oilers) Fall 0:50</li>\n<li>Champ. Round 1 - Colin Baker (Downers Grove Cougars WC) won by fall over Evan Hahn (Hononegah WC) Fall 0:48</li>\n<li>Champ. Round 1 - Connor Eaton (West Frankfort Jr. Redbirds) won by fall over Chase Moore (Paxton Youth WC) Fall 0:21</li>\n<li>Champ. Round 1 - Caden Triplett (Xtreme WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Maximus Gomez (Izzy Style Wrestling) won by fall over Julius Garrett (Tiger WC) Fall 0:48</li>\n<li>Champ. Round 1 - Joseph Passarelli (Downers Grove Cougars WC) won by fall over Basilo Betancourt (Harvey Twisters WC) Fall 3:00</li>\n<li>Champ. Round 1 - Brian Morel (Arlington Cardinals WC) won by fall over Sharell Johnson (Maywood Bucs/Powerhouse) Fall 1:56</li>\n<li>Champ. Round 1 - Dawson Pruitt (Westville Youth WC) won by major decision over Logan Gramly (Blackhawk WC) Maj 10-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Lucas Korte (Celtic Elite) received a bye   () Bye</li>\n<li>Champ. Round 1 - Paul Fay (Hononegah WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jamaal Moore (HF Spartan Elite WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Curtis Frazier (Olney Cubs WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Keenan Ness (Yorkville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Juan Hernandez (Lancer WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - James Bowers (Hononegah WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Nathanyel Jackson (Springfield Capitals Kids WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Jack Finnegan (Force WC) won by fall over Micah Bergen (Dawgs WC) Fall 1:04</li>\n<li>Champ. Round 1 - Parker Tavares (SCN Youth WC) won by major decision over Chad Bellis (Bloomington Raider WC) Maj 13-0</li>\n<li>Champ. Round 1 - Dylan Amico (Plainfield WC) won by decision over Ryan McBride (Prairie Central Hawks WC) Dec 6-0</li>\n<li>Champ. Round 1 - Charles Farmer (Moline WC) won by fall over Colin Sons (SCN Youth WC) Fall 2:25</li>\n<li>Champ. Round 1 - Hunter Bogwill (Gomez Wrestling Academy) won by decision over Brant Kirby (Oak Forest Warriors) Dec 12-7</li>\n<li>Champ. Round 1 - Jalen May (King Select Wrestling) won by decision over Christian Olsen (Crystal Lake Wizards) Dec 4-1</li>\n<li>Champ. Round 1 - Matthew Minick (King Select Wrestling) won by decision over Kenyon Boyce Jr (Harvey Twisters WC) Dec 5-2</li>\n<li>Champ. Round 1 - Joel Mylin (Golden Eagles WC) won by decision over Ronan Schuelke (Maddog Wrestling Academy) Dec 4-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Joseph Knapp (Brawlers WC) won by decision over Samuel Henkle (Crystal Lake Wizards) Dec 5-1</li>\n<li>Champ. Round 1 - Sawyer Nash (Grapplin` Devils WC) won by decision over Cale Horsch (Fisher WC) Dec 8-4</li>\n<li>Champ. Round 1 - Logan Kuhel-Trimmer (Force WC) won by fall over Isaiah Immke (Champaign WC) Fall 2:37</li>\n<li>Champ. Round 1 - Matthew Poniatowski (Windy City Wrestling of Notre Dame) won by decision over Zachary Fausel (Hononegah WC) Dec 6-1</li>\n<li>Champ. Round 1 - Justin Cole (Team 1006) won by decision over Jarek Wehrle (Vandalia Jr WC) Dec 6-2</li>\n<li>Champ. Round 1 - Michael Rodriguez (Southside Stallions) won by decision over Alex Ventimilla (Martinez Fox Valley Elite) Dec 6-4</li>\n<li>Champ. Round 1 - Alex Randell (Greg Gomez Trained Wrestling) won by decision over Joseph Cape (Central Elite Rebels) Dec 5-4</li>\n<li>Champ. Round 1 - David Klein (Mustang WC) won in sudden victory - 1 over Chase Hall (King Select Wrestling) SV-1 4-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Colton Tay (Panther Youth WC) won by decision over Trumain Butler (Renegade WC (NFP)) Dec 7-5</li>\n<li>Champ. Round 1 - Sam Emery (Celtic Elite) won by major decision over Michael Crawford (Sycamore WC) Maj 13-0</li>\n<li>Champ. Round 1 - Brock Pfeifer (Lincoln Way WC) won by major decision over Luc Valdez (Tinley Park Bulldogs) Maj 10-1</li>\n<li>Champ. Round 1 - Andrew Herbst (Hawk WC) won by major decision over Nick Kotiw (Champaign WC) Maj 12-0</li>\n<li>Champ. Round 1 - Joshua Koderhandt (Crusaders` Elite) won by major decision over Damien Lopez (Greg Gomez Trained Wrestling) Maj 14-2</li>\n<li>Champ. Round 1 - Reese Durlacher (Bison WC) won by tech fall over Owen Farquer (Metamora Kids WC) TF 16-1</li>\n<li>Champ. Round 1 - Cameron Clark (Dawgs WC) won by decision over Will Carlile (Mt. Olive Cats Kids Wrestling) Dec 5-4</li>\n<li>Champ. Round 1 - Cameron Johnson (Martinez Fox Valley Elite) won by major decision over Jeremy Jakowitsch (Barrington Broncos WC) Maj 8-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Alex Villar (Bolingbrook Junior Raiders) won by fall over Jimmy Ruston (Lions WC) Fall 2:02</li>\n<li>Champ. Round 1 - Kai Conway (Gomez Wrestling Academy) won by fall over Peyton Schroeder (SCN Youth WC) Fall 3:16</li>\n<li>Champ. Round 1 - Denis Murphy (Fox Valley WC) won by decision over Payton Geigner (Lincoln Way WC) Dec 5-3</li>\n<li>Champ. Round 1 - Joshua Holm (Izzy Style Wrestling) won by decision over Michael Archer (Southside Stallions) Dec 3-0</li>\n<li>Champ. Round 1 - Andrew Lira (Crystal Lake Wizards) won by decision over Blayne Donsbach (Cumberland Youth WC) Dec 13-7</li>\n<li>Champ. Round 1 - Grant Matarelli (Edwardsville WC) won by major decision over David Burgess (Rocket Fuel WC) Maj 12-3</li>\n<li>Champ. Round 1 - Dayton Hall (Aces WC) won by decision over Justin Peters (Dundee Highlanders WC) Dec 4-3</li>\n<li>Champ. Round 1 - Luke Barron (Team 1006) won by decision over Nathaniel Eldridge (Mattoon Youth WC) Dec 7-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Rocco Iannantone (Vittum Cats WC) won by fall over Christopher Jarka (Crystal Lake Wizards) Fall 2:47</li>\n<li>Champ. Round 1 - Sincere Bailey (Harvey Twisters WC) won by fall over Andrew Greenwood (Dawgs WC) Fall 2:07</li>\n<li>Champ. Round 1 - Ryan Haynes (Pekin Boys &amp; Girls Club) won by decision over Mitchell Rudsinski (Lincoln Way WC) Dec 10-3</li>\n<li>Champ. Round 1 - Kendall Norfleet (Harvey Twisters WC) won by decision over Presley Beasley (Crystal Lake Wizards) Dec 8-5</li>\n<li>Champ. Round 1 - Zeke Marshall (Martinez Fox Valley Elite) won by tech fall over Joseph Cardani (Champaign WC) TF 15-0</li>\n<li>Champ. Round 1 - Brendan Mattingly (Edwardsville WC) won by major decision over Cooper Wettig (Izzy Style Wrestling) Maj 14-2</li>\n<li>Champ. Round 1 - Michael D`Orazio (St. Charles East WC) won by tech fall over William Bramlett (Murphysboro WC) TF 15-0</li>\n<li>Champ. Round 1 - Andrew Baysingar (Arlington Cardinals WC) won by major decision over Logan Peters (Springfield Capitals Kids WC) Maj 8-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Chance Kilcrease (Edwardsville WC) won by major decision over Andrew Schwartz (Warrior Monks) Maj 11-0</li>\n<li>Champ. Round 1 - Domenic Zaccone (Orland Park Pioneers) won by major decision over Daniel McPherson (Lakeland Predators WC) Maj 14-1</li>\n<li>Champ. Round 1 - Andrew Cervantes (Force WC) won in sudden victory - 1 over Cole Walkington (Woodstock Cyclones WC) SV-1 5-3</li>\n<li>Champ. Round 1 - Garrett Bakarich (Triad Little Knights WC) won by major decision over Michael Moore (St. Tarcissus Raiders WC) Maj 9-1</li>\n<li>Champ. Round 1 - Ryan Smith (Harvey Twisters WC) won by major decision over Anthony Indelli (Falcons Elite) Maj 14-3</li>\n<li>Champ. Round 1 - Adam Meenen (Sauk Valley WC) won by fall over Nathaniel Dundon (Tiger WC) Fall 2:40</li>\n<li>Champ. Round 1 - Thomas Egan (Mustang WC) won by major decision over Jacob Ambrose (Midwest Central Youth WC) Maj 10-2</li>\n<li>Champ. Round 1 - Andy Posledni (Batavia WC) won by decision over Michael Carpenter (Cumberland Youth WC) Dec 4-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Ashton Breen (Bolingbrook Junior Raiders) won by decision over Rukkus Hunkins (Golden Eagles WC) Dec 3-2</li>\n<li>Champ. Round 1 - Jacob Paradee (A &amp; M Youth Wrestling) won by fall over Michael Wirkus (SCN Youth WC) Fall 2:42</li>\n<li>Champ. Round 1 - Jackson Hosman (Celtic Elite) won by decision over Anthony Chiaro (SCN Youth WC) Dec 7-0</li>\n<li>Champ. Round 1 - Gavin Bloom (Hononegah WC) won by decision over Jacob Mumm (Dwight WC) Dec 6-4</li>\n<li>Champ. Round 1 - Andy Madrigal (Pitbull Wrestling Alliance) won by fall over Jacob Sileven (West Frankfort Jr. Redbirds) Fall 4:14</li>\n<li>Champ. Round 1 - Drew Nash (Lemont Bears) won by decision over Cale Reeder (Yorkville WC) Dec 3-2</li>\n<li>Champ. Round 1 - Donnell Washington (Harvey Twisters WC) won by decision over Alexander Posada (Villa-Lombard Cougars) Dec 9-2</li>\n<li>Champ. Round 1 - Jacob Hendrickson (King Select Wrestling) won by decision over Hunter Aldrich (Champbuilders Wrestling) Dec 9-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Tony Heinitz (River Bend WC) won by decision over Zachary Reese (Will County Warriors) Dec 6-2</li>\n<li>Champ. Round 1 - Drake Regenhardt (Wolves WC Inc) won by decision over Daniel Sanderson (Fox Valley WC) Dec 7-4</li>\n<li>Champ. Round 1 - Chandler Gartner (Brawlers WC) won by decision over Ameer Abdallah (Greg Gomez Trained Wrestling) Dec 11-5</li>\n<li>Champ. Round 1 - Drake Davis (Illinois Valley Elite Wrestling) won by fall over Brad Zbilski (Z`s Team Pena) Fall 0:39</li>\n<li>Champ. Round 1 - Daniel Caulfield (Mustang WC) won by decision over Cormac Kane (Junior Cougar WC) Dec 10-3</li>\n<li>Champ. Round 1 - Devin Makemson (Bismarck-Henning WC) won by decision over John Hirsch (Granite City WC) Dec 5-0</li>\n<li>Champ. Round 1 - Kolbi Caffey (Carbondale WC) won by decision over Joshua Diaz (Morton Little Mustangs) Dec 6-2</li>\n<li>Champ. Round 1 - Peyton Nimsakont (Headlock Wrestling Academy) won by fall over Jacob Frost (Unity Youth WC) Fall 3:52</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Damien Cantrell (Brawlers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Blaine Riley (Panther Powerhouse Wrestling) won by fall over Tyson Burton (Champaign WC) Fall 0:31</li>\n<li>Champ. Round 1 - Eliseo Zamora (Hoopeston Youth Wrestling) won by decision over Kaleb Villarreal (Rock Island WC) Dec 8-6</li>\n<li>Champ. Round 1 - Maxx Fritz (Bulls WC) won by decision over Nicolas Patch (Force WC) Dec 7-1</li>\n<li>Champ. Round 1 - Cade Slayton (Dakota WC) won by decision over Nathanael Jara (Falcons Elite) Dec 7-0</li>\n<li>Champ. Round 1 - Cameron White (Harvey Twisters WC) won by injury default over Matthew Papke (Izzy Style Wrestling) Inj. 3:17</li>\n<li>Champ. Round 1 - Mateo Portillo (Southside Stallions) won by major decision over Ian Deisher (Blackhawk WC) Maj 9-1</li>\n<li>Champ. Round 1 - Kaleb Hartman (West Carroll WC) won by major decision over Ryan Kristo (Pitbull Wrestling Alliance) Maj 14-3</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Price (Lincoln Way WC) won by fall over Andrew Fisher (Pekin Boys &amp; Girls Club) Fall 0:30</li>\n<li>Champ. Round 1 - Peter Schied (Redhawk WC) won by decision over Tayesean White (Villa-Lombard Cougars) Dec 5-2</li>\n<li>Champ. Round 1 - Jonny Halvorsen (Maine Eagles WC) won by decision over Blake Bonds (Brawlers WC) Dec 9-3</li>\n<li>Champ. Round 1 - Thomas Parrish (Moline WC) won by decision over Ryan Quinn (Mustang WC) Dec 2-1</li>\n<li>Champ. Round 1 - Jesus Cancino (Lawrence County WC) won by decision over Brayden Roeder (Champaign WC) Dec 3-0</li>\n<li>Champ. Round 1 - Frank Carone (Crystal Lake Wizards) won by fall over Keiran Burke (Downers Grove Cougars WC) Fall 1:29</li>\n<li>Champ. Round 1 - Aaron Engle (Junior Kahoks) won by fall over Edgar Jones (East St. Louis Wrestling) Fall 1:46</li>\n<li>Champ. Round 1 - Trevor Jones (Martinez Fox Valley Elite) won by decision over Kevin Sanchez (Bismarck-Henning WC) Dec 5-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Joseph Zartuche (HF Spartan Elite WC) won by fall over Jacob Hansfield (Falcons Elite) Fall 3:45</li>\n<li>Champ. Round 1 - Austin Rash (River Bend WC) won by fall over Maxwell Garland (Sharks WC) Fall 0:59</li>\n<li>Champ. Round 1 - Tyler Guerrero (Martinez Fox Valley Elite) won by decision over Jacob Rossitto (Geneseo Spider WC) Dec 6-4</li>\n<li>Champ. Round 1 - Joseph Saracco (Force WC) won by fall over Adrian Bytyqi (Evanston School of Wrestling) Fall 2:34</li>\n<li>Champ. Round 1 - Martin Krasinski (Crystal Lake Wizards) won by decision over Daniel Smith (Carbondale WC) Dec 4-3</li>\n<li>Champ. Round 1 - Bryce Rivers (Westville Youth WC) won by fall over Oscar Miranda (Morton Little Mustangs) Fall 2:47</li>\n<li>Champ. Round 1 - Jason Bowman (Champaign WC) won in sudden victory - 1 over Liam O`Donnell (Crystal Lake Wizards) SV-1 11-9</li>\n<li>Champ. Round 1 - Mark Tucker (Edwardsville WC) won by decision over Cameron Bates (Little Huskies WC) Dec 4-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Yousif Salah (Celtic Elite) won by fall over Cameron Flanagan (Olney Cubs WC) Fall 0:51</li>\n<li>Champ. Round 1 - Nick Fetzner (Wolves WC Inc) won by fall over Michael Bautch (Batavia WC) Fall 1:58</li>\n<li>Champ. Round 1 - Bo Neidballa (Falcons Elite) won by fall over Edward Linthicum (Celtic Elite) Fall 1:03</li>\n<li>Champ. Round 1 - Drake Jennings (Stillman Valley WC) won by fall over Riley Scheffel (Edwardsville WC) Fall 2:54</li>\n<li>Champ. Round 1 - Christopher Leanos (Metamora Kids WC) won by fall over Adal Samaniego (Badger WC) Fall 0:18</li>\n<li>Champ. Round 1 - Barrett Beaird (Grayslake WC) won by decision over Victor Stigger (Maywood Bucs/Powerhouse) Dec 5-4</li>\n<li>Champ. Round 1 - Miles Tonielli (Blackhawk WC) won by fall over Gregory Hann (Little Huskies WC) Fall 2:06</li>\n<li>Champ. Round 1 - Dylan Butts (Wolfpak WC) won in sudden victory - 1 over Hunter Henning (Moline WC) SV-1 6-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Ameer Aqel (Vittum Cats WC) won in double overtime over Jayce Turner (A-J Jr. Wildcat Wrestling) 2-OT 2-1</li>\n<li>Champ. Round 1 - Ryan Pancamo (Scorpion WC) won by decision over Saul Quintana (Villa-Lombard Cougars) Dec 6-0</li>\n<li>Champ. Round 1 - Ryan Vedner (Arlington Cardinals WC) won by fall over Michael Miller (Riverton Youth Wrestling) Fall 1:47</li>\n<li>Champ. Round 1 - Tyreek Austin (Crusaders` Elite) won by decision over Quentin Shimmins (Rockford WC) Dec 6-4</li>\n<li>Champ. Round 1 - Andrew Rucker (Polo WC) won by decision over Andrew McLaughlin (Springfield Capitals Kids WC) Dec 8-4</li>\n<li>Champ. Round 1 - Hunter McAlpine (Seneca Irish Cadets WC) won by fall over Vito Claps (Little Huskies WC) Fall 2:05</li>\n<li>Champ. Round 1 - Justin Perren (Geneseo Spider WC) won by decision over Lashawn Reed (Danville Chargers Wrestling) Dec 7-2</li>\n<li>Champ. Round 1 - Ryan Dykes (Golden Eagles WC) won by fall over Felipe Martinez (Calumet Memorial PD Wolverines) Fall 3:32</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Joshua Carter (Harlem Cougar WC) won by fall over Ahilud Huerta (Waukegan Youth WC) Fall 4:14</li>\n<li>Champ. Round 1 - Bryan Bardel (Lincoln Way WC) won by major decision over Jared Stringini (The Law) Maj 11-2</li>\n<li>Champ. Round 1 - Troy White (Frankfort Square Wildcats Wrestling) won by fall over Davaanyam Erdenetsogt (Junior Titan Wrestling) Fall 0:39</li>\n<li>Champ. Round 1 - Ryan Doubek (Z`s Team Pena) won by fall over Talvin Gibson (Little Huskies WC) Fall 0:50</li>\n<li>Champ. Round 1 - Maximum Wilson (WW Tigers WC) won by decision over Alex Riddle (Hoopeston Youth Wrestling) Dec 8-4</li>\n<li>Champ. Round 1 - Ian Kovach (Granite City WC) won by fall over Shawn Hornbeak (Western Illinois All-Stars) Fall 1:18</li>\n<li>Champ. Round 1 - Daron Austin (East Alton Wood River Jr. Oilers) won by decision over John Willeford (Falcons Elite) Dec 2-0</li>\n<li>Champ. Round 1 - Adam Colunga (Hoopeston Youth Wrestling) won by fall over Gavin Christensen (Junior Cougar WC) Fall 1:07</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Jake Sobun (Celtic Elite) won by fall over Nathan Kaiser (Hononegah WC) Fall 1:11</li>\n<li>Champ. Round 1 - Cameron Lee (Metamora Kids WC) won by fall over Cova Curry (Hoopeston Youth Wrestling) Fall 1:07</li>\n<li>Champ. Round 1 - Blake Sayles (Force WC) won by fall over Nicholaus Langenfeld (Saber WC) Fall 2:30</li>\n<li>Champ. Round 1 - Andrew Sullivan (Maine Eagles WC) won by fall over Lyle Hallberg (Western Illinois All-Stars) Fall 1:04</li>\n<li>Champ. Round 1 - Matthew Hunter (Sycamore WC) won by fall over Sean Allgire (Panther Powerhouse Wrestling) Fall 0:41</li>\n<li>Champ. Round 1 - Cole Mikulait (Edwardsville WC) won by fall over Kenny Svestka (Martinez Fox Valley Elite) Fall 2:11</li>\n<li>Champ. Round 1 - Edward Fowler (Blackhawk WC) won by injury default over Chase Marshall (Tinley Park Bulldogs) Inj. 0:00</li>\n<li>Champ. Round 1 - Kyle Beasley (Olney Cubs WC) won by fall over Aaron Ponce (Stockton Renegades) Fall 2:14</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Daniel Card (Carlinville WC) won by decision over Derrick Norley (Lincoln Way WC) Dec 7-0</li>\n<li>Champ. Round 1 - Jose Ramos (Arlington Cardinals WC) won by fall over Lance Jewell (Cumberland Youth WC) Fall 0:22</li>\n<li>Champ. Round 1 - Clayton Sheldon (Sparta Junior Bulldogs) won by fall over Raul Murcio (Shamrock WC) Fall 1:58</li>\n<li>Champ. Round 1 - George Hays (Peoria Razorbacks WC) won by fall over Omari Foster (Tiger WC) Fall 0:28</li>\n<li>Champ. Round 1 - Carlos Luna (Blackhawk WC) won by fall over Samuel Livingston (Paxton Youth WC) Fall 1:39</li>\n<li>Champ. Round 1 - Jose Rojas (Lil Bucs WC) won by decision over Robert Castellano (Western Illinois All-Stars) Dec 9-7</li>\n<li>Champ. Round 1 - Jimmy Wormsley (Golden Eagles WC) won by decision over James Burns (Blackhawk WC) Dec 4-1</li>\n<li>Champ. Round 1 - Taylor Fleetwood (River Bend WC) won by decision over Jacob Stellhorn (Edwardsville WC) Dec 7-1</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Alfred McIntosh (Junior Kahoks) received a bye   () Bye</li>\n<li>Champ. Round 1 - Nicholas Vaccariello (Force WC) won by decision over Austin Velasquez (Calumet Memorial PD Wolverines) Dec 8-1</li>\n<li>Champ. Round 1 - Cody Miller (Bismarck-Henning WC) won by fall over Daviontae Ireland (Brawlers WC) Fall 1:49</li>\n<li>Champ. Round 1 - Brandon Reyes (Calumet Memorial PD Wolverines) won by fall over Darius Priget (Murphysboro WC) Fall 0:21</li>\n<li>Champ. Round 1 - Isaiah Brock (Fenton/BBAA Jr Bison WC) won by decision over Owen Lindsey (Peoria Razorbacks WC) Dec 6-2</li>\n<li>Champ. Round 1 - Justin Trotter (Glenbard East Jr Rams WC) won by fall over Vito Tito (Badger WC) Fall 3:00</li>\n<li>Champ. Round 1 - Noah Laney (Crystal Lake Wizards) won by decision over Justin Miramontes (Fenton/BBAA Jr Bison WC) Dec 5-4</li>\n<li>Champ. Round 1 - Kody Brower (Rocket Fuel WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Anthony King (East St. Louis Wrestling) won by decision over Reginald Allen (Rantoul Junior Eagles) Dec 3-0</li>\n<li>Champ. Round 1 - Miles Trahey (Orland Park Pioneers) won by fall over Briscoe Watson (Harvey Twisters WC) Fall 4:10</li>\n<li>Champ. Round 1 - Anthony Molton (Will County Warriors) won by decision over Tyson Coon (Hoopeston Youth Wrestling) Dec 7-5</li>\n<li>Champ. Round 1 - Anthony Schickel (Southside Stallions) won by decision over Zeth Stallings (Lawrence County WC) Dec 10-5</li>\n<li>Champ. Round 1 - Josh Bess (Maine Eagles WC) won by decision over Adan Bourge (Team 1006) Dec 5-0</li>\n<li>Champ. Round 1 - Chad Schap (Sycamore WC) won by decision over Justice Valdez (Martinez Fox Valley Elite) Dec 3-2</li>\n<li>Champ. Round 1 - Justin Montani (Crystal Lake Wizards) won by fall over Isaac Hunter (Evanston School of Wrestling) Fall 0:26</li>\n<li>Champ. Round 1 - Mark Guerrero (St. Charles East WC) won by major decision over Juan Isaiah Tapia (Champbuilders Wrestling) Maj 13-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Vincent Rink (Brawlers WC) won by fall over Tony Aughenbaugh (Mendota Mat Masters) Fall 2:14</li>\n<li>Champ. Round 1 - Nathan Callaway (Team No Ego WC) won by fall over Ty`reese Smith (Lionheart Intense Wrestling) Fall 1:02</li>\n<li>Champ. Round 1 - Brody Powell (Hoopeston Youth Wrestling) won by fall over Andrew Chaplin (Force WC) Fall 0:33</li>\n<li>Champ. Round 1 - Michael Jaffe (SCN Youth WC) won by fall over Cole Williams (Central Illinois Wrestling Academy) Fall 4:04</li>\n<li>Champ. Round 1 - Lucas Schevikhoven (Lakeland Predators WC) won by fall over David Letsinger (Lions WC) Fall 1:53</li>\n<li>Champ. Round 1 - William Hillard (Triad Little Knights WC) won by decision over Jacob Larson (Xtreme WC) Dec 3-2</li>\n<li>Champ. Round 1 - Patrick Bracken (Mustang WC) won by major decision over Christopher Santiago (Granite City WC) Maj 15-2</li>\n<li>Champ. Round 1 - Alex Giuliano (Izzy Style Wrestling) won by decision over Jace Sparks (Crystal Lake Wizards) Dec 10-8</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Austin Rudsinski (Lincoln Way WC) won by fall over Mark Holian (Crystal Lake Wizards) Fall 1:11</li>\n<li>Champ. Round 1 - Anthony Greco (Shamrock WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Anthony Talamonti (HF Spartan Elite WC) won by fall over Vincent D`Orazio (St. Charles East WC) Fall 1:53</li>\n<li>Champ. Round 1 - Steven-o`neil Swanson (Crystal Lake Wizards) won by fall over Brendan Gallo (Sharks WC) Fall 2:50</li>\n<li>Champ. Round 1 - Dylan Martin (Crusaders` Elite) won by fall over Cecil LaCour (Morton Little Mustangs) Fall 0:21</li>\n<li>Champ. Round 1 - Justin Benjamin (SCN Youth WC) won by fall over Sean Callaghan (Tinley Park Bulldogs) Fall 4:02</li>\n<li>Champ. Round 1 - Tyler Podnar (Falcons Elite) won by decision over Jake D`Angelo (Junior Porters WC) Dec 12-6</li>\n<li>Champ. Round 1 - Jacob Abeja (Tinley Park Bulldogs) won by decision over Nicholas Norwood (Crusaders` Elite) Dec 6-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Cameren Carver (Charleston WC) won by decision over Michael Cleary (Bulldog WC) Dec 12-7</li>\n<li>Champ. Round 1 - Ben Emery (Celtic Elite) won by fall over Christopher Alaniz (Hawk WC) Fall 2:32</li>\n<li>Champ. Round 1 - Tyler Krause (Bolingbrook Junior Raiders) won by decision over Miles Hoey (Redhawk WC) Dec 7-0</li>\n<li>Champ. Round 1 - Anthony Schaer (Wolves WC Inc) won by fall over Lexi Riemann (Riverton Youth Wrestling) Fall 2:45</li>\n<li>Champ. Round 1 - Benjamin Anderson (SCN Youth WC) won in tie breaker - 1 over Kyle Cavender (Harrisburg Junior Bulldogs) TB-1 2-1</li>\n<li>Champ. Round 1 - Jackson Lingle (Izzy Style Wrestling) won by fall over Declan McDaniel (Central Illinois Wrestling Academy) Fall 1:25</li>\n<li>Champ. Round 1 - Trenton Finch (King Select Wrestling) won by major decision over Brody Haynes (Pekin Boys &amp; Girls Club) Maj 16-2</li>\n<li>Champ. Round 1 - Moises Rivera (Waukegan Youth WC) won by decision over Jonathan Salgado (Martinez Fox Valley Elite) Dec 1-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Zachary McDowell (Celtic Elite) won by decision over Timothy Murphy (Mustang WC) Dec 9-4</li>\n<li>Champ. Round 1 - Patrick Daum (SCN Youth WC) won by major decision over Cole Riemer (Izzy Style Wrestling) Maj 8-0</li>\n<li>Champ. Round 1 - Dylan Doranski (Batavia WC) won by decision over Jake Kendall (Force WC) Dec 2-0</li>\n<li>Champ. Round 1 - Joseph Egan (Mustang WC) won by major decision over Manuel Ramirez (Waukegan Youth WC) Maj 14-0</li>\n<li>Champ. Round 1 - Mason Schewe (Hononegah WC) won by fall over Andrew Mathers (Mt. Zion Kids WC) Fall 2:15</li>\n<li>Champ. Round 1 - Kody Cavender (Harrisburg Junior Bulldogs) won by decision over Dimitrie Justus (Rock Island WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jaleen Yancey (Edwardsville WC) won by fall over Adam Pinter (Cary-Grove Matmen) Fall 3:45</li>\n<li>Champ. Round 1 - Jacob White (Dawgs WC) won by fall over Abdul Abdulhafedh (Waubonsie WC) Fall 0:24</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Timothy Houston (Tinley Park Bulldogs) won by decision over Jackson Zofkie (Frankfort Square Wildcats Wrestling) Dec 5-3</li>\n<li>Champ. Round 1 - Jarrett Paslay (Vandalia Jr WC) won by decision over Blake Brassfield (Quincy Cyclones Wrestling) Dec 7-4</li>\n<li>Champ. Round 1 - Jonathan Mitchell (Little Huskies WC) won by decision over Joshua Harsh (Granite City WC) Dec 12-6</li>\n<li>Champ. Round 1 - Adam McDowell (Celtic Elite) won by fall over Bryce Grant (River Bend WC) Fall 0:42</li>\n<li>Champ. Round 1 - Jacob Holm (Izzy Style Wrestling) won by decision over Allen Swanson (Team No Ego WC) Dec 7-6</li>\n<li>Champ. Round 1 - Jarrett Kinney (Hononegah WC) won by major decision over Nolan Roseman (Rantoul Junior Eagles) Maj 11-2</li>\n<li>Champ. Round 1 - Patrick Ryan (North Shore Edge) won by decision over Andrew Henkle (Crystal Lake Wizards) Dec 9-7</li>\n<li>Champ. Round 1 - Gabriel Berta (Berta Wrestling Academy) won by decision over Thomas Schroeder (SCN Youth WC) Dec 6-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Dylan Davidson (King Select Wrestling) won by major decision over Michael Hatfield (Crystal Lake Wizards) Maj 11-3</li>\n<li>Champ. Round 1 - Brian Madrigal (Pitbull Wrestling Alliance) won by decision over Dominick Ambrose (Orland Park Pioneers) Dec 8-5</li>\n<li>Champ. Round 1 - Brock Montford (Red Raiders Wrestling Team) won by fall over Tommy Criscione (Celtic Elite) Fall 1:11</li>\n<li>Champ. Round 1 - Austin Macias (Izzy Style Wrestling) won by fall over Jared Skaggs (King Select Wrestling) Fall 0:52</li>\n<li>Champ. Round 1 - Ja`Chun Smith (Little Huskies WC) won by major decision over Luke Skokna (Hinsdale Falcon WC) Maj 13-3</li>\n<li>Champ. Round 1 - Christopher Whaley (Springfield Capitals Kids WC) won by fall over Conner Alter (Tiger Town Tanglers WC) Fall 3:17</li>\n<li>Champ. Round 1 - Paul Gliva (Southside Stallions) won by tech fall over Logan Eppard (Mendota Mat Masters) TF 15-0</li>\n<li>Champ. Round 1 - Peter Ferraro (SCN Youth WC) won by major decision over Jeremy Rumsey (Saber WC) Maj 12-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Austin Ernd (Crystal Lake Wizards) won in double overtime over Corey Sapp (Bolingbrook Junior Raiders) 2-OT 3-2</li>\n<li>Champ. Round 1 - Nicholas Piaskowy (SCN Youth WC) won by major decision over Mason Ajster (Oakwood Youth WC) Maj 12-0</li>\n<li>Champ. Round 1 - Jackson O`Reilly (Team No Ego WC) won by decision over Tyler Krestel (Bolingbrook Junior Raiders) Dec 7-2</li>\n<li>Champ. Round 1 - Alex Zacharuk (Harlem Cougar WC) won by fall over Kaleb Featherly (Prairie Central Hawks WC) Fall 0:51</li>\n<li>Champ. Round 1 - Arien Hart (Murphysboro WC) won by decision over Nolan Cox (Palatine Panthers WC) Dec 10-5</li>\n<li>Champ. Round 1 - Cody Baldridge (Gilbert Grappling) won by decision over Zachary Haley (Quincy Cyclones Wrestling) Dec 2-1</li>\n<li>Champ. Round 1 - Kendall Coleman (Harvey Twisters WC) won by decision over Jake Meyer (Barrington Broncos WC) Dec 6-4</li>\n<li>Champ. Round 1 - Stone Engle (Moline WC) won by major decision over Sam Blaha (Junior Kahoks) Maj 11-0</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Jimmy Silva (HF Spartan Elite WC) won by decision over Kaden Beeler (Edwardsville WC) Dec 7-2</li>\n<li>Champ. Round 2 - Logan Deacetis (Prairie Central Hawks WC) won by major decision over Colin Dvorak (Stockton Renegades) Maj 13-5</li>\n<li>Champ. Round 2 - Nicky Amato (Izzy Style Wrestling) won by decision over Ronald Kruse (Hinsdale Falcon WC) Dec 7-1</li>\n<li>Champ. Round 2 - Joshua Ramos (Southside Stallions) won by tech fall over Joseph Roberts (Yorkville WC) TF 16-1</li>\n<li>Champ. Round 2 - Juan Bazaldua (Martinez Fox Valley Elite) won by fall over Brandon Laux (Harvey Twisters WC) Fall 0:56</li>\n<li>Champ. Round 2 - Dylan Connell (Crystal Lake Wizards) won by major decision over Collier Neville (Panther Powerhouse Wrestling) Maj 14-0</li>\n<li>Champ. Round 2 - Isaiah Willett (Renegade WC (NFP)) won by decision over Brody Ivey (Sauk Valley WC) Dec 4-1</li>\n<li>Champ. Round 2 - Luke Gardner (Vittum Cats WC) won by decision over George Marre (Gomez Wrestling Academy) Dec 2-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Jacob Dado (Orland Park Pioneers) won by fall over Jacob Saldana (SCN Youth WC) Fall 1:56</li>\n<li>Champ. Round 2 - David Ferrante (Red Raiders Wrestling Team) won by fall over Daemyen Middlebrooks (Little Huskies WC) Fall 0:28</li>\n<li>Champ. Round 2 - Tanner Swain (Vandalia Jr WC) won by decision over Ryan McGeever (Villa-Lombard Cougars) Dec 6-0</li>\n<li>Champ. Round 2 - Dalton Hall (Champaign WC) won by fall over Colin Tracy (Redhawk WC) Fall 0:15</li>\n<li>Champ. Round 2 - John Paul Smith (Bison WC) won by fall over Maxwell Kristoff (Crusaders` Elite) Fall 1:20</li>\n<li>Champ. Round 2 - Chase Clark (Hawk WC) won by decision over Kevin Joy (Tinley Park Bulldogs) Dec 6-3</li>\n<li>Champ. Round 2 - Phillip Sims (Carbondale WC) won by fall over Austin Robinson (Sauk Valley WC) Fall 1:59</li>\n<li>Champ. Round 2 - Fidel Mayora (Bolingbrook Junior Raiders) won by tech fall over Kyle Guttosch (Naperville WC) TF 20-4</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Grant Ripperda (Springfield Capitals Kids WC) won by fall over Brant DeMoss (SCN Youth WC) Fall 4:19</li>\n<li>Champ. Round 2 - Jordan Chisum (Zee-Bee Stingers WC) won by decision over Brandon Kidd (Renegade WC (NFP)) Dec 7-2</li>\n<li>Champ. Round 2 - Devin Wills (Crusaders` Elite) won by decision over Alexander Perez (Hinsdale Falcon WC) Dec 4-2</li>\n<li>Champ. Round 2 - Peter Christensen (Windy City Wrestling of Notre Dame) won in sudden victory - 1 over Eddie Villalobos (Rochelle WC) SV-1 9-7</li>\n<li>Champ. Round 2 - Abe Assad (Gomez Wrestling Academy) won by tech fall over Stephen Bushy (Crystal Lake Wizards) TF 17-1</li>\n<li>Champ. Round 2 - Jayden Terronez (Moline WC) won by decision over Michael Rhodes (Tinley Park Bulldogs) Dec 4-3</li>\n<li>Champ. Round 2 - Johnny Acevedo (Martinez Fox Valley Elite) won by fall over Austin Herkert (Taylorville WC) Fall 0:28</li>\n<li>Champ. Round 2 - Caleb Grau (Crusaders` Elite) won by decision over Ike Papes (Celtic Elite) Dec 5-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Trent Johnson (Scorpion WC) won by fall over Jacob Hefley (Hillsboro Jr Toppers WC) Fall 2:58</li>\n<li>Champ. Round 2 - Benjamin Zalapi (Hononegah WC) won by decision over Mario Leon (Lincoln Way WC) Dec 5-2</li>\n<li>Champ. Round 2 - Elijah Black (The Wrestling Factory) won by fall over Luke Russell (Naperville WC) Fall 1:02</li>\n<li>Champ. Round 2 - Vincent Querciagrossa (Metamora Kids WC) won by decision over Zachary Gleeson (Rochester WC) Dec 4-2</li>\n<li>Champ. Round 2 - Jon Conkrite (Bloomington Raider WC) won by major decision over Zeke Waltz (Jersey Junior Panthers Wrestling) Maj 15-3</li>\n<li>Champ. Round 2 - Anthony Kluk (Oak Forest Warriors) won by fall over Michael Wellman (Villa-Lombard Cougars) Fall 1:27</li>\n<li>Champ. Round 2 - Anthony Glauser (The Wrestling Factory) won by fall over Nick Stemmet (Team No Ego WC) Fall 4:26</li>\n<li>Champ. Round 2 - Brenden Parks (Kaneland Knights WC) won by decision over Andrew Steffes (Brawlers WC) Dec 5-3</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Quintin Hamilton (Evanston School of Wrestling) won by fall over Tristen Burns (Carlinville WC) Fall 4:27</li>\n<li>Champ. Round 2 - Connor Beesing (Xtreme WC) won in tie breaker - 1 over Tyson Heerman (Peoria Razorbacks WC) TB-1 5-4</li>\n<li>Champ. Round 2 - Logan Wilson (Unity Youth WC) won by fall over William Ingraham (Waubonsie WC) Fall 0:50</li>\n<li>Champ. Round 2 - Mustafa St.Clair (Harvey Twisters WC) won by fall over Colton Ingram (Xtreme WC) Fall 0:58</li>\n<li>Champ. Round 2 - River Flute (Road Warriors WC) won by decision over Devin Erickson (Prairie Central Hawks WC) Dec 4-0</li>\n<li>Champ. Round 2 - Ryan Wahrman (Villa-Lombard Cougars) won by decision over Bradley Peters (Cary-Grove Matmen) Dec 7-2</li>\n<li>Champ. Round 2 - Gavin Barton (Downers Grove Cougars WC) won by decision over Dontaice Roberson (Champaign WC) Dec 7-2</li>\n<li>Champ. Round 2 - Trevor Swier (Force WC) won by fall over Jacob Fitzsimmons (Windy City Wrestling of Notre Dame) Fall 0:39</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Brandon Hoselton (Prairie Central Hawks WC) won by decision over Andrew Fetzer (Bison WC) Dec 16-10</li>\n<li>Champ. Round 2 - Brayden Cruz (Pekin Boys &amp; Girls Club) won by fall over Angel Alverio (Crosstown Wrestling) Fall 4:28</li>\n<li>Champ. Round 2 - Drew Dyer (Edwardsville WC) won by decision over Thomas Collins (Vittum Cats WC) Dec 1-0</li>\n<li>Champ. Round 2 - Will Bernstein (Lions WC) won by fall over Vince Clinite (Scorpion WC) Fall 2:48</li>\n<li>Champ. Round 2 - Justin Allen (Dwight WC) won by fall over Donovan Corn (Harvey Twisters WC) Fall 3:32</li>\n<li>Champ. Round 2 - Joshua Crandall (Wolves WC Inc) won by fall over Noah Bellini (Sauk Valley WC) Fall 1:43</li>\n<li>Champ. Round 2 - Jay-cee Randolph-Gonzalez (Izzy Style Wrestling) won by fall over Jalon Nolan-LaGrone (Murphysboro WC) Fall 0:46</li>\n<li>Champ. Round 2 - Drew Gutknecht (Indians Elite) won by decision over Maximus Conn (Hoopeston Youth Wrestling) Dec 3-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Cory Peterson (King Select Wrestling) won by fall over Vince Ochoa (Bolingbrook Junior Raiders) Fall 2:29</li>\n<li>Champ. Round 2 - Jackson Punzel (Naperville WC) won by decision over Gabriel Pierce (Dawgs WC) Dec 7-2</li>\n<li>Champ. Round 2 - Kory McNicholas (Badger WC) won by decision over Grant Daykin (Riverton Youth Wrestling) Dec 10-3</li>\n<li>Champ. Round 2 - Julian Yap (Waukegan Youth WC) won by fall over Brady Andersen (Wolves WC Inc) Fall 4:19</li>\n<li>Champ. Round 2 - Jacob Woodrey (Prairie Central Hawks WC) won by fall over Colten Everman (Fisher WC) Fall 2:42</li>\n<li>Champ. Round 2 - Jiovanni Martinez (Tomcat WC) won by fall over Santos Castillo (Chargers WC) Fall 1:48</li>\n<li>Champ. Round 2 - Anthony Geraci (Headlock Wrestling Academy) won by disqualification over Geno Lukowski (Martinez Fox Valley Elite) DQ</li>\n<li>Champ. Round 2 - Thomas Doyle (Vittum Cats WC) won by fall over Ryan Johnson (Aces WC) Fall 2:28</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Noah Kuligowski (Harlem Cougar WC) won by decision over Mason Baker (O`Fallon Little Panthers WC) Dec 4-1</li>\n<li>Champ. Round 2 - Peyton Hammerich (Tiger Town Tanglers WC) won by major decision over Ethan Torres (Grayslake WC) Maj 13-4</li>\n<li>Champ. Round 2 - Kobe Howard (Renegade WC (NFP)) won by fall over Julian Harshbarger (Carbondale WC) Fall 0:41</li>\n<li>Champ. Round 2 - Joey Alletto (Falcons Elite) won by fall over Quinn Stewart (A &amp; M Youth Wrestling) Fall 0:42</li>\n<li>Champ. Round 2 - Luke Luffman (Champaign WC) won by decision over Sonny Blanco (Morton Little Mustangs) Dec 5-2</li>\n<li>Champ. Round 2 - Jimmy Bartell (Maine Eagles WC) won by fall over Jason Bridgewater (Midwest Central Youth WC) Fall 1:00</li>\n<li>Champ. Round 2 - Bo Meikamp (Edwardsville WC) won by decision over Jaylin Garay (Falcons Elite) Dec 5-4</li>\n<li>Champ. Round 2 - Lawrence Smith (Little Huskies WC) won by fall over Charles Barth (Frankfort Square Wildcats Wrestling) Fall 3:41</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Jalen Lee (Renegade WC (NFP)) won by fall over Samuel Martin (Edwardsville WC) Fall 0:15</li>\n<li>Champ. Round 2 - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Colin Baker (Downers Grove Cougars WC) Fall 0:22</li>\n<li>Champ. Round 2 - Connor Eaton (West Frankfort Jr. Redbirds) won by fall over Joshua Woodrey (Prairie Central Hawks WC) Fall 0:39</li>\n<li>Champ. Round 2 - Cody Goodman (The Wrestling Factory) won by fall over Caden Triplett (Xtreme WC) Fall 4:27</li>\n<li>Champ. Round 2 - Maximus Gomez (Izzy Style Wrestling) won by fall over Derek Freeman (Woodstock Cyclones WC) Fall 2:54</li>\n<li>Champ. Round 2 - David Hardwick (Lancer WC) won by fall over Joseph Passarelli (Downers Grove Cougars WC) Fall 0:55</li>\n<li>Champ. Round 2 - Anthony Enlow (Vandalia Kings) won by fall over Brian Morel (Arlington Cardinals WC) Fall 2:47</li>\n<li>Champ. Round 2 - Donovan Ford (Bolingbrook Junior Raiders) won by fall over Dawson Pruitt (Westville Youth WC) Fall 0:54</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Lucas Korte (Celtic Elite) won by decision over Caleb Guise (Clinton WC) Dec 3-1</li>\n<li>Champ. Round 2 - Brett Puppilo (Elk Grove Junior Grens) won by fall over Paul Fay (Hononegah WC) Fall 2:33</li>\n<li>Champ. Round 2 - Tyler Elsbury (Xtreme WC) won by fall over Jamaal Moore (HF Spartan Elite WC) Fall 1:15</li>\n<li>Champ. Round 2 - Chase Tatum (Tiger Town Tanglers WC) won by fall over Curtis Frazier (Olney Cubs WC) Fall 0:12</li>\n<li>Champ. Round 2 - Keenan Ness (Yorkville WC) won by fall over Craig Weiss (Badger WC) Fall 0:46</li>\n<li>Champ. Round 2 - Michael Dubanowski (Rockets Youth WC) won by fall over Juan Hernandez (Lancer WC) Fall 0:46</li>\n<li>Champ. Round 2 - Braden Johnson (O`Fallon Little Panthers WC) won by fall over James Bowers (Hononegah WC) Fall 1:29</li>\n<li>Champ. Round 2 - Ronald Tucker Jr (Bolingbrook Junior Raiders) won by fall over Nathanyel Jackson (Springfield Capitals Kids WC) Fall 0:34</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Jack Finnegan (Force WC) won by decision over Brandon Burke (Marengo Youth Wrestling) Dec 6-3</li>\n<li>Champ. Round 2 - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Parker Tavares (SCN Youth WC) Dec 10-5</li>\n<li>Champ. Round 2 - Jameir Castleberry (Little Huskies WC) won by fall over Dylan Amico (Plainfield WC) Fall 4:22</li>\n<li>Champ. Round 2 - Colton King (King Select Wrestling) won by decision over Charles Farmer (Moline WC) Dec 5-0</li>\n<li>Champ. Round 2 - Colton Linke (River Bend WC) won by major decision over Hunter Bogwill (Gomez Wrestling Academy) Maj 9-0</li>\n<li>Champ. Round 2 - Daniel Sheen (SCN Youth WC) won in sudden victory - 1 over Jalen May (King Select Wrestling) SV-1 2-0</li>\n<li>Champ. Round 2 - Matthew Minick (King Select Wrestling) won by fall over Carter Hall (Champaign WC) Fall 2:51</li>\n<li>Champ. Round 2 - Samuel Hayes (Contender Wrestling) won by decision over Joel Mylin (Golden Eagles WC) Dec 8-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Jacob Rundell (Little Huskies WC) won by tech fall over Joseph Knapp (Brawlers WC) TF 16-0</li>\n<li>Champ. Round 2 - Ben Lunn (Edwardsville WC) won by fall over Sawyer Nash (Grapplin` Devils WC) Fall 2:23</li>\n<li>Champ. Round 2 - Logan Kuhel-Trimmer (Force WC) won by decision over Grant Peterson (Central Illinois Wrestling Academy) Dec 4-2</li>\n<li>Champ. Round 2 - Diego Sotelo (Martinez Fox Valley Elite) won by fall over Matthew Poniatowski (Windy City Wrestling of Notre Dame) Fall 0:59</li>\n<li>Champ. Round 2 - Justin Cole (Team 1006) won by decision over Jake Doyle (Marengo Youth Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Michael Rodriguez (Southside Stallions) won by major decision over Kai Neumark (Arlington Cardinals WC) Maj 12-4</li>\n<li>Champ. Round 2 - Anterrius Turner (Lionheart Intense Wrestling) won by decision over Alex Randell (Greg Gomez Trained Wrestling) Dec 4-3</li>\n<li>Champ. Round 2 - Jacob Randolph (Celtic Elite) won by fall over David Klein (Mustang WC) Fall 1:02</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Dean Hamiti (Martinez Fox Valley Elite) won by fall over Colton Tay (Panther Youth WC) Fall 1:08</li>\n<li>Champ. Round 2 - Dylan Ragusin (Izzy Style Wrestling) won by fall over Sam Emery (Celtic Elite) Fall 4:01</li>\n<li>Champ. Round 2 - Tristan Daugherty (Central Illinois Wrestling Academy) won by major decision over Brock Pfeifer (Lincoln Way WC) Maj 11-0</li>\n<li>Champ. Round 2 - Noah Surtin (Edwardsville WC) won by fall over Andrew Herbst (Hawk WC) Fall 0:16</li>\n<li>Champ. Round 2 - Peyton Timmons (Red Raiders Wrestling Team) won by decision over Joshua Koderhandt (Crusaders` Elite) Dec 8-3</li>\n<li>Champ. Round 2 - Reese Durlacher (Bison WC) won by decision over Kaeden Kinison (Springfield Capitals Kids WC) Dec 5-3</li>\n<li>Champ. Round 2 - Kyle Schickel (Southside Stallions) won by tech fall over Cameron Clark (Dawgs WC) TF 19-2</li>\n<li>Champ. Round 2 - Cameron Johnson (Martinez Fox Valley Elite) won by major decision over Matthew Ramos (Bolingbrook Junior Raiders) Maj 8-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Alex Villar (Bolingbrook Junior Raiders) won by decision over Dallas Krueger (Moline WC) Dec 8-2</li>\n<li>Champ. Round 2 - Vincent Zerban (King Select Wrestling) won by fall over Kai Conway (Gomez Wrestling Academy) Fall 2:27</li>\n<li>Champ. Round 2 - Denis Murphy (Fox Valley WC) won by decision over Ethen Doty (West Carroll WC) Dec 6-4</li>\n<li>Champ. Round 2 - Joshua Holm (Izzy Style Wrestling) won by fall over Austin McConaha (Champaign WC) Fall 1:02</li>\n<li>Champ. Round 2 - Fabian Lopez (Greg Gomez Trained Wrestling) won by decision over Andrew Lira (Crystal Lake Wizards) Dec 10-4</li>\n<li>Champ. Round 2 - Joel Vandervere (The Wrestling Factory) won by fall over Grant Matarelli (Edwardsville WC) Fall 0:53</li>\n<li>Champ. Round 2 - Jacob Lindsey (Oak Forest Warriors) won by fall over Dayton Hall (Aces WC) Fall 2:11</li>\n<li>Champ. Round 2 - Nicholas Matthias (Celtic Elite) won by tech fall over Luke Barron (Team 1006) TF 16-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Nicholas Bolivar (Gomez Wrestling Academy) won by major decision over Rocco Iannantone (Vittum Cats WC) Maj 13-1</li>\n<li>Champ. Round 2 - Luke Odom (Edwardsville WC) won by decision over Sincere Bailey (Harvey Twisters WC) Dec 6-0</li>\n<li>Champ. Round 2 - Trevor Chumbley (SCN Youth WC) won by decision over Ryan Haynes (Pekin Boys &amp; Girls Club) Dec 7-0</li>\n<li>Champ. Round 2 - Kendall Norfleet (Harvey Twisters WC) won by decision over Kooper Loehr (Mt. Zion Kids WC) Dec 5-1</li>\n<li>Champ. Round 2 - Zeke Marshall (Martinez Fox Valley Elite) won by decision over Cole Watkins (Dawgs WC) Dec 9-4</li>\n<li>Champ. Round 2 - Bryan Smith (Harvey Twisters WC) won by decision over Brendan Mattingly (Edwardsville WC) Dec 5-1</li>\n<li>Champ. Round 2 - Kyle Tunink (Xtreme WC) won by major decision over Michael D`Orazio (St. Charles East WC) Maj 9-0</li>\n<li>Champ. Round 2 - Andrew Baysingar (Arlington Cardinals WC) won by decision over Kaleb Thompson (Bolingbrook Junior Raiders) Dec 2-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Jacob Tinajero (SCN Youth WC) won by decision over Chance Kilcrease (Edwardsville WC) Dec 6-4</li>\n<li>Champ. Round 2 - Domenic Zaccone (Orland Park Pioneers) won by major decision over Keyn Humes (Paxton Youth WC) Maj 11-0</li>\n<li>Champ. Round 2 - Andrew Cervantes (Force WC) won by decision over Leo Mushinsky (Dawgs WC) Dec 2-1</li>\n<li>Champ. Round 2 - Joshua Ogunsanya (Harvey Twisters WC) won by fall over Garrett Bakarich (Triad Little Knights WC) Fall 2:22</li>\n<li>Champ. Round 2 - Ryan Smith (Harvey Twisters WC) won by decision over James Ost (Villa-Lombard Cougars) Dec 4-0</li>\n<li>Champ. Round 2 - Austin Reliford (Carbondale WC) won by fall over Adam Meenen (Sauk Valley WC) Fall 3:05</li>\n<li>Champ. Round 2 - Thomas Egan (Mustang WC) won by decision over John Ridle (Golden Eagles WC) Dec 3-1</li>\n<li>Champ. Round 2 - James Pierandozzi (Bolingbrook Junior Raiders) won by major decision over Andy Posledni (Batavia WC) Maj 15-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Ashton Breen (Bolingbrook Junior Raiders) won by fall over Jacob Wilson (Lil Reaper WC) Fall 3:00</li>\n<li>Champ. Round 2 - Connor Gaynor (Tinley Park Bulldogs) won by fall over Jacob Paradee (A &amp; M Youth Wrestling) Fall 0:58</li>\n<li>Champ. Round 2 - Eddie Bolivar (Gomez Wrestling Academy) won by decision over Jackson Hosman (Celtic Elite) Dec 7-2</li>\n<li>Champ. Round 2 - Gavin Bloom (Hononegah WC) won by fall over Nathan Kisat (A-J Jr. Wildcat Wrestling) Fall 2:28</li>\n<li>Champ. Round 2 - Noah Villarreal (Martinez Fox Valley Elite) won by major decision over Andy Madrigal (Pitbull Wrestling Alliance) Maj 14-1</li>\n<li>Champ. Round 2 - Joel Sarver (Champaign WC) won by decision over Drew Nash (Lemont Bears) Dec 6-3</li>\n<li>Champ. Round 2 - Donnell Washington (Harvey Twisters WC) won by decision over Giovanni Cassioppi (Hononegah WC) Dec 7-0</li>\n<li>Champ. Round 2 - Samuel Wojcik (Vittum Cats WC) won by major decision over Jacob Hendrickson (King Select Wrestling) Maj 9-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Emille Shannon (King Select Wrestling) won by major decision over Tony Heinitz (River Bend WC) Maj 12-4</li>\n<li>Champ. Round 2 - Shawn Brown (Rantoul Junior Eagles) won by decision over Drake Regenhardt (Wolves WC Inc) Dec 5-3</li>\n<li>Champ. Round 2 - Jabari Fitzpatrick (Gomez Wrestling Academy) won by decision over Chandler Gartner (Brawlers WC) Dec 12-8</li>\n<li>Champ. Round 2 - Drake Davis (Illinois Valley Elite Wrestling) won by fall over Jamal Osborne (Harvey Twisters WC) Fall 4:13</li>\n<li>Champ. Round 2 - Daniel Caulfield (Mustang WC) won by fall over Cole Martin (Glenbard East Jr Rams WC) Fall 2:19</li>\n<li>Champ. Round 2 - Kyler Luepkes (Hononegah WC) won by fall over Devin Makemson (Bismarck-Henning WC) Fall 0:51</li>\n<li>Champ. Round 2 - Brad Gross (Sauk Valley WC) won by decision over Kolbi Caffey (Carbondale WC) Dec 6-4</li>\n<li>Champ. Round 2 - Cole Smith (Celtic Elite) won by fall over Peyton Nimsakont (Headlock Wrestling Academy) Fall 0:43</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Marre (Gomez Wrestling Academy) won by fall over Damien Cantrell (Brawlers WC) Fall 1:51</li>\n<li>Champ. Round 2 - We Rachal (Harvey Twisters WC) won by fall over Blaine Riley (Panther Powerhouse Wrestling) Fall 0:58</li>\n<li>Champ. Round 2 - Sam Woodruff (Waubonsie WC) won by decision over Eliseo Zamora (Hoopeston Youth Wrestling) Dec 4-0</li>\n<li>Champ. Round 2 - Trey Piotrowski (Wolves WC Inc) won by decision over Maxx Fritz (Bulls WC) Dec 7-5</li>\n<li>Champ. Round 2 - Danny Braunagel (Crusaders` Elite) won by fall over Cade Slayton (Dakota WC) Fall 3:34</li>\n<li>Champ. Round 2 - Cameron White (Harvey Twisters WC) won by fall over Gavin Johnson (Prairie Central Hawks WC) Fall 1:30</li>\n<li>Champ. Round 2 - Gabriel Castillo (Chargers WC) won by decision over Mateo Portillo (Southside Stallions) Dec 2-1</li>\n<li>Champ. Round 2 - Peter Radev (Vittum Cats WC) won by decision over Kaleb Hartman (West Carroll WC) Dec 5-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Matthew Hennessey (Martinez Fox Valley Elite) won by decision over Jacob Price (Lincoln Way WC) Dec 10-5</li>\n<li>Champ. Round 2 - Alex Harvey (Rochelle WC) won by decision over Peter Schied (Redhawk WC) Dec 5-0</li>\n<li>Champ. Round 2 - Zachary Braunagel (Crusaders` Elite) won by decision over Jonny Halvorsen (Maine Eagles WC) Dec 8-4</li>\n<li>Champ. Round 2 - Drew Hoselton (Prairie Central Hawks WC) won by tech fall over Thomas Parrish (Moline WC) TF 16-0</li>\n<li>Champ. Round 2 - Jesus Cancino (Lawrence County WC) won by fall over Darrell Chisum (Zee-Bee Stingers WC) Fall 0:56</li>\n<li>Champ. Round 2 - Frank Carone (Crystal Lake Wizards) won by decision over Baan Rachal (Harvey Twisters WC) Dec 6-5</li>\n<li>Champ. Round 2 - Aaron Engle (Junior Kahoks) won by decision over Blaize Punke (Central Elite Rebels) Dec 7-0</li>\n<li>Champ. Round 2 - Juwan Robinson (Bolingbrook Junior Raiders) won by fall over Trevor Jones (Martinez Fox Valley Elite) Fall 1:00</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Peyton West (Springfield Capitals Kids WC) won by fall over Joseph Zartuche (HF Spartan Elite WC) Fall 1:45</li>\n<li>Champ. Round 2 - Dan Benoit (Redhawk WC) won by major decision over Austin Rash (River Bend WC) Maj 9-0</li>\n<li>Champ. Round 2 - Jack Bond (Crusaders` Elite) won by fall over Tyler Guerrero (Martinez Fox Valley Elite) Fall 0:32</li>\n<li>Champ. Round 2 - Joseph Saracco (Force WC) won by decision over Dominic Ballano (Hononegah WC) Dec 7-6</li>\n<li>Champ. Round 2 - Martin Krasinski (Crystal Lake Wizards) won by fall over Kevin Joplin (Waukegan Youth WC) Fall 2:01</li>\n<li>Champ. Round 2 - Bryce Rivers (Westville Youth WC) won by decision over Brycen Kellett (LP Crunching Cavs) Dec 14-9</li>\n<li>Champ. Round 2 - Jason Bowman (Champaign WC) won by decision over Lukaz Szudarski (Greg Gomez Trained Wrestling) Dec 6-3</li>\n<li>Champ. Round 2 - Stevie Silva (HF Spartan Elite WC) won by fall over Mark Tucker (Edwardsville WC) Fall 2:01</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Jayleen Fitzpatrick (Gomez Wrestling Academy) won by fall over Yousif Salah (Celtic Elite) Fall 0:51</li>\n<li>Champ. Round 2 - Nick Fetzner (Wolves WC Inc) won by fall over Landen Vesley (Sauk Valley WC) Fall 1:05</li>\n<li>Champ. Round 2 - Bo Neidballa (Falcons Elite) won by fall over Blake Shelton (Oakwood Youth WC) Fall 2:45</li>\n<li>Champ. Round 2 - Drake Jennings (Stillman Valley WC) won by fall over Colin Kestian (Redhawk WC) Fall 0:49</li>\n<li>Champ. Round 2 - Christopher Leanos (Metamora Kids WC) won by fall over Christopher Beebe (Crusaders` Elite) Fall 4:28</li>\n<li>Champ. Round 2 - Elijah Rowe (Stockton Renegades) won by fall over Barrett Beaird (Grayslake WC) Fall 3:17</li>\n<li>Champ. Round 2 - Nate Jimenez (SCN Youth WC) won by fall over Miles Tonielli (Blackhawk WC) Fall 0:35</li>\n<li>Champ. Round 2 - Dylan Butts (Wolfpak WC) won by fall over John Simmelink (Force WC) Fall 0:49</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Ameer Aqel (Vittum Cats WC) won by decision over Alexander Falcon-Hardt (Little Huskies WC) Dec 5-4</li>\n<li>Champ. Round 2 - Cadin Koeppel (Cary-Grove Matmen) won by decision over Ryan Pancamo (Scorpion WC) Dec 7-5</li>\n<li>Champ. Round 2 - Cameron Nicholas (Westville Youth WC) won by fall over Ryan Vedner (Arlington Cardinals WC) Fall 0:41</li>\n<li>Champ. Round 2 - Hunter Holdcraft (LP Crunching Cavs) won by fall over Tyreek Austin (Crusaders` Elite) Fall 2:15</li>\n<li>Champ. Round 2 - Daniel Hileman (Granite City WC) won by fall over Andrew Rucker (Polo WC) Fall 4:18</li>\n<li>Champ. Round 2 - Jack Jessen (Martinez Fox Valley Elite) won by fall over Hunter McAlpine (Seneca Irish Cadets WC) Fall 0:15</li>\n<li>Champ. Round 2 - Izzy Fox (Evanston School of Wrestling) won by decision over Justin Perren (Geneseo Spider WC) Dec 5-0</li>\n<li>Champ. Round 2 - Macario Jaramillo (Force WC) won by major decision over Ryan Dykes (Golden Eagles WC) Maj 12-4</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Carter (Harlem Cougar WC) won by fall over Jacob Luffman (Champaign WC) Fall 2:43</li>\n<li>Champ. Round 2 - Aspen Park (Geneseo Spider WC) won by decision over Bryan Bardel (Lincoln Way WC) Dec 9-7</li>\n<li>Champ. Round 2 - Correy Midgett (East St. Louis Wrestling) won by fall over Troy White (Frankfort Square Wildcats Wrestling) Fall 3:00</li>\n<li>Champ. Round 2 - Tyler Surges (SCN Youth WC) won by major decision over Ryan Doubek (Z`s Team Pena) Maj 14-4</li>\n<li>Champ. Round 2 - Devin O`Rourke (Oak Forest Warriors) won by fall over Maximum Wilson (WW Tigers WC) Fall 1:30</li>\n<li>Champ. Round 2 - Anthony Cassioppi (Hononegah WC) won by fall over Ian Kovach (Granite City WC) Fall 1:03</li>\n<li>Champ. Round 2 - Daron Austin (East Alton Wood River Jr. Oilers) won by fall over Brandon McKimmy (The Wrestling Factory) Fall 4:19</li>\n<li>Champ. Round 2 - Adam Colunga (Hoopeston Youth Wrestling) won by decision over Cole Moore (Force WC) Dec 4-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Zachary Kincade (East Alton Wood River Jr. Oilers) won by fall over Jake Sobun (Celtic Elite) Fall 2:32</li>\n<li>Champ. Round 2 - Sergio Villalobos (Downers Grove Cougars WC) won by fall over Cameron Lee (Metamora Kids WC) Fall 3:59</li>\n<li>Champ. Round 2 - Maxwell McDermott (Little Huskies WC) won by fall over Blake Sayles (Force WC) Fall 1:59</li>\n<li>Champ. Round 2 - Maverick McPeek (Dakota WC) won in overtime over Andrew Sullivan (Maine Eagles WC) OT 3-1</li>\n<li>Champ. Round 2 - Wade Mascari (Bismarck-Henning WC) won by fall over Matthew Hunter (Sycamore WC) Fall 1:04</li>\n<li>Champ. Round 2 - Jace Punke (Central Elite Rebels) won by fall over Cole Mikulait (Edwardsville WC) Fall 1:18</li>\n<li>Champ. Round 2 - Issac Martinez (Pitbull Wrestling Alliance) won by major decision over Edward Fowler (Blackhawk WC) Maj 8-0</li>\n<li>Champ. Round 2 - Logan Anderson (Frankfort Square Wildcats Wrestling) won by fall over Kyle Beasley (Olney Cubs WC) Fall 1:22</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Christoper Flores (Crystal Lake Wizards) won by fall over Daniel Card (Carlinville WC) Fall 2:08</li>\n<li>Champ. Round 2 - Erick Cole (Moline WC) won by decision over Jose Ramos (Arlington Cardinals WC) Dec 5-0</li>\n<li>Champ. Round 2 - Clayton Sheldon (Sparta Junior Bulldogs) won by fall over Noor Mohammad (Tinley Park Bulldogs) Fall 2:10</li>\n<li>Champ. Round 2 - Antonio Huerta (Scorpion WC) won by fall over George Hays (Peoria Razorbacks WC) Fall 1:18</li>\n<li>Champ. Round 2 - Carlos Luna (Blackhawk WC) won by fall over William Hamlin (Unity Youth WC) Fall 1:26</li>\n<li>Champ. Round 2 - Luke Reinhardt (Arlington Cardinals WC) won by fall over Jose Rojas (Lil Bucs WC) Fall 1:23</li>\n<li>Champ. Round 2 - Jimmy Wormsley (Golden Eagles WC) won by fall over Shane White (Vandalia Jr WC) Fall 2:22</li>\n<li>Champ. Round 2 - Taylor Fleetwood (River Bend WC) won by fall over Jeffrey Griffin (HF Spartan Elite WC) Fall 3:28</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Alfred McIntosh (Junior Kahoks) won by decision over Cole Howard (Geneseo Spider WC) Dec 10-6</li>\n<li>Champ. Round 2 - Nicholas Vaccariello (Force WC) won by decision over Logan Meyer (Falcons Elite) Dec 2-0</li>\n<li>Champ. Round 2 - Cody Miller (Bismarck-Henning WC) won by fall over Joey Beaudoin (Sycamore WC) Fall 2:51</li>\n<li>Champ. Round 2 - Brandon Reyes (Calumet Memorial PD Wolverines) won by fall over Ethan Tran (Grayslake WC) Fall 1:15</li>\n<li>Champ. Round 2 - Abiel Horta (Badger WC) won by fall over Isaiah Brock (Fenton/BBAA Jr Bison WC) Fall 4:10</li>\n<li>Champ. Round 2 - Michael Weber (Edwardsville WC) won by fall over Justin Trotter (Glenbard East Jr Rams WC) Fall 0:23</li>\n<li>Champ. Round 2 - Noah Laney (Crystal Lake Wizards) won in overtime over Zachary Bee (Prairie Central Hawks WC) OT 2-1</li>\n<li>Champ. Round 2 - Shane Raber (Force WC) won by fall over Kody Brower (Rocket Fuel WC) Fall 3:30</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Christian Goin (Central Elite Rebels) won by fall over Anthony King (East St. Louis Wrestling) Fall 1:48</li>\n<li>Champ. Round 2 - Enzo Silva (Martinez Fox Valley Elite) won by fall over Miles Trahey (Orland Park Pioneers) Fall 1:02</li>\n<li>Champ. Round 2 - Anthony Molton (Will County Warriors) won by decision over Noah Paul (Polo WC) Dec 2-0</li>\n<li>Champ. Round 2 - Anthony Schickel (Southside Stallions) won by fall over Brenden Kaminscky (The Wrestling Factory) Fall 0:20</li>\n<li>Champ. Round 2 - Aaron Zebrauskas (Southside Stallions) won by fall over Josh Bess (Maine Eagles WC) Fall 2:41</li>\n<li>Champ. Round 2 - Chad Schap (Sycamore WC) won by decision over Dylan Wright (Edwardsville WC) Dec 8-3</li>\n<li>Champ. Round 2 - Justin Cardani (Champaign WC) won by major decision over Justin Montani (Crystal Lake Wizards) Maj 8-0</li>\n<li>Champ. Round 2 - Christopher Kennedy (Celtic Elite) won by decision over Mark Guerrero (St. Charles East WC) Dec 4-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Landen Pfeiffer (Crystal Lake Wizards) won by fall over Vincent Rink (Brawlers WC) Fall 3:33</li>\n<li>Champ. Round 2 - Joey Melendez (Izzy Style Wrestling) won by decision over Nathan Callaway (Team No Ego WC) Dec 8-5</li>\n<li>Champ. Round 2 - Travis Ford-Melton (Harvey Twisters WC) won by tech fall over Brody Powell (Hoopeston Youth Wrestling) TF 19-2</li>\n<li>Champ. Round 2 - Michael Jaffe (SCN Youth WC) won in overtime over Jackson O`Leary (Edwardsville WC) OT 4-2</li>\n<li>Champ. Round 2 - Lucas Schevikhoven (Lakeland Predators WC) won by major decision over Harley Kent (Western Illinois All-Stars) Maj 13-0</li>\n<li>Champ. Round 2 - Ryan Fleck (SCN Youth WC) won by fall over William Hillard (Triad Little Knights WC) Fall 2:29</li>\n<li>Champ. Round 2 - Anthony Turner (Lionheart Intense Wrestling) won by decision over Patrick Bracken (Mustang WC) Dec 7-0</li>\n<li>Champ. Round 2 - Alex Giuliano (Izzy Style Wrestling) won by decision over Noah Bickett (Plainfield WC) Dec 12-6</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Austin Rudsinski (Lincoln Way WC) won by decision over Shawn Sparacino (Southside Stallions) Dec 3-1</li>\n<li>Champ. Round 2 - Zachary Williard (Carbondale WC) won by fall over Anthony Greco (Shamrock WC) Fall 0:19</li>\n<li>Champ. Round 2 - Anthony Talamonti (HF Spartan Elite WC) won by decision over Tyler Fleetwood (River Bend WC) Dec 7-3</li>\n<li>Champ. Round 2 - Nico Nunez (Martinez Fox Valley Elite) won by major decision over Steven-o`neil Swanson (Crystal Lake Wizards) Maj 11-0</li>\n<li>Champ. Round 2 - Dylan Martin (Crusaders` Elite) won by decision over Cameron Miller (Marengo Youth Wrestling) Dec 7-2</li>\n<li>Champ. Round 2 - Nathan Cummings (Gomez Wrestling Academy) won by decision over Justin Benjamin (SCN Youth WC) Dec 8-5</li>\n<li>Champ. Round 2 - Ezra Elliott (Hoopeston Youth Wrestling) won by decision over Tyler Podnar (Falcons Elite) Dec 6-5</li>\n<li>Champ. Round 2 - Dylan Burnoski (Bolingbrook Junior Raiders) won by major decision over Jacob Abeja (Tinley Park Bulldogs) Maj 8-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Gannon Hughes (Team No Ego WC) won by fall over Cameren Carver (Charleston WC) Fall 0:46</li>\n<li>Champ. Round 2 - Ben Emery (Celtic Elite) won by decision over Joey Bianchini (Izzy Style Wrestling) Dec 6-1</li>\n<li>Champ. Round 2 - Tyler Krause (Bolingbrook Junior Raiders) won by fall over Hunter Wilde (Chargers WC) Fall 0:47</li>\n<li>Champ. Round 2 - Garrett Bass (King Select Wrestling) won by major decision over Anthony Schaer (Wolves WC Inc) Maj 13-1</li>\n<li>Champ. Round 2 - Tyler Lane (Crystal Lake Wizards) won by decision over Benjamin Anderson (SCN Youth WC) Dec 2-0</li>\n<li>Champ. Round 2 - David Spencer (Champaign WC) won in sudden victory - 1 over Jackson Lingle (Izzy Style Wrestling) SV-1 5-3</li>\n<li>Champ. Round 2 - Tommy Russell (Southside Stallions) won by decision over Trenton Finch (King Select Wrestling) Dec 6-2</li>\n<li>Champ. Round 2 - Moises Rivera (Waukegan Youth WC) won by decision over Pat Nolan (Orland Park Pioneers) Dec 4-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Isaac Martinez (Moline WC) won by decision over Zachary McDowell (Celtic Elite) Dec 8-7</li>\n<li>Champ. Round 2 - Patrick Daum (SCN Youth WC) won by fall over Logan Johnson (King Select Wrestling) Fall 3:24</li>\n<li>Champ. Round 2 - Dylan Doranski (Batavia WC) won by decision over Riley Palm (Crystal Lake Wizards) Dec 12-8</li>\n<li>Champ. Round 2 - Joseph Egan (Mustang WC) won by fall over Mason McBride (Westville Youth WC) Fall 2:46</li>\n<li>Champ. Round 2 - Sean McKenna (Martinez Fox Valley Elite) won by fall over Mason Schewe (Hononegah WC) Fall 0:25</li>\n<li>Champ. Round 2 - Jake Stiles (Izzy Style Wrestling) won by major decision over Kody Cavender (Harrisburg Junior Bulldogs) Maj 9-0</li>\n<li>Champ. Round 2 - Hassan Johnson (Harvey Twisters WC) won by decision over Jaleen Yancey (Edwardsville WC) Dec 8-3</li>\n<li>Champ. Round 2 - Austin Nagel (Vittum Cats WC) won by decision over Jacob White (Dawgs WC) Dec 8-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Timothy Houston (Tinley Park Bulldogs) won by decision over Christian Puente (Z`s Team Pena) Dec 7-1</li>\n<li>Champ. Round 2 - Payton Pulliam (Pontiac WC) won by fall over Jarrett Paslay (Vandalia Jr WC) Fall 3:49</li>\n<li>Champ. Round 2 - Jonathan Mitchell (Little Huskies WC) won in overtime over Malachi Grimm (Hinsdale Falcon WC) OT 9-7</li>\n<li>Champ. Round 2 - Will Lewan (Izzy Style Wrestling) won by fall over Adam McDowell (Celtic Elite) Fall 1:22</li>\n<li>Champ. Round 2 - Jacob Holm (Izzy Style Wrestling) won by fall over Jared Head (Dawgs WC) Fall 3:40</li>\n<li>Champ. Round 2 - Ryan Chambers (Murphysboro WC) won by decision over Jarrett Kinney (Hononegah WC) Dec 5-4</li>\n<li>Champ. Round 2 - Anthony Madrigal (Little Huskies WC) won by fall over Patrick Ryan (North Shore Edge) Fall 2:26</li>\n<li>Champ. Round 2 - Lucas Van Poucke (Force WC) won in overtime over Gabriel Berta (Berta Wrestling Academy) OT 2-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Matthew Ortiz (Martinez Fox Valley Elite) won by fall over Dylan Davidson (King Select Wrestling) Fall 4:30</li>\n<li>Champ. Round 2 - Ren Dazey (Champaign WC) won by major decision over Brian Madrigal (Pitbull Wrestling Alliance) Maj 11-2</li>\n<li>Champ. Round 2 - Tyler Delaware (Dawgs WC) won by decision over Brock Montford (Red Raiders Wrestling Team) Dec 6-3</li>\n<li>Champ. Round 2 - Robert Precin (Tinley Park Bulldogs) won by decision over Austin Macias (Izzy Style Wrestling) Dec 3-2</li>\n<li>Champ. Round 2 - Markus Hartman (Barrington Broncos WC) won by fall over Ja`Chun Smith (Little Huskies WC) Fall 0:41</li>\n<li>Champ. Round 2 - Patrick Grzywacz (Junior Kahoks) won by decision over Christopher Whaley (Springfield Capitals Kids WC) Dec 5-0</li>\n<li>Champ. Round 2 - Casey Allen (Crystal Lake Wizards) won by decision over Paul Gliva (Southside Stallions) Dec 4-0</li>\n<li>Champ. Round 2 - Peter Ferraro (SCN Youth WC) won by major decision over Raymond Dean (Force WC) Maj 12-4</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Brett Hammel (West Hancock WC) won by decision over Austin Ernd (Crystal Lake Wizards) Dec 7-1</li>\n<li>Champ. Round 2 - Bilal Bailey (Harvey Twisters WC) won by decision over Nicholas Piaskowy (SCN Youth WC) Dec 4-1</li>\n<li>Champ. Round 2 - Michael Womeldorf (Pitbull Wrestling Alliance) won by decision over Jackson O`Reilly (Team No Ego WC) Dec 4-3</li>\n<li>Champ. Round 2 - Alex Zacharuk (Harlem Cougar WC) won by fall over Francesco Romano (Edwardsville WC) Fall 2:37</li>\n<li>Champ. Round 2 - Niko Derain (Martinez Fox Valley Elite) won by major decision over Arien Hart (Murphysboro WC) Maj 11-2</li>\n<li>Champ. Round 2 - Cody Baldridge (Gilbert Grappling) won by decision over Peter McCusker (Rantoul Junior Eagles) Dec 5-3</li>\n<li>Champ. Round 2 - Jared Van Vleet (Stillman Valley WC) won by decision over Kendall Coleman (Harvey Twisters WC) Dec 6-0</li>\n<li>Champ. Round 2 - Baylor Fernandes (Bolingbrook Junior Raiders) won by decision over Stone Engle (Moline WC) Dec 4-1</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Logan Deacetis (Prairie Central Hawks WC) won by decision over Jimmy Silva (HF Spartan Elite WC) Dec 1-0</li>\n<li>Quarterfinal - Joshua Ramos (Southside Stallions) won by decision over Nicky Amato (Izzy Style Wrestling) Dec 4-0</li>\n<li>Quarterfinal - Juan Bazaldua (Martinez Fox Valley Elite) won by major decision over Dylan Connell (Crystal Lake Wizards) Maj 11-1</li>\n<li>Quarterfinal - Isaiah Willett (Renegade WC (NFP)) won by decision over Luke Gardner (Vittum Cats WC) Dec 10-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - David Ferrante (Red Raiders Wrestling Team) won by decision over Jacob Dado (Orland Park Pioneers) Dec 7-1</li>\n<li>Quarterfinal - Dalton Hall (Champaign WC) won by decision over Tanner Swain (Vandalia Jr WC) Dec 3-0</li>\n<li>Quarterfinal - John Paul Smith (Bison WC) won by fall over Chase Clark (Hawk WC) Fall 0:50</li>\n<li>Quarterfinal - Fidel Mayora (Bolingbrook Junior Raiders) won by major decision over Phillip Sims (Carbondale WC) Maj 11-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Jordan Chisum (Zee-Bee Stingers WC) won in sudden victory - 1 over Grant Ripperda (Springfield Capitals Kids WC) SV-1 8-6</li>\n<li>Quarterfinal - Peter Christensen (Windy City Wrestling of Notre Dame) won by decision over Devin Wills (Crusaders` Elite) Dec 5-3</li>\n<li>Quarterfinal - Abe Assad (Gomez Wrestling Academy) won by tech fall over Jayden Terronez (Moline WC) TF 16-1</li>\n<li>Quarterfinal - Johnny Acevedo (Martinez Fox Valley Elite) won by decision over Caleb Grau (Crusaders` Elite) Dec 5-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Benjamin Zalapi (Hononegah WC) won by decision over Trent Johnson (Scorpion WC) Dec 5-1</li>\n<li>Quarterfinal - Elijah Black (The Wrestling Factory) won by fall over Vincent Querciagrossa (Metamora Kids WC) Fall 2:28</li>\n<li>Quarterfinal - Anthony Kluk (Oak Forest Warriors) won by fall over Jon Conkrite (Bloomington Raider WC) Fall 1:04</li>\n<li>Quarterfinal - Anthony Glauser (The Wrestling Factory) won by tech fall over Brenden Parks (Kaneland Knights WC) TF 16-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Quintin Hamilton (Evanston School of Wrestling) won by fall over Connor Beesing (Xtreme WC) Fall 1:05</li>\n<li>Quarterfinal - Mustafa St.Clair (Harvey Twisters WC) won by decision over Logan Wilson (Unity Youth WC) Dec 10-6</li>\n<li>Quarterfinal - Ryan Wahrman (Villa-Lombard Cougars) won by tech fall over River Flute (Road Warriors WC) TF 16-0</li>\n<li>Quarterfinal - Trevor Swier (Force WC) won by fall over Gavin Barton (Downers Grove Cougars WC) Fall 0:57</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Brandon Hoselton (Prairie Central Hawks WC) won in tie breaker - 1 over Brayden Cruz (Pekin Boys &amp; Girls Club) TB-1 6-4</li>\n<li>Quarterfinal - Will Bernstein (Lions WC) won by fall over Drew Dyer (Edwardsville WC) Fall 3:41</li>\n<li>Quarterfinal - Justin Allen (Dwight WC) won by fall over Joshua Crandall (Wolves WC Inc) Fall 2:32</li>\n<li>Quarterfinal - Jay-cee Randolph-Gonzalez (Izzy Style Wrestling) won by fall over Drew Gutknecht (Indians Elite) Fall 1:55</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Cory Peterson (King Select Wrestling) won by major decision over Jackson Punzel (Naperville WC) Maj 9-0</li>\n<li>Quarterfinal - Julian Yap (Waukegan Youth WC) won by decision over Kory McNicholas (Badger WC) Dec 4-0</li>\n<li>Quarterfinal - Jiovanni Martinez (Tomcat WC) won by fall over Jacob Woodrey (Prairie Central Hawks WC) Fall 2:40</li>\n<li>Quarterfinal - Thomas Doyle (Vittum Cats WC) won by injury default over Anthony Geraci (Headlock Wrestling Academy) Inj. 3:31</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Peyton Hammerich (Tiger Town Tanglers WC) won by major decision over Noah Kuligowski (Harlem Cougar WC) Maj 12-3</li>\n<li>Quarterfinal - Kobe Howard (Renegade WC (NFP)) won by decision over Joey Alletto (Falcons Elite) Dec 13-8</li>\n<li>Quarterfinal - Luke Luffman (Champaign WC) won by decision over Jimmy Bartell (Maine Eagles WC) Dec 5-0</li>\n<li>Quarterfinal - Bo Meikamp (Edwardsville WC) won by decision over Lawrence Smith (Little Huskies WC) Dec 12-8</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Jalen Lee (Renegade WC (NFP)) won by major decision over Jacob Kaminski (Martinez Fox Valley Elite) Maj 13-4</li>\n<li>Quarterfinal - Connor Eaton (West Frankfort Jr. Redbirds) won by decision over Cody Goodman (The Wrestling Factory) Dec 6-0</li>\n<li>Quarterfinal - David Hardwick (Lancer WC) won by decision over Maximus Gomez (Izzy Style Wrestling) Dec 5-2</li>\n<li>Quarterfinal - Donovan Ford (Bolingbrook Junior Raiders) won by decision over Anthony Enlow (Vandalia Kings) Dec 2-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Lucas Korte (Celtic Elite) won by decision over Brett Puppilo (Elk Grove Junior Grens) Dec 1-0</li>\n<li>Quarterfinal - Chase Tatum (Tiger Town Tanglers WC) won by fall over Tyler Elsbury (Xtreme WC) Fall 1:45</li>\n<li>Quarterfinal - Keenan Ness (Yorkville WC) won by fall over Michael Dubanowski (Rockets Youth WC) Fall 2:41</li>\n<li>Quarterfinal - Ronald Tucker Jr (Bolingbrook Junior Raiders) won by fall over Braden Johnson (O`Fallon Little Panthers WC) Fall 2:19</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Jack Finnegan (Force WC) won by major decision over Nicholas Gonzalez (Gomez Wrestling Academy) Maj 12-2</li>\n<li>Quarterfinal - Jameir Castleberry (Little Huskies WC) won by major decision over Colton King (King Select Wrestling) Maj 9-0</li>\n<li>Quarterfinal - Daniel Sheen (SCN Youth WC) won by major decision over Colton Linke (River Bend WC) Maj 11-3</li>\n<li>Quarterfinal - Samuel Hayes (Contender Wrestling) won by decision over Matthew Minick (King Select Wrestling) Dec 5-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Jacob Rundell (Little Huskies WC) won by decision over Ben Lunn (Edwardsville WC) Dec 7-0</li>\n<li>Quarterfinal - Diego Sotelo (Martinez Fox Valley Elite) won by tech fall over Logan Kuhel-Trimmer (Force WC) TF 16-1</li>\n<li>Quarterfinal - Michael Rodriguez (Southside Stallions) won by injury default over Justin Cole (Team 1006) Inj. 2:15</li>\n<li>Quarterfinal - Jacob Randolph (Celtic Elite) won by major decision over Anterrius Turner (Lionheart Intense Wrestling) Maj 14-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Dylan Ragusin (Izzy Style Wrestling) won by decision over Dean Hamiti (Martinez Fox Valley Elite) Dec 16-9</li>\n<li>Quarterfinal - Noah Surtin (Edwardsville WC) won by decision over Tristan Daugherty (Central Illinois Wrestling Academy) Dec 4-2</li>\n<li>Quarterfinal - Reese Durlacher (Bison WC) won by decision over Peyton Timmons (Red Raiders Wrestling Team) Dec 5-4</li>\n<li>Quarterfinal - Cameron Johnson (Martinez Fox Valley Elite) won in overtime over Kyle Schickel (Southside Stallions) OT 5-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Vincent Zerban (King Select Wrestling) won by decision over Alex Villar (Bolingbrook Junior Raiders) Dec 5-2</li>\n<li>Quarterfinal - Denis Murphy (Fox Valley WC) won by fall over Joshua Holm (Izzy Style Wrestling) Fall 2:23</li>\n<li>Quarterfinal - Fabian Lopez (Greg Gomez Trained Wrestling) won by major decision over Joel Vandervere (The Wrestling Factory) Maj 8-0</li>\n<li>Quarterfinal - Nicholas Matthias (Celtic Elite) won by fall over Jacob Lindsey (Oak Forest Warriors) Fall 3:49</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Luke Odom (Edwardsville WC) won by decision over Nicholas Bolivar (Gomez Wrestling Academy) Dec 5-0</li>\n<li>Quarterfinal - Trevor Chumbley (SCN Youth WC) won by decision over Kendall Norfleet (Harvey Twisters WC) Dec 4-0</li>\n<li>Quarterfinal - Bryan Smith (Harvey Twisters WC) won by major decision over Zeke Marshall (Martinez Fox Valley Elite) Maj 11-3</li>\n<li>Quarterfinal - Andrew Baysingar (Arlington Cardinals WC) won by decision over Kyle Tunink (Xtreme WC) Dec 6-3</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Domenic Zaccone (Orland Park Pioneers) won by decision over Jacob Tinajero (SCN Youth WC) Dec 4-1</li>\n<li>Quarterfinal - Joshua Ogunsanya (Harvey Twisters WC) won by major decision over Andrew Cervantes (Force WC) Maj 19-6</li>\n<li>Quarterfinal - Ryan Smith (Harvey Twisters WC) won by decision over Austin Reliford (Carbondale WC) Dec 5-1</li>\n<li>Quarterfinal - James Pierandozzi (Bolingbrook Junior Raiders) won by fall over Thomas Egan (Mustang WC) Fall 2:22</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Connor Gaynor (Tinley Park Bulldogs) won by decision over Ashton Breen (Bolingbrook Junior Raiders) Dec 6-0</li>\n<li>Quarterfinal - Eddie Bolivar (Gomez Wrestling Academy) won by tech fall over Gavin Bloom (Hononegah WC) TF 17-1</li>\n<li>Quarterfinal - Noah Villarreal (Martinez Fox Valley Elite) won by tech fall over Joel Sarver (Champaign WC) TF 16-0</li>\n<li>Quarterfinal - Donnell Washington (Harvey Twisters WC) won by decision over Samuel Wojcik (Vittum Cats WC) Dec 8-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Emille Shannon (King Select Wrestling) won by major decision over Shawn Brown (Rantoul Junior Eagles) Maj 13-3</li>\n<li>Quarterfinal - Jabari Fitzpatrick (Gomez Wrestling Academy) won by decision over Drake Davis (Illinois Valley Elite Wrestling) Dec 3-2</li>\n<li>Quarterfinal - Kyler Luepkes (Hononegah WC) won by fall over Daniel Caulfield (Mustang WC) Fall 3:37</li>\n<li>Quarterfinal - Cole Smith (Celtic Elite) won by fall over Brad Gross (Sauk Valley WC) Fall 1:30</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - We Rachal (Harvey Twisters WC) won by decision over Anthony Marre (Gomez Wrestling Academy) Dec 9-5</li>\n<li>Quarterfinal - Trey Piotrowski (Wolves WC Inc) won by decision over Sam Woodruff (Waubonsie WC) Dec 7-4</li>\n<li>Quarterfinal - Danny Braunagel (Crusaders` Elite) won by fall over Cameron White (Harvey Twisters WC) Fall 3:19</li>\n<li>Quarterfinal - Peter Radev (Vittum Cats WC) won by tech fall over Gabriel Castillo (Chargers WC) TF 17-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Alex Harvey (Rochelle WC) won by decision over Matthew Hennessey (Martinez Fox Valley Elite) Dec 4-0</li>\n<li>Quarterfinal - Drew Hoselton (Prairie Central Hawks WC) won by fall over Zachary Braunagel (Crusaders` Elite) Fall 4:14</li>\n<li>Quarterfinal - Frank Carone (Crystal Lake Wizards) won by decision over Jesus Cancino (Lawrence County WC) Dec 8-4</li>\n<li>Quarterfinal - Juwan Robinson (Bolingbrook Junior Raiders) won by decision over Aaron Engle (Junior Kahoks) Dec 4-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Peyton West (Springfield Capitals Kids WC) won by decision over Dan Benoit (Redhawk WC) Dec 6-5</li>\n<li>Quarterfinal - Jack Bond (Crusaders` Elite) won by major decision over Joseph Saracco (Force WC) Maj 13-3</li>\n<li>Quarterfinal - Martin Krasinski (Crystal Lake Wizards) won by decision over Bryce Rivers (Westville Youth WC) Dec 4-2</li>\n<li>Quarterfinal - Stevie Silva (HF Spartan Elite WC) won by major decision over Jason Bowman (Champaign WC) Maj 9-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Jayleen Fitzpatrick (Gomez Wrestling Academy) won by decision over Nick Fetzner (Wolves WC Inc) Dec 10-8</li>\n<li>Quarterfinal - Drake Jennings (Stillman Valley WC) won by decision over Bo Neidballa (Falcons Elite) Dec 7-4</li>\n<li>Quarterfinal - Elijah Rowe (Stockton Renegades) won by fall over Christopher Leanos (Metamora Kids WC) Fall 4:23</li>\n<li>Quarterfinal - Nate Jimenez (SCN Youth WC) won by fall over Dylan Butts (Wolfpak WC) Fall 1:16</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Cadin Koeppel (Cary-Grove Matmen) won by fall over Ameer Aqel (Vittum Cats WC) Fall 2:25</li>\n<li>Quarterfinal - Cameron Nicholas (Westville Youth WC) won by fall over Hunter Holdcraft (LP Crunching Cavs) Fall 2:19</li>\n<li>Quarterfinal - Jack Jessen (Martinez Fox Valley Elite) won by fall over Daniel Hileman (Granite City WC) Fall 0:49</li>\n<li>Quarterfinal - Macario Jaramillo (Force WC) won by decision over Izzy Fox (Evanston School of Wrestling) Dec 6-4</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Joshua Carter (Harlem Cougar WC) won by major decision over Aspen Park (Geneseo Spider WC) Maj 11-2</li>\n<li>Quarterfinal - Tyler Surges (SCN Youth WC) won by decision over Correy Midgett (East St. Louis Wrestling) Dec 3-1</li>\n<li>Quarterfinal - Anthony Cassioppi (Hononegah WC) won by injury default over Devin O`Rourke (Oak Forest Warriors) Inj. 3:27</li>\n<li>Quarterfinal - Daron Austin (East Alton Wood River Jr. Oilers) won by decision over Adam Colunga (Hoopeston Youth Wrestling) Dec 3-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Sergio Villalobos (Downers Grove Cougars WC) won by fall over Zachary Kincade (East Alton Wood River Jr. Oilers) Fall 2:59</li>\n<li>Quarterfinal - Maverick McPeek (Dakota WC) won by decision over Maxwell McDermott (Little Huskies WC) Dec 6-0</li>\n<li>Quarterfinal - Wade Mascari (Bismarck-Henning WC) won by fall over Jace Punke (Central Elite Rebels) Fall 4:04</li>\n<li>Quarterfinal - Logan Anderson (Frankfort Square Wildcats Wrestling) won by fall over Issac Martinez (Pitbull Wrestling Alliance) Fall 0:13</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Erick Cole (Moline WC) won by decision over Christoper Flores (Crystal Lake Wizards) Dec 7-3</li>\n<li>Quarterfinal - Antonio Huerta (Scorpion WC) won by fall over Clayton Sheldon (Sparta Junior Bulldogs) Fall 2:53</li>\n<li>Quarterfinal - Luke Reinhardt (Arlington Cardinals WC) won by fall over Carlos Luna (Blackhawk WC) Fall 2:36</li>\n<li>Quarterfinal - Taylor Fleetwood (River Bend WC) won in overtime over Jimmy Wormsley (Golden Eagles WC) OT 3-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Alfred McIntosh (Junior Kahoks) won by decision over Nicholas Vaccariello (Force WC) Dec 5-2</li>\n<li>Quarterfinal - Cody Miller (Bismarck-Henning WC) won by fall over Brandon Reyes (Calumet Memorial PD Wolverines) Fall 2:07</li>\n<li>Quarterfinal - Abiel Horta (Badger WC) won by decision over Michael Weber (Edwardsville WC) Dec 3-2</li>\n<li>Quarterfinal - Shane Raber (Force WC) won by fall over Noah Laney (Crystal Lake Wizards) Fall 3:15</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Christian Goin (Central Elite Rebels) won by decision over Enzo Silva (Martinez Fox Valley Elite) Dec 6-0</li>\n<li>Quarterfinal - Anthony Schickel (Southside Stallions) won by decision over Anthony Molton (Will County Warriors) Dec 4-1</li>\n<li>Quarterfinal - Aaron Zebrauskas (Southside Stallions) won by tech fall over Chad Schap (Sycamore WC) TF 16-0</li>\n<li>Quarterfinal - Justin Cardani (Champaign WC) won in double overtime over Christopher Kennedy (Celtic Elite) 2-OT 3-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Joey Melendez (Izzy Style Wrestling) won by tech fall over Landen Pfeiffer (Crystal Lake Wizards) TF 16-0</li>\n<li>Quarterfinal - Travis Ford-Melton (Harvey Twisters WC) won by major decision over Michael Jaffe (SCN Youth WC) Maj 16-6</li>\n<li>Quarterfinal - Ryan Fleck (SCN Youth WC) won by decision over Lucas Schevikhoven (Lakeland Predators WC) Dec 7-5</li>\n<li>Quarterfinal - Anthony Turner (Lionheart Intense Wrestling) won by decision over Alex Giuliano (Izzy Style Wrestling) Dec 7-6</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Austin Rudsinski (Lincoln Way WC) won by decision over Zachary Williard (Carbondale WC) Dec 8-2</li>\n<li>Quarterfinal - Anthony Talamonti (HF Spartan Elite WC) won by decision over Nico Nunez (Martinez Fox Valley Elite) Dec 2-1</li>\n<li>Quarterfinal - Nathan Cummings (Gomez Wrestling Academy) won by decision over Dylan Martin (Crusaders` Elite) Dec 7-5</li>\n<li>Quarterfinal - Dylan Burnoski (Bolingbrook Junior Raiders) won by fall over Ezra Elliott (Hoopeston Youth Wrestling) Fall 2:30</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Gannon Hughes (Team No Ego WC) won by decision over Ben Emery (Celtic Elite) Dec 6-4</li>\n<li>Quarterfinal - Garrett Bass (King Select Wrestling) won by fall over Tyler Krause (Bolingbrook Junior Raiders) Fall 2:58</li>\n<li>Quarterfinal - David Spencer (Champaign WC) won by decision over Tyler Lane (Crystal Lake Wizards) Dec 5-4</li>\n<li>Quarterfinal - Moises Rivera (Waukegan Youth WC) won by major decision over Tommy Russell (Southside Stallions) Maj 11-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Patrick Daum (SCN Youth WC) won by decision over Isaac Martinez (Moline WC) Dec 4-1</li>\n<li>Quarterfinal - Joseph Egan (Mustang WC) won by decision over Dylan Doranski (Batavia WC) Dec 7-1</li>\n<li>Quarterfinal - Sean McKenna (Martinez Fox Valley Elite) won by decision over Jake Stiles (Izzy Style Wrestling) Dec 2-1</li>\n<li>Quarterfinal - Hassan Johnson (Harvey Twisters WC) won in double overtime over Austin Nagel (Vittum Cats WC) 2-OT 3-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Payton Pulliam (Pontiac WC) won by fall over Timothy Houston (Tinley Park Bulldogs) Fall 4:12</li>\n<li>Quarterfinal - Will Lewan (Izzy Style Wrestling) won by fall over Jonathan Mitchell (Little Huskies WC) Fall 1:03</li>\n<li>Quarterfinal - Jacob Holm (Izzy Style Wrestling) won by decision over Ryan Chambers (Murphysboro WC) Dec 5-0</li>\n<li>Quarterfinal - Anthony Madrigal (Little Huskies WC) won by major decision over Lucas Van Poucke (Force WC) Maj 9-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Matthew Ortiz (Martinez Fox Valley Elite) won by decision over Ren Dazey (Champaign WC) Dec 6-3</li>\n<li>Quarterfinal - Robert Precin (Tinley Park Bulldogs) won by decision over Tyler Delaware (Dawgs WC) Dec 9-2</li>\n<li>Quarterfinal - Markus Hartman (Barrington Broncos WC) won by tech fall over Patrick Grzywacz (Junior Kahoks) TF 16-0</li>\n<li>Quarterfinal - Peter Ferraro (SCN Youth WC) won by major decision over Casey Allen (Crystal Lake Wizards) Maj 9-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Brett Hammel (West Hancock WC) won by decision over Bilal Bailey (Harvey Twisters WC) Dec 1-0</li>\n<li>Quarterfinal - Alex Zacharuk (Harlem Cougar WC) won by decision over Michael Womeldorf (Pitbull Wrestling Alliance) Dec 5-4</li>\n<li>Quarterfinal - Cody Baldridge (Gilbert Grappling) won by decision over Niko Derain (Martinez Fox Valley Elite) Dec 5-2</li>\n<li>Quarterfinal - Baylor Fernandes (Bolingbrook Junior Raiders) won by decision over Jared Van Vleet (Stillman Valley WC) Dec 6-2</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Colin Dvorak (Stockton Renegades) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joseph Roberts (Yorkville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon Laux (Harvey Twisters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brody Ivey (Sauk Valley WC) won by decision over Jack Evans (Edwardsville WC) Dec 6-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Daemyen Middlebrooks (Little Huskies WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colin Tracy (Redhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Maxwell Kristoff (Crusaders` Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Guttosch (Naperville WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Zachary Katula (Yorkville WC) won by major decision over Brandon Kidd (Renegade WC (NFP)) Maj 8-0</li>\n<li>Cons. Round 1 - Eddie Villalobos (Rochelle WC) won by fall over Gustave Christensen (Lincoln Way WC) Fall 2:14</li>\n<li>Cons. Round 1 - Stephen Bushy (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Herkert (Taylorville WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Mario Leon (Lincoln Way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Luke Russell (Naperville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Wellman (Villa-Lombard Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nick Stemmet (Team No Ego WC) won by fall over Ke`shawn Hess (Peoria Razorbacks WC) Fall 1:05</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Tristen Burns (Carlinville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colton Ingram (Xtreme WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bradley Peters (Cary-Grove Matmen) won in sudden victory - 1 over Gianfranco Montalto (Lemont Bears) SV-1 5-3</li>\n<li>Cons. Round 1 - Jacob Fitzsimmons (Windy City Wrestling of Notre Dame) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Andrew Fetzer (Bison WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Vince Clinite (Scorpion WC) won by decision over Samuel Lamonica (Hononegah WC) Dec 3-2</li>\n<li>Cons. Round 1 - Donovan Corn (Harvey Twisters WC) won by fall over Brock Donati (St. Charles East WC) Fall 1:01</li>\n<li>Cons. Round 1 - Jalon Nolan-LaGrone (Murphysboro WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Vince Ochoa (Bolingbrook Junior Raiders) received a bye   () Bye</li>\n<li>Cons. Round 1 - Eli Pannell (River Bend WC) won by fall over Brady Andersen (Wolves WC Inc) Fall 2:14</li>\n<li>Cons. Round 1 - Santos Castillo (Chargers WC) won by fall over Ryan Norwood (Crusaders` Elite) Fall 0:59</li>\n<li>Cons. Round 1 - Ryan Johnson (Aces WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Ethan Torres (Grayslake WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Julian Harshbarger (Carbondale WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sonny Blanco (Morton Little Mustangs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jaylin Garay (Falcons Elite) received a bye   () Bye</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Samuel Martin (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Woodrey (Prairie Central Hawks WC) won by fall over Chase Moore (Paxton Youth WC) Fall 3:56</li>\n<li>Cons. Round 1 - Joseph Passarelli (Downers Grove Cougars WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dawson Pruitt (Westville Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Caleb Guise (Clinton WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Curtis Frazier (Olney Cubs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Craig Weiss (Badger WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathanyel Jackson (Springfield Capitals Kids WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Brandon Burke (Marengo Youth Wrestling) won by fall over Micah Bergen (Dawgs WC) Fall 0:29</li>\n<li>Cons. Round 1 - Dylan Amico (Plainfield WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jalen May (King Select Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joel Mylin (Golden Eagles WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Joseph Knapp (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Poniatowski (Windy City Wrestling of Notre Dame) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Ventimilla (Martinez Fox Valley Elite) won by decision over Kai Neumark (Arlington Cardinals WC) Dec 7-4</li>\n<li>Cons. Round 1 - David Klein (Mustang WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Sam Emery (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Herbst (Hawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kaeden Kinison (Springfield Capitals Kids WC) won by decision over Owen Farquer (Metamora Kids WC) Dec 6-0</li>\n<li>Cons. Round 1 - Matthew Ramos (Bolingbrook Junior Raiders) won by fall over Jeremy Jakowitsch (Barrington Broncos WC) Fall 3:49</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Kai Conway (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ethen Doty (West Carroll WC) won by decision over Payton Geigner (Lincoln Way WC) Dec 5-4</li>\n<li>Cons. Round 1 - Andrew Lira (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Luke Barron (Team 1006) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Sincere Bailey (Harvey Twisters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Haynes (Pekin Boys &amp; Girls Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brendan Mattingly (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kaleb Thompson (Bolingbrook Junior Raiders) won by major decision over Logan Peters (Springfield Capitals Kids WC) Maj 9-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Keyn Humes (Paxton Youth WC) won by decision over Daniel McPherson (Lakeland Predators WC) Dec 9-6</li>\n<li>Cons. Round 1 - Garrett Bakarich (Triad Little Knights WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - James Ost (Villa-Lombard Cougars) won by decision over Anthony Indelli (Falcons Elite) Dec 7-0</li>\n<li>Cons. Round 1 - Andy Posledni (Batavia WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Paradee (A &amp; M Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jackson Hosman (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andy Madrigal (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n<li>Cons. Round 1 - Giovanni Cassioppi (Hononegah WC) won by major decision over Alexander Posada (Villa-Lombard Cougars) Maj 9-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Tony Heinitz (River Bend WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chandler Gartner (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Devin Makemson (Bismarck-Henning WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Peyton Nimsakont (Headlock Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Blaine Riley (Panther Powerhouse Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Maxx Fritz (Bulls WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cade Slayton (Dakota WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kaleb Hartman (West Carroll WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Peter Schied (Redhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Parrish (Moline WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Baan Rachal (Harvey Twisters WC) won by fall over Keiran Burke (Downers Grove Cougars WC) Fall 4:27</li>\n<li>Cons. Round 1 - Trevor Jones (Martinez Fox Valley Elite) received a bye   () Bye</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Joseph Zartuche (HF Spartan Elite WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Guerrero (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Daniel Smith (Carbondale WC) won by fall over Kevin Joplin (Waukegan Youth WC) Fall 1:00</li>\n<li>Cons. Round 1 - Mark Tucker (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Yousif Salah (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Riley Scheffel (Edwardsville WC) won by fall over Colin Kestian (Redhawk WC) Fall 4:16</li>\n<li>Cons. Round 1 - Barrett Beaird (Grayslake WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Miles Tonielli (Blackhawk WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Ryan Pancamo (Scorpion WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Vedner (Arlington Cardinals WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hunter McAlpine (Seneca Irish Cadets WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Dykes (Golden Eagles WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Luffman (Champaign WC) won by decision over Ahilud Huerta (Waukegan Youth WC) Dec 10-8</li>\n<li>Cons. Round 1 - Ryan Doubek (Z`s Team Pena) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ian Kovach (Granite City WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon McKimmy (The Wrestling Factory) won by decision over John Willeford (Falcons Elite) Dec 7-3</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Cameron Lee (Metamora Kids WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Sullivan (Maine Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Hunter (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Beasley (Olney Cubs WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Jose Ramos (Arlington Cardinals WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - George Hays (Peoria Razorbacks WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jose Rojas (Lil Bucs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeffrey Griffin (HF Spartan Elite WC) won by major decision over Jacob Stellhorn (Edwardsville WC) Maj 10-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Cole Howard (Geneseo Spider WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joey Beaudoin (Sycamore WC) won by fall over Daviontae Ireland (Brawlers WC) Fall 0:38</li>\n<li>Cons. Round 1 - Isaiah Brock (Fenton/BBAA Jr Bison WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kody Brower (Rocket Fuel WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Anthony King (East St. Louis Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brenden Kaminscky (The Wrestling Factory) won by decision over Zeth Stallings (Lawrence County WC) Dec 4-3</li>\n<li>Cons. Round 1 - Josh Bess (Maine Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Justin Montani (Crystal Lake Wizards) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Nathan Callaway (Team No Ego WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brody Powell (Hoopeston Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - William Hillard (Triad Little Knights WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Patrick Bracken (Mustang WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Shawn Sparacino (Southside Stallions) won by fall over Mark Holian (Crystal Lake Wizards) Fall 3:21</li>\n<li>Cons. Round 1 - Tyler Fleetwood (River Bend WC) won by fall over Vincent D`Orazio (St. Charles East WC) Fall 2:32</li>\n<li>Cons. Round 1 - Justin Benjamin (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Abeja (Tinley Park Bulldogs) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Cameren Carver (Charleston WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Schaer (Wolves WC Inc) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jackson Lingle (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Pat Nolan (Orland Park Pioneers) won by major decision over Jonathan Salgado (Martinez Fox Valley Elite) Maj 12-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Logan Johnson (King Select Wrestling) won by decision over Cole Riemer (Izzy Style Wrestling) Dec 6-0</li>\n<li>Cons. Round 1 - Manuel Ramirez (Waukegan Youth WC) won by fall over Mason McBride (Westville Youth WC) Fall 0:47</li>\n<li>Cons. Round 1 - Mason Schewe (Hononegah WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jaleen Yancey (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Jarrett Paslay (Vandalia Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Adam McDowell (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Allen Swanson (Team No Ego WC) won by decision over Jared Head (Dawgs WC) Dec 13-9</li>\n<li>Cons. Round 1 - Patrick Ryan (North Shore Edge) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Dylan Davidson (King Select Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Macias (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ja`Chun Smith (Little Huskies WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeremy Rumsey (Saber WC) won in overtime over Raymond Dean (Force WC) OT 4-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Austin Ernd (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Francesco Romano (Edwardsville WC) won by fall over Kaleb Featherly (Prairie Central Hawks WC) Fall 4:20</li>\n<li>Cons. Round 1 - Zachary Haley (Quincy Cyclones Wrestling) won by decision over Peter McCusker (Rantoul Junior Eagles) Dec 6-5</li>\n<li>Cons. Round 1 - Stone Engle (Moline WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Jimmy Silva (HF Spartan Elite WC) won by decision over Colin Dvorak (Stockton Renegades) Dec 10-5</li>\n<li>Cons. Round 2 - Nicky Amato (Izzy Style Wrestling) won by major decision over Joseph Roberts (Yorkville WC) Maj 13-3</li>\n<li>Cons. Round 2 - Brandon Laux (Harvey Twisters WC) won by fall over Dylan Connell (Crystal Lake Wizards) Fall 2:52</li>\n<li>Cons. Round 2 - Luke Gardner (Vittum Cats WC) won by decision over Brody Ivey (Sauk Valley WC) Dec 6-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Dado (Orland Park Pioneers) won by fall over Daemyen Middlebrooks (Little Huskies WC) Fall 1:55</li>\n<li>Cons. Round 2 - Tanner Swain (Vandalia Jr WC) won by tech fall over Colin Tracy (Redhawk WC) TF 16-0</li>\n<li>Cons. Round 2 - Maxwell Kristoff (Crusaders` Elite) won by fall over Chase Clark (Hawk WC) Fall 2:43</li>\n<li>Cons. Round 2 - Phillip Sims (Carbondale WC) won by major decision over Kyle Guttosch (Naperville WC) Maj 11-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Zachary Katula (Yorkville WC) won in sudden victory - 1 over Grant Ripperda (Springfield Capitals Kids WC) SV-1 2-0</li>\n<li>Cons. Round 2 - Eddie Villalobos (Rochelle WC) won by decision over Devin Wills (Crusaders` Elite) Dec 3-1</li>\n<li>Cons. Round 2 - Jayden Terronez (Moline WC) won by fall over Stephen Bushy (Crystal Lake Wizards) Fall 3:37</li>\n<li>Cons. Round 2 - Caleb Grau (Crusaders` Elite) won by fall over Austin Herkert (Taylorville WC) Fall 2:32</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Trent Johnson (Scorpion WC) won by decision over Mario Leon (Lincoln Way WC) Dec 7-5</li>\n<li>Cons. Round 2 - Luke Russell (Naperville WC) won by fall over Vincent Querciagrossa (Metamora Kids WC) Fall 2:24</li>\n<li>Cons. Round 2 - Michael Wellman (Villa-Lombard Cougars) won by fall over Jon Conkrite (Bloomington Raider WC) Fall 0:55</li>\n<li>Cons. Round 2 - Nick Stemmet (Team No Ego WC) won by fall over Brenden Parks (Kaneland Knights WC) Fall 0:39</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Connor Beesing (Xtreme WC) won by decision over Tristen Burns (Carlinville WC) Dec 7-4</li>\n<li>Cons. Round 2 - Logan Wilson (Unity Youth WC) won by fall over Colton Ingram (Xtreme WC) Fall 2:52</li>\n<li>Cons. Round 2 - Bradley Peters (Cary-Grove Matmen) won by decision over River Flute (Road Warriors WC) Dec 8-4</li>\n<li>Cons. Round 2 - Gavin Barton (Downers Grove Cougars WC) won by fall over Jacob Fitzsimmons (Windy City Wrestling of Notre Dame) Fall 2:50</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Brayden Cruz (Pekin Boys &amp; Girls Club) won by fall over Andrew Fetzer (Bison WC) Fall 4:15</li>\n<li>Cons. Round 2 - Drew Dyer (Edwardsville WC) won by fall over Vince Clinite (Scorpion WC) Fall 3:47</li>\n<li>Cons. Round 2 - Donovan Corn (Harvey Twisters WC) won by decision over Joshua Crandall (Wolves WC Inc) Dec 9-4</li>\n<li>Cons. Round 2 - Drew Gutknecht (Indians Elite) won by fall over Jalon Nolan-LaGrone (Murphysboro WC) Fall 1:21</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Jackson Punzel (Naperville WC) won by decision over Vince Ochoa (Bolingbrook Junior Raiders) Dec 7-4</li>\n<li>Cons. Round 2 - Eli Pannell (River Bend WC) won by fall over Kory McNicholas (Badger WC) Fall 0:19</li>\n<li>Cons. Round 2 - Santos Castillo (Chargers WC) won by fall over Jacob Woodrey (Prairie Central Hawks WC) Fall 4:07</li>\n<li>Cons. Round 2 - Anthony Geraci (Headlock Wrestling Academy) won by fall over Ryan Johnson (Aces WC) Fall 4:25</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Noah Kuligowski (Harlem Cougar WC) won by fall over Ethan Torres (Grayslake WC) Fall 0:46</li>\n<li>Cons. Round 2 - Joey Alletto (Falcons Elite) won by fall over Julian Harshbarger (Carbondale WC) Fall 0:20</li>\n<li>Cons. Round 2 - Jimmy Bartell (Maine Eagles WC) won by fall over Sonny Blanco (Morton Little Mustangs) Fall 1:06</li>\n<li>Cons. Round 2 - Lawrence Smith (Little Huskies WC) won by major decision over Jaylin Garay (Falcons Elite) Maj 15-6</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Samuel Martin (Edwardsville WC) Fall 1:03</li>\n<li>Cons. Round 2 - Cody Goodman (The Wrestling Factory) won by fall over Joshua Woodrey (Prairie Central Hawks WC) Fall 1:06</li>\n<li>Cons. Round 2 - Maximus Gomez (Izzy Style Wrestling) won in sudden victory - 1 over Joseph Passarelli (Downers Grove Cougars WC) SV-1 5-1</li>\n<li>Cons. Round 2 - Anthony Enlow (Vandalia Kings) won by fall over Dawson Pruitt (Westville Youth WC) Fall 2:20</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Caleb Guise (Clinton WC) won by decision over Brett Puppilo (Elk Grove Junior Grens) Dec 3-0</li>\n<li>Cons. Round 2 - Tyler Elsbury (Xtreme WC) won by fall over Curtis Frazier (Olney Cubs WC) Fall 0:43</li>\n<li>Cons. Round 2 - Michael Dubanowski (Rockets Youth WC) won by fall over Craig Weiss (Badger WC) Fall 2:40</li>\n<li>Cons. Round 2 - Braden Johnson (O`Fallon Little Panthers WC) won by fall over Nathanyel Jackson (Springfield Capitals Kids WC) Fall 0:29</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Brandon Burke (Marengo Youth Wrestling) Dec 8-7</li>\n<li>Cons. Round 2 - Colton King (King Select Wrestling) won by decision over Dylan Amico (Plainfield WC) Dec 6-0</li>\n<li>Cons. Round 2 - Jalen May (King Select Wrestling) won by decision over Colton Linke (River Bend WC) Dec 4-2</li>\n<li>Cons. Round 2 - Joel Mylin (Golden Eagles WC) won by decision over Matthew Minick (King Select Wrestling) Dec 1-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Ben Lunn (Edwardsville WC) won by decision over Joseph Knapp (Brawlers WC) Dec 8-2</li>\n<li>Cons. Round 2 - Logan Kuhel-Trimmer (Force WC) won by decision over Matthew Poniatowski (Windy City Wrestling of Notre Dame) Dec 7-5</li>\n<li>Cons. Round 2 - Alex Ventimilla (Martinez Fox Valley Elite) won by major decision over Justin Cole (Team 1006) Maj 12-1</li>\n<li>Cons. Round 2 - David Klein (Mustang WC) won by injury default over Anterrius Turner (Lionheart Intense Wrestling) Inj. 0:00</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Dean Hamiti (Martinez Fox Valley Elite) won by fall over Sam Emery (Celtic Elite) Fall 3:43</li>\n<li>Cons. Round 2 - Tristan Daugherty (Central Illinois Wrestling Academy) won by tech fall over Andrew Herbst (Hawk WC) TF 17-1</li>\n<li>Cons. Round 2 - Peyton Timmons (Red Raiders Wrestling Team) won by fall over Kaeden Kinison (Springfield Capitals Kids WC) Fall 3:28</li>\n<li>Cons. Round 2 - Matthew Ramos (Bolingbrook Junior Raiders) won in sudden victory - 1 over Kyle Schickel (Southside Stallions) SV-1 5-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Alex Villar (Bolingbrook Junior Raiders) won by fall over Kai Conway (Gomez Wrestling Academy) Fall 4:27</li>\n<li>Cons. Round 2 - Ethen Doty (West Carroll WC) won by decision over Joshua Holm (Izzy Style Wrestling) Dec 8-3</li>\n<li>Cons. Round 2 - Joel Vandervere (The Wrestling Factory) won by fall over Andrew Lira (Crystal Lake Wizards) Fall 2:02</li>\n<li>Cons. Round 2 - Jacob Lindsey (Oak Forest Warriors) won by decision over Luke Barron (Team 1006) Dec 9-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Sincere Bailey (Harvey Twisters WC) won by decision over Nicholas Bolivar (Gomez Wrestling Academy) Dec 3-1</li>\n<li>Cons. Round 2 - Kendall Norfleet (Harvey Twisters WC) won by decision over Ryan Haynes (Pekin Boys &amp; Girls Club) Dec 4-3</li>\n<li>Cons. Round 2 - Brendan Mattingly (Edwardsville WC) won by decision over Zeke Marshall (Martinez Fox Valley Elite) Dec 4-3</li>\n<li>Cons. Round 2 - Kaleb Thompson (Bolingbrook Junior Raiders) won by major decision over Kyle Tunink (Xtreme WC) Maj 12-3</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Tinajero (SCN Youth WC) won by fall over Keyn Humes (Paxton Youth WC) Fall 0:46</li>\n<li>Cons. Round 2 - Andrew Cervantes (Force WC) won by fall over Garrett Bakarich (Triad Little Knights WC) Fall 1:00</li>\n<li>Cons. Round 2 - Austin Reliford (Carbondale WC) won by decision over James Ost (Villa-Lombard Cougars) Dec 8-4</li>\n<li>Cons. Round 2 - Thomas Egan (Mustang WC) won by decision over Andy Posledni (Batavia WC) Dec 6-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Ashton Breen (Bolingbrook Junior Raiders) won by fall over Jacob Paradee (A &amp; M Youth Wrestling) Fall 2:48</li>\n<li>Cons. Round 2 - Jackson Hosman (Celtic Elite) won by decision over Gavin Bloom (Hononegah WC) Dec 7-3</li>\n<li>Cons. Round 2 - Joel Sarver (Champaign WC) won by decision over Andy Madrigal (Pitbull Wrestling Alliance) Dec 6-0</li>\n<li>Cons. Round 2 - Giovanni Cassioppi (Hononegah WC) won by fall over Samuel Wojcik (Vittum Cats WC) Fall 3:41</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Tony Heinitz (River Bend WC) won by fall over Shawn Brown (Rantoul Junior Eagles) Fall 4:18</li>\n<li>Cons. Round 2 - Drake Davis (Illinois Valley Elite Wrestling) won by major decision over Chandler Gartner (Brawlers WC) Maj 15-1</li>\n<li>Cons. Round 2 - Daniel Caulfield (Mustang WC) won by forfeit over Devin Makemson (Bismarck-Henning WC) FF</li>\n<li>Cons. Round 2 - Brad Gross (Sauk Valley WC) won by major decision over Peyton Nimsakont (Headlock Wrestling Academy) Maj 10-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Anthony Marre (Gomez Wrestling Academy) won by fall over Blaine Riley (Panther Powerhouse Wrestling) Fall 3:57</li>\n<li>Cons. Round 2 - Maxx Fritz (Bulls WC) won by fall over Sam Woodruff (Waubonsie WC) Fall 4:23</li>\n<li>Cons. Round 2 - Cade Slayton (Dakota WC) won by fall over Cameron White (Harvey Twisters WC) Fall 4:30</li>\n<li>Cons. Round 2 - Kaleb Hartman (West Carroll WC) won by fall over Gabriel Castillo (Chargers WC) Fall 0:35</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Matthew Hennessey (Martinez Fox Valley Elite) won by decision over Peter Schied (Redhawk WC) Dec 6-1</li>\n<li>Cons. Round 2 - Zachary Braunagel (Crusaders` Elite) won by fall over Thomas Parrish (Moline WC) Fall 1:55</li>\n<li>Cons. Round 2 - Baan Rachal (Harvey Twisters WC) won by fall over Jesus Cancino (Lawrence County WC) Fall 2:34</li>\n<li>Cons. Round 2 - Aaron Engle (Junior Kahoks) won by major decision over Trevor Jones (Martinez Fox Valley Elite) Maj 15-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Dan Benoit (Redhawk WC) won by fall over Joseph Zartuche (HF Spartan Elite WC) Fall 1:20</li>\n<li>Cons. Round 2 - Joseph Saracco (Force WC) won by fall over Tyler Guerrero (Martinez Fox Valley Elite) Fall 4:29</li>\n<li>Cons. Round 2 - Bryce Rivers (Westville Youth WC) won by decision over Daniel Smith (Carbondale WC) Dec 7-5</li>\n<li>Cons. Round 2 - Jason Bowman (Champaign WC) won by decision over Mark Tucker (Edwardsville WC) Dec 8-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Yousif Salah (Celtic Elite) won by decision over Nick Fetzner (Wolves WC Inc) Dec 6-2</li>\n<li>Cons. Round 2 - Bo Neidballa (Falcons Elite) won by tech fall over Riley Scheffel (Edwardsville WC) TF 18-1</li>\n<li>Cons. Round 2 - Christopher Leanos (Metamora Kids WC) won by major decision over Barrett Beaird (Grayslake WC) Maj 9-1</li>\n<li>Cons. Round 2 - Dylan Butts (Wolfpak WC) won by fall over Miles Tonielli (Blackhawk WC) Fall 0:52</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Ryan Pancamo (Scorpion WC) won by decision over Ameer Aqel (Vittum Cats WC) Dec 6-1</li>\n<li>Cons. Round 2 - Ryan Vedner (Arlington Cardinals WC) won by decision over Hunter Holdcraft (LP Crunching Cavs) Dec 11-8</li>\n<li>Cons. Round 2 - Daniel Hileman (Granite City WC) won by fall over Hunter McAlpine (Seneca Irish Cadets WC) Fall 0:11</li>\n<li>Cons. Round 2 - Izzy Fox (Evanston School of Wrestling) won by fall over Ryan Dykes (Golden Eagles WC) Fall 2:05</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Luffman (Champaign WC) won by fall over Aspen Park (Geneseo Spider WC) Fall 3:36</li>\n<li>Cons. Round 2 - Ryan Doubek (Z`s Team Pena) won by fall over Correy Midgett (East St. Louis Wrestling) Fall 3:53</li>\n<li>Cons. Round 2 - Ian Kovach (Granite City WC) won by forfeit over Devin O`Rourke (Oak Forest Warriors) FF</li>\n<li>Cons. Round 2 - Adam Colunga (Hoopeston Youth Wrestling) won by fall over Brandon McKimmy (The Wrestling Factory) Fall 2:02</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Zachary Kincade (East Alton Wood River Jr. Oilers) won by fall over Cameron Lee (Metamora Kids WC) Fall 3:54</li>\n<li>Cons. Round 2 - Andrew Sullivan (Maine Eagles WC) won by decision over Maxwell McDermott (Little Huskies WC) Dec 5-4</li>\n<li>Cons. Round 2 - Jace Punke (Central Elite Rebels) won by fall over Matthew Hunter (Sycamore WC) Fall 1:14</li>\n<li>Cons. Round 2 - Kyle Beasley (Olney Cubs WC) won by fall over Issac Martinez (Pitbull Wrestling Alliance) Fall 2:58</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Christoper Flores (Crystal Lake Wizards) won by fall over Jose Ramos (Arlington Cardinals WC) Fall 2:46</li>\n<li>Cons. Round 2 - Clayton Sheldon (Sparta Junior Bulldogs) won by fall over George Hays (Peoria Razorbacks WC) Fall 2:05</li>\n<li>Cons. Round 2 - Jose Rojas (Lil Bucs WC) won by fall over Carlos Luna (Blackhawk WC) Fall 0:28</li>\n<li>Cons. Round 2 - Jeffrey Griffin (HF Spartan Elite WC) won in overtime over Jimmy Wormsley (Golden Eagles WC) OT 3-1</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Cole Howard (Geneseo Spider WC) won by fall over Nicholas Vaccariello (Force WC) Fall 0:48</li>\n<li>Cons. Round 2 - Brandon Reyes (Calumet Memorial PD Wolverines) won by fall over Joey Beaudoin (Sycamore WC) Fall 1:24</li>\n<li>Cons. Round 2 - Michael Weber (Edwardsville WC) won by fall over Isaiah Brock (Fenton/BBAA Jr Bison WC) Fall 2:59</li>\n<li>Cons. Round 2 - Kody Brower (Rocket Fuel WC) won by fall over Noah Laney (Crystal Lake Wizards) Fall 2:26</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Enzo Silva (Martinez Fox Valley Elite) won by major decision over Anthony King (East St. Louis Wrestling) Maj 14-0</li>\n<li>Cons. Round 2 - Anthony Molton (Will County Warriors) won by fall over Brenden Kaminscky (The Wrestling Factory) Fall 3:18</li>\n<li>Cons. Round 2 - Chad Schap (Sycamore WC) won by decision over Josh Bess (Maine Eagles WC) Dec 6-0</li>\n<li>Cons. Round 2 - Christopher Kennedy (Celtic Elite) won by decision over Justin Montani (Crystal Lake Wizards) Dec 3-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Nathan Callaway (Team No Ego WC) won by major decision over Landen Pfeiffer (Crystal Lake Wizards) Maj 14-2</li>\n<li>Cons. Round 2 - Michael Jaffe (SCN Youth WC) won by fall over Brody Powell (Hoopeston Youth Wrestling) Fall 2:45</li>\n<li>Cons. Round 2 - Lucas Schevikhoven (Lakeland Predators WC) won by decision over William Hillard (Triad Little Knights WC) Dec 4-0</li>\n<li>Cons. Round 2 - Alex Giuliano (Izzy Style Wrestling) won by decision over Patrick Bracken (Mustang WC) Dec 11-5</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Zachary Williard (Carbondale WC) won by decision over Shawn Sparacino (Southside Stallions) Dec 3-2</li>\n<li>Cons. Round 2 - Nico Nunez (Martinez Fox Valley Elite) won by decision over Tyler Fleetwood (River Bend WC) Dec 3-1</li>\n<li>Cons. Round 2 - Justin Benjamin (SCN Youth WC) won by major decision over Dylan Martin (Crusaders` Elite) Maj 11-3</li>\n<li>Cons. Round 2 - Ezra Elliott (Hoopeston Youth Wrestling) won by decision over Jacob Abeja (Tinley Park Bulldogs) Dec 2-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Ben Emery (Celtic Elite) won by fall over Cameren Carver (Charleston WC) Fall 0:57</li>\n<li>Cons. Round 2 - Tyler Krause (Bolingbrook Junior Raiders) won by decision over Anthony Schaer (Wolves WC Inc) Dec 3-2</li>\n<li>Cons. Round 2 - Jackson Lingle (Izzy Style Wrestling) won by decision over Tyler Lane (Crystal Lake Wizards) Dec 9-3</li>\n<li>Cons. Round 2 - Pat Nolan (Orland Park Pioneers) won by fall over Tommy Russell (Southside Stallions) Fall 0:34</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Logan Johnson (King Select Wrestling) won by decision over Isaac Martinez (Moline WC) Dec 9-2</li>\n<li>Cons. Round 2 - Manuel Ramirez (Waukegan Youth WC) won by fall over Dylan Doranski (Batavia WC) Fall 2:46</li>\n<li>Cons. Round 2 - Jake Stiles (Izzy Style Wrestling) won by major decision over Mason Schewe (Hononegah WC) Maj 13-0</li>\n<li>Cons. Round 2 - Austin Nagel (Vittum Cats WC) won by decision over Jaleen Yancey (Edwardsville WC) Dec 4-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Timothy Houston (Tinley Park Bulldogs) won by decision over Jarrett Paslay (Vandalia Jr WC) Dec 1-0</li>\n<li>Cons. Round 2 - Jonathan Mitchell (Little Huskies WC) won by decision over Adam McDowell (Celtic Elite) Dec 10-7</li>\n<li>Cons. Round 2 - Ryan Chambers (Murphysboro WC) won by decision over Allen Swanson (Team No Ego WC) Dec 4-2</li>\n<li>Cons. Round 2 - Lucas Van Poucke (Force WC) won by decision over Patrick Ryan (North Shore Edge) Dec 6-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Ren Dazey (Champaign WC) won in overtime over Dylan Davidson (King Select Wrestling) OT 9-7</li>\n<li>Cons. Round 2 - Austin Macias (Izzy Style Wrestling) won by major decision over Tyler Delaware (Dawgs WC) Maj 16-6</li>\n<li>Cons. Round 2 - Ja`Chun Smith (Little Huskies WC) won by decision over Patrick Grzywacz (Junior Kahoks) Dec 11-4</li>\n<li>Cons. Round 2 - Casey Allen (Crystal Lake Wizards) won by decision over Jeremy Rumsey (Saber WC) Dec 2-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Austin Ernd (Crystal Lake Wizards) won by decision over Bilal Bailey (Harvey Twisters WC) Dec 4-2</li>\n<li>Cons. Round 2 - Michael Womeldorf (Pitbull Wrestling Alliance) won by major decision over Francesco Romano (Edwardsville WC) Maj 16-5</li>\n<li>Cons. Round 2 - Zachary Haley (Quincy Cyclones Wrestling) won by decision over Niko Derain (Martinez Fox Valley Elite) Dec 5-4</li>\n<li>Cons. Round 2 - Jared Van Vleet (Stillman Valley WC) won by decision over Stone Engle (Moline WC) Dec 10-3</li>\n</ul>\n</section>",
  "Champ Semi`s & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semi`s &amp; Con Quarterfinal</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Joshua Ramos (Southside Stallions) won by decision over Logan Deacetis (Prairie Central Hawks WC) Dec 6-3</li>\n<li>Semifinal - Juan Bazaldua (Martinez Fox Valley Elite) won by tech fall over Isaiah Willett (Renegade WC (NFP)) TF 17-1</li>\n<li>Cons. Round 3 - Nicky Amato (Izzy Style Wrestling) won by decision over Jimmy Silva (HF Spartan Elite WC) Dec 2-0</li>\n<li>Cons. Round 3 - Brandon Laux (Harvey Twisters WC) won in double overtime over Luke Gardner (Vittum Cats WC) 2-OT 3-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - David Ferrante (Red Raiders Wrestling Team) won by major decision over Dalton Hall (Champaign WC) Maj 10-0</li>\n<li>Semifinal - Fidel Mayora (Bolingbrook Junior Raiders) won by fall over John Paul Smith (Bison WC) Fall 4:26</li>\n<li>Cons. Round 3 - Jacob Dado (Orland Park Pioneers) won by major decision over Tanner Swain (Vandalia Jr WC) Maj 8-0</li>\n<li>Cons. Round 3 - Phillip Sims (Carbondale WC) won by major decision over Maxwell Kristoff (Crusaders` Elite) Maj 9-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Peter Christensen (Windy City Wrestling of Notre Dame) won by fall over Jordan Chisum (Zee-Bee Stingers WC) Fall 2:33</li>\n<li>Semifinal - Abe Assad (Gomez Wrestling Academy) won by decision over Johnny Acevedo (Martinez Fox Valley Elite) Dec 4-2</li>\n<li>Cons. Round 3 - Eddie Villalobos (Rochelle WC) won by decision over Zachary Katula (Yorkville WC) Dec 5-3</li>\n<li>Cons. Round 3 - Jayden Terronez (Moline WC) won by fall over Caleb Grau (Crusaders` Elite) Fall 2:27</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Elijah Black (The Wrestling Factory) won by major decision over Benjamin Zalapi (Hononegah WC) Maj 10-2</li>\n<li>Semifinal - Anthony Glauser (The Wrestling Factory) won by decision over Anthony Kluk (Oak Forest Warriors) Dec 7-2</li>\n<li>Cons. Round 3 - Luke Russell (Naperville WC) won by injury default over Trent Johnson (Scorpion WC) Inj. 4:03</li>\n<li>Cons. Round 3 - Nick Stemmet (Team No Ego WC) won by fall over Michael Wellman (Villa-Lombard Cougars) Fall 2:51</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Mustafa St.Clair (Harvey Twisters WC) won by fall over Quintin Hamilton (Evanston School of Wrestling) Fall 0:34</li>\n<li>Semifinal - Trevor Swier (Force WC) won by fall over Ryan Wahrman (Villa-Lombard Cougars) Fall 0:28</li>\n<li>Cons. Round 3 - Logan Wilson (Unity Youth WC) won by fall over Connor Beesing (Xtreme WC) Fall 0:51</li>\n<li>Cons. Round 3 - Gavin Barton (Downers Grove Cougars WC) won by decision over Bradley Peters (Cary-Grove Matmen) Dec 13-8</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Brandon Hoselton (Prairie Central Hawks WC) won by decision over Will Bernstein (Lions WC) Dec 8-6</li>\n<li>Semifinal - Jay-cee Randolph-Gonzalez (Izzy Style Wrestling) won by decision over Justin Allen (Dwight WC) Dec 8-3</li>\n<li>Cons. Round 3 - Brayden Cruz (Pekin Boys &amp; Girls Club) won by fall over Drew Dyer (Edwardsville WC) Fall 4:15</li>\n<li>Cons. Round 3 - Donovan Corn (Harvey Twisters WC) won by decision over Drew Gutknecht (Indians Elite) Dec 8-5</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Cory Peterson (King Select Wrestling) won by fall over Julian Yap (Waukegan Youth WC) Fall 0:30</li>\n<li>Semifinal - Jiovanni Martinez (Tomcat WC) won by decision over Thomas Doyle (Vittum Cats WC) Dec 3-0</li>\n<li>Cons. Round 3 - Jackson Punzel (Naperville WC) won by fall over Eli Pannell (River Bend WC) Fall 0:33</li>\n<li>Cons. Round 3 - Santos Castillo (Chargers WC) won by major decision over Anthony Geraci (Headlock Wrestling Academy) Maj 9-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Kobe Howard (Renegade WC (NFP)) won by decision over Peyton Hammerich (Tiger Town Tanglers WC) Dec 14-8</li>\n<li>Semifinal - Luke Luffman (Champaign WC) won by fall over Bo Meikamp (Edwardsville WC) Fall 0:39</li>\n<li>Cons. Round 3 - Joey Alletto (Falcons Elite) won by fall over Noah Kuligowski (Harlem Cougar WC) Fall 0:37</li>\n<li>Cons. Round 3 - Jimmy Bartell (Maine Eagles WC) won by decision over Lawrence Smith (Little Huskies WC) Dec 3-1</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Jalen Lee (Renegade WC (NFP)) won by fall over Connor Eaton (West Frankfort Jr. Redbirds) Fall 2:07</li>\n<li>Semifinal - David Hardwick (Lancer WC) won by decision over Donovan Ford (Bolingbrook Junior Raiders) Dec 5-0</li>\n<li>Cons. Round 3 - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Cody Goodman (The Wrestling Factory) Fall 1:41</li>\n<li>Cons. Round 3 - Anthony Enlow (Vandalia Kings) won by decision over Maximus Gomez (Izzy Style Wrestling) Dec 5-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Chase Tatum (Tiger Town Tanglers WC) won by fall over Lucas Korte (Celtic Elite) Fall 0:50</li>\n<li>Semifinal - Ronald Tucker Jr (Bolingbrook Junior Raiders) won by fall over Keenan Ness (Yorkville WC) Fall 2:10</li>\n<li>Cons. Round 3 - Tyler Elsbury (Xtreme WC) won by fall over Caleb Guise (Clinton WC) Fall 2:40</li>\n<li>Cons. Round 3 - Braden Johnson (O`Fallon Little Panthers WC) won by fall over Michael Dubanowski (Rockets Youth WC) Fall 0:41</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Jack Finnegan (Force WC) won by decision over Jameir Castleberry (Little Huskies WC) Dec 5-4</li>\n<li>Semifinal - Samuel Hayes (Contender Wrestling) won by decision over Daniel Sheen (SCN Youth WC) Dec 4-0</li>\n<li>Cons. Round 3 - Colton King (King Select Wrestling) won by fall over Nicholas Gonzalez (Gomez Wrestling Academy) Fall 0:59</li>\n<li>Cons. Round 3 - Jalen May (King Select Wrestling) won by decision over Joel Mylin (Golden Eagles WC) Dec 5-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Diego Sotelo (Martinez Fox Valley Elite) won by decision over Jacob Rundell (Little Huskies WC) Dec 3-1</li>\n<li>Semifinal - Jacob Randolph (Celtic Elite) won by fall over Michael Rodriguez (Southside Stallions) Fall 2:07</li>\n<li>Cons. Round 3 - Ben Lunn (Edwardsville WC) won by tech fall over Logan Kuhel-Trimmer (Force WC) TF 15-0</li>\n<li>Cons. Round 3 - David Klein (Mustang WC) won by decision over Alex Ventimilla (Martinez Fox Valley Elite) Dec 7-4</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Noah Surtin (Edwardsville WC) won by decision over Dylan Ragusin (Izzy Style Wrestling) Dec 1-0</li>\n<li>Semifinal - Cameron Johnson (Martinez Fox Valley Elite) won by major decision over Reese Durlacher (Bison WC) Maj 9-1</li>\n<li>Cons. Round 3 - Dean Hamiti (Martinez Fox Valley Elite) won by fall over Tristan Daugherty (Central Illinois Wrestling Academy) Fall 3:21</li>\n<li>Cons. Round 3 - Matthew Ramos (Bolingbrook Junior Raiders) won by decision over Peyton Timmons (Red Raiders Wrestling Team) Dec 6-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Vincent Zerban (King Select Wrestling) won by fall over Denis Murphy (Fox Valley WC) Fall 2:01</li>\n<li>Semifinal - Nicholas Matthias (Celtic Elite) won in tie breaker - 1 over Fabian Lopez (Greg Gomez Trained Wrestling) TB-1 6-5</li>\n<li>Cons. Round 3 - Alex Villar (Bolingbrook Junior Raiders) won by decision over Ethen Doty (West Carroll WC) Dec 8-3</li>\n<li>Cons. Round 3 - Jacob Lindsey (Oak Forest Warriors) won by fall over Joel Vandervere (The Wrestling Factory) Fall 1:03</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Luke Odom (Edwardsville WC) won by major decision over Trevor Chumbley (SCN Youth WC) Maj 12-0</li>\n<li>Semifinal - Bryan Smith (Harvey Twisters WC) won by decision over Andrew Baysingar (Arlington Cardinals WC) Dec 6-3</li>\n<li>Cons. Round 3 - Sincere Bailey (Harvey Twisters WC) won by major decision over Kendall Norfleet (Harvey Twisters WC) Maj 9-0</li>\n<li>Cons. Round 3 - Kaleb Thompson (Bolingbrook Junior Raiders) won by decision over Brendan Mattingly (Edwardsville WC) Dec 14-7</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Joshua Ogunsanya (Harvey Twisters WC) won by decision over Domenic Zaccone (Orland Park Pioneers) Dec 5-1</li>\n<li>Semifinal - James Pierandozzi (Bolingbrook Junior Raiders) won by decision over Ryan Smith (Harvey Twisters WC) Dec 10-4</li>\n<li>Cons. Round 3 - Jacob Tinajero (SCN Youth WC) won by decision over Andrew Cervantes (Force WC) Dec 3-2</li>\n<li>Cons. Round 3 - Austin Reliford (Carbondale WC) won by major decision over Thomas Egan (Mustang WC) Maj 19-7</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Eddie Bolivar (Gomez Wrestling Academy) won by major decision over Connor Gaynor (Tinley Park Bulldogs) Maj 9-1</li>\n<li>Semifinal - Donnell Washington (Harvey Twisters WC) won by decision over Noah Villarreal (Martinez Fox Valley Elite) Dec 9-5</li>\n<li>Cons. Round 3 - Jackson Hosman (Celtic Elite) won by decision over Ashton Breen (Bolingbrook Junior Raiders) Dec 2-1</li>\n<li>Cons. Round 3 - Giovanni Cassioppi (Hononegah WC) won by decision over Joel Sarver (Champaign WC) Dec 2-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Emille Shannon (King Select Wrestling) won by decision over Jabari Fitzpatrick (Gomez Wrestling Academy) Dec 3-2</li>\n<li>Semifinal - Cole Smith (Celtic Elite) won by decision over Kyler Luepkes (Hononegah WC) Dec 5-0</li>\n<li>Cons. Round 3 - Drake Davis (Illinois Valley Elite Wrestling) won by fall over Tony Heinitz (River Bend WC) Fall 4:03</li>\n<li>Cons. Round 3 - Brad Gross (Sauk Valley WC) won by fall over Daniel Caulfield (Mustang WC) Fall 2:46</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - We Rachal (Harvey Twisters WC) won by decision over Trey Piotrowski (Wolves WC Inc) Dec 3-2</li>\n<li>Semifinal - Danny Braunagel (Crusaders` Elite) won by fall over Peter Radev (Vittum Cats WC) Fall 0:55</li>\n<li>Cons. Round 3 - Anthony Marre (Gomez Wrestling Academy) won by decision over Maxx Fritz (Bulls WC) Dec 9-5</li>\n<li>Cons. Round 3 - Kaleb Hartman (West Carroll WC) won by fall over Cade Slayton (Dakota WC) Fall 2:58</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Alex Harvey (Rochelle WC) won by decision over Drew Hoselton (Prairie Central Hawks WC) Dec 6-2</li>\n<li>Semifinal - Juwan Robinson (Bolingbrook Junior Raiders) won by decision over Frank Carone (Crystal Lake Wizards) Dec 6-3</li>\n<li>Cons. Round 3 - Matthew Hennessey (Martinez Fox Valley Elite) won by decision over Zachary Braunagel (Crusaders` Elite) Dec 14-7</li>\n<li>Cons. Round 3 - Aaron Engle (Junior Kahoks) won by decision over Baan Rachal (Harvey Twisters WC) Dec 11-10</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Jack Bond (Crusaders` Elite) won by decision over Peyton West (Springfield Capitals Kids WC) Dec 3-2</li>\n<li>Semifinal - Stevie Silva (HF Spartan Elite WC) won by major decision over Martin Krasinski (Crystal Lake Wizards) Maj 10-2</li>\n<li>Cons. Round 3 - Dan Benoit (Redhawk WC) won by decision over Joseph Saracco (Force WC) Dec 7-5</li>\n<li>Cons. Round 3 - Jason Bowman (Champaign WC) won by fall over Bryce Rivers (Westville Youth WC) Fall 3:39</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Jayleen Fitzpatrick (Gomez Wrestling Academy) won by fall over Drake Jennings (Stillman Valley WC) Fall 4:16</li>\n<li>Semifinal - Nate Jimenez (SCN Youth WC) won by fall over Elijah Rowe (Stockton Renegades) Fall 2:11</li>\n<li>Cons. Round 3 - Bo Neidballa (Falcons Elite) won by decision over Yousif Salah (Celtic Elite) Dec 3-1</li>\n<li>Cons. Round 3 - Dylan Butts (Wolfpak WC) won in overtime over Christopher Leanos (Metamora Kids WC) OT 9-7</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Cameron Nicholas (Westville Youth WC) won by fall over Cadin Koeppel (Cary-Grove Matmen) Fall 1:44</li>\n<li>Semifinal - Jack Jessen (Martinez Fox Valley Elite) won by fall over Macario Jaramillo (Force WC) Fall 0:26</li>\n<li>Cons. Round 3 - Ryan Vedner (Arlington Cardinals WC) won in overtime over Ryan Pancamo (Scorpion WC) OT 2-1</li>\n<li>Cons. Round 3 - Daniel Hileman (Granite City WC) won by fall over Izzy Fox (Evanston School of Wrestling) Fall 2:44</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Joshua Carter (Harlem Cougar WC) won by decision over Tyler Surges (SCN Youth WC) Dec 11-5</li>\n<li>Semifinal - Anthony Cassioppi (Hononegah WC) won by fall over Daron Austin (East Alton Wood River Jr. Oilers) Fall 1:02</li>\n<li>Cons. Round 3 - Ryan Doubek (Z`s Team Pena) won by major decision over Jacob Luffman (Champaign WC) Maj 15-3</li>\n<li>Cons. Round 3 - Adam Colunga (Hoopeston Youth Wrestling) won by fall over Ian Kovach (Granite City WC) Fall 4:12</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Sergio Villalobos (Downers Grove Cougars WC) won by major decision over Maverick McPeek (Dakota WC) Maj 9-0</li>\n<li>Semifinal - Logan Anderson (Frankfort Square Wildcats Wrestling) won by major decision over Wade Mascari (Bismarck-Henning WC) Maj 8-0</li>\n<li>Cons. Round 3 - Zachary Kincade (East Alton Wood River Jr. Oilers) won by decision over Andrew Sullivan (Maine Eagles WC) Dec 1-0</li>\n<li>Cons. Round 3 - Jace Punke (Central Elite Rebels) won by fall over Kyle Beasley (Olney Cubs WC) Fall 2:00</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Erick Cole (Moline WC) won by fall over Antonio Huerta (Scorpion WC) Fall 3:37</li>\n<li>Semifinal - Taylor Fleetwood (River Bend WC) won in overtime over Luke Reinhardt (Arlington Cardinals WC) OT 6-4</li>\n<li>Cons. Round 3 - Christoper Flores (Crystal Lake Wizards) won by fall over Clayton Sheldon (Sparta Junior Bulldogs) Fall 1:08</li>\n<li>Cons. Round 3 - Jose Rojas (Lil Bucs WC) won by decision over Jeffrey Griffin (HF Spartan Elite WC) Dec 8-5</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Cody Miller (Bismarck-Henning WC) won by decision over Alfred McIntosh (Junior Kahoks) Dec 7-0</li>\n<li>Semifinal - Shane Raber (Force WC) won by fall over Abiel Horta (Badger WC) Fall 0:33</li>\n<li>Cons. Round 3 - Cole Howard (Geneseo Spider WC) won by fall over Brandon Reyes (Calumet Memorial PD Wolverines) Fall 1:29</li>\n<li>Cons. Round 3 - Michael Weber (Edwardsville WC) won by fall over Kody Brower (Rocket Fuel WC) Fall 4:02</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Anthony Schickel (Southside Stallions) won by decision over Christian Goin (Central Elite Rebels) Dec 8-1</li>\n<li>Semifinal - Justin Cardani (Champaign WC) won in tie breaker - 1 over Aaron Zebrauskas (Southside Stallions) TB-1 1-0</li>\n<li>Cons. Round 3 - Anthony Molton (Will County Warriors) won by tech fall over Enzo Silva (Martinez Fox Valley Elite) TF 18-1</li>\n<li>Cons. Round 3 - Christopher Kennedy (Celtic Elite) won by fall over Chad Schap (Sycamore WC) Fall 2:26</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Joey Melendez (Izzy Style Wrestling) won by decision over Travis Ford-Melton (Harvey Twisters WC) Dec 3-0</li>\n<li>Semifinal - Anthony Turner (Lionheart Intense Wrestling) won by decision over Ryan Fleck (SCN Youth WC) Dec 9-3</li>\n<li>Cons. Round 3 - Michael Jaffe (SCN Youth WC) won by injury default over Nathan Callaway (Team No Ego WC) Inj. 2:43</li>\n<li>Cons. Round 3 - Lucas Schevikhoven (Lakeland Predators WC) won by decision over Alex Giuliano (Izzy Style Wrestling) Dec 2-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Austin Rudsinski (Lincoln Way WC) won by decision over Anthony Talamonti (HF Spartan Elite WC) Dec 9-3</li>\n<li>Semifinal - Dylan Burnoski (Bolingbrook Junior Raiders) won by fall over Nathan Cummings (Gomez Wrestling Academy) Fall 2:11</li>\n<li>Cons. Round 3 - Zachary Williard (Carbondale WC) won by decision over Nico Nunez (Martinez Fox Valley Elite) Dec 7-5</li>\n<li>Cons. Round 3 - Ezra Elliott (Hoopeston Youth Wrestling) won by decision over Justin Benjamin (SCN Youth WC) Dec 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Garrett Bass (King Select Wrestling) won by decision over Gannon Hughes (Team No Ego WC) Dec 4-1</li>\n<li>Semifinal - Moises Rivera (Waukegan Youth WC) won by decision over David Spencer (Champaign WC) Dec 7-1</li>\n<li>Cons. Round 3 - Ben Emery (Celtic Elite) won by fall over Tyler Krause (Bolingbrook Junior Raiders) Fall 3:54</li>\n<li>Cons. Round 3 - Pat Nolan (Orland Park Pioneers) won by major decision over Jackson Lingle (Izzy Style Wrestling) Maj 9-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Joseph Egan (Mustang WC) won by decision over Patrick Daum (SCN Youth WC) Dec 5-4</li>\n<li>Semifinal - Hassan Johnson (Harvey Twisters WC) won by decision over Sean McKenna (Martinez Fox Valley Elite) Dec 4-3</li>\n<li>Cons. Round 3 - Logan Johnson (King Select Wrestling) won by major decision over Manuel Ramirez (Waukegan Youth WC) Maj 9-0</li>\n<li>Cons. Round 3 - Jake Stiles (Izzy Style Wrestling) won by decision over Austin Nagel (Vittum Cats WC) Dec 3-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Will Lewan (Izzy Style Wrestling) won by tech fall over Payton Pulliam (Pontiac WC) TF 15-0</li>\n<li>Semifinal - Anthony Madrigal (Little Huskies WC) won by decision over Jacob Holm (Izzy Style Wrestling) Dec 8-2</li>\n<li>Cons. Round 3 - Jonathan Mitchell (Little Huskies WC) won by decision over Timothy Houston (Tinley Park Bulldogs) Dec 7-4</li>\n<li>Cons. Round 3 - Lucas Van Poucke (Force WC) won by decision over Ryan Chambers (Murphysboro WC) Dec 4-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Robert Precin (Tinley Park Bulldogs) won in double overtime over Matthew Ortiz (Martinez Fox Valley Elite) 2-OT 2-1</li>\n<li>Semifinal - Markus Hartman (Barrington Broncos WC) won by decision over Peter Ferraro (SCN Youth WC) Dec 1-0</li>\n<li>Cons. Round 3 - Austin Macias (Izzy Style Wrestling) won by decision over Ren Dazey (Champaign WC) Dec 5-1</li>\n<li>Cons. Round 3 - Ja`Chun Smith (Little Huskies WC) won by major decision over Casey Allen (Crystal Lake Wizards) Maj 13-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Brett Hammel (West Hancock WC) won by decision over Alex Zacharuk (Harlem Cougar WC) Dec 11-6</li>\n<li>Semifinal - Baylor Fernandes (Bolingbrook Junior Raiders) won by decision over Cody Baldridge (Gilbert Grappling) Dec 7-2</li>\n<li>Cons. Round 3 - Michael Womeldorf (Pitbull Wrestling Alliance) won by decision over Austin Ernd (Crystal Lake Wizards) Dec 5-3</li>\n<li>Cons. Round 3 - Jared Van Vleet (Stillman Valley WC) won by decision over Zachary Haley (Quincy Cyclones Wrestling) Dec 4-3</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Nicky Amato (Izzy Style Wrestling) won by decision over Logan Deacetis (Prairie Central Hawks WC) Dec 7-2</li>\n<li>Cons. Semi - Isaiah Willett (Renegade WC (NFP)) won by decision over Brandon Laux (Harvey Twisters WC) Dec 4-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Jacob Dado (Orland Park Pioneers) won by decision over Dalton Hall (Champaign WC) Dec 1-0</li>\n<li>Cons. Semi - John Paul Smith (Bison WC) won by decision over Phillip Sims (Carbondale WC) Dec 5-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Eddie Villalobos (Rochelle WC) won by fall over Jordan Chisum (Zee-Bee Stingers WC) Fall 3:16</li>\n<li>Cons. Semi - Johnny Acevedo (Martinez Fox Valley Elite) won by decision over Jayden Terronez (Moline WC) Dec 8-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Luke Russell (Naperville WC) won by decision over Benjamin Zalapi (Hononegah WC) Dec 1-0</li>\n<li>Cons. Semi - Nick Stemmet (Team No Ego WC) won by fall over Anthony Kluk (Oak Forest Warriors) Fall 2:48</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Logan Wilson (Unity Youth WC) won by fall over Quintin Hamilton (Evanston School of Wrestling) Fall 2:26</li>\n<li>Cons. Semi - Gavin Barton (Downers Grove Cougars WC) won by fall over Ryan Wahrman (Villa-Lombard Cougars) Fall 1:49</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Brayden Cruz (Pekin Boys &amp; Girls Club) won by decision over Will Bernstein (Lions WC) Dec 10-3</li>\n<li>Cons. Semi - Justin Allen (Dwight WC) won by fall over Donovan Corn (Harvey Twisters WC) Fall 3:32</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Jackson Punzel (Naperville WC) won by fall over Julian Yap (Waukegan Youth WC) Fall 3:35</li>\n<li>Cons. Semi - Santos Castillo (Chargers WC) won by decision over Thomas Doyle (Vittum Cats WC) Dec 6-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Joey Alletto (Falcons Elite) won by fall over Peyton Hammerich (Tiger Town Tanglers WC) Fall 2:07</li>\n<li>Cons. Semi - Bo Meikamp (Edwardsville WC) won in sudden victory - 1 over Jimmy Bartell (Maine Eagles WC) SV-1 4-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Connor Eaton (West Frankfort Jr. Redbirds) Fall 1:07</li>\n<li>Cons. Semi - Donovan Ford (Bolingbrook Junior Raiders) won by decision over Anthony Enlow (Vandalia Kings) Dec 2-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Tyler Elsbury (Xtreme WC) won by fall over Lucas Korte (Celtic Elite) Fall 3:53</li>\n<li>Cons. Semi - Keenan Ness (Yorkville WC) won by fall over Braden Johnson (O`Fallon Little Panthers WC) Fall 3:15</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Jameir Castleberry (Little Huskies WC) won by major decision over Colton King (King Select Wrestling) Maj 9-0</li>\n<li>Cons. Semi - Daniel Sheen (SCN Youth WC) won by decision over Jalen May (King Select Wrestling) Dec 2-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Jacob Rundell (Little Huskies WC) won by decision over Ben Lunn (Edwardsville WC) Dec 7-0</li>\n<li>Cons. Semi - Michael Rodriguez (Southside Stallions) won by major decision over David Klein (Mustang WC) Maj 13-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Dylan Ragusin (Izzy Style Wrestling) won by decision over Dean Hamiti (Martinez Fox Valley Elite) Dec 16-10</li>\n<li>Cons. Semi - Matthew Ramos (Bolingbrook Junior Raiders) won by injury default over Reese Durlacher (Bison WC) Inj. 4:28</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Alex Villar (Bolingbrook Junior Raiders) won by fall over Denis Murphy (Fox Valley WC) Fall 2:24</li>\n<li>Cons. Semi - Jacob Lindsey (Oak Forest Warriors) won by decision over Fabian Lopez (Greg Gomez Trained Wrestling) Dec 9-6</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Sincere Bailey (Harvey Twisters WC) won by decision over Trevor Chumbley (SCN Youth WC) Dec 9-3</li>\n<li>Cons. Semi - Andrew Baysingar (Arlington Cardinals WC) won by decision over Kaleb Thompson (Bolingbrook Junior Raiders) Dec 2-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Domenic Zaccone (Orland Park Pioneers) won by decision over Jacob Tinajero (SCN Youth WC) Dec 4-1</li>\n<li>Cons. Semi - Ryan Smith (Harvey Twisters WC) won by decision over Austin Reliford (Carbondale WC) Dec 5-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Jackson Hosman (Celtic Elite) won by decision over Connor Gaynor (Tinley Park Bulldogs) Dec 4-2</li>\n<li>Cons. Semi - Noah Villarreal (Martinez Fox Valley Elite) won by fall over Giovanni Cassioppi (Hononegah WC) Fall 0:30</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Jabari Fitzpatrick (Gomez Wrestling Academy) won by decision over Drake Davis (Illinois Valley Elite Wrestling) Dec 3-2</li>\n<li>Cons. Semi - Brad Gross (Sauk Valley WC) won by fall over Kyler Luepkes (Hononegah WC) Fall 1:22</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Anthony Marre (Gomez Wrestling Academy) won by decision over Trey Piotrowski (Wolves WC Inc) Dec 5-1</li>\n<li>Cons. Semi - Peter Radev (Vittum Cats WC) won by decision over Kaleb Hartman (West Carroll WC) Dec 5-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Drew Hoselton (Prairie Central Hawks WC) won by injury default over Matthew Hennessey (Martinez Fox Valley Elite) Inj. 4:07</li>\n<li>Cons. Semi - Frank Carone (Crystal Lake Wizards) won by decision over Aaron Engle (Junior Kahoks) Dec 3-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Peyton West (Springfield Capitals Kids WC) won by decision over Dan Benoit (Redhawk WC) Dec 3-2</li>\n<li>Cons. Semi - Jason Bowman (Champaign WC) won in sudden victory - 1 over Martin Krasinski (Crystal Lake Wizards) SV-1 6-4</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Drake Jennings (Stillman Valley WC) won by decision over Bo Neidballa (Falcons Elite) Dec 7-4</li>\n<li>Cons. Semi - Elijah Rowe (Stockton Renegades) won by fall over Dylan Butts (Wolfpak WC) Fall 4:09</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Cadin Koeppel (Cary-Grove Matmen) won by fall over Ryan Vedner (Arlington Cardinals WC) Fall 3:50</li>\n<li>Cons. Semi - Daniel Hileman (Granite City WC) won by fall over Macario Jaramillo (Force WC) Fall 0:31</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Tyler Surges (SCN Youth WC) won by major decision over Ryan Doubek (Z`s Team Pena) Maj 14-4</li>\n<li>Cons. Semi - Daron Austin (East Alton Wood River Jr. Oilers) won by decision over Adam Colunga (Hoopeston Youth Wrestling) Dec 3-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Maverick McPeek (Dakota WC) won by decision over Zachary Kincade (East Alton Wood River Jr. Oilers) Dec 5-2</li>\n<li>Cons. Semi - Wade Mascari (Bismarck-Henning WC) won by fall over Jace Punke (Central Elite Rebels) Fall 4:04</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Christoper Flores (Crystal Lake Wizards) won by fall over Antonio Huerta (Scorpion WC) Fall 1:07</li>\n<li>Cons. Semi - Luke Reinhardt (Arlington Cardinals WC) won by fall over Jose Rojas (Lil Bucs WC) Fall 1:23</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Alfred McIntosh (Junior Kahoks) won by decision over Cole Howard (Geneseo Spider WC) Dec 10-6</li>\n<li>Cons. Semi - Abiel Horta (Badger WC) won by decision over Michael Weber (Edwardsville WC) Dec 3-2</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Christian Goin (Central Elite Rebels) won by decision over Anthony Molton (Will County Warriors) Dec 8-5</li>\n<li>Cons. Semi - Aaron Zebrauskas (Southside Stallions) won by decision over Christopher Kennedy (Celtic Elite) Dec 2-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Travis Ford-Melton (Harvey Twisters WC) won by major decision over Michael Jaffe (SCN Youth WC) Maj 16-6</li>\n<li>Cons. Semi - Ryan Fleck (SCN Youth WC) won by decision over Lucas Schevikhoven (Lakeland Predators WC) Dec 7-5</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Anthony Talamonti (HF Spartan Elite WC) won by decision over Zachary Williard (Carbondale WC) Dec 8-3</li>\n<li>Cons. Semi - Nathan Cummings (Gomez Wrestling Academy) won by decision over Ezra Elliott (Hoopeston Youth Wrestling) Dec 4-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Gannon Hughes (Team No Ego WC) won by decision over Ben Emery (Celtic Elite) Dec 6-4</li>\n<li>Cons. Semi - Pat Nolan (Orland Park Pioneers) won by decision over David Spencer (Champaign WC) Dec 6-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Patrick Daum (SCN Youth WC) won by fall over Logan Johnson (King Select Wrestling) Fall 3:24</li>\n<li>Cons. Semi - Sean McKenna (Martinez Fox Valley Elite) won by decision over Jake Stiles (Izzy Style Wrestling) Dec 2-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Payton Pulliam (Pontiac WC) won in overtime over Jonathan Mitchell (Little Huskies WC) OT 11-10</li>\n<li>Cons. Semi - Jacob Holm (Izzy Style Wrestling) won by major decision over Lucas Van Poucke (Force WC) Maj 8-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Austin Macias (Izzy Style Wrestling) won by decision over Matthew Ortiz (Martinez Fox Valley Elite) Dec 6-2</li>\n<li>Cons. Semi - Ja`Chun Smith (Little Huskies WC) won by decision over Peter Ferraro (SCN Youth WC) Dec 12-8</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Alex Zacharuk (Harlem Cougar WC) won by decision over Michael Womeldorf (Pitbull Wrestling Alliance) Dec 6-4</li>\n<li>Cons. Semi - Jared Van Vleet (Stillman Valley WC) won by decision over Cody Baldridge (Gilbert Grappling) Dec 5-0</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Nicky Amato (Izzy Style Wrestling) won by decision over Isaiah Willett (Renegade WC (NFP)) Dec 3-2</li>\n<li>5th Place Match - Logan Deacetis (Prairie Central Hawks WC) won by decision over Brandon Laux (Harvey Twisters WC) Dec 6-5</li>\n<li>7th Place Match - Luke Gardner (Vittum Cats WC) won by fall over Jimmy Silva (HF Spartan Elite WC) Fall 2:50</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Jacob Dado (Orland Park Pioneers) won by fall over John Paul Smith (Bison WC) Fall 4:38</li>\n<li>5th Place Match - Dalton Hall (Champaign WC) won by decision over Phillip Sims (Carbondale WC) Dec 10-7</li>\n<li>7th Place Match - Tanner Swain (Vandalia Jr WC) won by major decision over Maxwell Kristoff (Crusaders` Elite) Maj 10-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Eddie Villalobos (Rochelle WC) won by decision over Johnny Acevedo (Martinez Fox Valley Elite) Dec 3-2</li>\n<li>5th Place Match - Jayden Terronez (Moline WC) won by fall over Jordan Chisum (Zee-Bee Stingers WC) Fall 2:12</li>\n<li>7th Place Match - Zachary Katula (Yorkville WC) won by decision over Caleb Grau (Crusaders` Elite) Dec 6-5</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Nick Stemmet (Team No Ego WC) won by major decision over Luke Russell (Naperville WC) Maj 15-2</li>\n<li>5th Place Match - Benjamin Zalapi (Hononegah WC) won by decision over Anthony Kluk (Oak Forest Warriors) Dec 4-3</li>\n<li>7th Place Match - Michael Wellman (Villa-Lombard Cougars) won by major decision over Trent Johnson (Scorpion WC) Maj 10-2</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Logan Wilson (Unity Youth WC) won by fall over Gavin Barton (Downers Grove Cougars WC) Fall 2:26</li>\n<li>5th Place Match - Quintin Hamilton (Evanston School of Wrestling) won by decision over Ryan Wahrman (Villa-Lombard Cougars) Dec 9-6</li>\n<li>7th Place Match - Connor Beesing (Xtreme WC) won by decision over Bradley Peters (Cary-Grove Matmen) Dec 8-6</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Brayden Cruz (Pekin Boys &amp; Girls Club) won by major decision over Justin Allen (Dwight WC) Maj 17-6</li>\n<li>5th Place Match - Donovan Corn (Harvey Twisters WC) won by fall over Will Bernstein (Lions WC) Fall 2:52</li>\n<li>7th Place Match - Drew Gutknecht (Indians Elite) won by fall over Drew Dyer (Edwardsville WC) Fall 2:40</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Santos Castillo (Chargers WC) won by decision over Jackson Punzel (Naperville WC) Dec 4-3</li>\n<li>5th Place Match - Thomas Doyle (Vittum Cats WC) won by fall over Julian Yap (Waukegan Youth WC) Fall 4:04</li>\n<li>7th Place Match - Eli Pannell (River Bend WC) won by decision over Anthony Geraci (Headlock Wrestling Academy) Dec 2-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Joey Alletto (Falcons Elite) won by fall over Bo Meikamp (Edwardsville WC) Fall 0:30</li>\n<li>5th Place Match - Peyton Hammerich (Tiger Town Tanglers WC) won by decision over Jimmy Bartell (Maine Eagles WC) Dec 4-2</li>\n<li>7th Place Match - Lawrence Smith (Little Huskies WC) won by major decision over Noah Kuligowski (Harlem Cougar WC) Maj 8-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Donovan Ford (Bolingbrook Junior Raiders) Fall 4:03</li>\n<li>5th Place Match - Anthony Enlow (Vandalia Kings) won by decision over Connor Eaton (West Frankfort Jr. Redbirds) Dec 3-2</li>\n<li>7th Place Match - Cody Goodman (The Wrestling Factory) won by decision over Maximus Gomez (Izzy Style Wrestling) Dec 5-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Tyler Elsbury (Xtreme WC) won by fall over Keenan Ness (Yorkville WC) Fall 3:19</li>\n<li>5th Place Match - Lucas Korte (Celtic Elite) won by fall over Braden Johnson (O`Fallon Little Panthers WC) Fall 0:53</li>\n<li>7th Place Match - Caleb Guise (Clinton WC) won by fall over Michael Dubanowski (Rockets Youth WC) Fall 4:27</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Jameir Castleberry (Little Huskies WC) won by decision over Daniel Sheen (SCN Youth WC) Dec 2-1</li>\n<li>5th Place Match - Jalen May (King Select Wrestling) won by decision over Colton King (King Select Wrestling) Dec 2-0</li>\n<li>7th Place Match - Joel Mylin (Golden Eagles WC) won by major decision over Nicholas Gonzalez (Gomez Wrestling Academy) Maj 13-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Jacob Rundell (Little Huskies WC) won by tech fall over Michael Rodriguez (Southside Stallions) TF 16-1</li>\n<li>5th Place Match - Ben Lunn (Edwardsville WC) won by decision over David Klein (Mustang WC) Dec 4-0</li>\n<li>7th Place Match - Alex Ventimilla (Martinez Fox Valley Elite) won by decision over Logan Kuhel-Trimmer (Force WC) Dec 4-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Dylan Ragusin (Izzy Style Wrestling) won by decision over Matthew Ramos (Bolingbrook Junior Raiders) Dec 3-1</li>\n<li>5th Place Match - Dean Hamiti (Martinez Fox Valley Elite) won by decision over Reese Durlacher (Bison WC) Dec 9-4</li>\n<li>7th Place Match - Peyton Timmons (Red Raiders Wrestling Team) won by decision over Tristan Daugherty (Central Illinois Wrestling Academy) Dec 2-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Jacob Lindsey (Oak Forest Warriors) won by fall over Alex Villar (Bolingbrook Junior Raiders) Fall 1:30</li>\n<li>5th Place Match - Fabian Lopez (Greg Gomez Trained Wrestling) won by major decision over Denis Murphy (Fox Valley WC) Maj 11-0</li>\n<li>7th Place Match - Ethen Doty (West Carroll WC) won by decision over Joel Vandervere (The Wrestling Factory) Dec 5-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Sincere Bailey (Harvey Twisters WC) won by decision over Andrew Baysingar (Arlington Cardinals WC) Dec 10-3</li>\n<li>5th Place Match - Trevor Chumbley (SCN Youth WC) won by decision over Kaleb Thompson (Bolingbrook Junior Raiders) Dec 6-0</li>\n<li>7th Place Match - Kendall Norfleet (Harvey Twisters WC) won by decision over Brendan Mattingly (Edwardsville WC) Dec 4-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Domenic Zaccone (Orland Park Pioneers) won by decision over Ryan Smith (Harvey Twisters WC) Dec 5-0</li>\n<li>5th Place Match - Jacob Tinajero (SCN Youth WC) won in sudden victory - 1 over Austin Reliford (Carbondale WC) SV-1 6-4</li>\n<li>7th Place Match - Andrew Cervantes (Force WC) won by decision over Thomas Egan (Mustang WC) Dec 6-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Noah Villarreal (Martinez Fox Valley Elite) won by major decision over Jackson Hosman (Celtic Elite) Maj 18-4</li>\n<li>5th Place Match - Giovanni Cassioppi (Hononegah WC) won by decision over Connor Gaynor (Tinley Park Bulldogs) Dec 5-0</li>\n<li>7th Place Match - Joel Sarver (Champaign WC) won by fall over Ashton Breen (Bolingbrook Junior Raiders) Fall 1:13</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Brad Gross (Sauk Valley WC) won by decision over Jabari Fitzpatrick (Gomez Wrestling Academy) Dec 3-1</li>\n<li>5th Place Match - Drake Davis (Illinois Valley Elite Wrestling) won by decision over Kyler Luepkes (Hononegah WC) Dec 5-0</li>\n<li>7th Place Match - Daniel Caulfield (Mustang WC) won by major decision over Tony Heinitz (River Bend WC) Maj 12-4</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Anthony Marre (Gomez Wrestling Academy) won by decision over Peter Radev (Vittum Cats WC) Dec 2-0</li>\n<li>5th Place Match - Kaleb Hartman (West Carroll WC) won by decision over Trey Piotrowski (Wolves WC Inc) Dec 5-2</li>\n<li>7th Place Match - Maxx Fritz (Bulls WC) won by decision over Cade Slayton (Dakota WC) Dec 3-1</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Drew Hoselton (Prairie Central Hawks WC) won by decision over Frank Carone (Crystal Lake Wizards) Dec 8-7</li>\n<li>5th Place Match - Aaron Engle (Junior Kahoks) won by decision over Matthew Hennessey (Martinez Fox Valley Elite) Dec 5-4</li>\n<li>7th Place Match - Zachary Braunagel (Crusaders` Elite) won by fall over Baan Rachal (Harvey Twisters WC) Fall 3:52</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Peyton West (Springfield Capitals Kids WC) won by decision over Jason Bowman (Champaign WC) Dec 8-1</li>\n<li>5th Place Match - Dan Benoit (Redhawk WC) won by injury default over Martin Krasinski (Crystal Lake Wizards) Inj. 0:00</li>\n<li>7th Place Match - Joseph Saracco (Force WC) won by decision over Bryce Rivers (Westville Youth WC) Dec 8-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Elijah Rowe (Stockton Renegades) won by decision over Drake Jennings (Stillman Valley WC) Dec 2-0</li>\n<li>5th Place Match - Bo Neidballa (Falcons Elite) won by fall over Dylan Butts (Wolfpak WC) Fall 1:21</li>\n<li>7th Place Match - Christopher Leanos (Metamora Kids WC) won by decision over Yousif Salah (Celtic Elite) Dec 1-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Daniel Hileman (Granite City WC) won by fall over Cadin Koeppel (Cary-Grove Matmen) Fall 1:42</li>\n<li>5th Place Match - Ryan Vedner (Arlington Cardinals WC) won by injury default over Macario Jaramillo (Force WC) Inj. 3:00</li>\n<li>7th Place Match - Izzy Fox (Evanston School of Wrestling) won by fall over Ryan Pancamo (Scorpion WC) Fall 3:43</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Tyler Surges (SCN Youth WC) won by decision over Daron Austin (East Alton Wood River Jr. Oilers) Dec 6-0</li>\n<li>5th Place Match - Ryan Doubek (Z`s Team Pena) won by fall over Adam Colunga (Hoopeston Youth Wrestling) Fall 0:38</li>\n<li>7th Place Match - Jacob Luffman (Champaign WC) won by fall over Ian Kovach (Granite City WC) Fall 3:59</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Maverick McPeek (Dakota WC) won by fall over Wade Mascari (Bismarck-Henning WC) Fall 3:42</li>\n<li>5th Place Match - Jace Punke (Central Elite Rebels) won by decision over Zachary Kincade (East Alton Wood River Jr. Oilers) Dec 3-1</li>\n<li>7th Place Match - Kyle Beasley (Olney Cubs WC) won by decision over Andrew Sullivan (Maine Eagles WC) Dec 4-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Christoper Flores (Crystal Lake Wizards) won by decision over Luke Reinhardt (Arlington Cardinals WC) Dec 4-3</li>\n<li>5th Place Match - Antonio Huerta (Scorpion WC) won by major decision over Jose Rojas (Lil Bucs WC) Maj 11-1</li>\n<li>7th Place Match - Jeffrey Griffin (HF Spartan Elite WC) won by decision over Clayton Sheldon (Sparta Junior Bulldogs) Dec 5-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Alfred McIntosh (Junior Kahoks) won by decision over Abiel Horta (Badger WC) Dec 11-7</li>\n<li>5th Place Match - Cole Howard (Geneseo Spider WC) won by fall over Michael Weber (Edwardsville WC) Fall 0:18</li>\n<li>7th Place Match - Brandon Reyes (Calumet Memorial PD Wolverines) won by fall over Kody Brower (Rocket Fuel WC) Fall 1:26</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Aaron Zebrauskas (Southside Stallions) won by decision over Christian Goin (Central Elite Rebels) Dec 5-2</li>\n<li>5th Place Match - Anthony Molton (Will County Warriors) won by decision over Christopher Kennedy (Celtic Elite) Dec 6-3</li>\n<li>7th Place Match - Enzo Silva (Martinez Fox Valley Elite) won by decision over Chad Schap (Sycamore WC) Dec 5-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Travis Ford-Melton (Harvey Twisters WC) won by tech fall over Ryan Fleck (SCN Youth WC) TF 16-1</li>\n<li>5th Place Match - Lucas Schevikhoven (Lakeland Predators WC) won by decision over Michael Jaffe (SCN Youth WC) Dec 4-3</li>\n<li>7th Place Match - Nathan Callaway (Team No Ego WC) won in overtime over Alex Giuliano (Izzy Style Wrestling) OT 2-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Anthony Talamonti (HF Spartan Elite WC) won by decision over Nathan Cummings (Gomez Wrestling Academy) Dec 5-1</li>\n<li>5th Place Match - Zachary Williard (Carbondale WC) won by major decision over Ezra Elliott (Hoopeston Youth Wrestling) Maj 13-2</li>\n<li>7th Place Match - Nico Nunez (Martinez Fox Valley Elite) won by major decision over Justin Benjamin (SCN Youth WC) Maj 14-6</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Pat Nolan (Orland Park Pioneers) won by decision over Gannon Hughes (Team No Ego WC) Dec 1-0</li>\n<li>5th Place Match - Ben Emery (Celtic Elite) won by major decision over David Spencer (Champaign WC) Maj 9-1</li>\n<li>7th Place Match - Jackson Lingle (Izzy Style Wrestling) won by decision over Tyler Krause (Bolingbrook Junior Raiders) Dec 3-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Sean McKenna (Martinez Fox Valley Elite) won by decision over Patrick Daum (SCN Youth WC) Dec 11-5</li>\n<li>5th Place Match - Jake Stiles (Izzy Style Wrestling) won by decision over Logan Johnson (King Select Wrestling) Dec 7-3</li>\n<li>7th Place Match - Austin Nagel (Vittum Cats WC) won by fall over Manuel Ramirez (Waukegan Youth WC) Fall 0:37</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Jacob Holm (Izzy Style Wrestling) won by major decision over Payton Pulliam (Pontiac WC) Maj 12-3</li>\n<li>5th Place Match - Lucas Van Poucke (Force WC) won by decision over Jonathan Mitchell (Little Huskies WC) Dec 10-8</li>\n<li>7th Place Match - Ryan Chambers (Murphysboro WC) won by decision over Timothy Houston (Tinley Park Bulldogs) Dec 8-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Austin Macias (Izzy Style Wrestling) won by decision over Ja`Chun Smith (Little Huskies WC) Dec 11-6</li>\n<li>5th Place Match - Peter Ferraro (SCN Youth WC) won in overtime over Matthew Ortiz (Martinez Fox Valley Elite) OT 3-1</li>\n<li>7th Place Match - Casey Allen (Crystal Lake Wizards) won by fall over Ren Dazey (Champaign WC) Fall 2:42</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Jared Van Vleet (Stillman Valley WC) won by decision over Alex Zacharuk (Harlem Cougar WC) Dec 5-4</li>\n<li>5th Place Match - Cody Baldridge (Gilbert Grappling) won by decision over Michael Womeldorf (Pitbull Wrestling Alliance) Dec 3-0</li>\n<li>7th Place Match - Zachary Haley (Quincy Cyclones Wrestling) won by decision over Austin Ernd (Crystal Lake Wizards) Dec 6-4</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Juan Bazaldua (Martinez Fox Valley Elite) won by decision over Joshua Ramos (Southside Stallions) Dec 9-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Fidel Mayora (Bolingbrook Junior Raiders) won by decision over David Ferrante (Red Raiders Wrestling Team) Dec 6-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Abe Assad (Gomez Wrestling Academy) won in sudden victory - 1 over Peter Christensen (Windy City Wrestling of Notre Dame) SV-1 6-4</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Anthony Glauser (The Wrestling Factory) won by decision over Elijah Black (The Wrestling Factory) Dec 7-5</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Trevor Swier (Force WC) won by major decision over Mustafa St.Clair (Harvey Twisters WC) Maj 10-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Jay-cee Randolph-Gonzalez (Izzy Style Wrestling) won by decision over Brandon Hoselton (Prairie Central Hawks WC) Dec 10-3</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Cory Peterson (King Select Wrestling) won by fall over Jiovanni Martinez (Tomcat WC) Fall 0:24</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Kobe Howard (Renegade WC (NFP)) won in overtime over Luke Luffman (Champaign WC) OT 4-3</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Jalen Lee (Renegade WC (NFP)) won by fall over David Hardwick (Lancer WC) Fall 2:33</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Ronald Tucker Jr (Bolingbrook Junior Raiders) won by fall over Chase Tatum (Tiger Town Tanglers WC) Fall 2:21</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Samuel Hayes (Contender Wrestling) won by decision over Jack Finnegan (Force WC) Dec 3-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Diego Sotelo (Martinez Fox Valley Elite) won by decision over Jacob Randolph (Celtic Elite) Dec 5-4</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Noah Surtin (Edwardsville WC) won by decision over Cameron Johnson (Martinez Fox Valley Elite) Dec 3-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Nicholas Matthias (Celtic Elite) won by decision over Vincent Zerban (King Select Wrestling) Dec 4-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Luke Odom (Edwardsville WC) won by decision over Bryan Smith (Harvey Twisters WC) Dec 6-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Joshua Ogunsanya (Harvey Twisters WC) won by fall over James Pierandozzi (Bolingbrook Junior Raiders) Fall 2:56</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Donnell Washington (Harvey Twisters WC) won by decision over Eddie Bolivar (Gomez Wrestling Academy) Dec 4-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Emille Shannon (King Select Wrestling) won by decision over Cole Smith (Celtic Elite) Dec 5-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - We Rachal (Harvey Twisters WC) won by decision over Danny Braunagel (Crusaders` Elite) Dec 5-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Juwan Robinson (Bolingbrook Junior Raiders) won by decision over Alex Harvey (Rochelle WC) Dec 7-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Stevie Silva (HF Spartan Elite WC) won by decision over Jack Bond (Crusaders` Elite) Dec 5-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Nate Jimenez (SCN Youth WC) won by decision over Jayleen Fitzpatrick (Gomez Wrestling Academy) Dec 9-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Jack Jessen (Martinez Fox Valley Elite) won by fall over Cameron Nicholas (Westville Youth WC) Fall 1:58</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Anthony Cassioppi (Hononegah WC) won by fall over Joshua Carter (Harlem Cougar WC) Fall 4:03</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Sergio Villalobos (Downers Grove Cougars WC) won by decision over Logan Anderson (Frankfort Square Wildcats Wrestling) Dec 4-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Erick Cole (Moline WC) won by decision over Taylor Fleetwood (River Bend WC) Dec 2-1</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Cody Miller (Bismarck-Henning WC) won by fall over Shane Raber (Force WC) Fall 1:26</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Justin Cardani (Champaign WC) won by decision over Anthony Schickel (Southside Stallions) Dec 2-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Joey Melendez (Izzy Style Wrestling) won by fall over Anthony Turner (Lionheart Intense Wrestling) Fall 0:26</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Dylan Burnoski (Bolingbrook Junior Raiders) won by decision over Austin Rudsinski (Lincoln Way WC) Dec 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Garrett Bass (King Select Wrestling) won by injury default over Moises Rivera (Waukegan Youth WC) Inj. 2:11</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Hassan Johnson (Harvey Twisters WC) won by decision over Joseph Egan (Mustang WC) Dec 7-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Anthony Madrigal (Little Huskies WC) won by decision over Will Lewan (Izzy Style Wrestling) Dec 5-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Markus Hartman (Barrington Broncos WC) won by fall over Robert Precin (Tinley Park Bulldogs) Fall 3:55</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Brett Hammel (West Hancock WC) won by decision over Baylor Fernandes (Bolingbrook Junior Raiders) Dec 10-7</li>\n</ul>\n</section>"
}
