{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Raul Lopez (Moline WC) won by fall over Robert Ford (Will County Warriors) Fall 2:58</li>\n<li>Champ. Round 1 - Ryan Yohe (Martinez Fox Valley Elite) won by fall over Christopher Colvin (Bulldog WC) Fall 4:15</li>\n<li>Champ. Round 1 - Ezra Avery (Lions WC) won by fall over Jacob Safarik (Falcons WC) Fall 2:35</li>\n<li>Champ. Round 1 - Caleb Dorsey (Junior Pioneer WC) won by decision over Noah Peight (Orangeville Broncos) Dec 6-0</li>\n<li>Champ. Round 1 - Bradley Nelson (Hampshire WC) won by decision over Bobby Bradley (Vandalia Jr Vandals) Dec 7-3</li>\n<li>Champ. Round 1 - Troy Ott (Mad Dog Wrestling Academy) won by fall over Cooper Blakeney (Central Elite Rebels) Fall 1:15</li>\n<li>Champ. Round 1 - George Bessette (Lakeland Predators) won by fall over Dylan Turner (Crystal Lake Wizards) Fall 0:49</li>\n<li>Champ. Round 1 - Tyler Grimsley (Saukee Youth WC) won by fall over Parker Stokes (Taylorville WC) Fall 1:50</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Colton Cinotto (L-P Crunching Cavs) won by fall over Michael Falejczyk (Little Celtic WC) Fall 0:47</li>\n<li>Champ. Round 1 - Matthew Domek (Lancer WC) won by decision over Lashawn Reed (Danville Chargers) Dec 7-5</li>\n<li>Champ. Round 1 - Blake Runkle (Champbuilders WC) won by fall over Brady Tolbert (Prairie Central-Chenoa Hawks) Fall 2:44</li>\n<li>Champ. Round 1 - Andrea Sennett (Bison WC) won by fall over Dylan Knepper (Brawlers WC) Fall 1:28</li>\n<li>Champ. Round 1 - Macario Jaramillo (Southside Comets) won by fall over Nikola Ivanisevic (Hinsdale WC) Fall 1:54</li>\n<li>Champ. Round 1 - Jarryd Cabusao (Golden Eagles WC) won by fall over Dylan Tipton (Collinsville Raiders) Fall 0:20</li>\n<li>Champ. Round 1 - Keegan O`donnell (Crystal Lake Wizards) won by decision over Robert Holt (Gladiators) Dec 6-1</li>\n<li>Champ. Round 1 - Jamie Hernandez (Blackhawk WC) won by fall over Jacob Loftus (Granite City WC) Fall 1:55</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Aaron Ditsworth (Moline WC) won by injury default over Daniel Mcnally (Crosstown WC) Inj. 0:00</li>\n<li>Champ. Round 1 - Blake Zalapi (Hononegah Kids WC) won by decision over Caleb Wagenblast (Edwardsville WC) Dec 10-3</li>\n<li>Champ. Round 1 - Wade Thiele (Saukee Youth WC) won by fall over Anthony Marchetti (Hawk Wrestling Club) Fall 0:51</li>\n<li>Champ. Round 1 - Jack Golnick (Golden Eagles WC) won by fall over Jakob Zahn (Morton Youth Wrestling) Fall 3:58</li>\n<li>Champ. Round 1 - Hunter Crowley (Fisher WC) won by fall over Grant Palmer (Arlington Cardinals) Fall 0:56</li>\n<li>Champ. Round 1 - Nick Potts (Kane County Grapplers) won by fall over Calvin Watkins (Harvey Park Dist Twisters) Fall 0:59</li>\n<li>Champ. Round 1 - Thomas Helton (Elmhurst Jr. Dukes) won by decision over Emmanuel Terrell (Rams Wrestling Club) Dec 9-7</li>\n<li>Champ. Round 1 - Al`lon Carter (Gladiators) won by tech fall over Cody Ayers (Oakwood WC) TF 18-3</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - David Charnot (Vittum Cats) won by fall over Nathan Orr (Lincoln-Way WC) Fall 0:28</li>\n<li>Champ. Round 1 - Blake Mccarthy (Rockridge Rocket Fuel WC) won by fall over Peyton Kellerman (Panther Powerhouse WC) Fall 2:23</li>\n<li>Champ. Round 1 - De`undre Garner (Gladiators) won by fall over Jayson Goplin (Streator WC) Fall 4:26</li>\n<li>Champ. Round 1 - Devon Sieveking (Benton Jr WC) won by fall over Samuel Orr (Lincoln-Way WC) Fall 0:12</li>\n<li>Champ. Round 1 - Trevor Holmberg (Bartlett Jr Hawks) won by decision over Sam Witz (Kane County Grapplers) Dec 4-0</li>\n<li>Champ. Round 1 - Zachary Parker (Knights Wrestling) won by fall over Chris Drennan (Springfield Capital Kids WC) Fall 2:28</li>\n<li>Champ. Round 1 - Alex Rosenbaum (Falcon Youth WC) won by fall over Derrick Cabrera (Chicago Crusaders) Fall 3:28</li>\n<li>Champ. Round 1 - Ricky Cantu (Gomez Wrestling Acad.) won by tech fall over David Buckner (Hononegah Kids WC) TF 15-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Brandon Reyes (Calumet MPD Wolverines) won by fall over Cyress Bergeron (Little Falcons WC) Fall 0:44</li>\n<li>Champ. Round 1 - Austin Fritzgerald (Junior Spartans WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Karim Fuentes (Gladiators) won by fall over Joe Carpenter (Harvey Park Dist Twisters) Fall 0:24</li>\n<li>Champ. Round 1 - Jack Simpson (Hoopeston Area WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jacob Gohde (Illini Bluffs WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Kyle Connolly (Jacksonville Area Youth Wrestling) won by fall over Joshua Moore (Calumet MPD Wolverines) Fall 0:16</li>\n<li>Champ. Round 1 - Alex Garsky (Murphysboro Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Daniel Dominiak (Waubonsie WC) won by fall over Bernardo Trevino (Shamrock WC) Fall 0:17</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Hiles (Indians Elite) won by fall over Brendan Gallo (Sharks WC) Fall 3:17</li>\n<li>Champ. Round 1 - Brent Ochoa (Vittum Cats) won by tech fall over Christopher Harrison (East St. Louis Wrestling) TF 18-2</li>\n<li>Champ. Round 1 - Austin Rudsinski (Lincoln-Way WC) won by decision over Dawson Thomas (Mt. Vernon Lions) Dec 13-6</li>\n<li>Champ. Round 1 - Travis Ford-melton (Harvey Park Dist Twisters) won by decision over Dane Durlacher (Bison WC) Dec 8-6</li>\n<li>Champ. Round 1 - Joe Ruffino (St. Charles East WC) won by decision over Ty`reese Smith (Lionheart Intense Wrestling) Dec 10-6</li>\n<li>Champ. Round 1 - Cameron Miller (Marengo Youth Wrestling) won by decision over Tyler Wood (Tigertown Tanglers) Dec 6-5</li>\n<li>Champ. Round 1 - Christian Goin (Central Elite Rebels) won by major decision over Tony Aughenbaugh (Mendota Mat Masters) Maj 15-5</li>\n<li>Champ. Round 1 - Nathan Zinzer (Oswego East Team No Ego) won by major decision over Caedyn Fitch (Little Rockets) Maj 11-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Kolbe O`brien (SCN Youth WC) won by decision over Kameron Moss (King Select Wrestling) Dec 6-5</li>\n<li>Champ. Round 1 - Dylan Burnoski (Bolingbrook Junior Raiders) won by tech fall over Austin Kedzie (Sycamore WC) TF 16-0</li>\n<li>Champ. Round 1 - Anthony Zamora (Force Wrestling) won by decision over James Higdon (Collinsville Raiders) Dec 4-2</li>\n<li>Champ. Round 1 - Joshua Fiegel (Richmond WC) won by decision over Patrick Daum (SCN Youth WC) Dec 5-4</li>\n<li>Champ. Round 1 - Brandon Muselman (Tinley Park Bulldogs) won by fall over Matthew Cinnamon (Saber Wrestling Club) Fall 2:53</li>\n<li>Champ. Round 1 - Christopher Whaley (Sauk Valley WC) won by decision over Dominic Testa (Gomez Wrestling Acad.) Dec 3-2</li>\n<li>Champ. Round 1 - Jacob Gross (Lakeland Predators) won by fall over Justen Pate (Harvey Park Dist Twisters) Fall 1:21</li>\n<li>Champ. Round 1 - Dakota Matthews (Fisher WC) won by major decision over Isaac Martinez (Junior Pioneer WC) Maj 17-6</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Jack Calderone (Junior Spartans WC) won by decision over Alek Ziegler (King Select Wrestling) Dec 2-1</li>\n<li>Champ. Round 1 - Ethan Phillips (Illinois Valley Elite WC) won by decision over Drew Mccoy (Springfield Capital Kids WC) Dec 8-4</li>\n<li>Champ. Round 1 - Anthony Rink (Brawlers WC) won by major decision over Joshua Moore (Pontiac WC) Maj 13-5</li>\n<li>Champ. Round 1 - Nicholas Norris (Chilli Dawgs WC) won by decision over Ryan Chambers (Murphysboro Wrestling) Dec 6-2</li>\n<li>Champ. Round 1 - Jason Renteria (Martinez Fox Valley Elite) won by decision over Brady Wilsie (Xtreme Wrestling) Dec 9-2</li>\n<li>Champ. Round 1 - Nicholas Donovan (Villa Lombard Cougars) won by major decision over Ja`chun Smith (Gladiators) Maj 12-4</li>\n<li>Champ. Round 1 - Austin Macias (Z`s Team Pena) won by major decision over Joseph Egan (Mustang WC) Maj 8-0</li>\n<li>Champ. Round 1 - Sean Mckenna (Martinez Fox Valley Elite) won by major decision over Ryan Burright (Gomez Wrestling Acad.) Maj 11-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Sean Cullen (Wrestling Factory) won by decision over Brandon Ramos (Plainfield WC) Dec 2-0</li>\n<li>Champ. Round 1 - Brice Casey (Springfield Capital Kids WC) won in overtime over Chris Bratten (Triad Little Knights) OT 4-0</li>\n<li>Champ. Round 1 - Markus Hartman (Barrington Broncos) won by fall over Chrishon Tucker (East St. Louis Wrestling) Fall 5:45</li>\n<li>Champ. Round 1 - Shajrianna Turner (Lionheart Intense Wrestling) won by decision over Liam Meagher (Little Celtic WC) Dec 6-1</li>\n<li>Champ. Round 1 - Devin Michicich (Southside Stallions) won by major decision over Alex Zacharuk (Harlem Huskies WC) Maj 9-0</li>\n<li>Champ. Round 1 - Cody Baldridge (Martinez Fox Valley Elite) won by decision over Aaron Summers (West Hancock Titan WC) Dec 4-2</li>\n<li>Champ. Round 1 - Peter Ogunsanya (Harvey Park Dist Twisters) won by decision over Charles Faber (Izzy Style School of Wrestling) Dec 6-4</li>\n<li>Champ. Round 1 - Bradley Holmes (Peoria Heights Minutemen) won by decision over Tyler Lane (Crystal Lake Wizards) Dec 4-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Zachary Lorek (Brawlers WC) won by decision over Jakob Cysewski (Barrington Broncos) Dec 3-1</li>\n<li>Champ. Round 1 - Christian Hall (Harvey Park Dist Twisters) won by major decision over Dustin Swanson (Hawk Wrestling Club) Maj 9-1</li>\n<li>Champ. Round 1 - Wylie Allen (Crystal Lake Wizards) won by decision over Antonio Menozi (Little Celtic WC) Dec 7-2</li>\n<li>Champ. Round 1 - John Cullen (Wrestling Factory) won by fall over Mohammed Taylor (Harvey Park Dist Twisters) Fall 1:25</li>\n<li>Champ. Round 1 - Isaac Jacquez (Martinez Fox Valley Elite) won by major decision over Joe Worms (Illini Bluffs WC) Maj 8-0</li>\n<li>Champ. Round 1 - Brandon Critchfield (King Select Wrestling) won by major decision over Bradley Emmett (Springfield Capital Kids WC) Maj 14-0</li>\n<li>Champ. Round 1 - Anthony Rubino (SCN Youth WC) won by decision over Johnathan Moylan (Granite City WC) Dec 11-6</li>\n<li>Champ. Round 1 - Demarius Terhune (Champaign Wrestling Club) won by decision over Devin Beaston (West Hancock Titan WC) Dec 7-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Kenneth Barber (Wrestling Factory) won by decision over Clayton Bell (Mahomet-Seymour Youth WC) Dec 7-0</li>\n<li>Champ. Round 1 - Zachary Krause (Force Wrestling) won by decision over Frank Woods (Crystal Lake Wizards) Dec 6-0</li>\n<li>Champ. Round 1 - Drew Hoselton (Prairie Central-Chenoa Hawks) won by decision over Cole Smith (Little Celtic WC) Dec 5-0</li>\n<li>Champ. Round 1 - Lucas Busse (Wolves WC) won by major decision over Noah Jackson (Waukegan Youth WC) Maj 13-5</li>\n<li>Champ. Round 1 - Guy Brown (Edwardsville WC) won by major decision over Tristin Tripp (West Hancock Titan WC) Maj 8-0</li>\n<li>Champ. Round 1 - Ryan Murray (Little Falcons WC) won in overtime over Rahman Johnson (Harvey Park Dist Twisters) OT 6-4</li>\n<li>Champ. Round 1 - Jared Ellingwood (Martinez Fox Valley Elite) won by decision over Jarrid Braunagel (O`Fallon Little Panthers) Dec 4-2</li>\n<li>Champ. Round 1 - Braxten Ary (Midwest Central Youth) won by decision over Kevin Davis (Little Huskie WC) Dec 7-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Matthew Hennessey (Force Wrestling) won by fall over Terrell Hess Ii (Peoria Razorbacks Youth WC) Fall 2:20</li>\n<li>Champ. Round 1 - Egan Berta (Lemont Bears WC) won by fall over Henry Graham (Lionheart Intense Wrestling) Fall 2:32</li>\n<li>Champ. Round 1 - Christian Davis (Hoopeston Area WC) won by decision over Joey Schloegel (Lincoln-Way WC) Dec 7-5</li>\n<li>Champ. Round 1 - Chris Betancourt (Harvey Park Dist Twisters) won by fall over Blake Begner (Metamora Kids WC) Fall 2:15</li>\n<li>Champ. Round 1 - Jacob Fiorito (Crystal Lake Wizards) won by fall over Braden Whitecotton (Herrin Junior WC) Fall 0:46</li>\n<li>Champ. Round 1 - Joshua Barzowski (Martinez Fox Valley Elite) won by tech fall over Bobby Pryhocki (Lakeland Predators) TF 17-2</li>\n<li>Champ. Round 1 - Jacob Hawkins (Harlem Huskies WC) won by fall over Frank Mazur (Arlington Cardinals) Fall 1:24</li>\n<li>Champ. Round 1 - Devin Kane (Martinez Fox Valley Elite) won by fall over Jacob Dixon (Carlinville Kids WC) Fall 4:05</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Zachary Wade (Batavia Pinners) won by decision over Joey Saracco (Force Wrestling) Dec 6-0</li>\n<li>Champ. Round 1 - Logan Mcclellan (King Select Wrestling) won by fall over Cale Sementi (Champaign Wrestling Club) Fall 2:11</li>\n<li>Champ. Round 1 - Cole Bateman (Orland Park Pioneers) won by decision over Gabriel Cross (Lionheart Intense Wrestling) Dec 7-0</li>\n<li>Champ. Round 1 - Ameen Hamdan (Triumph `The Art of Wrestling`) won by decision over David Diak (Edwardsville WC) Dec 9-3</li>\n<li>Champ. Round 1 - Devin Donovan (Villa Lombard Cougars) won by major decision over Garrett Petreikis (Rockridge Rocket Fuel WC) Maj 12-0</li>\n<li>Champ. Round 1 - Justin Martinez (Xtreme Wrestling) won by fall over Bison Carcelli (Southside Comets) Fall 4:06</li>\n<li>Champ. Round 1 - Jesse Ditzler (Sauk Valley WC) won by decision over Cameron Lopez (Tinley Park Bulldogs) Dec 2-0</li>\n<li>Champ. Round 1 - Jaylen Shaw (Arlington Cardinals) won by fall over Jacob Oury (Golden Eagles WC) Fall 2:00</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Kevin Zange (Crystal Lake Wizards) won by tech fall over Roman Johnson (Will County Warriors) TF 18-3</li>\n<li>Champ. Round 1 - Brandon Rutherford (Mt. Vernon Lions) won by fall over Lewis Radosevich (Vittum Cats) Fall 2:30</li>\n<li>Champ. Round 1 - Patrick Brucki (Orland Park Pioneers) won by decision over Kyle Marshall (Vittum Cats) Dec 7-2</li>\n<li>Champ. Round 1 - Brandon Elsbury (Xtreme Wrestling) won by decision over Dylan Rosentreter (Carlinville Kids WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jordan Soto (Batavia Pinners) won by fall over Kellen Sarver (Champaign Wrestling Club) Fall 2:46</li>\n<li>Champ. Round 1 - Christian Brunner (Barrington Broncos) won by fall over Kayne Jenkins (Illinois Valley Elite WC) Fall 2:57</li>\n<li>Champ. Round 1 - Alex Gonzalez (Blackhawk WC) won by decision over Danny Madonia (Gomez Wrestling Acad.) Dec 5-0</li>\n<li>Champ. Round 1 - Aaron Weaver (Westville Youth WC) won by fall over Niles Ager (Sauk Valley WC) Fall 1:04</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Gabriel Montalvo (Lincoln-Way WC) won by decision over Nicholas Sundburg (Crystal Lake Wizards) Dec 4-2</li>\n<li>Champ. Round 1 - Alex Rodriguez (Fox Lake WC) won by fall over Caleb Adams (West Hancock Titan WC) Fall 3:56</li>\n<li>Champ. Round 1 - Maximillian Hill (Lakeland Predators) won by fall over Kyle Gara (Marengo Youth Wrestling) Fall 3:24</li>\n<li>Champ. Round 1 - Kenneth Kirkland (Indians Elite) won by decision over Zach Humphrey (Geneseo Spider WC) Dec 5-0</li>\n<li>Champ. Round 1 - Ryan Murfield (O`Fallon Little Panthers) won by decision over Tyler Laux (Harvey Park Dist Twisters) Dec 13-7</li>\n<li>Champ. Round 1 - Levi Ransom (Pontiac WC) won by decision over Nate Jimenez (SCN Youth WC) Dec 4-0</li>\n<li>Champ. Round 1 - Spencer Feerer (Kane County Grapplers) won by decision over Gavin Pickel (Herrin Junior WC) Dec 9-5</li>\n<li>Champ. Round 1 - Kyle Karpinski (Southside Stallions) won by fall over Dalton Whitted (Mahomet-Seymour Youth WC) Fall 0:48</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Cummens (Junior Spartans WC) won by fall over Connor Placey (Izzy Style School of Wrestling) Fall 0:41</li>\n<li>Champ. Round 1 - Dalton Willett (Warren County Brawlers) won by decision over Jeremy Dedick (Richmond WC) Dec 7-5</li>\n<li>Champ. Round 1 - Ethan Cain (Sauk Valley WC) won by decision over Amir Zegar (Little Celtic WC) Dec 10-4</li>\n<li>Champ. Round 1 - Nicolas Delgado (Marengo Youth Wrestling) won in overtime over Connor Cesaretti (Naperville WC) OT 8-6</li>\n<li>Champ. Round 1 - Tariq Thurman (Gladiators) won by fall over Mason Beadles (Mahomet-Seymour Youth WC) Fall 4:27</li>\n<li>Champ. Round 1 - Zach Peterson (Bulls WC) won by fall over Arturo Alfaro (Gomez Wrestling Acad.) Fall 2:24</li>\n<li>Champ. Round 1 - Tj Casella (Lions WC) won in overtime over David Apple (Team West Wolves) OT 4-2</li>\n<li>Champ. Round 1 - Tyler Eggemeyer (Panther Powerhouse WC) won by fall over Joshua French (Prairie Central-Chenoa Hawks) Fall 2:53</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Robbie Seredi (Gomez Wrestling Acad.) won by tech fall over Anthony Tudisco (Oswego East Team No Ego) TF 17-2</li>\n<li>Champ. Round 1 - Matthew Rafe (Brawlers WC) won by fall over Jack Bond (O`Fallon Little Panthers) Fall 1:27</li>\n<li>Champ. Round 1 - Xavier Sallie (Will County Warriors) won by decision over Elijah Rochel (Villa Park Young Warriors) Dec 12-5</li>\n<li>Champ. Round 1 - Keenan Edgar (Chicago Crusaders) won by fall over Maxwell Jennings (MC Bulldog Wrestling Club) Fall 1:00</li>\n<li>Champ. Round 1 - Michael Beaudoin (Sycamore WC) won by decision over Diata Drayton (Harvey Park Dist Twisters) Dec 9-6</li>\n<li>Champ. Round 1 - Gavin Mast (Champions WC) won by fall over Garrette Branson (Mattoon Youth WC) Fall 4:29</li>\n<li>Champ. Round 1 - Daltyn Dodd (Moline WC) won in overtime over Caleb Mennen (Hawk Wrestling Club) OT 6-5</li>\n<li>Champ. Round 1 - Gavin Goddard (Champaign Wrestling Club) won by fall over Devin O`rourke (Oak Forest Warriors) Fall 3:49</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Sean Kelly (Little Celtic WC) won by fall over Vlad Stepanov (Tigertown Tanglers) Fall 0:25</li>\n<li>Champ. Round 1 - Christian Brown (Oswego East Team No Ego) won by fall over Jonathon Litterio (Mustang WC) Fall 4:14</li>\n<li>Champ. Round 1 - Chris Yaros (Vittum Cats) won by fall over Caleb Rojas (Brawlers WC) Fall 3:00</li>\n<li>Champ. Round 1 - Maxwell Oswalt (Sauk Valley WC) won by major decision over Katlin Michelon (Roxana Kids WC) Maj 9-1</li>\n<li>Champ. Round 1 - Kory Loew (Edwardsville WC) won by decision over Niles Harmon (Rockford WC) Dec 4-0</li>\n<li>Champ. Round 1 - Wayne Sobotka (Shamrock WC) won by fall over Jacob Franklin (Fisher WC) Fall 1:16</li>\n<li>Champ. Round 1 - Woo Lee (Arlington Cardinals) won by fall over Cameron Doyle (Stillman Valley WC) Fall 2:48</li>\n<li>Champ. Round 1 - Daniel Spencer (Team Mascoutah) won by fall over Rocco Farriols (Crosstown WC) Fall 1:56</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Andy Gastelum (Force Wrestling) won by decision over Tyler Caldwell (Yorkville Wrestling Club) Dec 7-3</li>\n<li>Champ. Round 1 - Noah Miller (Arlington Cardinals) won by fall over Alexander Marston (A &amp; M Youth Wrestling) Fall 1:02</li>\n<li>Champ. Round 1 - Dayton Coyle (Seneca Irish Cadets) won by fall over Anthony Wilson (East St. Louis Wrestling) Fall 2:31</li>\n<li>Champ. Round 1 - Michael Bruno (Arlington Cardinals) won by fall over Colan Ciciura (Falcons WC) Fall 1:00</li>\n<li>Champ. Round 1 - Nathan King (Little Falcons WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Cody Barnes (Crystal Lake Wizards) won by fall over Austin Kent (Edwardsville WC) Fall 2:12</li>\n<li>Champ. Round 1 - Cole Roach (Crystal Lake Wizards) won by fall over Richard Smith (Renegade WC (NFP)) Fall 3:28</li>\n<li>Champ. Round 1 - Adam Shultz (WW Tiger WC) won by decision over Gary Crites (Granite City WC) Dec 4-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Keith Mcgee (Junior Spartans WC) won by fall over Joseph Katula (Yorkville Wrestling Club) Fall 0:11</li>\n<li>Champ. Round 1 - Alexander Anguiano (Belvidere Bandits) won by fall over Victor Hawthorne (Granite City WC) Fall 1:55</li>\n<li>Champ. Round 1 - Dylan Ervin (Martinez Fox Valley Elite) won by fall over Joe Ambuel (Edwardsville WC) Fall 2:05</li>\n<li>Champ. Round 1 - Josh Davis (Rock Island WC) won by fall over Xavier Nicholls (Rockford WC) Fall 1:24</li>\n<li>Champ. Round 1 - Jacob Godinez (Central Elite Rebels) won by fall over Conrad Powell (Paxton Youth WC) Fall 4:15</li>\n<li>Champ. Round 1 - Charlie Kirkwood (Oswego East Team No Ego) won by fall over Roberto Quintero (Southside Stallions) Fall 1:30</li>\n<li>Champ. Round 1 - Kenny Martens (Maine Eagles) won by decision over Stephen Kreyenbuhl (Elmhurst Jr. Dukes) Dec 9-2</li>\n<li>Champ. Round 1 - Frank Tomaskovic (Vittum Cats) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Nathan Karas (Plainfield WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Landon Johnson (Junior Maroon WC) won by fall over Robert Gannon (Downers Grove Cougars) Fall 2:54</li>\n<li>Champ. Round 1 - Riley State (Little Huskie WC) won by fall over Adam Jung (A-J Junior Wildcats) Fall 0:29</li>\n<li>Champ. Round 1 - Antonio James (East St. Louis Wrestling) won by fall over Quinn Polaski (Junior Porters WC) Fall 2:22</li>\n<li>Champ. Round 1 - Adrian Ortiz (Arlington Cardinals) won by fall over Christopher Buntyn (Hononegah Kids WC) Fall 1:13</li>\n<li>Champ. Round 1 - Devin Knight (Sycamore WC) won by fall over Tristan Miller (The Law) Fall 2:12</li>\n<li>Champ. Round 1 - Alexander Zentner (Barrington Broncos) won by fall over Hayden Saldivar (Naperville WC) Fall 2:59</li>\n<li>Champ. Round 1 - Matthew Bernal (Rebels WC) won by decision over Zach Reed (Dakota WC) Dec 5-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Michael Gomez (Cary Matmen WC) won by fall over David Beacom (Little Huskie WC) Fall 3:40</li>\n<li>Champ. Round 1 - Luke Mathias (A &amp; M Youth Wrestling) won by fall over James Rowe (Junior Spartans WC) Fall 0:37</li>\n<li>Champ. Round 1 - Nicholas Barker (Vittum Cats) won by fall over Matthew Roan (Hononegah Kids WC) Fall 1:28</li>\n<li>Champ. Round 1 - Alec Daykin (Riverton Hawks Wrestling) won by decision over Kyle Hedge (Crystal Lake Wizards) Dec 3-1</li>\n<li>Champ. Round 1 - Christopher Caldwell (Junior Rams WC) won by fall over Wolfgang Kemp (Crystal Lake Wizards) Fall 1:09</li>\n<li>Champ. Round 1 - Deandre Ford (Oswego East Team No Ego) won by decision over Devin Flodin (Arlington Cardinals) Dec 1-0</li>\n<li>Champ. Round 1 - Trey Kerrens (Murphysboro Wrestling) won by fall over Chase Norton (Tigertown Tanglers) Fall 1:30</li>\n<li>Champ. Round 1 - Francisco Quiroz (Huntley Jr. Red Raiders) won by fall over Kevin Hoelscher (Fox Lake WC) Fall 1:50</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - James Pawelski (Maine Eagles) won by decision over Joseph Brauer (Little Celtic WC) Dec 3-1</li>\n<li>Champ. Round 1 - Joshua Gentry (Badger WC) won by major decision over Deontae Yancey (Edwardsville WC) Maj 13-2</li>\n<li>Champ. Round 1 - Tyler Myers (Plainfield WC) won by decision over Mario Trice (Edwardsville WC) Dec 6-0</li>\n<li>Champ. Round 1 - Tyler Scanlon (Tinley Park Bulldogs) won by decision over Adam Nixon (Gomez Wrestling Acad.) Dec 4-0</li>\n<li>Champ. Round 1 - Kyle Bernat (SCN Youth WC) won by decision over Rocco Falco (Southside Stallions) Dec 6-0</li>\n<li>Champ. Round 1 - Beau Harrier (Golden Eagles WC) won by fall over Logan Voss (Sauk Valley WC) Fall 1:14</li>\n<li>Champ. Round 1 - Raul Marrero Jr (Springfield Capital Kids WC) won by fall over Brenden Macdonald (Rock Island WC) Fall 2:51</li>\n<li>Champ. Round 1 - Kyle Szlenk (Crystal Lake Wizards) won by decision over Michael Doranski (Batavia Pinners) Dec 4-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Vinnie Piunti (Martinez Fox Valley Elite) won by fall over Brandon Acklin (Edwardsville WC) Fall 0:37</li>\n<li>Champ. Round 1 - Shaun Wasso (Little Celtic WC) won by fall over Dylan Devries (Stillman Valley WC) Fall 0:44</li>\n<li>Champ. Round 1 - Matthew Crnich (Lincoln-Way WC) won by decision over Jevon Hey (Belleville Little Devils) Dec 4-0</li>\n<li>Champ. Round 1 - Joe Antonelli (SCN Youth WC) won by fall over Nathan Olsen (Crystal Lake Wizards) Fall 2:20</li>\n<li>Champ. Round 1 - Christian Robertson (Vittum Cats) won by fall over Jonathan Hethmon (Falcon Youth WC) Fall 1:21</li>\n<li>Champ. Round 1 - Jake Bess (Maine Eagles) won by decision over Ryan Brooks (East Peoria Crossface WC) Dec 4-1</li>\n<li>Champ. Round 1 - Drew Johnson (Team West Wolves) won by major decision over Dakota Marrello (Southside Stallions) Maj 12-3</li>\n<li>Champ. Round 1 - Dustin Huss (Charger WC) won by decision over Gage Adams (Fisher WC) Dec 9-6</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Kyle Ruettiger (Lincoln-Way WC) won by fall over Dylan Chambers (Murphysboro Wrestling) Fall 0:44</li>\n<li>Champ. Round 1 - Hunter Grau (Geneseo Spider WC) won by decision over Daniel Swan (Tinley Park Bulldogs) Dec 6-0</li>\n<li>Champ. Round 1 - Andrew Mcfall (Force Wrestling) won by fall over Takoda Blair (Prairie Central-Chenoa Hawks) Fall 0:38</li>\n<li>Champ. Round 1 - Tanner Ambry (Edwardsville WC) won by decision over Will Lucie (West Hancock Titan WC) Dec 4-2</li>\n<li>Champ. Round 1 - Joshua Larson (Xtreme Wrestling) won by fall over Quinn Doherty (Martinez Fox Valley Elite) Fall 3:46</li>\n<li>Champ. Round 1 - Jacob Silzer (Tinley Park Bulldogs) won by tech fall over Brian Rossdeutcher (Junior Cougar WC) TF 17-1</li>\n<li>Champ. Round 1 - Christopher Dranka (Crystal Lake Wizards) won by major decision over Valentino Ortiz (Southside Stallions) Maj 8-0</li>\n<li>Champ. Round 1 - Conrad Noverini (SCN Youth WC) won by decision over Tristan Zabinski (Gomez Wrestling Acad.) Dec 1-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Matthew Valenti (Bartlett Jr Hawks) won by decision over David Krohn (Plainfield WC) Dec 4-3</li>\n<li>Champ. Round 1 - Johnathan Turner (Springfield Capital Kids WC) won by decision over Marquez Roberson (Belleville Little Devils) Dec 4-3</li>\n<li>Champ. Round 1 - Jackson Schoen (Gomez Wrestling Acad.) won by decision over Greylin Powers (Granite City WC) Dec 1-0</li>\n<li>Champ. Round 1 - Darin Trout (Pontiac WC) won by fall over Blake Belt (Brawlers WC) Fall 2:48</li>\n<li>Champ. Round 1 - David Kasper (Southside Stallions) won by fall over Alec Henze (Dakota WC) Fall 0:36</li>\n<li>Champ. Round 1 - Joey Nauman (Yorkville Wrestling Club) won by decision over Joseph Riordan (Martinez Fox Valley Elite) Dec 9-3</li>\n<li>Champ. Round 1 - Steven Fessler (Vittum Cats) won by decision over Jake Cornish (Oswego East Team No Ego) Dec 11-5</li>\n<li>Champ. Round 1 - Britches Sikula (Wolves WC) won by decision over Brody Vester (Yorkville Wrestling Club) Dec 2-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Jake Drew (Gomez Wrestling Acad.) won by major decision over Jake Tisza (Junior Spartans WC) Maj 13-0</li>\n<li>Champ. Round 1 - David Mcdermott (St. Charles East WC) won by major decision over Jaron Robinson (Mendota Mat Masters) Maj 16-2</li>\n<li>Champ. Round 1 - Bobby Alexander (Gomez Wrestling Acad.) won by fall over Grady Todd (Junior Rams WC) Fall 0:41</li>\n<li>Champ. Round 1 - Jack Pradel (Oswego East Team No Ego) won by major decision over Joseph Miner (Bolingbrook Junior Raiders) Maj 9-0</li>\n<li>Champ. Round 1 - John Bass (King Select Wrestling) won by major decision over Isaac Horsch (Fisher WC) Maj 15-4</li>\n<li>Champ. Round 1 - Logan Lundelius (Crystal Lake Wizards) won by decision over Robert Zebrauskas (Southside Stallions) Dec 6-4</li>\n<li>Champ. Round 1 - Gunner Wenger (The Law) won by decision over Chris Worthey (Benton Jr WC) Dec 2-0</li>\n<li>Champ. Round 1 - Steve Novy (Mustang WC) won by fall over Jeffrey Leach (Prairie Central-Chenoa Hawks) Fall 0:41</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Brian Krasowski (Orland Park Pioneers) won by decision over Jacob Gatz (Arlington Cardinals) Dec 4-3</li>\n<li>Champ. Round 1 - Nick Gasbarro (Tinley Park Bulldogs) won by fall over Nathan Olsen (Dakota WC) Fall 0:59</li>\n<li>Champ. Round 1 - Brandon Meyer (Crystal Lake Wizards) won by decision over Andrew Butz (Falcons WC) Dec 3-0</li>\n<li>Champ. Round 1 - Jimmy Gallardo (Gomez Wrestling Acad.) won by fall over Alex Madrigal (Southside Stallions) Fall 3:30</li>\n<li>Champ. Round 1 - Christian Milliron (Yorkville Wrestling Club) won by decision over Qarin Johnnic (WW Tiger WC) Dec 6-3</li>\n<li>Champ. Round 1 - Cody Harris (Belleville Little Devils) won by decision over Matthew Watson (Lil` Storm) Dec 11-6</li>\n<li>Champ. Round 1 - Michael Callahan (SCN Youth WC) won by major decision over Chase Worthey (Benton Jr WC) Maj 18-5</li>\n<li>Champ. Round 1 - Anthony Vota (Little Redskins WC) won by major decision over Dakota Akins (Bismarck Henning WC) Maj 10-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Peter Perich (Force Wrestling) won by fall over Cole Ebenroth (Junior Rams WC) Fall 0:40</li>\n<li>Champ. Round 1 - Kameron Irvin (Gladiators) won by fall over Cody Tournear (Champaign Wrestling Club) Fall 3:29</li>\n<li>Champ. Round 1 - Jared Finley (Shelbyville Jr Rams Wrestling) won by decision over Kevin Soraghan (Force Wrestling) Dec 9-5</li>\n<li>Champ. Round 1 - Eric Schultz (Tinley Park Bulldogs) won by decision over Camiran Sadeghi (West Hancock Titan WC) Dec 5-0</li>\n<li>Champ. Round 1 - Alexander Butler (Fighting Titans) won by decision over Peyton Smith (Benton Jr WC) Dec 10-7</li>\n<li>Champ. Round 1 - Noah Drabek (Lakeland Predators) won by decision over Elijah Baltazar (SCN Youth WC) Dec 6-0</li>\n<li>Champ. Round 1 - Vincent Turk (Crystal Lake Wizards) won by decision over Alexander Mckenna (Trevian WC) Dec 7-1</li>\n<li>Champ. Round 1 - Colten Ratz (Fox Valley WC) won by decision over Don Cavitt (East St. Louis Wrestling) Dec 5-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Clayton Ledbetter (Force Wrestling) won by major decision over Adam Ziminski (Waubonsie WC) Maj 13-0</li>\n<li>Champ. Round 1 - Nicholas Foster (Belleville Junior Hit Squad) won in overtime over Wyatt Fox (Shelbyville Jr Rams Wrestling) OT 9-7</li>\n<li>Champ. Round 1 - Ben Schneider (Orland Park Pioneers) won by decision over Ethan Haines (Champaign Wrestling Club) Dec 6-0</li>\n<li>Champ. Round 1 - Dequarius Millett (Granite City WC) won by decision over Nathan Traxler (SCN Youth WC) Dec 5-3</li>\n<li>Champ. Round 1 - Travis Cysewski (Barrington Broncos) won by decision over Austin Wilson (Peoria Heights Minutemen) Dec 4-0</li>\n<li>Champ. Round 1 - Isaiah White (Harvey Park Dist Twisters) won by major decision over Nicholas Remke (Marengo Youth Wrestling) Maj 12-3</li>\n<li>Champ. Round 1 - Tom Slattery (Tinley Park Bulldogs) won by fall over Daniel Terronez (Moline WC) Fall 4:22</li>\n<li>Champ. Round 1 - Kameron Vantassel (Hononegah Kids WC) won by fall over Julius Smith (Barrington Broncos) Fall 4:02</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Eric Barone (Wolves WC) won by fall over Tristan Smith (Falcon Youth WC) Fall 1:58</li>\n<li>Champ. Round 1 - Nathan Romero (Martinez Fox Valley Elite) won by decision over Mason Delong (Brawlers WC) Dec 8-4</li>\n<li>Champ. Round 1 - Tanner Anthony (Harlem Huskies WC) won by fall over Nikolas Mccoy (Crosstown WC) Fall 0:54</li>\n<li>Champ. Round 1 - Ben Williamson (Naperville WC) won by fall over Tyler Bergstralh (Prairie Central-Chenoa Hawks) Fall 1:01</li>\n<li>Champ. Round 1 - Johnny Davidson (Barrington Broncos) won in overtime over Joseph Muller (Tinley Park Bulldogs) OT 7-6</li>\n<li>Champ. Round 1 - Patrick Stanton (Murphysboro Wrestling) won by decision over Dalton Lawver (Rock Island WC) Dec 6-0</li>\n<li>Champ. Round 1 - Sage Friese (Seneca Irish Cadets) won by major decision over Adrian Wroblewski (Arlington Cardinals) Maj 14-2</li>\n<li>Champ. Round 1 - Jim Brennan (Lemont Bears WC) won by decision over Brayton Williams (Edwardsville WC) Dec 6-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Lucas Reifsteck (Force Wrestling) won by fall over Jarrod Raap (Dundee Highlanders) Fall 1:06</li>\n<li>Champ. Round 1 - Andrew Aldarondo (Badger WC) won by fall over Jonathan Chamberlain (Roxana Kids WC) Fall 2:35</li>\n<li>Champ. Round 1 - Hasan Muhammad (Renegade WC (NFP)) won by fall over Eric Bey (Junior Spartans WC) Fall 4:30</li>\n<li>Champ. Round 1 - Andrew Marsden (Crystal Lake Wizards) won by decision over Dalton Blankenship (Vandalia Jr Vandals) Dec 6-5</li>\n<li>Champ. Round 1 - Riley Demoss (SCN Youth WC) won by fall over Cody Rice (Westville Youth WC) Fall 4:20</li>\n<li>Champ. Round 1 - Caleb Bedford (Moline WC) won by decision over Samuel Torrence (Barrington Broncos) Dec 8-5</li>\n<li>Champ. Round 1 - Ramon Lopez (Martinez Fox Valley Elite) won by major decision over Michael Otzwirk (Bartlett Jr Hawks) Maj 11-1</li>\n<li>Champ. Round 1 - Joseph Medina (Geneseo Spider WC) won by fall over Tyson Digby (Lil` Storm) Fall 0:40</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Garrett Rude (Hawk Wrestling Club) won by decision over Bryce Gabel (Brawlers WC) Dec 12-5</li>\n<li>Champ. Round 1 - Clayton Mckimmy (Fox Lake WC) won by fall over Gauge Valberg-brown (Rock Island WC) Fall 0:56</li>\n<li>Champ. Round 1 - William King (Dundee Highlanders) won by fall over Tanner Strobel (Arlington Cardinals) Fall 2:27</li>\n<li>Champ. Round 1 - Mitchel Humphrey (Mendota Mat Masters) won by fall over Roger Thigpen (Force Wrestling) Fall 3:21</li>\n<li>Champ. Round 1 - Patrick Kristin (Tinley Park Bulldogs) won by fall over Brett Vogel (Hillsboro Jr Toppers) Fall 2:06</li>\n<li>Champ. Round 1 - Austin Shelton (Oakwood WC) won by decision over Jake Birkhaug (Batavia Pinners) Dec 2-0</li>\n<li>Champ. Round 1 - Wesley Villarreal (Kane County Grapplers) won by major decision over Taylor Streeter (Murphysboro Wrestling) Maj 12-2</li>\n<li>Champ. Round 1 - Dru Worker (Tinley Park Bulldogs) won by fall over Wesley Kibler (SJO Spartan Youth WC) Fall 1:05</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Justin Esposito (Little Celtic WC) won by fall over Victor Aguirre (Oswego East Team No Ego) Fall 1:06</li>\n<li>Champ. Round 1 - Dallas Appleman (Clipper WC) won by fall over David Labash (Hawk Wrestling Club) Fall 2:41</li>\n<li>Champ. Round 1 - Jacob Spanier (Mendota Mat Masters) won by major decision over Derek Biliskov (Force Wrestling) Maj 9-0</li>\n<li>Champ. Round 1 - Jacob Villarreal (Kane County Grapplers) won by decision over Justin Dauphin (Crystal Lake Wizards) Dec 8-6</li>\n<li>Champ. Round 1 - John Mclaughlin (Vittum Cats) won by decision over Gunnar Meeker (SJO Spartan Youth WC) Dec 6-1</li>\n<li>Champ. Round 1 - Dillon Warnecke (Villa Lombard Cougars) won by fall over Bryce Kuhner (Highland Bulldog Jr WC) Fall 0:55</li>\n<li>Champ. Round 1 - Kenneth Marshall (Vittum Cats) won by decision over Mark Bornhofen (Barrington Broncos) Dec 5-0</li>\n<li>Champ. Round 1 - Jarod Noel (Bismarck Henning WC) won by major decision over Shawn Markovic (Granite City WC) Maj 11-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Collin Cronberg (Little Celtic WC) won by fall over Stefan Ivanisevic (Hinsdale WC) Fall 1:06</li>\n<li>Champ. Round 1 - Tate Manka (Riverton Hawks Wrestling) won by major decision over Blaine Bilek (Southside Stallions) Maj 10-0</li>\n<li>Champ. Round 1 - Christopher Morgan (Gladiators) won by fall over Chris Murino (Orland Park Pioneers) Fall 2:50</li>\n<li>Champ. Round 1 - Rashann Ford (Blackhawk WC) won by decision over Matthew Saults (Lil` Storm) Dec 9-4</li>\n<li>Champ. Round 1 - Niko Portokalis (Arlington Cardinals) won by decision over Mitchell Pearson (Edwardsville WC) Dec 11-6</li>\n<li>Champ. Round 1 - De`gyon Macklin (Hawk Wrestling Club) won by fall over Chase Dietrich (Chilli Dawgs WC) Fall 1:22</li>\n<li>Champ. Round 1 - Matthew Striegel (King Select Wrestling) won by major decision over Tom Price (Knights Wrestling) Maj 12-1</li>\n<li>Champ. Round 1 - Anthony Jarvis (Shamrock WC) won by decision over Alex Bleeker (Pekin Boys &amp; Girls Club) Dec 13-6</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Keenith Edgar (Chicago Crusaders) won by fall over Raul Lopez (Moline WC) Fall 2:03</li>\n<li>Champ. Round 2 - Ryan Yohe (Martinez Fox Valley Elite) won by decision over Deven English (Hoopeston Intermediate Wrestling) Dec 4-3</li>\n<li>Champ. Round 2 - James Watters (Edwardsville WC) won by fall over Ezra Avery (Lions WC) Fall 0:38</li>\n<li>Champ. Round 2 - Sylvester Vijil (Hononegah Kids WC) won by decision over Caleb Dorsey (Junior Pioneer WC) Dec 7-4</li>\n<li>Champ. Round 2 - Nick Graziano (Oak Forest Warriors) won by decision over Bradley Nelson (Hampshire WC) Dec 5-3</li>\n<li>Champ. Round 2 - Troy Ott (Mad Dog Wrestling Academy) won by major decision over Brendon Gambill (Little Falcons WC) Maj 15-2</li>\n<li>Champ. Round 2 - George Bessette (Lakeland Predators) won by tech fall over Eliceo Villarreal (Peoria Razorbacks Youth WC) TF 18-3</li>\n<li>Champ. Round 2 - Tyler Grimsley (Saukee Youth WC) won by decision over Trevor Schmidt (Falcons WC) Dec 3-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Jonathan Broadway (Centralia) won by fall over Colton Cinotto (L-P Crunching Cavs) Fall 4:12</li>\n<li>Champ. Round 2 - Romeo Mcknight (Crystal Lake Wizards) won by fall over Matthew Domek (Lancer WC) Fall 0:31</li>\n<li>Champ. Round 2 - Lake Vitkauskas (Oak Forest Warriors) won by fall over Blake Runkle (Champbuilders WC) Fall 1:45</li>\n<li>Champ. Round 2 - Peter Capetillo (SCN Youth WC) won by fall over Andrea Sennett (Bison WC) Fall 1:21</li>\n<li>Champ. Round 2 - Brandon Andino (Gomez Wrestling Acad.) won by decision over Macario Jaramillo (Southside Comets) Dec 5-4</li>\n<li>Champ. Round 2 - Jarryd Cabusao (Golden Eagles WC) won by tech fall over Madison Carlton (Oakwood WC) TF 15-0</li>\n<li>Champ. Round 2 - Brady Rude (Sauk Valley WC) won by fall over Keegan O`donnell (Crystal Lake Wizards) Fall 2:27</li>\n<li>Champ. Round 2 - Dylan Schultz (Lincoln-Way WC) won by fall over Jamie Hernandez (Blackhawk WC) Fall 0:30</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Allen Stallings (Gladiators) won by injury default over Aaron Ditsworth (Moline WC) Inj. 0:00</li>\n<li>Champ. Round 2 - Matt Allen (Hinsdale WC) won by decision over Blake Zalapi (Hononegah Kids WC) Dec 5-3</li>\n<li>Champ. Round 2 - Wade Thiele (Saukee Youth WC) won by fall over Jordan Ryan (Bartlett Jr Hawks) Fall 0:53</li>\n<li>Champ. Round 2 - Kumari Jackson (Springfield Capital Kids WC) won by decision over Jack Golnick (Golden Eagles WC) Dec 2-1</li>\n<li>Champ. Round 2 - Hunter Crowley (Fisher WC) won by decision over Austin Thurman (Belleville Little Devils) Dec 7-0</li>\n<li>Champ. Round 2 - Kenneth Abitua (Xtreme Wrestling) won by tech fall over Nick Potts (Kane County Grapplers) TF 15-0</li>\n<li>Champ. Round 2 - Cole Hunzeker (Geneseo Spider WC) won by fall over Thomas Helton (Elmhurst Jr. Dukes) Fall 1:23</li>\n<li>Champ. Round 2 - Matt Brozovich (Indians Elite) won by decision over Al`lon Carter (Gladiators) Dec 3-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - David Charnot (Vittum Cats) won by fall over Andru White (Oakwood WC) Fall 0:26</li>\n<li>Champ. Round 2 - Thomas Rollete (Hononegah Kids WC) won by fall over Blake Mccarthy (Rockridge Rocket Fuel WC) Fall 2:17</li>\n<li>Champ. Round 2 - De`undre Garner (Gladiators) won by fall over Dominic Ferraro (Gomez Wrestling Acad.) Fall 4:48</li>\n<li>Champ. Round 2 - Devon Sieveking (Benton Jr WC) won by decision over Devin Moore (Blackhawk WC) Dec 7-4</li>\n<li>Champ. Round 2 - Andrew Wise (Aces WC) won by fall over Trevor Holmberg (Bartlett Jr Hawks) Fall 1:10</li>\n<li>Champ. Round 2 - Remington Smith (Limestone Youth WC) won by fall over Zachary Parker (Knights Wrestling) Fall 1:06</li>\n<li>Champ. Round 2 - Joshua King (Powerhouse WC) won by fall over Alex Rosenbaum (Falcon Youth WC) Fall 0:12</li>\n<li>Champ. Round 2 - David Newman (Indians Elite) won by fall over Ricky Cantu (Gomez Wrestling Acad.) Fall 2:32</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Brandon Reyes (Calumet MPD Wolverines) won by fall over Tony Valentino (Elk Grove Junior Grens) Fall 1:14</li>\n<li>Champ. Round 2 - Sam Deisher (Blackhawk WC) won by fall over Austin Fritzgerald (Junior Spartans WC) Fall 0:46</li>\n<li>Champ. Round 2 - Octavius Mccloud (Carbondale WC) won by fall over Karim Fuentes (Gladiators) Fall 2:41</li>\n<li>Champ. Round 2 - Dominic Tudor (Peoria Razorbacks Youth WC) won by fall over Jack Simpson (Hoopeston Area WC) Fall 2:51</li>\n<li>Champ. Round 2 - Keiffer Johnston (Shelbyville Jr Rams Wrestling) won by fall over Jacob Gohde (Illini Bluffs WC) Fall 0:36</li>\n<li>Champ. Round 2 - Ryan Ramirez (Little Falcons WC) won by fall over Kyle Connolly (Jacksonville Area Youth Wrestling) Fall 0:58</li>\n<li>Champ. Round 2 - Bryan Ditchman (Tinley Park Bulldogs) won by fall over Alex Garsky (Murphysboro Wrestling) Fall 0:10</li>\n<li>Champ. Round 2 - Joshua Stark (Brawlers WC) won by fall over Daniel Dominiak (Waubonsie WC) Fall 2:20</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Jacob Hiles (Indians Elite) won by decision over Anthony Schaer (Wolves WC) Dec 11-7</li>\n<li>Champ. Round 2 - Ryan Roper (SCN Youth WC) won by decision over Brent Ochoa (Vittum Cats) Dec 6-4</li>\n<li>Champ. Round 2 - Austin Rudsinski (Lincoln-Way WC) won by decision over Payton Pulliam (Pontiac WC) Dec 5-2</li>\n<li>Champ. Round 2 - Ethan Harsted (Seneca Irish Cadets) won by major decision over Travis Ford-melton (Harvey Park Dist Twisters) Maj 12-2</li>\n<li>Champ. Round 2 - Kevin Radcliff (Gomez Wrestling Acad.) won by tech fall over Joe Ruffino (St. Charles East WC) TF 19-2</li>\n<li>Champ. Round 2 - Aaron Zebrauskas (Southside Stallions) won by fall over Cameron Miller (Marengo Youth Wrestling) Fall 0:50</li>\n<li>Champ. Round 2 - Chase Bittle (Belleville Little Devils) won by fall over Christian Goin (Central Elite Rebels) Fall 1:13</li>\n<li>Champ. Round 2 - Marcus Povlick (Force Wrestling) won by tech fall over Nathan Zinzer (Oswego East Team No Ego) TF 15-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Kolbe O`brien (SCN Youth WC) won by decision over David Spencer (Mahomet-Seymour Youth WC) Dec 6-1</li>\n<li>Champ. Round 2 - Dylan Burnoski (Bolingbrook Junior Raiders) won by major decision over Hunter Wilde (Charger WC) Maj 15-4</li>\n<li>Champ. Round 2 - Anthony Zamora (Force Wrestling) won by decision over Joey Melendez (Rambler / Next Level WC) Dec 3-0</li>\n<li>Champ. Round 2 - Hassan Johnson (Harvey Park Dist Twisters) won by decision over Joshua Fiegel (Richmond WC) Dec 2-1</li>\n<li>Champ. Round 2 - Jake Szlenk (Crystal Lake Wizards) won by decision over Brandon Muselman (Tinley Park Bulldogs) Dec 2-0</li>\n<li>Champ. Round 2 - Anthony Madrigal (Martinez Fox Valley Elite) won by tech fall over Christopher Whaley (Sauk Valley WC) TF 18-3</li>\n<li>Champ. Round 2 - Jacob Gross (Lakeland Predators) won by decision over Cooper Secker (King Select Wrestling) Dec 3-1</li>\n<li>Champ. Round 2 - Michael Mcgee (Force Wrestling) won by fall over Dakota Matthews (Fisher WC) Fall 1:29</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Pat Walker (Gomez Wrestling Acad.) won by fall over Jack Calderone (Junior Spartans WC) Fall 1:14</li>\n<li>Champ. Round 2 - Bilal Bailey (Harvey Park Dist Twisters) won by decision over Ethan Phillips (Illinois Valley Elite WC) Dec 7-3</li>\n<li>Champ. Round 2 - Michael Tortorice (Wolves WC) won by decision over Anthony Rink (Brawlers WC) Dec 9-2</li>\n<li>Champ. Round 2 - Anthony Cheloni (SCN Youth WC) won by fall over Nicholas Norris (Chilli Dawgs WC) Fall 2:40</li>\n<li>Champ. Round 2 - Jason Renteria (Martinez Fox Valley Elite) won by tech fall over Ren Dazey (Mahomet-Seymour Youth WC) TF 21-6</li>\n<li>Champ. Round 2 - Brett Hammel (West Hancock Titan WC) won by decision over Nicholas Donovan (Villa Lombard Cougars) Dec 5-4</li>\n<li>Champ. Round 2 - Tyler Moon (King Select Wrestling) won by fall over Austin Macias (Z`s Team Pena) Fall 4:02</li>\n<li>Champ. Round 2 - Sean Mckenna (Martinez Fox Valley Elite) won by decision over Jason Stokes (Little Celtic WC) Dec 4-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Dylan Duncan (SCN Youth WC) won by decision over Sean Cullen (Wrestling Factory) Dec 5-0</li>\n<li>Champ. Round 2 - Alec Meronk (Metamora Kids WC) won by decision over Brice Casey (Springfield Capital Kids WC) Dec 6-2</li>\n<li>Champ. Round 2 - Markus Hartman (Barrington Broncos) won by decision over Christian Kanzler (Wolves WC) Dec 6-5</li>\n<li>Champ. Round 2 - Jacob Dudeck (Tinley Park Bulldogs) won by decision over Shajrianna Turner (Lionheart Intense Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Devin Michicich (Southside Stallions) won by decision over Dack Punke (Central Elite Rebels) Dec 2-0</li>\n<li>Champ. Round 2 - Brendon Davis (Soldier Wrestling Allstar Training) won by fall over Cody Baldridge (Martinez Fox Valley Elite) Fall 2:24</li>\n<li>Champ. Round 2 - Gavin Sutton (Gomez Wrestling Acad.) won by decision over Peter Ogunsanya (Harvey Park Dist Twisters) Dec 5-1</li>\n<li>Champ. Round 2 - Jake Polka (Little Celtic WC) won by fall over Bradley Holmes (Peoria Heights Minutemen) Fall 1:49</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Zachary Lorek (Brawlers WC) won by decision over Ethan Reel (Central Elite Rebels) Dec 3-2</li>\n<li>Champ. Round 2 - Merik Fulton (Triad Little Knights) won by decision over Christian Hall (Harvey Park Dist Twisters) Dec 6-4</li>\n<li>Champ. Round 2 - Nicholas Burke (Downers Grove Cougars) won by major decision over Wylie Allen (Crystal Lake Wizards) Maj 10-0</li>\n<li>Champ. Round 2 - John Cullen (Wrestling Factory) won by decision over Drake Davis (Illinois Valley Elite WC) Dec 6-0</li>\n<li>Champ. Round 2 - Nolan Baker (Xtreme Wrestling) won by fall over Isaac Jacquez (Martinez Fox Valley Elite) Fall 3:31</li>\n<li>Champ. Round 2 - Yahya Thomas (Harvey Park Dist Twisters) won by decision over Brandon Critchfield (King Select Wrestling) Dec 6-2</li>\n<li>Champ. Round 2 - Austin Gomez (Gomez Wrestling Acad.) won by fall over Anthony Rubino (SCN Youth WC) Fall 2:19</li>\n<li>Champ. Round 2 - Raekwon Williams (Crosstown WC) won by decision over Demarius Terhune (Champaign Wrestling Club) Dec 11-8</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Kenneth Barber (Wrestling Factory) won by decision over Brad Gross (Sauk Valley WC) Dec 9-5</li>\n<li>Champ. Round 2 - Austin O`connor (Tinley Park Bulldogs) won by decision over Zachary Krause (Force Wrestling) Dec 6-3</li>\n<li>Champ. Round 2 - Jake Barzowski (Martinez Fox Valley Elite) won by decision over Drew Hoselton (Prairie Central-Chenoa Hawks) Dec 6-3</li>\n<li>Champ. Round 2 - Drake Boverie (Bulls WC) won by fall over Lucas Busse (Wolves WC) Fall 0:39</li>\n<li>Champ. Round 2 - Guy Brown (Edwardsville WC) won by decision over Sean Barelli (Fighting Titans) Dec 8-6</li>\n<li>Champ. Round 2 - Mitchell Stathakis (Barrington Broncos) won by major decision over Ryan Murray (Little Falcons WC) Maj 13-1</li>\n<li>Champ. Round 2 - Blaize Punke (Central Elite Rebels) won in overtime over Jared Ellingwood (Martinez Fox Valley Elite) OT 7-5</li>\n<li>Champ. Round 2 - Juwan Robinson (Bolingbrook Junior Raiders) won by major decision over Braxten Ary (Midwest Central Youth) Maj 9-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Aj Jaffe (SCN Youth WC) won by decision over Matthew Hennessey (Force Wrestling) Dec 8-2</li>\n<li>Champ. Round 2 - Emille Shannon (King Select Wrestling) won by fall over Egan Berta (Lemont Bears WC) Fall 2:46</li>\n<li>Champ. Round 2 - Christian Fausel (Hononegah Kids WC) won by tech fall over Christian Davis (Hoopeston Area WC) TF 16-0</li>\n<li>Champ. Round 2 - Chris Betancourt (Harvey Park Dist Twisters) won by decision over Zachery Ellis (Zee Bee Stingers) Dec 7-5</li>\n<li>Champ. Round 2 - Palidin Martinez (Moline WC) won by decision over Jacob Fiorito (Crystal Lake Wizards) Dec 7-4</li>\n<li>Champ. Round 2 - Kordell Norfleet (Harvey Park Dist Twisters) won by fall over Joshua Barzowski (Martinez Fox Valley Elite) Fall 0:16</li>\n<li>Champ. Round 2 - Garrett Brachbill (Shelbyville Jr Rams Wrestling) won by major decision over Jacob Hawkins (Harlem Huskies WC) Maj 8-0</li>\n<li>Champ. Round 2 - Devin Kane (Martinez Fox Valley Elite) won by fall over Datrelle Kozeluh (Crosstown WC) Fall 4:08</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Gregory Krulas (Dakota WC) won by major decision over Zachary Wade (Batavia Pinners) Maj 12-0</li>\n<li>Champ. Round 2 - Johnathon Doyle (Gomez Wrestling Acad.) won by fall over Logan Mcclellan (King Select Wrestling) Fall 2:32</li>\n<li>Champ. Round 2 - Cole Bateman (Orland Park Pioneers) won by decision over Braydon Delgado (Sauk Valley WC) Dec 8-1</li>\n<li>Champ. Round 2 - Ameen Hamdan (Triumph `The Art of Wrestling`) won by decision over Kevin Pate (Harvey Park Dist Twisters) Dec 9-2</li>\n<li>Champ. Round 2 - Logan Gruszka (Oswego East Team No Ego) won by fall over Devin Donovan (Villa Lombard Cougars) Fall 1:19</li>\n<li>Champ. Round 2 - Trent Rakers (Highland Bulldog Jr WC) won by fall over Justin Martinez (Xtreme Wrestling) Fall 0:23</li>\n<li>Champ. Round 2 - Jesse Ditzler (Sauk Valley WC) won by decision over Jace Wheeler (Springfield Capital Kids WC) Dec 4-2</li>\n<li>Champ. Round 2 - Shayne Oster (Junior Porters WC) won by decision over Jaylen Shaw (Arlington Cardinals) Dec 10-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Elliot Koster (Geneseo Spider WC) won by decision over Kevin Zange (Crystal Lake Wizards) Dec 4-2</li>\n<li>Champ. Round 2 - Dino Gutierrez (Rebels WC) won by fall over Brandon Rutherford (Mt. Vernon Lions) Fall 4:04</li>\n<li>Champ. Round 2 - Jack Jessen (Villa Park Young Warriors) won by fall over Patrick Brucki (Orland Park Pioneers) Fall 3:52</li>\n<li>Champ. Round 2 - Jake Lanning (Pontiac WC) won by major decision over Brandon Elsbury (Xtreme Wrestling) Maj 10-2</li>\n<li>Champ. Round 2 - Johnny Mologousis (Lions WC) won by decision over Jordan Soto (Batavia Pinners) Dec 4-3</li>\n<li>Champ. Round 2 - Tyler Dunn (East St. Louis Wrestling) won by decision over Christian Brunner (Barrington Broncos) Dec 5-4</li>\n<li>Champ. Round 2 - Andrew Wenger (Dakota WC) won by decision over Alex Gonzalez (Blackhawk WC) Dec 1-0</li>\n<li>Champ. Round 2 - Gavin Rathbun (Force Wrestling) won by fall over Aaron Weaver (Westville Youth WC) Fall 2:24</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Brady Jamrozek (Izzy Style School of Wrestling) won by major decision over Gabriel Montalvo (Lincoln-Way WC) Maj 16-7</li>\n<li>Champ. Round 2 - Alex Rodriguez (Fox Lake WC) won by decision over Jacob Warner (Champaign Wrestling Club) Dec 14-13</li>\n<li>Champ. Round 2 - Louie Depasquale (Redhawk WC) won by fall over Maximillian Hill (Lakeland Predators) Fall 1:15</li>\n<li>Champ. Round 2 - Kenneth Kirkland (Indians Elite) won in overtime over Cyress Ahart (Edwardsville WC) OT 3-1</li>\n<li>Champ. Round 2 - Randy Meneweather (Knox County Krushers) won by fall over Ryan Murfield (O`Fallon Little Panthers) Fall 0:56</li>\n<li>Champ. Round 2 - Matthew Wroblewski (Arlington Cardinals) won by fall over Levi Ransom (Pontiac WC) Fall 1:54</li>\n<li>Champ. Round 2 - Colten Cashmore (Richmond WC) won by decision over Spencer Feerer (Kane County Grapplers) Dec 6-3</li>\n<li>Champ. Round 2 - Brian Burns (Orland Park Pioneers) won by decision over Kyle Karpinski (Southside Stallions) Dec 9-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Chris Prosser (Edwardsville WC) won by fall over Jacob Cummens (Junior Spartans WC) Fall 3:44</li>\n<li>Champ. Round 2 - Tyler Tsagalis (Gomez Wrestling Acad.) won by decision over Dalton Willett (Warren County Brawlers) Dec 2-0</li>\n<li>Champ. Round 2 - Kamal Bey (Harvey Park Dist Twisters) won by major decision over Ethan Cain (Sauk Valley WC) Maj 8-0</li>\n<li>Champ. Round 2 - Griffin Meeker (SJO Spartan Youth WC) won by decision over Nicolas Delgado (Marengo Youth Wrestling) Dec 4-1</li>\n<li>Champ. Round 2 - Michael Peters (Champions WC) won by major decision over Tariq Thurman (Gladiators) Maj 13-0</li>\n<li>Champ. Round 2 - Brandon Elliott (Harlem Huskies WC) won by fall over Zach Peterson (Bulls WC) Fall 4:13</li>\n<li>Champ. Round 2 - Tj Casella (Lions WC) won by fall over Mason Kroening (Waubonsie WC) Fall 2:24</li>\n<li>Champ. Round 2 - David Riojas (Force Wrestling) won by major decision over Tyler Eggemeyer (Panther Powerhouse WC) Maj 12-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Robbie Seredi (Gomez Wrestling Acad.) won by fall over Evan Broniarczyk (Tinley Park Bulldogs) Fall 2:01</li>\n<li>Champ. Round 2 - Matthew Rafe (Brawlers WC) won by fall over Keaton Titus (Cumberland Youth WC) Fall 2:44</li>\n<li>Champ. Round 2 - Xavier Sallie (Will County Warriors) won by major decision over Luke Hoffman (Tigertown Tanglers) Maj 12-4</li>\n<li>Champ. Round 2 - Mitchel Stites (Dakota WC) won by fall over Keenan Edgar (Chicago Crusaders) Fall 1:07</li>\n<li>Champ. Round 2 - Michael Beaudoin (Sycamore WC) won by major decision over James Logsdon (Jacksonville Area Youth Wrestling) Maj 13-1</li>\n<li>Champ. Round 2 - Jared Smith (Lakeland Predators) won by fall over Gavin Mast (Champions WC) Fall 0:23</li>\n<li>Champ. Round 2 - Stephen Kemp (Batavia Pinners) won by decision over Daltyn Dodd (Moline WC) Dec 9-3</li>\n<li>Champ. Round 2 - Thomas Brennan (Orland Park Pioneers) won by major decision over Gavin Goddard (Champaign Wrestling Club) Maj 12-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Sean Kelly (Little Celtic WC) won by fall over Juan Alfaro (Gomez Wrestling Acad.) Fall 2:22</li>\n<li>Champ. Round 2 - Christian Brown (Oswego East Team No Ego) won by fall over Riley Perrine (Riverton Hawks Wrestling) Fall 2:40</li>\n<li>Champ. Round 2 - Isaac Flores (Carbondale WC) won by decision over Chris Yaros (Vittum Cats) Dec 4-2</li>\n<li>Champ. Round 2 - Maxwell Oswalt (Sauk Valley WC) won by decision over Christian Thompson (Wolves WC) Dec 9-3</li>\n<li>Champ. Round 2 - Ryan Fish (Gladiators) won by fall over Kory Loew (Edwardsville WC) Fall 1:00</li>\n<li>Champ. Round 2 - Mitch Novotny (Downers Grove Cougars) won by fall over Wayne Sobotka (Shamrock WC) Fall 1:57</li>\n<li>Champ. Round 2 - Woo Lee (Arlington Cardinals) won by decision over Lane Akre (Geneseo Spider WC) Dec 6-5</li>\n<li>Champ. Round 2 - Tyler Johnson (Junior Porters WC) won by fall over Daniel Spencer (Team Mascoutah) Fall 0:08</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Tad Cravens (Herrin Junior WC) won by fall over Andy Gastelum (Force Wrestling) Fall 2:18</li>\n<li>Champ. Round 2 - Christopher Malone (Sycamore WC) won by fall over Noah Miller (Arlington Cardinals) Fall 2:17</li>\n<li>Champ. Round 2 - Alex Benoit (Redhawk WC) won by fall over Dayton Coyle (Seneca Irish Cadets) Fall 0:57</li>\n<li>Champ. Round 2 - Ubaldo Torres (Blackhawk WC) won by fall over Michael Bruno (Arlington Cardinals) Fall 2:45</li>\n<li>Champ. Round 2 - Colton Wegner (Villa Lombard Cougars) won by fall over Nathan King (Little Falcons WC) Fall 2:50</li>\n<li>Champ. Round 2 - Latrey Reed (Danville Chargers) won by decision over Cody Barnes (Crystal Lake Wizards) Dec 15-9</li>\n<li>Champ. Round 2 - Aj Friedrich (Metamora Kids WC) won by major decision over Cole Roach (Crystal Lake Wizards) Maj 11-2</li>\n<li>Champ. Round 2 - Joshua Bouie (Indians Elite) won by fall over Adam Shultz (WW Tiger WC) Fall 2:36</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Keith Mcgee (Junior Spartans WC) won by fall over Tom Schofield (Mustang WC) Fall 4:11</li>\n<li>Champ. Round 2 - Alexander Anguiano (Belvidere Bandits) won by fall over Karl Fowler (Blackhawk WC) Fall 1:00</li>\n<li>Champ. Round 2 - Adrian Salinas (Rams Wrestling Club) won by fall over Dylan Ervin (Martinez Fox Valley Elite) Fall 0:33</li>\n<li>Champ. Round 2 - Alex Gelber (Springfield Capital Kids WC) won by fall over Josh Davis (Rock Island WC) Fall 0:51</li>\n<li>Champ. Round 2 - Tristan Penrod (Mt. Vernon Lions) won by decision over Jacob Godinez (Central Elite Rebels) Dec 5-1</li>\n<li>Champ. Round 2 - Kailor Hecox (Hecox Team Benaiah) won by fall over Charlie Kirkwood (Oswego East Team No Ego) Fall 0:42</li>\n<li>Champ. Round 2 - Jordan Ladd (Chilli Dawgs WC) won by fall over Kenny Martens (Maine Eagles) Fall 2:30</li>\n<li>Champ. Round 2 - Ryan Berman (Little Celtic WC) won by decision over Frank Tomaskovic (Vittum Cats) Dec 6-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Nathan Karas (Plainfield WC) won by fall over Chasity Carpenter (Danville Chargers) Fall 0:27</li>\n<li>Champ. Round 2 - Ross Sealby (Xtreme Wrestling) won by fall over Landon Johnson (Junior Maroon WC) Fall 0:36</li>\n<li>Champ. Round 2 - Frank Pavlik (Rebels WC) won by fall over Riley State (Little Huskie WC) Fall 0:41</li>\n<li>Champ. Round 2 - Lucas Warren (Blackhawk WC) won by fall over Antonio James (East St. Louis Wrestling) Fall 0:32</li>\n<li>Champ. Round 2 - Nicholas Czar (Highland Bulldog Jr WC) won by fall over Adrian Ortiz (Arlington Cardinals) Fall 1:18</li>\n<li>Champ. Round 2 - Devin Knight (Sycamore WC) won by decision over George Beck (WW Tiger WC) Dec 9-3</li>\n<li>Champ. Round 2 - Nick Becker (Tinley Park Bulldogs) won by fall over Alexander Zentner (Barrington Broncos) Fall 0:23</li>\n<li>Champ. Round 2 - Matthew Iwinski (Force Wrestling) won by fall over Matthew Bernal (Rebels WC) Fall 2:49</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Ruiz (Rams Wrestling Club) won by fall over Michael Gomez (Cary Matmen WC) Fall 2:50</li>\n<li>Champ. Round 2 - Michael Johnson Jr (St. Charles East WC) won by fall over Luke Mathias (A &amp; M Youth Wrestling) Fall 0:14</li>\n<li>Champ. Round 2 - Nicholas Barker (Vittum Cats) won by fall over Prentice Long (East St. Louis Wrestling) Fall 4:19</li>\n<li>Champ. Round 2 - Tate Buller (Champbuilders WC) won by fall over Alec Daykin (Riverton Hawks Wrestling) Fall 1:58</li>\n<li>Champ. Round 2 - Wyatt Witty (Bismarck Henning WC) won by fall over Christopher Caldwell (Junior Rams WC) Fall 0:53</li>\n<li>Champ. Round 2 - Jacob Heavlin (Warrior Monks) won by fall over Deandre Ford (Oswego East Team No Ego) Fall 1:07</li>\n<li>Champ. Round 2 - Jake Ford (Vittum Cats) won by fall over Trey Kerrens (Murphysboro Wrestling) Fall 0:22</li>\n<li>Champ. Round 2 - Nicholas Wolf (Force Wrestling) won by fall over Francisco Quiroz (Huntley Jr. Red Raiders) Fall 0:10</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Travis Piotrowski (Wolves WC) won by fall over James Pawelski (Maine Eagles) Fall 0:40</li>\n<li>Champ. Round 2 - Louie Hayes (Martinez Fox Valley Elite) won by fall over Joshua Gentry (Badger WC) Fall 2:42</li>\n<li>Champ. Round 2 - John Paul Stedwill (Central Elite Rebels) won by decision over Tyler Myers (Plainfield WC) Dec 7-0</li>\n<li>Champ. Round 2 - Tyler Scanlon (Tinley Park Bulldogs) won by major decision over Alex Erickson (Rock Island WC) Maj 13-3</li>\n<li>Champ. Round 2 - Kirk Johansen (Villa Lombard Cougars) won by fall over Kyle Bernat (SCN Youth WC) Fall 2:07</li>\n<li>Champ. Round 2 - Jabari Moody (Harvey Park Dist Twisters) won by fall over Beau Harrier (Golden Eagles WC) Fall 3:42</li>\n<li>Champ. Round 2 - Raul Marrero Jr (Springfield Capital Kids WC) won by fall over Brandon Tennyson (Herrin Junior WC) Fall 1:13</li>\n<li>Champ. Round 2 - Francis Edelen (Junior Spartans WC) won by fall over Kyle Szlenk (Crystal Lake Wizards) Fall 1:15</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Vinnie Piunti (Martinez Fox Valley Elite) won by decision over Dalton Kinison (Springfield Capital Kids WC) Dec 5-2</li>\n<li>Champ. Round 2 - Shaun Wasso (Little Celtic WC) won by decision over Hunter Webb (Sauk Valley WC) Dec 3-1</li>\n<li>Champ. Round 2 - Kyle Peisker (Gomez Wrestling Acad.) won by major decision over Matthew Crnich (Lincoln-Way WC) Maj 8-0</li>\n<li>Champ. Round 2 - Nick Lukanich (Vittum Cats) won by decision over Joe Antonelli (SCN Youth WC) Dec 12-5</li>\n<li>Champ. Round 2 - Christian Robertson (Vittum Cats) won by fall over Alex Rader (Hononegah Kids WC) Fall 3:06</li>\n<li>Champ. Round 2 - Aj Rechenmacher (Batavia Pinners) won by major decision over Jake Bess (Maine Eagles) Maj 9-0</li>\n<li>Champ. Round 2 - Jacob Mitchell (Highland Bulldog Jr WC) won by fall over Drew Johnson (Team West Wolves) Fall 0:44</li>\n<li>Champ. Round 2 - Colin Glascott (Orland Park Pioneers) won by tech fall over Dustin Huss (Charger WC) TF 19-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Patrick Augustyn (Gomez Wrestling Acad.) won by decision over Kyle Ruettiger (Lincoln-Way WC) Dec 4-2</li>\n<li>Champ. Round 2 - Brandon Hanik (Vittum Cats) won by fall over Hunter Grau (Geneseo Spider WC) Fall 1:25</li>\n<li>Champ. Round 2 - Garrett Dziedzic (Crystal Lake Wizards) won in overtime over Andrew Mcfall (Force Wrestling) OT 3-1</li>\n<li>Champ. Round 2 - Thomas Svestka (Martinez Fox Valley Elite) won by major decision over Tanner Ambry (Edwardsville WC) Maj 16-6</li>\n<li>Champ. Round 2 - Joshua Larson (Xtreme Wrestling) won by fall over Riley Staab (Champaign Wrestling Club) Fall 2:14</li>\n<li>Champ. Round 2 - Jacob Silzer (Tinley Park Bulldogs) won by tech fall over Tanner Coleman (Peoria Heights Minutemen) TF 15-0</li>\n<li>Champ. Round 2 - Christopher Dranka (Crystal Lake Wizards) won by decision over Joshua Rozell (Granite City WC) Dec 4-3</li>\n<li>Champ. Round 2 - Cameron Roat (Little Celtic WC) won by major decision over Conrad Noverini (SCN Youth WC) Maj 12-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Matt Rowland (SCN Youth WC) won by fall over Matthew Valenti (Bartlett Jr Hawks) Fall 0:34</li>\n<li>Champ. Round 2 - Carter Pillen (Geneseo Spider WC) won by decision over Johnathan Turner (Springfield Capital Kids WC) Dec 1-0</li>\n<li>Champ. Round 2 - Jacob Orth (Crystal Lake Wizards) won by decision over Jackson Schoen (Gomez Wrestling Acad.) Dec 6-2</li>\n<li>Champ. Round 2 - Rudy Yates (Lions WC) won by tech fall over Darin Trout (Pontiac WC) TF 21-4</li>\n<li>Champ. Round 2 - David Kasper (Southside Stallions) won by decision over Javeontae Crider (Lionheart Intense Wrestling) Dec 7-2</li>\n<li>Champ. Round 2 - Dalton Brito (Edwardsville WC) won by tech fall over Joey Nauman (Yorkville Wrestling Club) TF 16-1</li>\n<li>Champ. Round 2 - Steven Fessler (Vittum Cats) won in overtime over Eric Carter (Wrestling Factory) OT 6-4</li>\n<li>Champ. Round 2 - Roberto Campos (Bolingbrook Junior Raiders) won by major decision over Britches Sikula (Wolves WC) Maj 11-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Jake Drew (Gomez Wrestling Acad.) won by decision over Keegan Powers (Hononegah Kids WC) Dec 2-1</li>\n<li>Champ. Round 2 - Kris Williams (Harvey Park Dist Twisters) won by tech fall over David Mcdermott (St. Charles East WC) TF 23-7</li>\n<li>Champ. Round 2 - Bobby Alexander (Gomez Wrestling Acad.) won by fall over Draylin Turner (Rantoul Junior Eagles) Fall 0:44</li>\n<li>Champ. Round 2 - Cole Wysocki (Triad Little Knights) won by decision over Jack Pradel (Oswego East Team No Ego) Dec 6-0</li>\n<li>Champ. Round 2 - Andrew Verr (Villa Park Young Warriors) won by major decision over John Bass (King Select Wrestling) Maj 11-0</li>\n<li>Champ. Round 2 - Logan Lundelius (Crystal Lake Wizards) won by decision over Brody Sharp (Yorkville Wrestling Club) Dec 8-4</li>\n<li>Champ. Round 2 - Michael Cullen (Wrestling Factory) won by fall over Gunner Wenger (The Law) Fall 0:44</li>\n<li>Champ. Round 2 - Steve Novy (Mustang WC) won by decision over James Knapp (Brawlers WC) Dec 9-8</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Brian Krasowski (Orland Park Pioneers) won by decision over Ryder Punke (Central Elite Rebels) Dec 3-2</li>\n<li>Champ. Round 2 - Nick Gasbarro (Tinley Park Bulldogs) won by decision over Cole Witzig (Triad Little Knights) Dec 8-2</li>\n<li>Champ. Round 2 - Carlos Jacquez (Martinez Fox Valley Elite) won by decision over Brandon Meyer (Crystal Lake Wizards) Dec 9-5</li>\n<li>Champ. Round 2 - Jonathan Warner (Geneseo Spider WC) won by decision over Jimmy Gallardo (Gomez Wrestling Acad.) Dec 3-2</li>\n<li>Champ. Round 2 - Christian Milliron (Yorkville Wrestling Club) won by decision over Brandon Briggs (Crystal Lake Wizards) Dec 10-6</li>\n<li>Champ. Round 2 - Gabriel Townsell (Gladiators) won by fall over Cody Harris (Belleville Little Devils) Fall 0:32</li>\n<li>Champ. Round 2 - Matthew Rundell (Arlington Cardinals) won by fall over Michael Callahan (SCN Youth WC) Fall 2:24</li>\n<li>Champ. Round 2 - Kyle Simpkins (Brawlers WC) won by tech fall over Anthony Vota (Little Redskins WC) TF 18-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Peter Perich (Force Wrestling) won by fall over Matthew Ferraro (SCN Youth WC) Fall 1:01</li>\n<li>Champ. Round 2 - Nathanial Smalling (King Select Wrestling) won by fall over Kameron Irvin (Gladiators) Fall 2:54</li>\n<li>Champ. Round 2 - James Wolfe (Dakota WC) won by fall over Jared Finley (Shelbyville Jr Rams Wrestling) Fall 2:07</li>\n<li>Champ. Round 2 - Daniel Arteaga (Fox Lake WC) won by decision over Eric Schultz (Tinley Park Bulldogs) Dec 6-3</li>\n<li>Champ. Round 2 - Riley Beard (Peoria Razorbacks Youth WC) won by fall over Alexander Butler (Fighting Titans) Fall 0:21</li>\n<li>Champ. Round 2 - Noah Drabek (Lakeland Predators) won by decision over Jakada Hull (Harvey Park Dist Twisters) Dec 10-4</li>\n<li>Champ. Round 2 - Vincent Turk (Crystal Lake Wizards) won by major decision over Joey Schott Jr (Champaign Wrestling Club) Maj 14-0</li>\n<li>Champ. Round 2 - Carson Oughton (Indians Elite) won by major decision over Colten Ratz (Fox Valley WC) Maj 13-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Carver James (Dakota WC) won in overtime over Clayton Ledbetter (Force Wrestling) OT 8-4</li>\n<li>Champ. Round 2 - Nicholas Foster (Belleville Junior Hit Squad) won in overtime over Levi Smith (Lakeland Predators) OT 1-0</li>\n<li>Champ. Round 2 - Ben Schneider (Orland Park Pioneers) won by decision over Brandon Ahlgrim (Sauk Valley WC) Dec 4-2</li>\n<li>Champ. Round 2 - Juwan Edmond (Gladiators) won by fall over Dequarius Millett (Granite City WC) Fall 1:57</li>\n<li>Champ. Round 2 - Kenan Carter (Martinez Fox Valley Elite) won by decision over Travis Cysewski (Barrington Broncos) Dec 7-5</li>\n<li>Champ. Round 2 - Isaiah White (Harvey Park Dist Twisters) won by decision over Trace Carello (Mt. Vernon Lions) Dec 10-4</li>\n<li>Champ. Round 2 - Vaughn Hobart (Pontiac WC) won by decision over Tom Slattery (Tinley Park Bulldogs) Dec 4-3</li>\n<li>Champ. Round 2 - Kameron Vantassel (Hononegah Kids WC) won by decision over Kyle Betourne (Brawlers WC) Dec 2-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Ryan Willett (Renegade WC (NFP)) won by decision over Eric Barone (Wolves WC) Dec 2-1</li>\n<li>Champ. Round 2 - Chase Vosburgh (Mt. Vernon Lions) won by fall over Nathan Romero (Martinez Fox Valley Elite) Fall 2:48</li>\n<li>Champ. Round 2 - Tanner Anthony (Harlem Huskies WC) won by decision over Josiah Cropp (Geneseo Spider WC) Dec 8-6</li>\n<li>Champ. Round 2 - Joey Gunther (Fox Lake WC) won by decision over Ben Williamson (Naperville WC) Dec 5-2</li>\n<li>Champ. Round 2 - Keone Derain (Martinez Fox Valley Elite) won by fall over Johnny Davidson (Barrington Broncos) Fall 1:05</li>\n<li>Champ. Round 2 - Mack Anderson (Springfield Capital Kids WC) won by tech fall over Patrick Stanton (Murphysboro Wrestling) TF 16-0</li>\n<li>Champ. Round 2 - Fernie Silva (Hononegah Kids WC) won by fall over Sage Friese (Seneca Irish Cadets) Fall 3:44</li>\n<li>Champ. Round 2 - Larry Early (Force Wrestling) won by decision over Jim Brennan (Lemont Bears WC) Dec 5-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Lucas Reifsteck (Force Wrestling) won by fall over Gabe Pleasants (Morton Youth Wrestling) Fall 2:35</li>\n<li>Champ. Round 2 - Peter Minwegen (Barrington Broncos) won by fall over Andrew Aldarondo (Badger WC) Fall 2:14</li>\n<li>Champ. Round 2 - Luke Fortuna (Martinez Fox Valley Elite) won by fall over Hasan Muhammad (Renegade WC (NFP)) Fall 4:12</li>\n<li>Champ. Round 2 - Andrew Marsden (Crystal Lake Wizards) won by decision over Lucas Duckett (Shelbyville Jr Rams Wrestling) Dec 5-0</li>\n<li>Champ. Round 2 - Flynn Nagel (Vittum Cats) won by fall over Riley Demoss (SCN Youth WC) Fall 4:22</li>\n<li>Champ. Round 2 - Gavin Mcbride (Edwardsville WC) won by decision over Caleb Bedford (Moline WC) Dec 6-4</li>\n<li>Champ. Round 2 - Tyler Demoss (Hononegah Kids WC) won in double overtime over Ramon Lopez (Martinez Fox Valley Elite) 2-OT 7-2</li>\n<li>Champ. Round 2 - Brent Hakeman (Brawlers WC) won by decision over Joseph Medina (Geneseo Spider WC) Dec 8-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Timothy Young (Tomcat WC) won by fall over Garrett Rude (Hawk Wrestling Club) Fall 2:38</li>\n<li>Champ. Round 2 - Clayton Mckimmy (Fox Lake WC) won by decision over Aaron Carter (Fisher WC) Dec 9-2</li>\n<li>Champ. Round 2 - Kenny Condon (Vittum Cats) won by major decision over William King (Dundee Highlanders) Maj 10-2</li>\n<li>Champ. Round 2 - Mitchel Humphrey (Mendota Mat Masters) won by fall over Skyler Roley (Effingham Youth WC) Fall 2:56</li>\n<li>Champ. Round 2 - Ryan Pitra (Geneseo Spider WC) won by fall over Patrick Kristin (Tinley Park Bulldogs) Fall 1:30</li>\n<li>Champ. Round 2 - Xavier Montalvo (Gomez Wrestling Acad.) won by fall over Austin Shelton (Oakwood WC) Fall 0:29</li>\n<li>Champ. Round 2 - Jenner Hecox (Hecox Team Benaiah) won by decision over Wesley Villarreal (Kane County Grapplers) Dec 10-5</li>\n<li>Champ. Round 2 - Dru Worker (Tinley Park Bulldogs) won by decision over Michael Hall (Junior Spartans WC) Dec 4-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Claude Shelby (King Select Wrestling) won by major decision over Justin Esposito (Little Celtic WC) Maj 12-4</li>\n<li>Champ. Round 2 - Tommy Calkins (Maine Eagles) won by fall over Dallas Appleman (Clipper WC) Fall 1:14</li>\n<li>Champ. Round 2 - Tyre Lee (Renegade WC (NFP)) won by fall over Jacob Spanier (Mendota Mat Masters) Fall 2:20</li>\n<li>Champ. Round 2 - Brandon Klein (Champaign Wrestling Club) won by fall over Jacob Villarreal (Kane County Grapplers) Fall 1:04</li>\n<li>Champ. Round 2 - Jt Jones (Rock Island WC) won by decision over John Mclaughlin (Vittum Cats) Dec 2-1</li>\n<li>Champ. Round 2 - Dillon Warnecke (Villa Lombard Cougars) won by fall over Anton Krocko (Dundee Highlanders) Fall 0:33</li>\n<li>Champ. Round 2 - Kenneth Marshall (Vittum Cats) won by decision over Ryan Taylor (Downers Grove Cougars) Dec 8-3</li>\n<li>Champ. Round 2 - Zachary Prinz (Force Wrestling) won by fall over Jarod Noel (Bismarck Henning WC) Fall 2:37</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Collin Cronberg (Little Celtic WC) won by fall over Jacob Cain (Sauk Valley WC) Fall 0:51</li>\n<li>Champ. Round 2 - Jake Flower (Hononegah Kids WC) won by fall over Tate Manka (Riverton Hawks Wrestling) Fall 2:44</li>\n<li>Champ. Round 2 - Blake Cripe (Vandalia Jr Vandals) won by fall over Christopher Morgan (Gladiators) Fall 2:09</li>\n<li>Champ. Round 2 - Jimique Davis (Gomez Wrestling Acad.) won by major decision over Rashann Ford (Blackhawk WC) Maj 14-0</li>\n<li>Champ. Round 2 - Niko Portokalis (Arlington Cardinals) won by decision over Nicholas Spacek (Lions WC) Dec 4-2</li>\n<li>Champ. Round 2 - Colton Reed (Mahomet-Seymour Youth WC) won by fall over De`gyon Macklin (Hawk Wrestling Club) Fall 1:19</li>\n<li>Champ. Round 2 - Matthew Striegel (King Select Wrestling) won by decision over Noah Frazier (Batavia Pinners) Dec 2-0</li>\n<li>Champ. Round 2 - Jeff Klank (Indians Elite) won by fall over Anthony Jarvis (Shamrock WC) Fall 2:35</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Keenith Edgar (Chicago Crusaders) won by fall over Ryan Yohe (Martinez Fox Valley Elite) Fall 3:27</li>\n<li>Quarterfinal - James Watters (Edwardsville WC) won by fall over Sylvester Vijil (Hononegah Kids WC) Fall 2:09</li>\n<li>Quarterfinal - Troy Ott (Mad Dog Wrestling Academy) won by fall over Nick Graziano (Oak Forest Warriors) Fall 0:43</li>\n<li>Quarterfinal - George Bessette (Lakeland Predators) won by fall over Tyler Grimsley (Saukee Youth WC) Fall 0:15</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Romeo Mcknight (Crystal Lake Wizards) won by fall over Jonathan Broadway (Centralia) Fall 0:52</li>\n<li>Quarterfinal - Lake Vitkauskas (Oak Forest Warriors) won by fall over Peter Capetillo (SCN Youth WC) Fall 2:30</li>\n<li>Quarterfinal - Jarryd Cabusao (Golden Eagles WC) won by fall over Brandon Andino (Gomez Wrestling Acad.) Fall 2:40</li>\n<li>Quarterfinal - Brady Rude (Sauk Valley WC) won by fall over Dylan Schultz (Lincoln-Way WC) Fall 2:35</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Allen Stallings (Gladiators) won by major decision over Matt Allen (Hinsdale WC) Maj 15-3</li>\n<li>Quarterfinal - Kumari Jackson (Springfield Capital Kids WC) won by fall over Wade Thiele (Saukee Youth WC) Fall 4:22</li>\n<li>Quarterfinal - Kenneth Abitua (Xtreme Wrestling) won by decision over Hunter Crowley (Fisher WC) Dec 7-0</li>\n<li>Quarterfinal - Matt Brozovich (Indians Elite) won by decision over Cole Hunzeker (Geneseo Spider WC) Dec 4-1</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Thomas Rollete (Hononegah Kids WC) won by decision over David Charnot (Vittum Cats) Dec 9-8</li>\n<li>Quarterfinal - De`undre Garner (Gladiators) won by decision over Devon Sieveking (Benton Jr WC) Dec 8-1</li>\n<li>Quarterfinal - Andrew Wise (Aces WC) won by fall over Remington Smith (Limestone Youth WC) Fall 0:17</li>\n<li>Quarterfinal - Joshua King (Powerhouse WC) won by decision over David Newman (Indians Elite) Dec 5-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Sam Deisher (Blackhawk WC) won by fall over Brandon Reyes (Calumet MPD Wolverines) Fall 1:04</li>\n<li>Quarterfinal - Octavius Mccloud (Carbondale WC) won by fall over Dominic Tudor (Peoria Razorbacks Youth WC) Fall 0:40</li>\n<li>Quarterfinal - Keiffer Johnston (Shelbyville Jr Rams Wrestling) won by decision over Ryan Ramirez (Little Falcons WC) Dec 7-0</li>\n<li>Quarterfinal - Bryan Ditchman (Tinley Park Bulldogs) won by fall over Joshua Stark (Brawlers WC) Fall 0:11</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Jacob Hiles (Indians Elite) won by decision over Ryan Roper (SCN Youth WC) Dec 10-3</li>\n<li>Quarterfinal - Ethan Harsted (Seneca Irish Cadets) won by decision over Austin Rudsinski (Lincoln-Way WC) Dec 10-3</li>\n<li>Quarterfinal - Kevin Radcliff (Gomez Wrestling Acad.) won by major decision over Aaron Zebrauskas (Southside Stallions) Maj 10-2</li>\n<li>Quarterfinal - Marcus Povlick (Force Wrestling) won by decision over Chase Bittle (Belleville Little Devils) Dec 4-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Dylan Burnoski (Bolingbrook Junior Raiders) won by fall over Kolbe O`brien (SCN Youth WC) Fall 4:27</li>\n<li>Quarterfinal - Anthony Zamora (Force Wrestling) won by decision over Hassan Johnson (Harvey Park Dist Twisters) Dec 1-0</li>\n<li>Quarterfinal - Anthony Madrigal (Martinez Fox Valley Elite) won by fall over Jake Szlenk (Crystal Lake Wizards) Fall 2:34</li>\n<li>Quarterfinal - Michael Mcgee (Force Wrestling) won by tech fall over Jacob Gross (Lakeland Predators) TF 16-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Pat Walker (Gomez Wrestling Acad.) won by fall over Bilal Bailey (Harvey Park Dist Twisters) Fall 1:13</li>\n<li>Quarterfinal - Anthony Cheloni (SCN Youth WC) won by fall over Michael Tortorice (Wolves WC) Fall 3:00</li>\n<li>Quarterfinal - Jason Renteria (Martinez Fox Valley Elite) won by major decision over Brett Hammel (West Hancock Titan WC) Maj 14-3</li>\n<li>Quarterfinal - Sean Mckenna (Martinez Fox Valley Elite) won by decision over Tyler Moon (King Select Wrestling) Dec 6-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Dylan Duncan (SCN Youth WC) won by major decision over Alec Meronk (Metamora Kids WC) Maj 14-1</li>\n<li>Quarterfinal - Jacob Dudeck (Tinley Park Bulldogs) won by decision over Markus Hartman (Barrington Broncos) Dec 6-2</li>\n<li>Quarterfinal - Devin Michicich (Southside Stallions) won by fall over Brendon Davis (Soldier Wrestling Allstar Training) Fall 0:39</li>\n<li>Quarterfinal - Gavin Sutton (Gomez Wrestling Acad.) won by decision over Jake Polka (Little Celtic WC) Dec 4-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Merik Fulton (Triad Little Knights) won by decision over Zachary Lorek (Brawlers WC) Dec 10-4</li>\n<li>Quarterfinal - John Cullen (Wrestling Factory) won by fall over Nicholas Burke (Downers Grove Cougars) Fall 0:27</li>\n<li>Quarterfinal - Yahya Thomas (Harvey Park Dist Twisters) won by decision over Nolan Baker (Xtreme Wrestling) Dec 9-5</li>\n<li>Quarterfinal - Austin Gomez (Gomez Wrestling Acad.) won by major decision over Raekwon Williams (Crosstown WC) Maj 17-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Austin O`connor (Tinley Park Bulldogs) won by major decision over Kenneth Barber (Wrestling Factory) Maj 9-1</li>\n<li>Quarterfinal - Drake Boverie (Bulls WC) won by major decision over Jake Barzowski (Martinez Fox Valley Elite) Maj 8-0</li>\n<li>Quarterfinal - Mitchell Stathakis (Barrington Broncos) won by decision over Guy Brown (Edwardsville WC) Dec 4-2</li>\n<li>Quarterfinal - Juwan Robinson (Bolingbrook Junior Raiders) won by fall over Blaize Punke (Central Elite Rebels) Fall 2:43</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Aj Jaffe (SCN Youth WC) won by decision over Emille Shannon (King Select Wrestling) Dec 5-0</li>\n<li>Quarterfinal - Christian Fausel (Hononegah Kids WC) won by decision over Chris Betancourt (Harvey Park Dist Twisters) Dec 6-1</li>\n<li>Quarterfinal - Kordell Norfleet (Harvey Park Dist Twisters) won by fall over Palidin Martinez (Moline WC) Fall 2:04</li>\n<li>Quarterfinal - Garrett Brachbill (Shelbyville Jr Rams Wrestling) won by decision over Devin Kane (Martinez Fox Valley Elite) Dec 5-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Johnathon Doyle (Gomez Wrestling Acad.) won by major decision over Gregory Krulas (Dakota WC) Maj 11-3</li>\n<li>Quarterfinal - Ameen Hamdan (Triumph `The Art of Wrestling`) won by major decision over Cole Bateman (Orland Park Pioneers) Maj 14-1</li>\n<li>Quarterfinal - Trent Rakers (Highland Bulldog Jr WC) won by decision over Logan Gruszka (Oswego East Team No Ego) Dec 6-2</li>\n<li>Quarterfinal - Shayne Oster (Junior Porters WC) won by decision over Jesse Ditzler (Sauk Valley WC) Dec 8-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Dino Gutierrez (Rebels WC) won by fall over Elliot Koster (Geneseo Spider WC) Fall 0:47</li>\n<li>Quarterfinal - Jack Jessen (Villa Park Young Warriors) won by decision over Jake Lanning (Pontiac WC) Dec 6-1</li>\n<li>Quarterfinal - Johnny Mologousis (Lions WC) won by decision over Tyler Dunn (East St. Louis Wrestling) Dec 8-2</li>\n<li>Quarterfinal - Andrew Wenger (Dakota WC) won by decision over Gavin Rathbun (Force Wrestling) Dec 7-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Alex Rodriguez (Fox Lake WC) won by major decision over Brady Jamrozek (Izzy Style School of Wrestling) Maj 10-1</li>\n<li>Quarterfinal - Louie Depasquale (Redhawk WC) won by fall over Kenneth Kirkland (Indians Elite) Fall 1:00</li>\n<li>Quarterfinal - Randy Meneweather (Knox County Krushers) won by decision over Matthew Wroblewski (Arlington Cardinals) Dec 5-0</li>\n<li>Quarterfinal - Brian Burns (Orland Park Pioneers) won by decision over Colten Cashmore (Richmond WC) Dec 1-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Chris Prosser (Edwardsville WC) won in overtime over Tyler Tsagalis (Gomez Wrestling Acad.) OT 3-2</li>\n<li>Quarterfinal - Kamal Bey (Harvey Park Dist Twisters) won by fall over Griffin Meeker (SJO Spartan Youth WC) Fall 1:53</li>\n<li>Quarterfinal - Michael Peters (Champions WC) won by fall over Brandon Elliott (Harlem Huskies WC) Fall 2:40</li>\n<li>Quarterfinal - David Riojas (Force Wrestling) won by fall over Tj Casella (Lions WC) Fall 2:40</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Robbie Seredi (Gomez Wrestling Acad.) won by fall over Matthew Rafe (Brawlers WC) Fall 1:48</li>\n<li>Quarterfinal - Mitchel Stites (Dakota WC) won by fall over Xavier Sallie (Will County Warriors) Fall 2:31</li>\n<li>Quarterfinal - Jared Smith (Lakeland Predators) won by fall over Michael Beaudoin (Sycamore WC) Fall 1:13</li>\n<li>Quarterfinal - Thomas Brennan (Orland Park Pioneers) won by decision over Stephen Kemp (Batavia Pinners) Dec 5-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Sean Kelly (Little Celtic WC) won by fall over Christian Brown (Oswego East Team No Ego) Fall 1:00</li>\n<li>Quarterfinal - Isaac Flores (Carbondale WC) won by decision over Maxwell Oswalt (Sauk Valley WC) Dec 9-2</li>\n<li>Quarterfinal - Ryan Fish (Gladiators) won by decision over Mitch Novotny (Downers Grove Cougars) Dec 6-2</li>\n<li>Quarterfinal - Tyler Johnson (Junior Porters WC) won by fall over Woo Lee (Arlington Cardinals) Fall 0:31</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Christopher Malone (Sycamore WC) won by decision over Tad Cravens (Herrin Junior WC) Dec 13-8</li>\n<li>Quarterfinal - Alex Benoit (Redhawk WC) won by fall over Ubaldo Torres (Blackhawk WC) Fall 0:33</li>\n<li>Quarterfinal - Colton Wegner (Villa Lombard Cougars) won by forfeit over Latrey Reed (Danville Chargers) FF</li>\n<li>Quarterfinal - Aj Friedrich (Metamora Kids WC) won in overtime over Joshua Bouie (Indians Elite) OT 2-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Keith Mcgee (Junior Spartans WC) won by decision over Alexander Anguiano (Belvidere Bandits) Dec 6-1</li>\n<li>Quarterfinal - Alex Gelber (Springfield Capital Kids WC) won by decision over Adrian Salinas (Rams Wrestling Club) Dec 1-0</li>\n<li>Quarterfinal - Kailor Hecox (Hecox Team Benaiah) won by fall over Tristan Penrod (Mt. Vernon Lions) Fall 2:03</li>\n<li>Quarterfinal - Jordan Ladd (Chilli Dawgs WC) won by decision over Ryan Berman (Little Celtic WC) Dec 6-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Ross Sealby (Xtreme Wrestling) won by fall over Nathan Karas (Plainfield WC) Fall 1:24</li>\n<li>Quarterfinal - Lucas Warren (Blackhawk WC) won by fall over Frank Pavlik (Rebels WC) Fall 0:22</li>\n<li>Quarterfinal - Nicholas Czar (Highland Bulldog Jr WC) won by major decision over Devin Knight (Sycamore WC) Maj 10-0</li>\n<li>Quarterfinal - Matthew Iwinski (Force Wrestling) won by fall over Nick Becker (Tinley Park Bulldogs) Fall 2:21</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Michael Johnson Jr (St. Charles East WC) won by fall over Joshua Ruiz (Rams Wrestling Club) Fall 1:43</li>\n<li>Quarterfinal - Tate Buller (Champbuilders WC) won by fall over Nicholas Barker (Vittum Cats) Fall 2:18</li>\n<li>Quarterfinal - Jacob Heavlin (Warrior Monks) won by fall over Wyatt Witty (Bismarck Henning WC) Fall 2:57</li>\n<li>Quarterfinal - Nicholas Wolf (Force Wrestling) won by fall over Jake Ford (Vittum Cats) Fall 3:41</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Louie Hayes (Martinez Fox Valley Elite) won by decision over Travis Piotrowski (Wolves WC) Dec 6-2</li>\n<li>Quarterfinal - John Paul Stedwill (Central Elite Rebels) won by major decision over Tyler Scanlon (Tinley Park Bulldogs) Maj 12-2</li>\n<li>Quarterfinal - Jabari Moody (Harvey Park Dist Twisters) won by major decision over Kirk Johansen (Villa Lombard Cougars) Maj 18-4</li>\n<li>Quarterfinal - Francis Edelen (Junior Spartans WC) won by fall over Raul Marrero Jr (Springfield Capital Kids WC) Fall 2:48</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Shaun Wasso (Little Celtic WC) won by fall over Vinnie Piunti (Martinez Fox Valley Elite) Fall 0:54</li>\n<li>Quarterfinal - Kyle Peisker (Gomez Wrestling Acad.) won by decision over Nick Lukanich (Vittum Cats) Dec 4-1</li>\n<li>Quarterfinal - Christian Robertson (Vittum Cats) won by decision over Aj Rechenmacher (Batavia Pinners) Dec 5-2</li>\n<li>Quarterfinal - Colin Glascott (Orland Park Pioneers) won by decision over Jacob Mitchell (Highland Bulldog Jr WC) Dec 8-7</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Brandon Hanik (Vittum Cats) won by decision over Patrick Augustyn (Gomez Wrestling Acad.) Dec 6-0</li>\n<li>Quarterfinal - Garrett Dziedzic (Crystal Lake Wizards) won by decision over Thomas Svestka (Martinez Fox Valley Elite) Dec 5-3</li>\n<li>Quarterfinal - Jacob Silzer (Tinley Park Bulldogs) won by tech fall over Joshua Larson (Xtreme Wrestling) TF 16-1</li>\n<li>Quarterfinal - Cameron Roat (Little Celtic WC) won by decision over Christopher Dranka (Crystal Lake Wizards) Dec 6-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Matt Rowland (SCN Youth WC) won by major decision over Carter Pillen (Geneseo Spider WC) Maj 13-2</li>\n<li>Quarterfinal - Rudy Yates (Lions WC) won by major decision over Jacob Orth (Crystal Lake Wizards) Maj 18-4</li>\n<li>Quarterfinal - David Kasper (Southside Stallions) won in overtime over Dalton Brito (Edwardsville WC) OT 3-2</li>\n<li>Quarterfinal - Roberto Campos (Bolingbrook Junior Raiders) won by decision over Steven Fessler (Vittum Cats) Dec 2-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Jake Drew (Gomez Wrestling Acad.) won by decision over Kris Williams (Harvey Park Dist Twisters) Dec 3-0</li>\n<li>Quarterfinal - Bobby Alexander (Gomez Wrestling Acad.) won by fall over Cole Wysocki (Triad Little Knights) Fall 3:21</li>\n<li>Quarterfinal - Logan Lundelius (Crystal Lake Wizards) won by decision over Andrew Verr (Villa Park Young Warriors) Dec 8-4</li>\n<li>Quarterfinal - Michael Cullen (Wrestling Factory) won by fall over Steve Novy (Mustang WC) Fall 1:00</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Nick Gasbarro (Tinley Park Bulldogs) won by decision over Brian Krasowski (Orland Park Pioneers) Dec 3-1</li>\n<li>Quarterfinal - Carlos Jacquez (Martinez Fox Valley Elite) won by major decision over Jonathan Warner (Geneseo Spider WC) Maj 13-4</li>\n<li>Quarterfinal - Gabriel Townsell (Gladiators) won by decision over Christian Milliron (Yorkville Wrestling Club) Dec 11-5</li>\n<li>Quarterfinal - Matthew Rundell (Arlington Cardinals) won by major decision over Kyle Simpkins (Brawlers WC) Maj 11-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Peter Perich (Force Wrestling) won by decision over Nathanial Smalling (King Select Wrestling) Dec 11-9</li>\n<li>Quarterfinal - James Wolfe (Dakota WC) won by decision over Daniel Arteaga (Fox Lake WC) Dec 6-0</li>\n<li>Quarterfinal - Noah Drabek (Lakeland Predators) won by major decision over Riley Beard (Peoria Razorbacks Youth WC) Maj 8-0</li>\n<li>Quarterfinal - Vincent Turk (Crystal Lake Wizards) won by decision over Carson Oughton (Indians Elite) Dec 7-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Carver James (Dakota WC) won by major decision over Nicholas Foster (Belleville Junior Hit Squad) Maj 12-3</li>\n<li>Quarterfinal - Juwan Edmond (Gladiators) won by fall over Ben Schneider (Orland Park Pioneers) Fall 3:56</li>\n<li>Quarterfinal - Isaiah White (Harvey Park Dist Twisters) won by major decision over Kenan Carter (Martinez Fox Valley Elite) Maj 14-3</li>\n<li>Quarterfinal - Kameron Vantassel (Hononegah Kids WC) won by decision over Vaughn Hobart (Pontiac WC) Dec 7-5</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Chase Vosburgh (Mt. Vernon Lions) won by fall over Ryan Willett (Renegade WC (NFP)) Fall 1:15</li>\n<li>Quarterfinal - Tanner Anthony (Harlem Huskies WC) won by decision over Joey Gunther (Fox Lake WC) Dec 6-3</li>\n<li>Quarterfinal - Keone Derain (Martinez Fox Valley Elite) won by decision over Mack Anderson (Springfield Capital Kids WC) Dec 12-5</li>\n<li>Quarterfinal - Larry Early (Force Wrestling) won by major decision over Fernie Silva (Hononegah Kids WC) Maj 15-5</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Lucas Reifsteck (Force Wrestling) won by decision over Peter Minwegen (Barrington Broncos) Dec 2-1</li>\n<li>Quarterfinal - Luke Fortuna (Martinez Fox Valley Elite) won by decision over Andrew Marsden (Crystal Lake Wizards) Dec 11-7</li>\n<li>Quarterfinal - Flynn Nagel (Vittum Cats) won by major decision over Gavin Mcbride (Edwardsville WC) Maj 12-3</li>\n<li>Quarterfinal - Tyler Demoss (Hononegah Kids WC) won by fall over Brent Hakeman (Brawlers WC) Fall 0:30</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Timothy Young (Tomcat WC) won by decision over Clayton Mckimmy (Fox Lake WC) Dec 7-6</li>\n<li>Quarterfinal - Kenny Condon (Vittum Cats) won by tech fall over Mitchel Humphrey (Mendota Mat Masters) TF 15-0</li>\n<li>Quarterfinal - Xavier Montalvo (Gomez Wrestling Acad.) won in overtime over Ryan Pitra (Geneseo Spider WC) OT 6-4</li>\n<li>Quarterfinal - Dru Worker (Tinley Park Bulldogs) won by decision over Jenner Hecox (Hecox Team Benaiah) Dec 8-3</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Tommy Calkins (Maine Eagles) won by decision over Claude Shelby (King Select Wrestling) Dec 3-1</li>\n<li>Quarterfinal - Tyre Lee (Renegade WC (NFP)) won by decision over Brandon Klein (Champaign Wrestling Club) Dec 8-3</li>\n<li>Quarterfinal - Jt Jones (Rock Island WC) won by decision over Dillon Warnecke (Villa Lombard Cougars) Dec 6-4</li>\n<li>Quarterfinal - Zachary Prinz (Force Wrestling) won by fall over Kenneth Marshall (Vittum Cats) Fall 3:42</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Collin Cronberg (Little Celtic WC) won by decision over Jake Flower (Hononegah Kids WC) Dec 7-2</li>\n<li>Quarterfinal - Jimique Davis (Gomez Wrestling Acad.) won by decision over Blake Cripe (Vandalia Jr Vandals) Dec 5-0</li>\n<li>Quarterfinal - Colton Reed (Mahomet-Seymour Youth WC) won by fall over Niko Portokalis (Arlington Cardinals) Fall 1:09</li>\n<li>Quarterfinal - Jeff Klank (Indians Elite) won by decision over Matthew Striegel (King Select Wrestling) Dec 1-0</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Raul Lopez (Moline WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ezra Avery (Lions WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brendon Gambill (Little Falcons WC) won by fall over Cooper Blakeney (Central Elite Rebels) Fall 1:44</li>\n<li>Cons. Round 1 - Eliceo Villarreal (Peoria Razorbacks Youth WC) won by fall over Dylan Turner (Crystal Lake Wizards) Fall 0:51</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Matthew Domek (Lancer WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Blake Runkle (Champbuilders WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Madison Carlton (Oakwood WC) won by fall over Dylan Tipton (Collinsville Raiders) Fall 0:55</li>\n<li>Cons. Round 1 - Keegan O`donnell (Crystal Lake Wizards) received a bye   () Bye</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Aaron Ditsworth (Moline WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Golnick (Golden Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nick Potts (Kane County Grapplers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Al`lon Carter (Gladiators) received a bye   () Bye</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Blake Mccarthy (Rockridge Rocket Fuel WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dominic Ferraro (Gomez Wrestling Acad.) won by fall over Jayson Goplin (Streator WC) Fall 1:07</li>\n<li>Cons. Round 1 - Trevor Holmberg (Bartlett Jr Hawks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Rosenbaum (Falcon Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Austin Fritzgerald (Junior Spartans WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Karim Fuentes (Gladiators) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Gohde (Illini Bluffs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Garsky (Murphysboro Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Anthony Schaer (Wolves WC) won by fall over Brendan Gallo (Sharks WC) Fall 3:53</li>\n<li>Cons. Round 1 - Travis Ford-melton (Harvey Park Dist Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joe Ruffino (St. Charles East WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Zinzer (Oswego East Team No Ego) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Austin Kedzie (Sycamore WC) won by fall over Hunter Wilde (Charger WC) Fall 1:06</li>\n<li>Cons. Round 1 - Joey Melendez (Rambler / Next Level WC) won by decision over James Higdon (Collinsville Raiders) Dec 4-2</li>\n<li>Cons. Round 1 - Christopher Whaley (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dakota Matthews (Fisher WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Jack Calderone (Junior Spartans WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Norris (Chilli Dawgs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brady Wilsie (Xtreme Wrestling) won by decision over Ren Dazey (Mahomet-Seymour Youth WC) Dec 7-4</li>\n<li>Cons. Round 1 - Ryan Burright (Gomez Wrestling Acad.) won by decision over Jason Stokes (Little Celtic WC) Dec 8-7</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Sean Cullen (Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Shajrianna Turner (Lionheart Intense Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dack Punke (Central Elite Rebels) won by decision over Alex Zacharuk (Harlem Huskies WC) Dec 6-0</li>\n<li>Cons. Round 1 - Peter Ogunsanya (Harvey Park Dist Twisters) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Christian Hall (Harvey Park Dist Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drake Davis (Illinois Valley Elite WC) won by decision over Mohammed Taylor (Harvey Park Dist Twisters) Dec 13-7</li>\n<li>Cons. Round 1 - Brandon Critchfield (King Select Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Rubino (SCN Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Zachary Krause (Force Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Lucas Busse (Wolves WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Murray (Little Falcons WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Braxten Ary (Midwest Central Youth) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Matthew Hennessey (Force Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christian Davis (Hoopeston Area WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Barzowski (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Hawkins (Harlem Huskies WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Logan Mcclellan (King Select Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kevin Pate (Harvey Park Dist Twisters) won by fall over David Diak (Edwardsville WC) Fall 1:24</li>\n<li>Cons. Round 1 - Justin Martinez (Xtreme Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jaylen Shaw (Arlington Cardinals) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Brandon Rutherford (Mt. Vernon Lions) received a bye   () Bye</li>\n<li>Cons. Round 1 - Patrick Brucki (Orland Park Pioneers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jordan Soto (Batavia Pinners) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Gonzalez (Blackhawk WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Warner (Champaign Wrestling Club) won by fall over Caleb Adams (West Hancock Titan WC) Fall 3:45</li>\n<li>Cons. Round 1 - Maximillian Hill (Lakeland Predators) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Murfield (O`Fallon Little Panthers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Karpinski (Southside Stallions) received a bye   () Bye</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Cummens (Junior Spartans WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ethan Cain (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tariq Thurman (Gladiators) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Eggemeyer (Panther Powerhouse WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Evan Broniarczyk (Tinley Park Bulldogs) won by decision over Anthony Tudisco (Oswego East Team No Ego) Dec 13-6</li>\n<li>Cons. Round 1 - Keenan Edgar (Chicago Crusaders) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gavin Mast (Champions WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gavin Goddard (Champaign Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Juan Alfaro (Gomez Wrestling Acad.) won by fall over Vlad Stepanov (Tigertown Tanglers) Fall 3:49</li>\n<li>Cons. Round 1 - Chris Yaros (Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kory Loew (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Daniel Spencer (Team Mascoutah) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Noah Miller (Arlington Cardinals) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dayton Coyle (Seneca Irish Cadets) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan King (Little Falcons WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cole Roach (Crystal Lake Wizards) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Tom Schofield (Mustang WC) won by fall over Joseph Katula (Yorkville Wrestling Club) Fall 0:50</li>\n<li>Cons. Round 1 - Josh Davis (Rock Island WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Charlie Kirkwood (Oswego East Team No Ego) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kenny Martens (Maine Eagles) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Landon Johnson (Junior Maroon WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Antonio James (East St. Louis Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Adrian Ortiz (Arlington Cardinals) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Bernal (Rebels WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Luke Mathias (A &amp; M Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alec Daykin (Riverton Hawks Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Deandre Ford (Oswego East Team No Ego) received a bye   () Bye</li>\n<li>Cons. Round 1 - Francisco Quiroz (Huntley Jr. Red Raiders) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Joshua Gentry (Badger WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Myers (Plainfield WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Beau Harrier (Golden Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Szlenk (Crystal Lake Wizards) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Hunter Webb (Sauk Valley WC) won by fall over Dylan Devries (Stillman Valley WC) Fall 1:14</li>\n<li>Cons. Round 1 - Matthew Crnich (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Rader (Hononegah Kids WC) won by fall over Jonathan Hethmon (Falcon Youth WC) Fall 0:38</li>\n<li>Cons. Round 1 - Dustin Huss (Charger WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Hunter Grau (Geneseo Spider WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Mcfall (Force Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tanner Coleman (Peoria Heights Minutemen) won by fall over Brian Rossdeutcher (Junior Cougar WC) Fall 2:16</li>\n<li>Cons. Round 1 - Conrad Noverini (SCN Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Matthew Valenti (Bartlett Jr Hawks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Darin Trout (Pontiac WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Javeontae Crider (Lionheart Intense Wrestling) won by major decision over Alec Henze (Dakota WC) Maj 11-2</li>\n<li>Cons. Round 1 - Britches Sikula (Wolves WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Keegan Powers (Hononegah Kids WC) won by decision over Jake Tisza (Junior Spartans WC) Dec 7-0</li>\n<li>Cons. Round 1 - Grady Todd (Junior Rams WC) won by decision over Draylin Turner (Rantoul Junior Eagles) Dec 10-7</li>\n<li>Cons. Round 1 - Robert Zebrauskas (Southside Stallions) won by decision over Brody Sharp (Yorkville Wrestling Club) Dec 7-4</li>\n<li>Cons. Round 1 - Gunner Wenger (The Law) received a bye   () Bye</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Cole Witzig (Triad Little Knights) won by decision over Nathan Olsen (Dakota WC) Dec 5-2</li>\n<li>Cons. Round 1 - Brandon Meyer (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cody Harris (Belleville Little Devils) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Callahan (SCN Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Cole Ebenroth (Junior Rams WC) won by decision over Matthew Ferraro (SCN Youth WC) Dec 4-3</li>\n<li>Cons. Round 1 - Jared Finley (Shelbyville Jr Rams Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jakada Hull (Harvey Park Dist Twisters) won by decision over Elijah Baltazar (SCN Youth WC) Dec 9-4</li>\n<li>Cons. Round 1 - Alexander Mckenna (Trevian WC) won by decision over Joey Schott Jr (Champaign Wrestling Club) Dec 6-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Clayton Ledbetter (Force Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dequarius Millett (Granite City WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trace Carello (Mt. Vernon Lions) won by major decision over Nicholas Remke (Marengo Youth Wrestling) Maj 12-1</li>\n<li>Cons. Round 1 - Kyle Betourne (Brawlers WC) won by fall over Julius Smith (Barrington Broncos) Fall 2:44</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Nathan Romero (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Josiah Cropp (Geneseo Spider WC) won by injury default over Nikolas Mccoy (Crosstown WC) Inj. 0:00</li>\n<li>Cons. Round 1 - Johnny Davidson (Barrington Broncos) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jim Brennan (Lemont Bears WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Gabe Pleasants (Morton Youth Wrestling) won by decision over Jarrod Raap (Dundee Highlanders) Dec 6-3</li>\n<li>Cons. Round 1 - Hasan Muhammad (Renegade WC (NFP)) received a bye   () Bye</li>\n<li>Cons. Round 1 - Riley Demoss (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ramon Lopez (Martinez Fox Valley Elite) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Garrett Rude (Hawk Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - William King (Dundee Highlanders) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Shelton (Oakwood WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Hall (Junior Spartans WC) won by major decision over Wesley Kibler (SJO Spartan Youth WC) Maj 14-6</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Dallas Appleman (Clipper WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Spanier (Mendota Mat Masters) received a bye   () Bye</li>\n<li>Cons. Round 1 - John Mclaughlin (Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jarod Noel (Bismarck Henning WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Cain (Sauk Valley WC) won by decision over Stefan Ivanisevic (Hinsdale WC) Dec 6-2</li>\n<li>Cons. Round 1 - Rashann Ford (Blackhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - De`gyon Macklin (Hawk Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Jarvis (Shamrock WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Raul Lopez (Moline WC) won by major decision over Ryan Yohe (Martinez Fox Valley Elite) Maj 8-0</li>\n<li>Cons. Round 2 - Sylvester Vijil (Hononegah Kids WC) won by decision over Ezra Avery (Lions WC) Dec 9-5</li>\n<li>Cons. Round 2 - Nick Graziano (Oak Forest Warriors) won in overtime over Brendon Gambill (Little Falcons WC) OT 8-6</li>\n<li>Cons. Round 2 - Eliceo Villarreal (Peoria Razorbacks Youth WC) won by fall over Tyler Grimsley (Saukee Youth WC) Fall 3:57</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Matthew Domek (Lancer WC) won by decision over Jonathan Broadway (Centralia) Dec 3-1</li>\n<li>Cons. Round 2 - Peter Capetillo (SCN Youth WC) won by decision over Blake Runkle (Champbuilders WC) Dec 4-2</li>\n<li>Cons. Round 2 - Brandon Andino (Gomez Wrestling Acad.) won by major decision over Madison Carlton (Oakwood WC) Maj 9-0</li>\n<li>Cons. Round 2 - Dylan Schultz (Lincoln-Way WC) won by fall over Keegan O`donnell (Crystal Lake Wizards) Fall 3:27</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Matt Allen (Hinsdale WC) won by decision over Aaron Ditsworth (Moline WC) Dec 9-4</li>\n<li>Cons. Round 2 - Wade Thiele (Saukee Youth WC) won by decision over Jack Golnick (Golden Eagles WC) Dec 4-2</li>\n<li>Cons. Round 2 - Nick Potts (Kane County Grapplers) won by fall over Hunter Crowley (Fisher WC) Fall 1:06</li>\n<li>Cons. Round 2 - Al`lon Carter (Gladiators) won by fall over Cole Hunzeker (Geneseo Spider WC) Fall 1:59</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - David Charnot (Vittum Cats) won by fall over Blake Mccarthy (Rockridge Rocket Fuel WC) Fall 0:17</li>\n<li>Cons. Round 2 - Dominic Ferraro (Gomez Wrestling Acad.) won by decision over Devon Sieveking (Benton Jr WC) Dec 9-6</li>\n<li>Cons. Round 2 - Remington Smith (Limestone Youth WC) won in overtime over Trevor Holmberg (Bartlett Jr Hawks) OT 6-4</li>\n<li>Cons. Round 2 - David Newman (Indians Elite) won by fall over Alex Rosenbaum (Falcon Youth WC) Fall 0:14</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Brandon Reyes (Calumet MPD Wolverines) won by fall over Austin Fritzgerald (Junior Spartans WC) Fall 0:59</li>\n<li>Cons. Round 2 - Karim Fuentes (Gladiators) won by fall over Dominic Tudor (Peoria Razorbacks Youth WC) Fall 0:42</li>\n<li>Cons. Round 2 - Ryan Ramirez (Little Falcons WC) won by fall over Jacob Gohde (Illini Bluffs WC) Fall 0:32</li>\n<li>Cons. Round 2 - Joshua Stark (Brawlers WC) won by fall over Alex Garsky (Murphysboro Wrestling) Fall 0:12</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Ryan Roper (SCN Youth WC) won by major decision over Anthony Schaer (Wolves WC) Maj 10-2</li>\n<li>Cons. Round 2 - Austin Rudsinski (Lincoln-Way WC) won by decision over Travis Ford-melton (Harvey Park Dist Twisters) Dec 4-3</li>\n<li>Cons. Round 2 - Aaron Zebrauskas (Southside Stallions) won by fall over Joe Ruffino (St. Charles East WC) Fall 1:21</li>\n<li>Cons. Round 2 - Chase Bittle (Belleville Little Devils) won by fall over Nathan Zinzer (Oswego East Team No Ego) Fall 0:37</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Kolbe O`brien (SCN Youth WC) won by fall over Austin Kedzie (Sycamore WC) Fall 2:14</li>\n<li>Cons. Round 2 - Joey Melendez (Rambler / Next Level WC) won in overtime over Hassan Johnson (Harvey Park Dist Twisters) OT 3-2</li>\n<li>Cons. Round 2 - Jake Szlenk (Crystal Lake Wizards) won by decision over Christopher Whaley (Sauk Valley WC) Dec 6-0</li>\n<li>Cons. Round 2 - Jacob Gross (Lakeland Predators) won by tech fall over Dakota Matthews (Fisher WC) TF 15-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Jack Calderone (Junior Spartans WC) won by decision over Bilal Bailey (Harvey Park Dist Twisters) Dec 1-0</li>\n<li>Cons. Round 2 - Nicholas Norris (Chilli Dawgs WC) won by decision over Michael Tortorice (Wolves WC) Dec 3-0</li>\n<li>Cons. Round 2 - Brady Wilsie (Xtreme Wrestling) won by major decision over Brett Hammel (West Hancock Titan WC) Maj 11-1</li>\n<li>Cons. Round 2 - Tyler Moon (King Select Wrestling) won by decision over Ryan Burright (Gomez Wrestling Acad.) Dec 6-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Sean Cullen (Wrestling Factory) won by decision over Alec Meronk (Metamora Kids WC) Dec 3-2</li>\n<li>Cons. Round 2 - Shajrianna Turner (Lionheart Intense Wrestling) won by decision over Markus Hartman (Barrington Broncos) Dec 2-1</li>\n<li>Cons. Round 2 - Dack Punke (Central Elite Rebels) won by decision over Brendon Davis (Soldier Wrestling Allstar Training) Dec 6-0</li>\n<li>Cons. Round 2 - Peter Ogunsanya (Harvey Park Dist Twisters) won by decision over Jake Polka (Little Celtic WC) Dec 6-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Zachary Lorek (Brawlers WC) won by decision over Christian Hall (Harvey Park Dist Twisters) Dec 8-2</li>\n<li>Cons. Round 2 - Drake Davis (Illinois Valley Elite WC) won by decision over Nicholas Burke (Downers Grove Cougars) Dec 9-3</li>\n<li>Cons. Round 2 - Nolan Baker (Xtreme Wrestling) won by fall over Brandon Critchfield (King Select Wrestling) Fall 2:55</li>\n<li>Cons. Round 2 - Raekwon Williams (Crosstown WC) won by fall over Anthony Rubino (SCN Youth WC) Fall 2:37</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Kenneth Barber (Wrestling Factory) won by decision over Zachary Krause (Force Wrestling) Dec 5-1</li>\n<li>Cons. Round 2 - Jake Barzowski (Martinez Fox Valley Elite) won by fall over Lucas Busse (Wolves WC) Fall 4:04</li>\n<li>Cons. Round 2 - Guy Brown (Edwardsville WC) won by decision over Ryan Murray (Little Falcons WC) Dec 6-5</li>\n<li>Cons. Round 2 - Blaize Punke (Central Elite Rebels) won by fall over Braxten Ary (Midwest Central Youth) Fall 1:00</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Emille Shannon (King Select Wrestling) won by decision over Matthew Hennessey (Force Wrestling) Dec 8-2</li>\n<li>Cons. Round 2 - Chris Betancourt (Harvey Park Dist Twisters) won by decision over Christian Davis (Hoopeston Area WC) Dec 11-4</li>\n<li>Cons. Round 2 - Joshua Barzowski (Martinez Fox Valley Elite) won by major decision over Palidin Martinez (Moline WC) Maj 12-2</li>\n<li>Cons. Round 2 - Devin Kane (Martinez Fox Valley Elite) won by fall over Jacob Hawkins (Harlem Huskies WC) Fall 0:54</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Gregory Krulas (Dakota WC) won by decision over Logan Mcclellan (King Select Wrestling) Dec 7-0</li>\n<li>Cons. Round 2 - Kevin Pate (Harvey Park Dist Twisters) won by fall over Cole Bateman (Orland Park Pioneers) Fall 1:07</li>\n<li>Cons. Round 2 - Logan Gruszka (Oswego East Team No Ego) won by tech fall over Justin Martinez (Xtreme Wrestling) TF 15-0</li>\n<li>Cons. Round 2 - Jesse Ditzler (Sauk Valley WC) won by decision over Jaylen Shaw (Arlington Cardinals) Dec 7-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Elliot Koster (Geneseo Spider WC) won in overtime over Brandon Rutherford (Mt. Vernon Lions) OT 5-3</li>\n<li>Cons. Round 2 - Jake Lanning (Pontiac WC) won by decision over Patrick Brucki (Orland Park Pioneers) Dec 5-2</li>\n<li>Cons. Round 2 - Jordan Soto (Batavia Pinners) won by decision over Tyler Dunn (East St. Louis Wrestling) Dec 13-8</li>\n<li>Cons. Round 2 - Alex Gonzalez (Blackhawk WC) won by injury default over Gavin Rathbun (Force Wrestling) Inj. 0:00</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Warner (Champaign Wrestling Club) won in overtime over Brady Jamrozek (Izzy Style School of Wrestling) OT 7-5</li>\n<li>Cons. Round 2 - Maximillian Hill (Lakeland Predators) won by fall over Kenneth Kirkland (Indians Elite) Fall 1:57</li>\n<li>Cons. Round 2 - Matthew Wroblewski (Arlington Cardinals) won by tech fall over Ryan Murfield (O`Fallon Little Panthers) TF 15-0</li>\n<li>Cons. Round 2 - Colten Cashmore (Richmond WC) won by decision over Kyle Karpinski (Southside Stallions) Dec 6-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Tsagalis (Gomez Wrestling Acad.) won by decision over Jacob Cummens (Junior Spartans WC) Dec 7-1</li>\n<li>Cons. Round 2 - Griffin Meeker (SJO Spartan Youth WC) won by decision over Ethan Cain (Sauk Valley WC) Dec 5-2</li>\n<li>Cons. Round 2 - Brandon Elliott (Harlem Huskies WC) won by major decision over Tariq Thurman (Gladiators) Maj 8-0</li>\n<li>Cons. Round 2 - Tyler Eggemeyer (Panther Powerhouse WC) won by fall over Tj Casella (Lions WC) Fall 0:35</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Matthew Rafe (Brawlers WC) won by fall over Evan Broniarczyk (Tinley Park Bulldogs) Fall 1:12</li>\n<li>Cons. Round 2 - Xavier Sallie (Will County Warriors) won by fall over Keenan Edgar (Chicago Crusaders) Fall 0:34</li>\n<li>Cons. Round 2 - Michael Beaudoin (Sycamore WC) won by fall over Gavin Mast (Champions WC) Fall 1:14</li>\n<li>Cons. Round 2 - Stephen Kemp (Batavia Pinners) won by major decision over Gavin Goddard (Champaign Wrestling Club) Maj 10-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Christian Brown (Oswego East Team No Ego) won by fall over Juan Alfaro (Gomez Wrestling Acad.) Fall 1:59</li>\n<li>Cons. Round 2 - Chris Yaros (Vittum Cats) won by major decision over Maxwell Oswalt (Sauk Valley WC) Maj 10-0</li>\n<li>Cons. Round 2 - Mitch Novotny (Downers Grove Cougars) won by fall over Kory Loew (Edwardsville WC) Fall 0:56</li>\n<li>Cons. Round 2 - Woo Lee (Arlington Cardinals) won by injury default over Daniel Spencer (Team Mascoutah) Inj. 0:00</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Tad Cravens (Herrin Junior WC) won by decision over Noah Miller (Arlington Cardinals) Dec 9-3</li>\n<li>Cons. Round 2 - Dayton Coyle (Seneca Irish Cadets) won by fall over Ubaldo Torres (Blackhawk WC) Fall 2:56</li>\n<li>Cons. Round 2 - Nathan King (Little Falcons WC) won by forfeit over Latrey Reed (Danville Chargers) FF</li>\n<li>Cons. Round 2 - Joshua Bouie (Indians Elite) won by fall over Cole Roach (Crystal Lake Wizards) Fall 3:16</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Tom Schofield (Mustang WC) won by fall over Alexander Anguiano (Belvidere Bandits) Fall 2:47</li>\n<li>Cons. Round 2 - Josh Davis (Rock Island WC) won by fall over Adrian Salinas (Rams Wrestling Club) Fall 2:38</li>\n<li>Cons. Round 2 - Tristan Penrod (Mt. Vernon Lions) won by decision over Charlie Kirkwood (Oswego East Team No Ego) Dec 8-3</li>\n<li>Cons. Round 2 - Ryan Berman (Little Celtic WC) won by decision over Kenny Martens (Maine Eagles) Dec 3-2</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Nathan Karas (Plainfield WC) won by fall over Landon Johnson (Junior Maroon WC) Fall 1:03</li>\n<li>Cons. Round 2 - Frank Pavlik (Rebels WC) won by fall over Antonio James (East St. Louis Wrestling) Fall 3:34</li>\n<li>Cons. Round 2 - Devin Knight (Sycamore WC) won by fall over Adrian Ortiz (Arlington Cardinals) Fall 3:31</li>\n<li>Cons. Round 2 - Matthew Bernal (Rebels WC) won by fall over Nick Becker (Tinley Park Bulldogs) Fall 3:16</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Joshua Ruiz (Rams Wrestling Club) won by fall over Luke Mathias (A &amp; M Youth Wrestling) Fall 1:15</li>\n<li>Cons. Round 2 - Alec Daykin (Riverton Hawks Wrestling) won in overtime over Nicholas Barker (Vittum Cats) OT 2-1</li>\n<li>Cons. Round 2 - Wyatt Witty (Bismarck Henning WC) won by fall over Deandre Ford (Oswego East Team No Ego) Fall 3:38</li>\n<li>Cons. Round 2 - Jake Ford (Vittum Cats) won by fall over Francisco Quiroz (Huntley Jr. Red Raiders) Fall 0:42</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Travis Piotrowski (Wolves WC) won by fall over Joshua Gentry (Badger WC) Fall 1:16</li>\n<li>Cons. Round 2 - Tyler Myers (Plainfield WC) won by major decision over Tyler Scanlon (Tinley Park Bulldogs) Maj 11-1</li>\n<li>Cons. Round 2 - Kirk Johansen (Villa Lombard Cougars) won by major decision over Beau Harrier (Golden Eagles WC) Maj 16-2</li>\n<li>Cons. Round 2 - Kyle Szlenk (Crystal Lake Wizards) won by decision over Raul Marrero Jr (Springfield Capital Kids WC) Dec 8-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Vinnie Piunti (Martinez Fox Valley Elite) won by fall over Hunter Webb (Sauk Valley WC) Fall 0:58</li>\n<li>Cons. Round 2 - Nick Lukanich (Vittum Cats) won by tech fall over Matthew Crnich (Lincoln-Way WC) TF 18-3</li>\n<li>Cons. Round 2 - Alex Rader (Hononegah Kids WC) won by decision over Aj Rechenmacher (Batavia Pinners) Dec 8-3</li>\n<li>Cons. Round 2 - Jacob Mitchell (Highland Bulldog Jr WC) won by fall over Dustin Huss (Charger WC) Fall 0:56</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Patrick Augustyn (Gomez Wrestling Acad.) won by decision over Hunter Grau (Geneseo Spider WC) Dec 8-5</li>\n<li>Cons. Round 2 - Thomas Svestka (Martinez Fox Valley Elite) won by decision over Andrew Mcfall (Force Wrestling) Dec 13-7</li>\n<li>Cons. Round 2 - Tanner Coleman (Peoria Heights Minutemen) won by decision over Joshua Larson (Xtreme Wrestling) Dec 4-2</li>\n<li>Cons. Round 2 - Christopher Dranka (Crystal Lake Wizards) won by major decision over Conrad Noverini (SCN Youth WC) Maj 10-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Carter Pillen (Geneseo Spider WC) won by decision over Matthew Valenti (Bartlett Jr Hawks) Dec 6-1</li>\n<li>Cons. Round 2 - Jacob Orth (Crystal Lake Wizards) won by fall over Darin Trout (Pontiac WC) Fall 2:00</li>\n<li>Cons. Round 2 - Dalton Brito (Edwardsville WC) won by decision over Javeontae Crider (Lionheart Intense Wrestling) Dec 7-2</li>\n<li>Cons. Round 2 - Britches Sikula (Wolves WC) won by fall over Steven Fessler (Vittum Cats) Fall 2:31</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Keegan Powers (Hononegah Kids WC) won by fall over Kris Williams (Harvey Park Dist Twisters) Fall 4:14</li>\n<li>Cons. Round 2 - Cole Wysocki (Triad Little Knights) won by fall over Grady Todd (Junior Rams WC) Fall 2:33</li>\n<li>Cons. Round 2 - Andrew Verr (Villa Park Young Warriors) won by fall over Robert Zebrauskas (Southside Stallions) Fall 1:00</li>\n<li>Cons. Round 2 - Gunner Wenger (The Law) won by major decision over Steve Novy (Mustang WC) Maj 12-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Cole Witzig (Triad Little Knights) won in double overtime over Brian Krasowski (Orland Park Pioneers) 2-OT 2-1</li>\n<li>Cons. Round 2 - Brandon Meyer (Crystal Lake Wizards) won by fall over Jonathan Warner (Geneseo Spider WC) Fall 0:49</li>\n<li>Cons. Round 2 - Christian Milliron (Yorkville Wrestling Club) won by fall over Cody Harris (Belleville Little Devils) Fall 0:36</li>\n<li>Cons. Round 2 - Kyle Simpkins (Brawlers WC) won by decision over Michael Callahan (SCN Youth WC) Dec 4-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Nathanial Smalling (King Select Wrestling) won by tech fall over Cole Ebenroth (Junior Rams WC) TF 18-3</li>\n<li>Cons. Round 2 - Jared Finley (Shelbyville Jr Rams Wrestling) won by decision over Daniel Arteaga (Fox Lake WC) Dec 8-2</li>\n<li>Cons. Round 2 - Jakada Hull (Harvey Park Dist Twisters) won by major decision over Riley Beard (Peoria Razorbacks Youth WC) Maj 11-2</li>\n<li>Cons. Round 2 - Alexander Mckenna (Trevian WC) won by decision over Carson Oughton (Indians Elite) Dec 3-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Nicholas Foster (Belleville Junior Hit Squad) won by major decision over Clayton Ledbetter (Force Wrestling) Maj 15-6</li>\n<li>Cons. Round 2 - Dequarius Millett (Granite City WC) won by decision over Ben Schneider (Orland Park Pioneers) Dec 7-1</li>\n<li>Cons. Round 2 - Trace Carello (Mt. Vernon Lions) won by major decision over Kenan Carter (Martinez Fox Valley Elite) Maj 8-0</li>\n<li>Cons. Round 2 - Kyle Betourne (Brawlers WC) won by decision over Vaughn Hobart (Pontiac WC) Dec 7-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Ryan Willett (Renegade WC (NFP)) won in overtime over Nathan Romero (Martinez Fox Valley Elite) OT 6-5</li>\n<li>Cons. Round 2 - Josiah Cropp (Geneseo Spider WC) won in overtime over Joey Gunther (Fox Lake WC) OT 5-3</li>\n<li>Cons. Round 2 - Mack Anderson (Springfield Capital Kids WC) won by major decision over Johnny Davidson (Barrington Broncos) Maj 10-0</li>\n<li>Cons. Round 2 - Jim Brennan (Lemont Bears WC) won by decision over Fernie Silva (Hononegah Kids WC) Dec 7-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Gabe Pleasants (Morton Youth Wrestling) won by fall over Peter Minwegen (Barrington Broncos) Fall 4:09</li>\n<li>Cons. Round 2 - Hasan Muhammad (Renegade WC (NFP)) won by decision over Andrew Marsden (Crystal Lake Wizards) Dec 8-2</li>\n<li>Cons. Round 2 - Riley Demoss (SCN Youth WC) won by decision over Gavin Mcbride (Edwardsville WC) Dec 7-1</li>\n<li>Cons. Round 2 - Ramon Lopez (Martinez Fox Valley Elite) won by decision over Brent Hakeman (Brawlers WC) Dec 5-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Clayton Mckimmy (Fox Lake WC) won by decision over Garrett Rude (Hawk Wrestling Club) Dec 7-0</li>\n<li>Cons. Round 2 - Mitchel Humphrey (Mendota Mat Masters) won by fall over William King (Dundee Highlanders) Fall 3:29</li>\n<li>Cons. Round 2 - Ryan Pitra (Geneseo Spider WC) won by decision over Austin Shelton (Oakwood WC) Dec 7-0</li>\n<li>Cons. Round 2 - Jenner Hecox (Hecox Team Benaiah) won by decision over Michael Hall (Junior Spartans WC) Dec 2-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Claude Shelby (King Select Wrestling) won by decision over Dallas Appleman (Clipper WC) Dec 8-4</li>\n<li>Cons. Round 2 - Brandon Klein (Champaign Wrestling Club) won by major decision over Jacob Spanier (Mendota Mat Masters) Maj 10-0</li>\n<li>Cons. Round 2 - Dillon Warnecke (Villa Lombard Cougars) won by fall over John Mclaughlin (Vittum Cats) Fall 3:27</li>\n<li>Cons. Round 2 - Kenneth Marshall (Vittum Cats) won in overtime over Jarod Noel (Bismarck Henning WC) OT 2-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Jake Flower (Hononegah Kids WC) won by major decision over Jacob Cain (Sauk Valley WC) Maj 9-0</li>\n<li>Cons. Round 2 - Blake Cripe (Vandalia Jr Vandals) won by major decision over Rashann Ford (Blackhawk WC) Maj 14-6</li>\n<li>Cons. Round 2 - Niko Portokalis (Arlington Cardinals) won by fall over De`gyon Macklin (Hawk Wrestling Club) Fall 3:35</li>\n<li>Cons. Round 2 - Matthew Striegel (King Select Wrestling) won by major decision over Anthony Jarvis (Shamrock WC) Maj 11-2</li>\n</ul>\n</section>",
  "Champ Semis & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semis &amp; Con Quarterfinal</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - James Watters (Edwardsville WC) won by major decision over Keenith Edgar (Chicago Crusaders) Maj 17-4</li>\n<li>Semifinal - George Bessette (Lakeland Predators) won by fall over Troy Ott (Mad Dog Wrestling Academy) Fall 3:39</li>\n<li>Cons. Round 3 - Sylvester Vijil (Hononegah Kids WC) won by tech fall over Raul Lopez (Moline WC) TF 15-0</li>\n<li>Cons. Round 3 - Eliceo Villarreal (Peoria Razorbacks Youth WC) won by fall over Nick Graziano (Oak Forest Warriors) Fall 1:58</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Romeo Mcknight (Crystal Lake Wizards) won by decision over Lake Vitkauskas (Oak Forest Warriors) Dec 12-6</li>\n<li>Semifinal - Brady Rude (Sauk Valley WC) won by fall over Jarryd Cabusao (Golden Eagles WC) Fall 1:00</li>\n<li>Cons. Round 3 - Peter Capetillo (SCN Youth WC) won by fall over Matthew Domek (Lancer WC) Fall 0:49</li>\n<li>Cons. Round 3 - Brandon Andino (Gomez Wrestling Acad.) won by decision over Dylan Schultz (Lincoln-Way WC) Dec 6-4</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Allen Stallings (Gladiators) won by decision over Kumari Jackson (Springfield Capital Kids WC) Dec 3-1</li>\n<li>Semifinal - Kenneth Abitua (Xtreme Wrestling) won by decision over Matt Brozovich (Indians Elite) Dec 7-1</li>\n<li>Cons. Round 3 - Matt Allen (Hinsdale WC) won by major decision over Wade Thiele (Saukee Youth WC) Maj 12-3</li>\n<li>Cons. Round 3 - Al`lon Carter (Gladiators) won by fall over Nick Potts (Kane County Grapplers) Fall 0:37</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - De`undre Garner (Gladiators) won by decision over Thomas Rollete (Hononegah Kids WC) Dec 11-4</li>\n<li>Semifinal - Joshua King (Powerhouse WC) won by decision over Andrew Wise (Aces WC) Dec 11-8</li>\n<li>Cons. Round 3 - Dominic Ferraro (Gomez Wrestling Acad.) won by fall over David Charnot (Vittum Cats) Fall 0:19</li>\n<li>Cons. Round 3 - David Newman (Indians Elite) won by fall over Remington Smith (Limestone Youth WC) Fall 0:15</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Octavius Mccloud (Carbondale WC) won by decision over Sam Deisher (Blackhawk WC) Dec 7-2</li>\n<li>Semifinal - Bryan Ditchman (Tinley Park Bulldogs) won by injury default over Keiffer Johnston (Shelbyville Jr Rams Wrestling) Inj. 0:00</li>\n<li>Cons. Round 3 - Karim Fuentes (Gladiators) won by fall over Brandon Reyes (Calumet MPD Wolverines) Fall 3:55</li>\n<li>Cons. Round 3 - Joshua Stark (Brawlers WC) won by decision over Ryan Ramirez (Little Falcons WC) Dec 6-4</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Ethan Harsted (Seneca Irish Cadets) won by fall over Jacob Hiles (Indians Elite) Fall 2:40</li>\n<li>Semifinal - Marcus Povlick (Force Wrestling) won by decision over Kevin Radcliff (Gomez Wrestling Acad.) Dec 4-1</li>\n<li>Cons. Round 3 - Ryan Roper (SCN Youth WC) won by major decision over Austin Rudsinski (Lincoln-Way WC) Maj 13-2</li>\n<li>Cons. Round 3 - Chase Bittle (Belleville Little Devils) won by major decision over Aaron Zebrauskas (Southside Stallions) Maj 11-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Dylan Burnoski (Bolingbrook Junior Raiders) won by decision over Anthony Zamora (Force Wrestling) Dec 4-2</li>\n<li>Semifinal - Anthony Madrigal (Martinez Fox Valley Elite) won by decision over Michael Mcgee (Force Wrestling) Dec 6-4</li>\n<li>Cons. Round 3 - Kolbe O`brien (SCN Youth WC) won by decision over Joey Melendez (Rambler / Next Level WC) Dec 6-0</li>\n<li>Cons. Round 3 - Jake Szlenk (Crystal Lake Wizards) won by major decision over Jacob Gross (Lakeland Predators) Maj 16-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Anthony Cheloni (SCN Youth WC) won by major decision over Pat Walker (Gomez Wrestling Acad.) Maj 11-2</li>\n<li>Semifinal - Jason Renteria (Martinez Fox Valley Elite) won by decision over Sean Mckenna (Martinez Fox Valley Elite) Dec 3-0</li>\n<li>Cons. Round 3 - Jack Calderone (Junior Spartans WC) won in overtime over Nicholas Norris (Chilli Dawgs WC) OT 3-1</li>\n<li>Cons. Round 3 - Brady Wilsie (Xtreme Wrestling) won by decision over Tyler Moon (King Select Wrestling) Dec 8-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Dylan Duncan (SCN Youth WC) won by major decision over Jacob Dudeck (Tinley Park Bulldogs) Maj 12-1</li>\n<li>Semifinal - Gavin Sutton (Gomez Wrestling Acad.) won by decision over Devin Michicich (Southside Stallions) Dec 4-0</li>\n<li>Cons. Round 3 - Sean Cullen (Wrestling Factory) won by decision over Shajrianna Turner (Lionheart Intense Wrestling) Dec 4-0</li>\n<li>Cons. Round 3 - Peter Ogunsanya (Harvey Park Dist Twisters) won by decision over Dack Punke (Central Elite Rebels) Dec 5-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Merik Fulton (Triad Little Knights) won by decision over John Cullen (Wrestling Factory) Dec 5-0</li>\n<li>Semifinal - Austin Gomez (Gomez Wrestling Acad.) won by decision over Yahya Thomas (Harvey Park Dist Twisters) Dec 8-2</li>\n<li>Cons. Round 3 - Drake Davis (Illinois Valley Elite WC) won by decision over Zachary Lorek (Brawlers WC) Dec 8-2</li>\n<li>Cons. Round 3 - Nolan Baker (Xtreme Wrestling) won by fall over Raekwon Williams (Crosstown WC) Fall 2:06</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Austin O`connor (Tinley Park Bulldogs) won by major decision over Drake Boverie (Bulls WC) Maj 12-2</li>\n<li>Semifinal - Mitchell Stathakis (Barrington Broncos) won by decision over Juwan Robinson (Bolingbrook Junior Raiders) Dec 4-3</li>\n<li>Cons. Round 3 - Jake Barzowski (Martinez Fox Valley Elite) won by decision over Kenneth Barber (Wrestling Factory) Dec 6-5</li>\n<li>Cons. Round 3 - Guy Brown (Edwardsville WC) won by fall over Blaize Punke (Central Elite Rebels) Fall 2:43</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Aj Jaffe (SCN Youth WC) won by major decision over Christian Fausel (Hononegah Kids WC) Maj 13-3</li>\n<li>Semifinal - Kordell Norfleet (Harvey Park Dist Twisters) won by fall over Garrett Brachbill (Shelbyville Jr Rams Wrestling) Fall 2:18</li>\n<li>Cons. Round 3 - Emille Shannon (King Select Wrestling) won in overtime over Chris Betancourt (Harvey Park Dist Twisters) OT 5-3</li>\n<li>Cons. Round 3 - Devin Kane (Martinez Fox Valley Elite) won by fall over Joshua Barzowski (Martinez Fox Valley Elite) Fall 1:29</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Johnathon Doyle (Gomez Wrestling Acad.) won by decision over Ameen Hamdan (Triumph `The Art of Wrestling`) Dec 9-5</li>\n<li>Semifinal - Trent Rakers (Highland Bulldog Jr WC) won by fall over Shayne Oster (Junior Porters WC) Fall 0:48</li>\n<li>Cons. Round 3 - Gregory Krulas (Dakota WC) won in overtime over Kevin Pate (Harvey Park Dist Twisters) OT 8-6</li>\n<li>Cons. Round 3 - Logan Gruszka (Oswego East Team No Ego) won by decision over Jesse Ditzler (Sauk Valley WC) Dec 6-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Jack Jessen (Villa Park Young Warriors) won by major decision over Dino Gutierrez (Rebels WC) Maj 13-2</li>\n<li>Semifinal - Johnny Mologousis (Lions WC) won by decision over Andrew Wenger (Dakota WC) Dec 6-0</li>\n<li>Cons. Round 3 - Jake Lanning (Pontiac WC) won by fall over Elliot Koster (Geneseo Spider WC) Fall 0:38</li>\n<li>Cons. Round 3 - Alex Gonzalez (Blackhawk WC) won by fall over Jordan Soto (Batavia Pinners) Fall 4:53</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Alex Rodriguez (Fox Lake WC) won by fall over Louie Depasquale (Redhawk WC) Fall 4:00</li>\n<li>Semifinal - Randy Meneweather (Knox County Krushers) won by fall over Brian Burns (Orland Park Pioneers) Fall 0:35</li>\n<li>Cons. Round 3 - Maximillian Hill (Lakeland Predators) won by fall over Jacob Warner (Champaign Wrestling Club) Fall 3:31</li>\n<li>Cons. Round 3 - Matthew Wroblewski (Arlington Cardinals) won by decision over Colten Cashmore (Richmond WC) Dec 6-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Kamal Bey (Harvey Park Dist Twisters) won by fall over Chris Prosser (Edwardsville WC) Fall 2:27</li>\n<li>Semifinal - Michael Peters (Champions WC) won by tech fall over David Riojas (Force Wrestling) TF 17-2</li>\n<li>Cons. Round 3 - Tyler Tsagalis (Gomez Wrestling Acad.) won by decision over Griffin Meeker (SJO Spartan Youth WC) Dec 4-0</li>\n<li>Cons. Round 3 - Tyler Eggemeyer (Panther Powerhouse WC) won by decision over Brandon Elliott (Harlem Huskies WC) Dec 8-7</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Mitchel Stites (Dakota WC) won by decision over Robbie Seredi (Gomez Wrestling Acad.) Dec 9-3</li>\n<li>Semifinal - Jared Smith (Lakeland Predators) won by decision over Thomas Brennan (Orland Park Pioneers) Dec 7-1</li>\n<li>Cons. Round 3 - Matthew Rafe (Brawlers WC) won by decision over Xavier Sallie (Will County Warriors) Dec 16-10</li>\n<li>Cons. Round 3 - Stephen Kemp (Batavia Pinners) won by tech fall over Michael Beaudoin (Sycamore WC) TF 16-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Sean Kelly (Little Celtic WC) won by decision over Isaac Flores (Carbondale WC) Dec 5-0</li>\n<li>Semifinal - Tyler Johnson (Junior Porters WC) won by fall over Ryan Fish (Gladiators) Fall 3:36</li>\n<li>Cons. Round 3 - Christian Brown (Oswego East Team No Ego) won by fall over Chris Yaros (Vittum Cats) Fall 1:30</li>\n<li>Cons. Round 3 - Woo Lee (Arlington Cardinals) won by fall over Mitch Novotny (Downers Grove Cougars) Fall 4:21</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Alex Benoit (Redhawk WC) won by fall over Christopher Malone (Sycamore WC) Fall 0:48</li>\n<li>Semifinal - Aj Friedrich (Metamora Kids WC) won by decision over Colton Wegner (Villa Lombard Cougars) Dec 8-7</li>\n<li>Cons. Round 3 - Tad Cravens (Herrin Junior WC) won by decision over Dayton Coyle (Seneca Irish Cadets) Dec 12-8</li>\n<li>Cons. Round 3 - Joshua Bouie (Indians Elite) won by fall over Nathan King (Little Falcons WC) Fall 1:01</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Keith Mcgee (Junior Spartans WC) won by decision over Alex Gelber (Springfield Capital Kids WC) Dec 10-4</li>\n<li>Semifinal - Kailor Hecox (Hecox Team Benaiah) won by fall over Jordan Ladd (Chilli Dawgs WC) Fall 2:00</li>\n<li>Cons. Round 3 - Tom Schofield (Mustang WC) won by decision over Josh Davis (Rock Island WC) Dec 8-2</li>\n<li>Cons. Round 3 - Ryan Berman (Little Celtic WC) won by decision over Tristan Penrod (Mt. Vernon Lions) Dec 2-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Lucas Warren (Blackhawk WC) won by fall over Ross Sealby (Xtreme Wrestling) Fall 2:23</li>\n<li>Semifinal - Nicholas Czar (Highland Bulldog Jr WC) won by fall over Matthew Iwinski (Force Wrestling) Fall 2:38</li>\n<li>Cons. Round 3 - Frank Pavlik (Rebels WC) won by fall over Nathan Karas (Plainfield WC) Fall 0:50</li>\n<li>Cons. Round 3 - Matthew Bernal (Rebels WC) won by fall over Devin Knight (Sycamore WC) Fall 1:30</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Michael Johnson Jr (St. Charles East WC) won by fall over Tate Buller (Champbuilders WC) Fall 1:47</li>\n<li>Semifinal - Jacob Heavlin (Warrior Monks) won by decision over Nicholas Wolf (Force Wrestling) Dec 7-4</li>\n<li>Cons. Round 3 - Alec Daykin (Riverton Hawks Wrestling) won by fall over Joshua Ruiz (Rams Wrestling Club) Fall 0:31</li>\n<li>Cons. Round 3 - Jake Ford (Vittum Cats) won by fall over Wyatt Witty (Bismarck Henning WC) Fall 0:18</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Louie Hayes (Martinez Fox Valley Elite) won by major decision over John Paul Stedwill (Central Elite Rebels) Maj 13-3</li>\n<li>Semifinal - Jabari Moody (Harvey Park Dist Twisters) won by tech fall over Francis Edelen (Junior Spartans WC) TF 20-4</li>\n<li>Cons. Round 3 - Travis Piotrowski (Wolves WC) won by fall over Tyler Myers (Plainfield WC) Fall 2:31</li>\n<li>Cons. Round 3 - Kirk Johansen (Villa Lombard Cougars) won by major decision over Kyle Szlenk (Crystal Lake Wizards) Maj 13-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Kyle Peisker (Gomez Wrestling Acad.) won by major decision over Shaun Wasso (Little Celtic WC) Maj 13-2</li>\n<li>Semifinal - Christian Robertson (Vittum Cats) won by fall over Colin Glascott (Orland Park Pioneers) Fall 3:53</li>\n<li>Cons. Round 3 - Vinnie Piunti (Martinez Fox Valley Elite) won by decision over Nick Lukanich (Vittum Cats) Dec 7-6</li>\n<li>Cons. Round 3 - Jacob Mitchell (Highland Bulldog Jr WC) won by decision over Alex Rader (Hononegah Kids WC) Dec 9-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Brandon Hanik (Vittum Cats) won by decision over Garrett Dziedzic (Crystal Lake Wizards) Dec 3-2</li>\n<li>Semifinal - Jacob Silzer (Tinley Park Bulldogs) won by decision over Cameron Roat (Little Celtic WC) Dec 2-1</li>\n<li>Cons. Round 3 - Thomas Svestka (Martinez Fox Valley Elite) won by decision over Patrick Augustyn (Gomez Wrestling Acad.) Dec 5-2</li>\n<li>Cons. Round 3 - Christopher Dranka (Crystal Lake Wizards) won by decision over Tanner Coleman (Peoria Heights Minutemen) Dec 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Rudy Yates (Lions WC) won by decision over Matt Rowland (SCN Youth WC) Dec 8-2</li>\n<li>Semifinal - David Kasper (Southside Stallions) won by fall over Roberto Campos (Bolingbrook Junior Raiders) Fall 3:21</li>\n<li>Cons. Round 3 - Jacob Orth (Crystal Lake Wizards) won by decision over Carter Pillen (Geneseo Spider WC) Dec 4-2</li>\n<li>Cons. Round 3 - Dalton Brito (Edwardsville WC) won by major decision over Britches Sikula (Wolves WC) Maj 9-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Jake Drew (Gomez Wrestling Acad.) won by fall over Bobby Alexander (Gomez Wrestling Acad.) Fall 2:49</li>\n<li>Semifinal - Michael Cullen (Wrestling Factory) won by major decision over Logan Lundelius (Crystal Lake Wizards) Maj 14-3</li>\n<li>Cons. Round 3 - Cole Wysocki (Triad Little Knights) won by decision over Keegan Powers (Hononegah Kids WC) Dec 3-2</li>\n<li>Cons. Round 3 - Gunner Wenger (The Law) won by major decision over Andrew Verr (Villa Park Young Warriors) Maj 12-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Nick Gasbarro (Tinley Park Bulldogs) won by decision over Carlos Jacquez (Martinez Fox Valley Elite) Dec 4-3</li>\n<li>Semifinal - Matthew Rundell (Arlington Cardinals) won by major decision over Gabriel Townsell (Gladiators) Maj 10-0</li>\n<li>Cons. Round 3 - Brandon Meyer (Crystal Lake Wizards) won by decision over Cole Witzig (Triad Little Knights) Dec 2-1</li>\n<li>Cons. Round 3 - Kyle Simpkins (Brawlers WC) won by fall over Christian Milliron (Yorkville Wrestling Club) Fall 2:57</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - James Wolfe (Dakota WC) won by decision over Peter Perich (Force Wrestling) Dec 7-0</li>\n<li>Semifinal - Vincent Turk (Crystal Lake Wizards) won by decision over Noah Drabek (Lakeland Predators) Dec 5-0</li>\n<li>Cons. Round 3 - Nathanial Smalling (King Select Wrestling) won by fall over Jared Finley (Shelbyville Jr Rams Wrestling) Fall 1:30</li>\n<li>Cons. Round 3 - Jakada Hull (Harvey Park Dist Twisters) won in overtime over Alexander Mckenna (Trevian WC) OT 8-6</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Carver James (Dakota WC) won by decision over Juwan Edmond (Gladiators) Dec 6-2</li>\n<li>Semifinal - Isaiah White (Harvey Park Dist Twisters) won by major decision over Kameron Vantassel (Hononegah Kids WC) Maj 11-1</li>\n<li>Cons. Round 3 - Dequarius Millett (Granite City WC) won by decision over Nicholas Foster (Belleville Junior Hit Squad) Dec 6-2</li>\n<li>Cons. Round 3 - Trace Carello (Mt. Vernon Lions) won by decision over Kyle Betourne (Brawlers WC) Dec 7-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Chase Vosburgh (Mt. Vernon Lions) won in overtime over Tanner Anthony (Harlem Huskies WC) OT 4-2</li>\n<li>Semifinal - Larry Early (Force Wrestling) won by decision over Keone Derain (Martinez Fox Valley Elite) Dec 8-4</li>\n<li>Cons. Round 3 - Josiah Cropp (Geneseo Spider WC) won by fall over Ryan Willett (Renegade WC (NFP)) Fall 2:51</li>\n<li>Cons. Round 3 - Jim Brennan (Lemont Bears WC) won by fall over Mack Anderson (Springfield Capital Kids WC) Fall 1:27</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Luke Fortuna (Martinez Fox Valley Elite) won by major decision over Lucas Reifsteck (Force Wrestling) Maj 9-1</li>\n<li>Semifinal - Tyler Demoss (Hononegah Kids WC) won by decision over Flynn Nagel (Vittum Cats) Dec 7-4</li>\n<li>Cons. Round 3 - Hasan Muhammad (Renegade WC (NFP)) won by fall over Gabe Pleasants (Morton Youth Wrestling) Fall 1:43</li>\n<li>Cons. Round 3 - Riley Demoss (SCN Youth WC) won by decision over Ramon Lopez (Martinez Fox Valley Elite) Dec 7-3</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Kenny Condon (Vittum Cats) won by fall over Timothy Young (Tomcat WC) Fall 1:25</li>\n<li>Semifinal - Dru Worker (Tinley Park Bulldogs) won by injury default over Xavier Montalvo (Gomez Wrestling Acad.) Inj. 0:00</li>\n<li>Cons. Round 3 - Mitchel Humphrey (Mendota Mat Masters) won by decision over Clayton Mckimmy (Fox Lake WC) Dec 5-0</li>\n<li>Cons. Round 3 - Ryan Pitra (Geneseo Spider WC) won by decision over Jenner Hecox (Hecox Team Benaiah) Dec 7-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Tyre Lee (Renegade WC (NFP)) won by fall over Tommy Calkins (Maine Eagles) Fall 2:18</li>\n<li>Semifinal - Zachary Prinz (Force Wrestling) won by major decision over Jt Jones (Rock Island WC) Maj 12-3</li>\n<li>Cons. Round 3 - Claude Shelby (King Select Wrestling) won by fall over Brandon Klein (Champaign Wrestling Club) Fall 1:22</li>\n<li>Cons. Round 3 - Kenneth Marshall (Vittum Cats) won by decision over Dillon Warnecke (Villa Lombard Cougars) Dec 4-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Jimique Davis (Gomez Wrestling Acad.) won by fall over Collin Cronberg (Little Celtic WC) Fall 2:28</li>\n<li>Semifinal - Jeff Klank (Indians Elite) won by fall over Colton Reed (Mahomet-Seymour Youth WC) Fall 4:17</li>\n<li>Cons. Round 3 - Blake Cripe (Vandalia Jr Vandals) won by decision over Jake Flower (Hononegah Kids WC) Dec 13-6</li>\n<li>Cons. Round 3 - Niko Portokalis (Arlington Cardinals) won by decision over Matthew Striegel (King Select Wrestling) Dec 5-1</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Keenith Edgar (Chicago Crusaders) won by fall over Sylvester Vijil (Hononegah Kids WC) Fall 1:05</li>\n<li>Cons. Semi - Troy Ott (Mad Dog Wrestling Academy) won by fall over Eliceo Villarreal (Peoria Razorbacks Youth WC) Fall 1:16</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Lake Vitkauskas (Oak Forest Warriors) won by fall over Peter Capetillo (SCN Youth WC) Fall 2:30</li>\n<li>Cons. Semi - Jarryd Cabusao (Golden Eagles WC) won by fall over Brandon Andino (Gomez Wrestling Acad.) Fall 2:40</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Matt Allen (Hinsdale WC) won by decision over Kumari Jackson (Springfield Capital Kids WC) Dec 8-4</li>\n<li>Cons. Semi - Matt Brozovich (Indians Elite) won by decision over Al`lon Carter (Gladiators) Dec 3-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Dominic Ferraro (Gomez Wrestling Acad.) won by fall over Thomas Rollete (Hononegah Kids WC) Fall 2:27</li>\n<li>Cons. Semi - Andrew Wise (Aces WC) won by fall over David Newman (Indians Elite) Fall 3:59</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Sam Deisher (Blackhawk WC) won by tech fall over Karim Fuentes (Gladiators) TF 15-0</li>\n<li>Cons. Semi - Keiffer Johnston (Shelbyville Jr Rams Wrestling) won by fall over Joshua Stark (Brawlers WC) Fall 3:46</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Jacob Hiles (Indians Elite) won by decision over Ryan Roper (SCN Youth WC) Dec 10-3</li>\n<li>Cons. Semi - Chase Bittle (Belleville Little Devils) won by decision over Kevin Radcliff (Gomez Wrestling Acad.) Dec 8-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Kolbe O`brien (SCN Youth WC) won by decision over Anthony Zamora (Force Wrestling) Dec 7-0</li>\n<li>Cons. Semi - Michael Mcgee (Force Wrestling) won by major decision over Jake Szlenk (Crystal Lake Wizards) Maj 15-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Pat Walker (Gomez Wrestling Acad.) won by fall over Jack Calderone (Junior Spartans WC) Fall 1:14</li>\n<li>Cons. Semi - Sean Mckenna (Martinez Fox Valley Elite) won by fall over Brady Wilsie (Xtreme Wrestling) Fall 4:27</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Jacob Dudeck (Tinley Park Bulldogs) won by decision over Sean Cullen (Wrestling Factory) Dec 4-1</li>\n<li>Cons. Semi - Devin Michicich (Southside Stallions) won by decision over Peter Ogunsanya (Harvey Park Dist Twisters) Dec 9-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - John Cullen (Wrestling Factory) won by decision over Drake Davis (Illinois Valley Elite WC) Dec 6-0</li>\n<li>Cons. Semi - Yahya Thomas (Harvey Park Dist Twisters) won by decision over Nolan Baker (Xtreme Wrestling) Dec 9-5</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Drake Boverie (Bulls WC) won by major decision over Jake Barzowski (Martinez Fox Valley Elite) Maj 8-0</li>\n<li>Cons. Semi - Juwan Robinson (Bolingbrook Junior Raiders) won by fall over Guy Brown (Edwardsville WC) Fall 3:43</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Christian Fausel (Hononegah Kids WC) won by decision over Emille Shannon (King Select Wrestling) Dec 3-1</li>\n<li>Cons. Semi - Garrett Brachbill (Shelbyville Jr Rams Wrestling) won by decision over Devin Kane (Martinez Fox Valley Elite) Dec 5-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Gregory Krulas (Dakota WC) won by decision over Ameen Hamdan (Triumph `The Art of Wrestling`) Dec 7-0</li>\n<li>Cons. Semi - Shayne Oster (Junior Porters WC) won by decision over Logan Gruszka (Oswego East Team No Ego) Dec 5-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Jake Lanning (Pontiac WC) won by fall over Dino Gutierrez (Rebels WC) Fall 0:37</li>\n<li>Cons. Semi - Andrew Wenger (Dakota WC) won by decision over Alex Gonzalez (Blackhawk WC) Dec 1-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Louie Depasquale (Redhawk WC) won by fall over Maximillian Hill (Lakeland Predators) Fall 1:15</li>\n<li>Cons. Semi - Matthew Wroblewski (Arlington Cardinals) won by decision over Brian Burns (Orland Park Pioneers) Dec 8-1</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Chris Prosser (Edwardsville WC) won by decision over Tyler Tsagalis (Gomez Wrestling Acad.) Dec 3-2</li>\n<li>Cons. Semi - David Riojas (Force Wrestling) won by fall over Tyler Eggemeyer (Panther Powerhouse WC) Fall 2:40</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Robbie Seredi (Gomez Wrestling Acad.) won by fall over Matthew Rafe (Brawlers WC) Fall 1:48</li>\n<li>Cons. Semi - Thomas Brennan (Orland Park Pioneers) won by decision over Stephen Kemp (Batavia Pinners) Dec 5-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Isaac Flores (Carbondale WC) won by major decision over Christian Brown (Oswego East Team No Ego) Maj 9-1</li>\n<li>Cons. Semi - Ryan Fish (Gladiators) won by tech fall over Woo Lee (Arlington Cardinals) TF 19-3</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Christopher Malone (Sycamore WC) won by decision over Tad Cravens (Herrin Junior WC) Dec 13-8</li>\n<li>Cons. Semi - Colton Wegner (Villa Lombard Cougars) won by decision over Joshua Bouie (Indians Elite) Dec 7-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Tom Schofield (Mustang WC) won by decision over Alex Gelber (Springfield Capital Kids WC) Dec 6-2</li>\n<li>Cons. Semi - Jordan Ladd (Chilli Dawgs WC) won by decision over Ryan Berman (Little Celtic WC) Dec 6-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Ross Sealby (Xtreme Wrestling) won by decision over Frank Pavlik (Rebels WC) Dec 3-1</li>\n<li>Cons. Semi - Matthew Iwinski (Force Wrestling) won by fall over Matthew Bernal (Rebels WC) Fall 2:49</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Tate Buller (Champbuilders WC) won by fall over Alec Daykin (Riverton Hawks Wrestling) Fall 1:58</li>\n<li>Cons. Semi - Nicholas Wolf (Force Wrestling) won by fall over Jake Ford (Vittum Cats) Fall 3:41</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Travis Piotrowski (Wolves WC) won by tech fall over John Paul Stedwill (Central Elite Rebels) TF 15-0</li>\n<li>Cons. Semi - Francis Edelen (Junior Spartans WC) won by decision over Kirk Johansen (Villa Lombard Cougars) Dec 11-4</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Shaun Wasso (Little Celtic WC) won by fall over Vinnie Piunti (Martinez Fox Valley Elite) Fall 0:54</li>\n<li>Cons. Semi - Colin Glascott (Orland Park Pioneers) won by decision over Jacob Mitchell (Highland Bulldog Jr WC) Dec 8-7</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Garrett Dziedzic (Crystal Lake Wizards) won by decision over Thomas Svestka (Martinez Fox Valley Elite) Dec 5-3</li>\n<li>Cons. Semi - Cameron Roat (Little Celtic WC) won by decision over Christopher Dranka (Crystal Lake Wizards) Dec 6-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Matt Rowland (SCN Youth WC) won by tech fall over Jacob Orth (Crystal Lake Wizards) TF 17-2</li>\n<li>Cons. Semi - Roberto Campos (Bolingbrook Junior Raiders) won by decision over Dalton Brito (Edwardsville WC) Dec 9-4</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Bobby Alexander (Gomez Wrestling Acad.) won by fall over Cole Wysocki (Triad Little Knights) Fall 3:21</li>\n<li>Cons. Semi - Gunner Wenger (The Law) won by decision over Logan Lundelius (Crystal Lake Wizards) Dec 8-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Carlos Jacquez (Martinez Fox Valley Elite) won by decision over Brandon Meyer (Crystal Lake Wizards) Dec 9-5</li>\n<li>Cons. Semi - Kyle Simpkins (Brawlers WC) won by major decision over Gabriel Townsell (Gladiators) Maj 15-5</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Peter Perich (Force Wrestling) won by decision over Nathanial Smalling (King Select Wrestling) Dec 11-9</li>\n<li>Cons. Semi - Noah Drabek (Lakeland Predators) won by decision over Jakada Hull (Harvey Park Dist Twisters) Dec 10-4</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Juwan Edmond (Gladiators) won by fall over Dequarius Millett (Granite City WC) Fall 1:57</li>\n<li>Cons. Semi - Kameron Vantassel (Hononegah Kids WC) won by decision over Trace Carello (Mt. Vernon Lions) Dec 4-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Tanner Anthony (Harlem Huskies WC) won by decision over Josiah Cropp (Geneseo Spider WC) Dec 8-6</li>\n<li>Cons. Semi - Jim Brennan (Lemont Bears WC) won by decision over Keone Derain (Martinez Fox Valley Elite) Dec 4-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Lucas Reifsteck (Force Wrestling) won by major decision over Hasan Muhammad (Renegade WC (NFP)) Maj 14-6</li>\n<li>Cons. Semi - Flynn Nagel (Vittum Cats) won by fall over Riley Demoss (SCN Youth WC) Fall 4:22</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Mitchel Humphrey (Mendota Mat Masters) won by major decision over Timothy Young (Tomcat WC) Maj 11-3</li>\n<li>Cons. Semi - Xavier Montalvo (Gomez Wrestling Acad.) won in overtime over Ryan Pitra (Geneseo Spider WC) OT 6-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Tommy Calkins (Maine Eagles) won by decision over Claude Shelby (King Select Wrestling) Dec 3-1</li>\n<li>Cons. Semi - Kenneth Marshall (Vittum Cats) won by major decision over Jt Jones (Rock Island WC) Maj 10-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Collin Cronberg (Little Celtic WC) won by major decision over Blake Cripe (Vandalia Jr Vandals) Maj 14-5</li>\n<li>Cons. Semi - Colton Reed (Mahomet-Seymour Youth WC) won by fall over Niko Portokalis (Arlington Cardinals) Fall 1:09</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Keenith Edgar (Chicago Crusaders) won by fall over Troy Ott (Mad Dog Wrestling Academy) Fall 0:35</li>\n<li>5th Place Match - Sylvester Vijil (Hononegah Kids WC) won by decision over Eliceo Villarreal (Peoria Razorbacks Youth WC) Dec 11-4</li>\n<li>7th Place Match - Nick Graziano (Oak Forest Warriors) won by tech fall over Raul Lopez (Moline WC) TF 17-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Lake Vitkauskas (Oak Forest Warriors) won by decision over Jarryd Cabusao (Golden Eagles WC) Dec 9-8</li>\n<li>5th Place Match - Brandon Andino (Gomez Wrestling Acad.) won by decision over Peter Capetillo (SCN Youth WC) Dec 2-1</li>\n<li>7th Place Match - Dylan Schultz (Lincoln-Way WC) won by fall over Matthew Domek (Lancer WC) Fall 0:49</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Matt Allen (Hinsdale WC) won by decision over Matt Brozovich (Indians Elite) Dec 5-3</li>\n<li>5th Place Match - Al`lon Carter (Gladiators) won by decision over Kumari Jackson (Springfield Capital Kids WC) Dec 2-0</li>\n<li>7th Place Match - Nick Potts (Kane County Grapplers) won by decision over Wade Thiele (Saukee Youth WC) Dec 10-7</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Andrew Wise (Aces WC) won by fall over Dominic Ferraro (Gomez Wrestling Acad.) Fall 2:34</li>\n<li>5th Place Match - David Newman (Indians Elite) won by fall over Thomas Rollete (Hononegah Kids WC) Fall 0:58</li>\n<li>7th Place Match - David Charnot (Vittum Cats) won by fall over Remington Smith (Limestone Youth WC) Fall 2:14</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Keiffer Johnston (Shelbyville Jr Rams Wrestling) won by decision over Sam Deisher (Blackhawk WC) Dec 2-0</li>\n<li>5th Place Match - Joshua Stark (Brawlers WC) won by fall over Karim Fuentes (Gladiators) Fall 0:58</li>\n<li>7th Place Match - Ryan Ramirez (Little Falcons WC) won by fall over Brandon Reyes (Calumet MPD Wolverines) Fall 0:59</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Chase Bittle (Belleville Little Devils) won in overtime over Jacob Hiles (Indians Elite) OT 9-7</li>\n<li>5th Place Match - Kevin Radcliff (Gomez Wrestling Acad.) won by decision over Ryan Roper (SCN Youth WC) Dec 5-1</li>\n<li>7th Place Match - Aaron Zebrauskas (Southside Stallions) won by decision over Austin Rudsinski (Lincoln-Way WC) Dec 4-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Michael Mcgee (Force Wrestling) won by decision over Kolbe O`brien (SCN Youth WC) Dec 13-6</li>\n<li>5th Place Match - Jake Szlenk (Crystal Lake Wizards) won by decision over Anthony Zamora (Force Wrestling) Dec 6-2</li>\n<li>7th Place Match - Jacob Gross (Lakeland Predators) won by decision over Joey Melendez (Rambler / Next Level WC) Dec 2-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Pat Walker (Gomez Wrestling Acad.) won by decision over Sean Mckenna (Martinez Fox Valley Elite) Dec 4-3</li>\n<li>5th Place Match - Brady Wilsie (Xtreme Wrestling) won by decision over Jack Calderone (Junior Spartans WC) Dec 2-1</li>\n<li>7th Place Match - Tyler Moon (King Select Wrestling) won by decision over Nicholas Norris (Chilli Dawgs WC) Dec 8-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Devin Michicich (Southside Stallions) won by decision over Jacob Dudeck (Tinley Park Bulldogs) Dec 7-2</li>\n<li>5th Place Match - Peter Ogunsanya (Harvey Park Dist Twisters) won by decision over Sean Cullen (Wrestling Factory) Dec 5-1</li>\n<li>7th Place Match - Dack Punke (Central Elite Rebels) won by decision over Shajrianna Turner (Lionheart Intense Wrestling) Dec 1-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Yahya Thomas (Harvey Park Dist Twisters) won by decision over John Cullen (Wrestling Factory) Dec 7-1</li>\n<li>5th Place Match - Nolan Baker (Xtreme Wrestling) won by fall over Drake Davis (Illinois Valley Elite WC) Fall 4:18</li>\n<li>7th Place Match - Zachary Lorek (Brawlers WC) won in overtime over Raekwon Williams (Crosstown WC) OT 4-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Drake Boverie (Bulls WC) won by decision over Juwan Robinson (Bolingbrook Junior Raiders) Dec 3-0</li>\n<li>5th Place Match - Guy Brown (Edwardsville WC) won in overtime over Jake Barzowski (Martinez Fox Valley Elite) OT 4-3</li>\n<li>7th Place Match - Blaize Punke (Central Elite Rebels) won by decision over Kenneth Barber (Wrestling Factory) Dec 5-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Christian Fausel (Hononegah Kids WC) won in overtime over Garrett Brachbill (Shelbyville Jr Rams Wrestling) OT 6-5</li>\n<li>5th Place Match - Emille Shannon (King Select Wrestling) won by fall over Devin Kane (Martinez Fox Valley Elite) Fall 1:48</li>\n<li>7th Place Match - Joshua Barzowski (Martinez Fox Valley Elite) won by decision over Chris Betancourt (Harvey Park Dist Twisters) Dec 6-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Gregory Krulas (Dakota WC) won by tech fall over Shayne Oster (Junior Porters WC) TF 17-2</li>\n<li>5th Place Match - Logan Gruszka (Oswego East Team No Ego) won by injury default over Ameen Hamdan (Triumph `The Art of Wrestling`) Inj. 0:00</li>\n<li>7th Place Match - Kevin Pate (Harvey Park Dist Twisters) won by fall over Jesse Ditzler (Sauk Valley WC) Fall 0:29</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Jake Lanning (Pontiac WC) won by major decision over Andrew Wenger (Dakota WC) Maj 10-2</li>\n<li>5th Place Match - Alex Gonzalez (Blackhawk WC) won by decision over Dino Gutierrez (Rebels WC) Dec 4-3</li>\n<li>7th Place Match - Jordan Soto (Batavia Pinners) won by fall over Elliot Koster (Geneseo Spider WC) Fall 0:58</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Matthew Wroblewski (Arlington Cardinals) won by decision over Louie Depasquale (Redhawk WC) Dec 6-0</li>\n<li>5th Place Match - Maximillian Hill (Lakeland Predators) won by major decision over Brian Burns (Orland Park Pioneers) Maj 14-0</li>\n<li>7th Place Match - Colten Cashmore (Richmond WC) won by decision over Jacob Warner (Champaign Wrestling Club) Dec 2-1</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - David Riojas (Force Wrestling) won by decision over Chris Prosser (Edwardsville WC) Dec 3-2</li>\n<li>5th Place Match - Tyler Tsagalis (Gomez Wrestling Acad.) won by major decision over Tyler Eggemeyer (Panther Powerhouse WC) Maj 12-0</li>\n<li>7th Place Match - Brandon Elliott (Harlem Huskies WC) won in double overtime over Griffin Meeker (SJO Spartan Youth WC) 2-OT 2-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Robbie Seredi (Gomez Wrestling Acad.) won by major decision over Thomas Brennan (Orland Park Pioneers) Maj 13-3</li>\n<li>5th Place Match - Stephen Kemp (Batavia Pinners) won by decision over Matthew Rafe (Brawlers WC) Dec 7-1</li>\n<li>7th Place Match - Xavier Sallie (Will County Warriors) won by fall over Michael Beaudoin (Sycamore WC) Fall 3:31</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Ryan Fish (Gladiators) won by decision over Isaac Flores (Carbondale WC) Dec 7-0</li>\n<li>5th Place Match - Woo Lee (Arlington Cardinals) won by fall over Christian Brown (Oswego East Team No Ego) Fall 2:33</li>\n<li>7th Place Match - Mitch Novotny (Downers Grove Cougars) won by decision over Chris Yaros (Vittum Cats) Dec 6-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Christopher Malone (Sycamore WC) won in double overtime over Colton Wegner (Villa Lombard Cougars) 2-OT 6-3</li>\n<li>5th Place Match - Joshua Bouie (Indians Elite) won by fall over Tad Cravens (Herrin Junior WC) Fall 1:30</li>\n<li>7th Place Match - Dayton Coyle (Seneca Irish Cadets) won by decision over Nathan King (Little Falcons WC) Dec 6-4</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Jordan Ladd (Chilli Dawgs WC) won by fall over Tom Schofield (Mustang WC) Fall 1:55</li>\n<li>5th Place Match - Ryan Berman (Little Celtic WC) won by decision over Alex Gelber (Springfield Capital Kids WC) Dec 3-0</li>\n<li>7th Place Match - Tristan Penrod (Mt. Vernon Lions) won by major decision over Josh Davis (Rock Island WC) Maj 12-2</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Matthew Iwinski (Force Wrestling) won by fall over Ross Sealby (Xtreme Wrestling) Fall 2:23</li>\n<li>5th Place Match - Frank Pavlik (Rebels WC) won by decision over Matthew Bernal (Rebels WC) Dec 5-3</li>\n<li>7th Place Match - Devin Knight (Sycamore WC) won by decision over Nathan Karas (Plainfield WC) Dec 6-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Nicholas Wolf (Force Wrestling) won by fall over Tate Buller (Champbuilders WC) Fall 1:17</li>\n<li>5th Place Match - Jake Ford (Vittum Cats) won by fall over Alec Daykin (Riverton Hawks Wrestling) Fall 2:53</li>\n<li>7th Place Match - Wyatt Witty (Bismarck Henning WC) won by fall over Joshua Ruiz (Rams Wrestling Club) Fall 1:01</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Francis Edelen (Junior Spartans WC) won by decision over Travis Piotrowski (Wolves WC) Dec 1-0</li>\n<li>5th Place Match - Kirk Johansen (Villa Lombard Cougars) won by fall over John Paul Stedwill (Central Elite Rebels) Fall 4:23</li>\n<li>7th Place Match - Kyle Szlenk (Crystal Lake Wizards) won by fall over Tyler Myers (Plainfield WC) Fall 4:05</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Colin Glascott (Orland Park Pioneers) won by major decision over Shaun Wasso (Little Celtic WC) Maj 10-1</li>\n<li>5th Place Match - Vinnie Piunti (Martinez Fox Valley Elite) won by decision over Jacob Mitchell (Highland Bulldog Jr WC) Dec 5-4</li>\n<li>7th Place Match - Nick Lukanich (Vittum Cats) won by decision over Alex Rader (Hononegah Kids WC) Dec 4-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Garrett Dziedzic (Crystal Lake Wizards) won by fall over Cameron Roat (Little Celtic WC) Fall 3:21</li>\n<li>5th Place Match - Thomas Svestka (Martinez Fox Valley Elite) won by tech fall over Christopher Dranka (Crystal Lake Wizards) TF 17-2</li>\n<li>7th Place Match - Tanner Coleman (Peoria Heights Minutemen) won in overtime over Patrick Augustyn (Gomez Wrestling Acad.) OT 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Matt Rowland (SCN Youth WC) won in double overtime over Roberto Campos (Bolingbrook Junior Raiders) 2-OT 3-2</li>\n<li>5th Place Match - Jacob Orth (Crystal Lake Wizards) won by decision over Dalton Brito (Edwardsville WC) Dec 5-3</li>\n<li>7th Place Match - Britches Sikula (Wolves WC) won by decision over Carter Pillen (Geneseo Spider WC) Dec 4-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Bobby Alexander (Gomez Wrestling Acad.) won by decision over Gunner Wenger (The Law) Dec 9-3</li>\n<li>5th Place Match - Cole Wysocki (Triad Little Knights) won by decision over Logan Lundelius (Crystal Lake Wizards) Dec 7-3</li>\n<li>7th Place Match - Keegan Powers (Hononegah Kids WC) won by major decision over Andrew Verr (Villa Park Young Warriors) Maj 14-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Kyle Simpkins (Brawlers WC) won by decision over Carlos Jacquez (Martinez Fox Valley Elite) Dec 3-2</li>\n<li>5th Place Match - Gabriel Townsell (Gladiators) won in overtime over Brandon Meyer (Crystal Lake Wizards) OT 3-1</li>\n<li>7th Place Match - Cole Witzig (Triad Little Knights) won by major decision over Christian Milliron (Yorkville Wrestling Club) Maj 8-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Peter Perich (Force Wrestling) won by decision over Noah Drabek (Lakeland Predators) Dec 2-1</li>\n<li>5th Place Match - Jakada Hull (Harvey Park Dist Twisters) won in overtime over Nathanial Smalling (King Select Wrestling) OT 16-14</li>\n<li>7th Place Match - Alexander Mckenna (Trevian WC) won by decision over Jared Finley (Shelbyville Jr Rams Wrestling) Dec 8-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Juwan Edmond (Gladiators) won by fall over Kameron Vantassel (Hononegah Kids WC) Fall 1:01</li>\n<li>5th Place Match - Trace Carello (Mt. Vernon Lions) won by tech fall over Dequarius Millett (Granite City WC) TF 19-0</li>\n<li>7th Place Match - Kyle Betourne (Brawlers WC) won in overtime over Nicholas Foster (Belleville Junior Hit Squad) OT 8-6</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Jim Brennan (Lemont Bears WC) won by decision over Tanner Anthony (Harlem Huskies WC) Dec 6-4</li>\n<li>5th Place Match - Keone Derain (Martinez Fox Valley Elite) won by decision over Josiah Cropp (Geneseo Spider WC) Dec 8-4</li>\n<li>7th Place Match - Mack Anderson (Springfield Capital Kids WC) won by fall over Ryan Willett (Renegade WC (NFP)) Fall 2:35</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Flynn Nagel (Vittum Cats) won by fall over Lucas Reifsteck (Force Wrestling) Fall 2:23</li>\n<li>5th Place Match - Riley Demoss (SCN Youth WC) won by major decision over Hasan Muhammad (Renegade WC (NFP)) Maj 8-0</li>\n<li>7th Place Match - Ramon Lopez (Martinez Fox Valley Elite) won by fall over Gabe Pleasants (Morton Youth Wrestling) Fall 3:30</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Mitchel Humphrey (Mendota Mat Masters) won by injury default over Xavier Montalvo (Gomez Wrestling Acad.) Inj. 0:00</li>\n<li>5th Place Match - Ryan Pitra (Geneseo Spider WC) won by decision over Timothy Young (Tomcat WC) Dec 6-2</li>\n<li>7th Place Match - Jenner Hecox (Hecox Team Benaiah) won by decision over Clayton Mckimmy (Fox Lake WC) Dec 7-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Kenneth Marshall (Vittum Cats) won by decision over Tommy Calkins (Maine Eagles) Dec 3-1</li>\n<li>5th Place Match - Jt Jones (Rock Island WC) won by decision over Claude Shelby (King Select Wrestling) Dec 11-6</li>\n<li>7th Place Match - Dillon Warnecke (Villa Lombard Cougars) won by decision over Brandon Klein (Champaign Wrestling Club) Dec 4-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Colton Reed (Mahomet-Seymour Youth WC) won by decision over Collin Cronberg (Little Celtic WC) Dec 8-4</li>\n<li>5th Place Match - Blake Cripe (Vandalia Jr Vandals) won in overtime over Niko Portokalis (Arlington Cardinals) OT 7-5</li>\n<li>7th Place Match - Matthew Striegel (King Select Wrestling) won by decision over Jake Flower (Hononegah Kids WC) Dec 6-0</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - George Bessette (Lakeland Predators) won by decision over James Watters (Edwardsville WC) Dec 5-3</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Brady Rude (Sauk Valley WC) won by fall over Romeo Mcknight (Crystal Lake Wizards) Fall 0:35</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Allen Stallings (Gladiators) won by major decision over Kenneth Abitua (Xtreme Wrestling) Maj 9-1</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Joshua King (Powerhouse WC) won by fall over De`undre Garner (Gladiators) Fall 2:57</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Bryan Ditchman (Tinley Park Bulldogs) won by fall over Octavius Mccloud (Carbondale WC) Fall 1:51</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Marcus Povlick (Force Wrestling) won by tech fall over Ethan Harsted (Seneca Irish Cadets) TF 16-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Anthony Madrigal (Martinez Fox Valley Elite) won by decision over Dylan Burnoski (Bolingbrook Junior Raiders) Dec 6-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Jason Renteria (Martinez Fox Valley Elite) won by decision over Anthony Cheloni (SCN Youth WC) Dec 4-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Gavin Sutton (Gomez Wrestling Acad.) won in overtime over Dylan Duncan (SCN Youth WC) OT 5-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Austin Gomez (Gomez Wrestling Acad.) won by fall over Merik Fulton (Triad Little Knights) Fall 2:53</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Austin O`connor (Tinley Park Bulldogs) won by major decision over Mitchell Stathakis (Barrington Broncos) Maj 9-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Aj Jaffe (SCN Youth WC) won in overtime over Kordell Norfleet (Harvey Park Dist Twisters) OT 4-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Johnathon Doyle (Gomez Wrestling Acad.) won by decision over Trent Rakers (Highland Bulldog Jr WC) Dec 7-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Jack Jessen (Villa Park Young Warriors) won by major decision over Johnny Mologousis (Lions WC) Maj 9-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Randy Meneweather (Knox County Krushers) won by fall over Alex Rodriguez (Fox Lake WC) Fall 1:49</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Kamal Bey (Harvey Park Dist Twisters) won by decision over Michael Peters (Champions WC) Dec 8-7</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Jared Smith (Lakeland Predators) won by fall over Mitchel Stites (Dakota WC) Fall 2:26</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Tyler Johnson (Junior Porters WC) won by fall over Sean Kelly (Little Celtic WC) Fall 0:59</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Alex Benoit (Redhawk WC) won by fall over Aj Friedrich (Metamora Kids WC) Fall 1:52</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Kailor Hecox (Hecox Team Benaiah) won by decision over Keith Mcgee (Junior Spartans WC) Dec 3-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Lucas Warren (Blackhawk WC) won by fall over Nicholas Czar (Highland Bulldog Jr WC) Fall 4:16</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Michael Johnson Jr (St. Charles East WC) won by fall over Jacob Heavlin (Warrior Monks) Fall 3:57</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Jabari Moody (Harvey Park Dist Twisters) won by fall over Louie Hayes (Martinez Fox Valley Elite) Fall 2:01</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Christian Robertson (Vittum Cats) won by decision over Kyle Peisker (Gomez Wrestling Acad.) Dec 8-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Jacob Silzer (Tinley Park Bulldogs) won in overtime over Brandon Hanik (Vittum Cats) OT 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Rudy Yates (Lions WC) won by decision over David Kasper (Southside Stallions) Dec 9-4</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Michael Cullen (Wrestling Factory) won by decision over Jake Drew (Gomez Wrestling Acad.) Dec 4-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Matthew Rundell (Arlington Cardinals) won by decision over Nick Gasbarro (Tinley Park Bulldogs) Dec 5-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Vincent Turk (Crystal Lake Wizards) won by decision over James Wolfe (Dakota WC) Dec 2-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Isaiah White (Harvey Park Dist Twisters) won by decision over Carver James (Dakota WC) Dec 8-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Chase Vosburgh (Mt. Vernon Lions) won by decision over Larry Early (Force Wrestling) Dec 4-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Luke Fortuna (Martinez Fox Valley Elite) won by decision over Tyler Demoss (Hononegah Kids WC) Dec 3-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Dru Worker (Tinley Park Bulldogs) won by decision over Kenny Condon (Vittum Cats) Dec 3-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Zachary Prinz (Force Wrestling) won by fall over Tyre Lee (Renegade WC (NFP)) Fall 0:53</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Jimique Davis (Gomez Wrestling Acad.) won in overtime over Jeff Klank (Indians Elite) OT 7-2</li>\n</ul>\n</section>"
}
