{
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>Champ. Round 1 - Brooklyn Sharwarko (Lil` Coalers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Elena Amendola (Fox Valley WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Maleya Campbell (Wilmington WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Rosie Pace (N.Y.A Jr. Rebels WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>Champ. Round 1 - Piper Koning (Cardinals WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Avery Duckett (Shelbyville Jr. Wrestling Rams) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Erin Brophy (Lions WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Emery Westerberg (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Bethany Schroer (East Peoria River Bandits Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>Champ. Round 1 - Grace Sinks (TJ Trained Wrestling) won by fall over Kayelyn Lee (SJO Youth WC) Fall 0:50</li>\n<li>Champ. Round 1 - Rose Bucaro (Mat Rat WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Anya Rossi (Arlington Cardinals WC) won by major decision over Dalilah Fair (Mt. Zion Kids WC) Maj 14-6</li>\n<li>Champ. Round 1 - Cambrie Gianokis (Mat Rat WC) won by decision over Jesse Skelton (Eureka WC) Dec 5-4</li>\n<li>Champ. Round 1 - Noviana Celestino (Sauk Valley WC) won by fall over Madelyn Lavery (Tinley Park Bulldogs WC) Fall 2:15</li>\n<li>Champ. Round 1 - Khloe McCaslin (Sandwich WC) won by fall over Gemma Benning (Belvidere Bandits WC) Fall 1:32</li>\n<li>Champ. Round 1 - Ryan Donnelly (Tinley Park Bulldogs WC) won by fall over Jackie Glenzinski (Doom Wrestling) Fall 1:37</li>\n<li>Champ. Round 1 - Khloe Dominguez (DeKalb WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>Champ. Round 1 - Kaylynn Goetz (Mt. Zion Kids WC) won by fall over Autumn Dixon (Camp Point Youth Wrestling) Fall 1:17</li>\n<li>Champ. Round 1 - Adalyn Albavera (Stallions Wrestling Academy) won by fall over Allie Sheets (Monticello Youth WC) Fall 0:44</li>\n<li>Champ. Round 1 - Genevieve Del Muro (nWo WC) won by decision over Lucy Carson (Antioch Predators WC) Dec 14-9</li>\n<li>Champ. Round 1 - Eiselee Hrascinski (Tinley Park Bulldogs WC) won by fall over Amelia Buckley (SJO Youth WC) Fall 0:38</li>\n<li>Champ. Round 1 - Norah Doyle (Vandalia Jr WC) won by major decision over Awbree Corson (Stillman Valley WC) Maj 14-0</li>\n<li>Champ. Round 1 - Chelsea Price (Demolition WC) won by decision over Julia Solberg (Batavia WC) Dec 5-0</li>\n<li>Champ. Round 1 - Alyce Stone (Glenbard East Jr Rams WC) won by fall over Sofia Norwood (Team Mascoutah WC) Fall 0:44</li>\n<li>Champ. Round 1 - Beaux McCartney (Alber Athletics WC) won by fall over Kamilla Ulaszek (Orland Park Pioneers WC) Fall 0:41</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>Champ. Round 1 - Elise LeCuyer (Sandwich WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Piper Angel (Clinton WC) won by decision over Liberty House (Rockford WC) Dec 6-2</li>\n<li>Champ. Round 1 - Abigail Jahnel (Unity Youth WC) won by fall over Hilal Nafisa Saleem (Caravan Kids WC) Fall 1:34</li>\n<li>Champ. Round 1 - Hadley Slabaugh (Harlem Huskies WC) won by decision over Paisley Raikes (Ottawa Wolfpack WC) Dec 6-4</li>\n<li>Champ. Round 1 - Esmeralda Gaytan (Evanston School of Wrestling) won by decision over Phoebe Koning (Cardinals WC) Dec 9-6</li>\n<li>Champ. Round 1 - Raenyn Miller (Sparta Junior Bulldogs WC) won by fall over Charlotte Leopold (Belvidere Bandits WC) Fall 0:37</li>\n<li>Champ. Round 1 - Savannah Paynes (Bulldog Elite WC) won by fall over Isabella Martinez (Tribe WC) Fall 0:19</li>\n<li>Champ. Round 1 - Makenna Austra (Bulls WC) won by decision over Evelyn Charlton (Lockport Junior Porters WC) Dec 6-1</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>Champ. Round 1 - Kinzleigh Kopka (DeKalb WC) won by fall over Lucy Cox (Tinley Park Bulldogs WC) Fall 1:33</li>\n<li>Champ. Round 1 - Colette Gaitros (Mt. Zion Kids WC) won by fall over Brielle Gumm (East Peoria River Bandits Wrestling) Fall 1:40</li>\n<li>Champ. Round 1 - Zora Goebel (The Law WC) won by decision over Alaina Linton (Oakwood Youth WC) Dec 9-2</li>\n<li>Champ. Round 1 - Isabella Schoenemann (Orland Park Pioneers WC) won by decision over Lainey Brugger (Harvard WC) Dec 4-1</li>\n<li>Champ. Round 1 - Kaylee Carney (Macomb Little Bombers Wrestling) won by decision over Natalie Strange (Lawrence County Knights WC) Dec 6-5</li>\n<li>Champ. Round 1 - Melanie Mendez (Crosstown Spartan Elite WC) won by fall over Hiro Martinez (Evanston School of Wrestling) Fall 0:37</li>\n<li>Champ. Round 1 - Brooklyn McGreehin (Peotone Little Devils WC) won by decision over Jaeda Lewis (Peoria Razorbacks WC) Dec 2-0</li>\n<li>Champ. Round 1 - Victoria Kasky (Gladiator Elite WC) won by fall over Saphira Kamplain (Crawford County WC) Fall 0:54</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>Champ. Round 1 - Chloe Finnegan (Belvidere Bandits WC) won by decision over Emily Lewis (Yorkville WC) Dec 4-3</li>\n<li>Champ. Round 1 - Madison Gregoria (Woodstock Cyclones WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Baylee Grimes (Reed Custer Jr. Panthers WC) won by fall over Micaela Lopez (Clipper WC) Fall 0:56</li>\n<li>Champ. Round 1 - Jocelyn Zicatl (Bulldog Elite WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Camila Rodriguez (Beat the Streets Chicago-Midway) won by decision over Olivia Werner (Lion`s Den Wrestling Academy) Dec 4-0</li>\n<li>Champ. Round 1 - Samari Hernandez (Bulldog Elite WC) won by major decision over Mercy Lower (Tiger Town Tanglers WC) Maj 11-2</li>\n<li>Champ. Round 1 - Hollyn Boggess (Panther Powerhouse Wrestling) won by fall over Kaitlyn Lewis (Yorkville WC) Fall 0:32</li>\n<li>Champ. Round 1 - Raiza LeCompte (Tinley Park Bulldogs WC) won by decision over Jenna Alsbury (Wilmington WC) Dec 7-6</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>Champ. Round 1 - Charlotte Mathias (Warrensburg-Latham Jr. Cardinals WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Charlize Cartwright (Junior Patriots WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Kimberlyn McGrown (Danville Chargers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Zoey Rousseau (Beat the Streets Chicago-Midway) won by fall over Kinley Hendricks (El Paso Gridley Youth WC) Fall 1:38</li>\n<li>Champ. Round 1 - Genevieve Jones (Granite City Wrestling Association) received a bye   () Bye</li>\n<li>Champ. Round 1 - Lanna Learch (Belvidere Bandits WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Genesis Green (Vandalia Jr WC) won by decision over Erin Wells (Taylorville WC) Dec 4-0</li>\n<li>Champ. Round 1 - Mckinley Allen (Riot Room Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>Champ. Round 1 - Kayden Chapman (Mattoon Youth WC) won by major decision over Jayce Moon (Demolition WC) Maj 11-1</li>\n<li>Champ. Round 1 - Declan Roach (Panther WC) won by fall over Chase Ebert (Morris WC) Fall 0:58</li>\n<li>Champ. Round 1 - Charles McGlennon (Lemont Bears WC) won by fall over Daniel Garcia (Callan Wrestling Academy) Fall 0:46</li>\n<li>Champ. Round 1 - Calvin Grant (Urbana Tigers WC) won by fall over Maddux Bartels (Morris WC) Fall 1:39</li>\n<li>Champ. Round 1 - Tristan Atkins (Lawrence County Knights WC) won by fall over Gerald Spangler (Collinsville WC) Fall 2:00</li>\n<li>Champ. Round 1 - Sam Smith (Stockton Renegades WC) won by decision over David Kalmanovsky (Built By Brunson Wrestling) Dec 9-5</li>\n<li>Champ. Round 1 - Asher Sefton (Vandalia Jr WC) won by fall over Elijah Newbold (Marengo Youth WC) Fall 1:22</li>\n<li>Champ. Round 1 - Joseph Salzman (Lincoln-Way WC) won by decision over Alexi Stellatos (Junior Titans Wrestling) Dec 5-0</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>Champ. Round 1 - Axel Graves (SJO Youth WC) won by fall over Brayden Smith (Frankfort Gladiator Wrestling) Fall 2:18</li>\n<li>Champ. Round 1 - Noah Reyes (Beat the Streets Chicago-Avondale) won by decision over Jaxtyn LeConte (Rockford WC) Dec 9-7</li>\n<li>Champ. Round 1 - Chase Amorn (RTC Wrestling) won by fall over Kolton Orrick (Iguana WC) Fall 0:50</li>\n<li>Champ. Round 1 - Darian Keller (Crystal Lake Wizards WC) won by major decision over Omar Salah (Frankfort Wildcats Wrestling) Maj 8-0</li>\n<li>Champ. Round 1 - Graham Terry (River Bend WC) won by fall over Kyle Nickson (Caravan Kids WC) Fall 0:51</li>\n<li>Champ. Round 1 - Cooper Stumbaugh (Scorpion WC) won by decision over Jamerson Bloodworth (Gladiator Elite WC) Dec 8-3</li>\n<li>Champ. Round 1 - Ethan Heckler (Morris WC) won by decision over Levi Mata (Cory Clark Wrestling) Dec 6-3</li>\n<li>Champ. Round 1 - Trevor Kasky (Gladiator Elite WC) won by major decision over Daniel Johnson (Tinley Park Bulldogs WC) Maj 14-5</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>Champ. Round 1 - Boston Blakely (Alber Athletics WC) won by fall over Rhett White (Roxana WC) Fall 0:36</li>\n<li>Champ. Round 1 - Karter Neal (Storm Youth WC) won by major decision over Aaron Jones (Springs Elite WC) Maj 14-0</li>\n<li>Champ. Round 1 - Elijah Fay (Bulls WC) won by fall over Asher Thompson (SJO Youth WC) Fall 1:25</li>\n<li>Champ. Round 1 - Tre`Lyn Morrow (Crystal Lake Wizards WC) won by decision over Jack Kappas (Lemont Bears WC) Dec 5-2</li>\n<li>Champ. Round 1 - Shane McGinnis (Frankfort Wildcats Wrestling) won by decision over Krew Raines (Sandwich WC) Dec 10-6</li>\n<li>Champ. Round 1 - Jack Newsom (Cory Clark Wrestling) won by fall over Anthony Losurdo (Wolfpak WC) Fall 1:58</li>\n<li>Champ. Round 1 - Tyler Winterhalter (Arlington Cardinals WC) won by decision over Mason Manning (Lincoln-Way WC) Dec 3-0</li>\n<li>Champ. Round 1 - Abrahm Leingang (Sherrard Jr. Tigers WC) won by decision over Darian Martinez-Williams (Greg Gomez Trained Wrestling) Dec 8-5</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>Champ. Round 1 - Nico Poeta (Champaign WC) won in sudden victory - 1 over Rowan Harsted (Ottawa Wolfpack WC) SV-1 6-4</li>\n<li>Champ. Round 1 - Kevin Ippolito (Crawford County WC) won by major decision over Javier Aguilera (St. Charles WC) Maj 16-5</li>\n<li>Champ. Round 1 - Layton Kraemer (Nomad Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Gabriel Torres (nWo WC) won by major decision over Oliver Garcia (St. Charles WC) Maj 9-0</li>\n<li>Champ. Round 1 - Jacob McMurray (Lions WC) won in tie breaker - 1 over Jeremiah Hosman (Little Celtic WC) TB-1 1-0</li>\n<li>Champ. Round 1 - Evan Ross (Stillman Valley WC) won by decision over Joey Raimondi (Headlock Wrestling Academy) Dec 2-0</li>\n<li>Champ. Round 1 - Jt Tsokolas (Mustang WC) won by decision over Nolan Rodriguez (Riot Room Wrestling) Dec 6-4</li>\n<li>Champ. Round 1 - Ryan Campos (Fox Lake WC) won by decision over Bennett Giffin (Reed Custer Jr. Panthers WC) Dec 9-5</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>Champ. Round 1 - Makar Pavlys (Suplex WC) won by decision over Jack Lamb (SCN Youth WC) Dec 5-0</li>\n<li>Champ. Round 1 - Aaron Munks (Pontiac WC) won by decision over Brody Connolly (Crystal Lake Wizards WC) Dec 3-1</li>\n<li>Champ. Round 1 - David Bugrimov (Suplex WC) won by decision over Jagger Burrell (Olympia WC) Dec 6-0</li>\n<li>Champ. Round 1 - Wells Millard (Rochelle Wrestling Club) won by decision over Lucas Kavanagh (Wheaton WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jack Wood (Granite City Wrestling Association) won by fall over Declan O`Malley (Dinamo Wrestling) Fall 0:30</li>\n<li>Champ. Round 1 - Abram Schrand (Champions WC) won in sudden victory - 1 over Kingston Smith (Thunder WC) SV-1 8-6</li>\n<li>Champ. Round 1 - Elijah Foss (Gladiator Elite WC) won by decision over Abel Bochmann (Assumption Elite WC) Dec 4-1</li>\n<li>Champ. Round 1 - Frankie Rivas (Lions WC) won by decision over Trecyn Holba (Frankfort Gladiator Wrestling) Dec 7-0</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>Champ. Round 1 - Timothy Block (Mattoon Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Camden Fitzgerald (Little Celtic WC) won by fall over Chase Nickson (Caravan Kids WC) Fall 1:44</li>\n<li>Champ. Round 1 - Dennis LaMonte (Tinley Park Bulldogs WC) won by fall over Harte Burrell (Olympia WC) Fall 1:33</li>\n<li>Champ. Round 1 - Brody Cohen (Built By Brunson Wrestling) won by fall over Alex Todd (Mat Rat WC) Fall 0:34</li>\n<li>Champ. Round 1 - Cooper Whaley (Rockford WC) won by decision over Hunter Horne (Fox Valley WC) Dec 6-2</li>\n<li>Champ. Round 1 - Easton Shinn (Southern Illinois Bulldogs WC) won by decision over Azerial Ramirez (Sauk Valley WC) Dec 4-2</li>\n<li>Champ. Round 1 - Vincent Jimenez (Crystal Lake Wizards WC) won by fall over Jerome Rogers Iii (O`Fallon Little Panthers WC) Fall 1:41</li>\n<li>Champ. Round 1 - Porfivio Celestino (Sauk Valley WC) won by fall over Nicholas Smelko (Oswego WC) Fall 0:43</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>Champ. Round 1 - Jordan Benefiel (nWo WC) won by decision over Cooper Alger-Scott (Taylorville WC) Dec 4-0</li>\n<li>Champ. Round 1 - Shane McNulty (Demolition WC) won by fall over Zachary Haas (Naperville WC) Fall 0:56</li>\n<li>Champ. Round 1 - Lodi Morgan (Wilmington WC) won by fall over Landon Punke (Morris WC) Fall 0:39</li>\n<li>Champ. Round 1 - Pryce Hendriksen (SCN Youth WC) won by major decision over Calvin Kreke (Decatur Dawgs WC) Maj 14-0</li>\n<li>Champ. Round 1 - Antonio Medina (Arlington Cardinals WC) won by decision over Jackson Schaefer (Southside Outlaws WC) Dec 7-6</li>\n<li>Champ. Round 1 - Benson Grugel (Stillman Valley WC) won by decision over Dallas Shelton (Panther Powerhouse Wrestling) Dec 9-2</li>\n<li>Champ. Round 1 - Killien Schwarz (Riot Room Wrestling) won by fall over Jordan Caudill (Izzy Style Wrestling) Fall 2:52</li>\n<li>Champ. Round 1 - James Newell (Springs Elite WC) won by decision over Drake Baker (Lawrence County Knights WC) Dec 3-2</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>Champ. Round 1 - Dawson Dyer (Mattoon Youth WC) won by decision over Quinton Odonnell (Morris WC) Dec 10-5</li>\n<li>Champ. Round 1 - Immanuel Hampton (Team Mascoutah WC) won by decision over Caladin Drake (The Law WC) Dec 9-4</li>\n<li>Champ. Round 1 - Jackson Deering (Rockets WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Logan Shreve (PSF Wrestling Academy) won by fall over Emmett Berlin (Tiger Town Tanglers WC) Fall 2:32</li>\n<li>Champ. Round 1 - Logan Linton (Force Elite WC) won by tech fall over Donny Grieco (SCN Youth WC) TF 18-3</li>\n<li>Champ. Round 1 - Anthony Schaffer (Izzy Style Wrestling) won by decision over William Moore (Mustang WC) Dec 6-4</li>\n<li>Champ. Round 1 - Mason Potts (Fox Lake WC) won by fall over Thomas Mesch (SCN Youth WC) Fall 2:44</li>\n<li>Champ. Round 1 - Danny Strode (Demolition WC) won by fall over Camden Willis (Vittum Cats WC) Fall 0:22</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>Champ. Round 1 - Miles Schmid (Clinton WC) won by decision over Michael Patterson (Orland Park Pioneers WC) Dec 7-2</li>\n<li>Champ. Round 1 - Connor Rech (Dinamo Wrestling) won by decision over Rhett Eastin (Olney Cubs WC) Dec 8-6</li>\n<li>Champ. Round 1 - Ayden McAuliffe (Tinley Park Bulldogs WC) won by fall over Abel Dickerson (Petersburg WC) Fall 0:35</li>\n<li>Champ. Round 1 - Chase Stroot (Team Mascoutah WC) won by major decision over Cooper Lardi (Lil` Coalers WC) Maj 13-2</li>\n<li>Champ. Round 1 - Jackson Moreno (Belvidere Bandits WC) won by major decision over Kaydin Feliciano (Beat the Streets Chicago-Avondale) Maj 13-1</li>\n<li>Champ. Round 1 - Noah Caputo (nWo WC) won by fall over Jaxon Holtzman (Downers Grove WC) Fall 2:10</li>\n<li>Champ. Round 1 - Nehemiah Andronic (Rochelle Wrestling Club) won by decision over Jackson Doherty (Dragons Lair WC) Dec 6-0</li>\n<li>Champ. Round 1 - Francesco Faso (Barrington Broncos WC) won by decision over Benjamin Townsend (Wheaton WC) Dec 5-1</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>Champ. Round 1 - Daquain Hubbard Jr (Urbana Tigers WC) won by fall over Aedan Perez (Glenbard East Jr Rams WC) Fall 0:23</li>\n<li>Champ. Round 1 - Tyler Wirth (Lemont Bears WC) won by fall over David Harris (Toss Em Up Wrestling Academy) Fall 0:57</li>\n<li>Champ. Round 1 - Noah Jaber (Badger WC) won by decision over Vedder Anello (Mattoon Youth WC) Dec 2-1</li>\n<li>Champ. Round 1 - Joseph Keigher (Elk Grove Junior Grens WC) won by fall over Rys Tijerina (St. Charles WC) Fall 1:19</li>\n<li>Champ. Round 1 - Joseph Oliver (Peotone Little Devils WC) won by fall over Benson Housman (Macomb Little Bombers Wrestling) Fall 1:50</li>\n<li>Champ. Round 1 - Kane Linneman (Harvard WC) won by decision over NyKel DeLoach (Lion`s Den Wrestling Academy) Dec 7-3</li>\n<li>Champ. Round 1 - Jake Meeks (Lawrence County Knights WC) won by decision over Jaxson Pane (Peotone Little Devils WC) Dec 6-0</li>\n<li>Champ. Round 1 - Conrad Barber (Belvidere Bandits WC) won by fall over Hunter Voss (DC WC) Fall 2:49</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>Champ. Round 1 - Mackson Bruning (Panther Youth WC) won by fall over Elliott Collins (DeKalb WC) Fall 0:57</li>\n<li>Champ. Round 1 - Liam Lee (Built By Brunson Wrestling) won by fall over Kayden Sicka (Southern Illinois Bulldogs WC) Fall 2:52</li>\n<li>Champ. Round 1 - Chase White (Jersey Junior Panthers Wrestling) won by major decision over Lincoln Stocks (Mt. Zion Kids WC) Maj 10-1</li>\n<li>Champ. Round 1 - Jake Jerik (Antioch Predators WC) won by fall over Declan Wargo (Crystal Lake Wizards WC) Fall 1:44</li>\n<li>Champ. Round 1 - Aiden Kalchbrenner (Panther WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Brent Hills Ii (Champions WC) won by fall over Michael Mucha (Little Celtic WC) Fall 2:26</li>\n<li>Champ. Round 1 - William Blomberg (Yorkville WC) won by decision over Hawkins Edgcomb (SCN Youth WC) Dec 5-2</li>\n<li>Champ. Round 1 - Gino DePaolo (Brawlers WC) won by fall over Malaci Hogan (Harvey Twisters WC) Fall 2:25</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>Champ. Round 1 - Brock Harvey (Hononegah WC) won by fall over Oliver Swallows (Prairie Central Youth Wrestling) Fall 0:56</li>\n<li>Champ. Round 1 - Abel Orr (Champions WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Braxton Slack (Belvidere Bandits WC) won by fall over Colton Sahlin (Yorkville WC) Fall 0:17</li>\n<li>Champ. Round 1 - Leonard Morgan (Wilmington WC) won by fall over Keith Feriozzi (Decatur Dawgs WC) Fall 1:48</li>\n<li>Champ. Round 1 - Waylin Rogers (Vandalia Jr WC) won by fall over James Shibata (Barrington Broncos WC) Fall 1:18</li>\n<li>Champ. Round 1 - Donnagain Mallory (Mustang WC) won by fall over Julian Alvarado (Batavia WC) Fall 0:32</li>\n<li>Champ. Round 1 - Giovanni Bolognini (Scorpion WC) won by fall over Anthony Poro (Arlington Cardinals WC) Fall 1:31</li>\n<li>Champ. Round 1 - Dylan Orozco (Oak Forest Warriors WC) won by decision over Jonah Findley (Salem WC) Dec 3-1</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>Champ. Round 1 - Beau Hill (Champions WC) won by fall over Declan Guleserian (Fox Valley WC) Fall 0:44</li>\n<li>Champ. Round 1 - Tony Hess (Wildcats Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Lukas Martin (Lincoln Youth WC) won by fall over William Ortiz (Fox Valley WC) Fall 2:55</li>\n<li>Champ. Round 1 - Cal Butikofer (Yorkville WC) won by fall over Jackson Albright (Arlington Cardinals WC) Fall 1:20</li>\n<li>Champ. Round 1 - Landon Haak (Stillman Valley WC) won by fall over Jonathan Winder (Jersey Junior Panthers Wrestling) Fall 0:47</li>\n<li>Champ. Round 1 - Roman Lucio (Badger WC) won by major decision over Charlie Redman (Brawlers WC) Maj 12-3</li>\n<li>Champ. Round 1 - Bryce Boltz (Sycamore WC) won by fall over Jacob Harris (Lil` Coalers WC) Fall 1:30</li>\n<li>Champ. Round 1 - Pierce Spiller (Murphysboro Wrestling) won by decision over Hunter Lindsey (Dwight WC) Dec 8-6</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Alina Gomez (Oak Forest Warriors WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Sophia Olandese (Wheaton WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Rayelynn Hartmann (Tiger Town Tanglers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Marli Cobbs (Belleville Little Devils WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>Champ. Round 1 - Mayleigh Bly (Shelbyville Jr. Wrestling Rams) received a bye   () Bye</li>\n<li>Champ. Round 1 - Veda Bailey (Warriors Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Henley Hawthorne (Granite City Wrestling Association) received a bye   () Bye</li>\n<li>Champ. Round 1 - Ava Willock (Rockets WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Charlotte Baker (Dixon WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Ivy Sullivan (Dixon WC) won by major decision over Kyra Gibson (Tiger Town Tanglers WC) Maj 12-1</li>\n<li>Champ. Round 1 - Kathlynn Sturhahn (Quincy Little Raiders WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Grace Stoller (Clinton WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>Champ. Round 1 - Layla McFarland (Vandalia Jr WC) won by fall over Salem Harris (Champaign WC) Fall 1:27</li>\n<li>Champ. Round 1 - Chyanne Lee (Will County Warriors WC) won by fall over Jemalee Bertram (Clinton WC) Fall 2:41</li>\n<li>Champ. Round 1 - Izabella Gustafson (Sherrard Jr. Tigers WC) won by fall over Sophie Burke (Wilmington WC) Fall 0:48</li>\n<li>Champ. Round 1 - Gabriella Garza (Carbondale WC) won by fall over Johanna Daugherty (Taylorville WC) Fall 0:24</li>\n<li>Champ. Round 1 - Mia Cervone (Red Raiders Wrestling Team) received a bye   () Bye</li>\n<li>Champ. Round 1 - Hazel Bliss (Gladiator Elite WC) won by fall over Lily Beach (Hononegah WC) Fall 1:20</li>\n<li>Champ. Round 1 - Fiona O`Connor (Rockets WC) won by fall over Stella Roof (Clinton WC) Fall 1:27</li>\n<li>Champ. Round 1 - Jaylie Lackey (Lawrence County Knights WC) won by fall over Madison Brophy (Lions WC) Fall 2:00</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>Champ. Round 1 - Genevieve Howe (Metamora Kids WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Chevi Sanchez (Champaign WC) won by fall over Kylie Paine (Taylorville WC) Fall 0:17</li>\n<li>Champ. Round 1 - Merida Paddock (Antioch Predators WC) won by decision over Mylee Swaim (Oakwood Youth WC) Dec 7-5</li>\n<li>Champ. Round 1 - HenLeigh Munz (Sauk Valley WC) won by fall over Zoey Houle (Lil Reaper WC) Fall 0:30</li>\n<li>Champ. Round 1 - Brenna Skinner (Maine Eagles WC) won by fall over Emma Overman (Orland Park Pioneers WC) Fall 0:42</li>\n<li>Champ. Round 1 - Emersyn McCabe (Villa Park Young Warriors WC) won by major decision over Marley Bradford (Lockport Junior Porters WC) Maj 12-0</li>\n<li>Champ. Round 1 - Ellie Klein (West Suburban Girls WC) won by decision over Brittany Milligan (Falcon Youth Wrestling) Dec 7-0</li>\n<li>Champ. Round 1 - Ally Atzman (Orland Park Pioneers WC) won by fall over Roxanne Houle (Lil Reaper WC) Fall 0:47</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>Champ. Round 1 - Ellyana Piper (Little Giants WC) won by fall over Mia Dennison (Rochelle Wrestling Club) Fall 3:00</li>\n<li>Champ. Round 1 - Olivia Hruska (Antioch Predators WC) won by major decision over Lillian Trost (Oak Forest Warriors WC) Maj 13-0</li>\n<li>Champ. Round 1 - Alexi Carrasco (Caravan Kids WC) won by fall over Gabriella Young (Hoopeston Area Youth Wrestling) Fall 1:30</li>\n<li>Champ. Round 1 - Ella Deterding (Sparta Junior Bulldogs WC) won by fall over Ariel Hinojosa (Antioch Predators WC) Fall 0:57</li>\n<li>Champ. Round 1 - Kolbie Ervin (Sandwich WC) won by decision over Laura Allen (Wilmington WC) Dec 6-2</li>\n<li>Champ. Round 1 - Kinsley Bratcher (Southern Illinois Bulldogs WC) won by fall over Cheyenne Cervencik (Badger WC) Fall 0:34</li>\n<li>Champ. Round 1 - Kynlea Doehring (Vandalia Jr WC) won by fall over Isabella Eib (Demolition WC) Fall 1:08</li>\n<li>Champ. Round 1 - Raya Reading (Little Giants WC) won by fall over Grace McEnaney (McHenry WC) Fall 2:58</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>Champ. Round 1 - Braelyn Bunting (Falcon Youth Wrestling) won by fall over Autumn Trowbridge (Highland Bulldog Jr. WC) Fall 0:15</li>\n<li>Champ. Round 1 - Emerson Seaton (Collinsville WC) won by fall over Lilybell Valdez (Round Lake Jr. Panthers WC) Fall 0:24</li>\n<li>Champ. Round 1 - Adair Lawrence (O`Fallon Little Panthers WC) won by fall over Jenna Earles (MS Youth WC) Fall 0:51</li>\n<li>Champ. Round 1 - Kourtney Kanallakan (Edwardsville WC) won by fall over Kylie Nagel (MadDog Wrestling Academy) Fall 0:33</li>\n<li>Champ. Round 1 - Anastasia Rucinski (Tiger Town Tanglers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Irene Buzick (Midwest Central Youth WC) won by fall over Hadasha Hesse (Elk Grove Junior Grens WC) Fall 0:29</li>\n<li>Champ. Round 1 - Madelynn Wiebenga (Sauk Valley WC) won by major decision over Courtney Serafin (Downers Grove WC) Maj 9-0</li>\n<li>Champ. Round 1 - Bristol Larson (Demolition WC) won by fall over Kailee Warren (Jacksonville Area Wrestling) Fall 1:21</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>Champ. Round 1 - Brinley Johnson (Westville WC) won by fall over Helen Hansen (Downers Grove WC) Fall 1:44</li>\n<li>Champ. Round 1 - Audriana Herzog (Marengo Youth WC) won by decision over Veronica Ziller (Lockport Junior Porters WC) Dec 7-3</li>\n<li>Champ. Round 1 - Evangelina Guzman (Will County Warriors WC) won by fall over Maycelynn Holmes (Shelbyville Jr. Wrestling Rams) Fall 1:27</li>\n<li>Champ. Round 1 - Aria Torres (West Suburban Girls WC) won by fall over Adriana Vega (Red Raiders Wrestling Team) Fall 0:50</li>\n<li>Champ. Round 1 - Carly Maloney (Tinley Park Bulldogs WC) won by fall over Laura Miller (Crawford County WC) Fall 1:21</li>\n<li>Champ. Round 1 - Myka Roberts (TJ Trained Wrestling) won by fall over Alexandra Carroll (Mat Rat WC) Fall 1:39</li>\n<li>Champ. Round 1 - Afton Wininger (West Frankfort Jr. Redbirds WC) won by fall over Natalie Norberg (Sauk Valley WC) Fall 0:22</li>\n<li>Champ. Round 1 - Kaylee Koller (Badger WC) won by fall over Rubie Ortega (MadDog Wrestling Academy) Fall 0:57</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Azlynn Wilson (Benton WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Collins Miller (LaSalle Peru Crunching Cavs Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>Champ. Round 1 - Kane Deal (SOT-C) won by decision over Jack Brown (Frankfort Wildcats Wrestling) Dec 5-4</li>\n<li>Champ. Round 1 - Hudsyn Pfanz (TJ Trained Wrestling) won by decision over Mason Black (Springs Elite WC) Dec 5-2</li>\n<li>Champ. Round 1 - Maxwell Fauth (Lions WC) won by decision over Joseph Major (Force Elite WC) Dec 5-0</li>\n<li>Champ. Round 1 - Walker Kelley (Champions WC) won by fall over Kai Chambers (Iguana WC) Fall 1:54</li>\n<li>Champ. Round 1 - Hayden Bushue (Effingham Youth WC) won by decision over Luca Bartels (Fox Valley WC) Dec 6-5</li>\n<li>Champ. Round 1 - Diego Garcia (North Boone WC) won by decision over Jaiden Valdez (Headlock Wrestling Academy) Dec 5-0</li>\n<li>Champ. Round 1 - Terrell Crowcroft (Spartan WC) won by major decision over Diezel Steele (Olney Cubs WC) Maj 14-2</li>\n<li>Champ. Round 1 - Derek Hayes (SCN Youth WC) won by injury default over Finnegan Campbell (Headlock Wrestling Academy) Inj. 2:00</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>Champ. Round 1 - Tom Toledo (Demolition WC) won by fall over Steven Griffith (Storm Youth WC) Fall 0:59</li>\n<li>Champ. Round 1 - Owen Slabaugh (Alber Athletics WC) won by fall over Julian Trujillo (Built By Brunson Wrestling) Fall 0:58</li>\n<li>Champ. Round 1 - Achilles Cortese (Cortese WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Brennan Caruso (McHenry WC) won by decision over Carter Knowles (Lincoln-Way WC) Dec 4-1</li>\n<li>Champ. Round 1 - Jack DeGroot (Sauk Valley WC) won by decision over Quinn Roach (Panther WC) Dec 5-0</li>\n<li>Champ. Round 1 - Chase Pool (Glenbard East Jr Rams WC) won by fall over Nolan St Angelo (PSF Wrestling Academy) Fall 1:54</li>\n<li>Champ. Round 1 - Karson Nietzel (Rocket Fuel WC) won by major decision over Bobby Alfaro (Martinez Fox Valley Elite WC) Maj 9-0</li>\n<li>Champ. Round 1 - Karson Stoeckel (Bulls WC) won by fall over Elijah Czerwiec (Lemont Bears WC) Fall 0:37</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>Champ. Round 1 - Paxson Minkie (Alber Athletics WC) won by decision over Kree Burkey (Gladiator Elite WC) Dec 5-0</li>\n<li>Champ. Round 1 - Henry Bansley (Panther WC) won by decision over Tyson Jones (SJO Youth WC) Dec 5-3</li>\n<li>Champ. Round 1 - Ryder Little (Central Illinois Bulldogs WC) won by major decision over Tucker Brand (Panther Powerhouse Wrestling) Maj 11-2</li>\n<li>Champ. Round 1 - Jordan Easton (Springs Elite WC) won in sudden victory - 1 over Riley Reyes (Alber Athletics WC) SV-1 5-0</li>\n<li>Champ. Round 1 - Michael Fangerow (Lincoln-Way WC) won by decision over Anthony Triner (Yorkville WC) Dec 4-0</li>\n<li>Champ. Round 1 - Tate Adamson (SCN Youth WC) won by major decision over Ezekiel Martinez (Toss Em Up Wrestling Academy) Maj 11-2</li>\n<li>Champ. Round 1 - Wyatt McClain (Demolition WC) won by decision over Anthony Federici (Headlock Wrestling Academy) Dec 5-2</li>\n<li>Champ. Round 1 - Weston Brom (Fox Valley WC) won by decision over Asher Garretson (Yorkville WC) Dec 5-0</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>Champ. Round 1 - Will Gallo (SJO Youth WC) won by major decision over Taitum Wenninger (Champbuilders Wrestling) Maj 12-2</li>\n<li>Champ. Round 1 - Scott Kilmer (Lion`s Den Wrestling Academy) won by fall over Maddox Martinez (Tribe WC) Fall 2:53</li>\n<li>Champ. Round 1 - Sloan Sears (PSF Wrestling Academy) won by decision over Beau Fields (Falcon Youth Wrestling) Dec 8-2</li>\n<li>Champ. Round 1 - Maddox Noonan (Ottawa Wolfpack WC) won by decision over Wesley Baker (Glenbard East Jr Rams WC) Dec 5-2</li>\n<li>Champ. Round 1 - Charlie Blake (Panther WC) won in sudden victory - 1 over Leo Christensen (Lil` Coalers WC) SV-1 6-2</li>\n<li>Champ. Round 1 - Derek Keller (Crystal Lake Wizards WC) won by decision over Peter Willis (Arlington Cardinals WC) Dec 6-2</li>\n<li>Champ. Round 1 - Jordy Teran (Alber Athletics WC) won by decision over Tony Distasio (Lemont Bears WC) Dec 3-2</li>\n<li>Champ. Round 1 - Lawson Lokanc (Lincoln-Way WC) won by decision over Ryder Cybul (Antioch Predators WC) Dec 5-2</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>Champ. Round 1 - Jaxon Sullivan (Antioch Predators WC) won by major decision over Elijah Narayanan (Batavia WC) Maj 8-0</li>\n<li>Champ. Round 1 - Neklous Jones (Alber Athletics WC) won by decision over Carter Johnson (Lincoln Youth WC) Dec 7-3</li>\n<li>Champ. Round 1 - Ben Gellings (Barrington Broncos WC) won by decision over Tanner Brucker (Falcon Youth Wrestling) Dec 5-1</li>\n<li>Champ. Round 1 - Dominic Warner (Harlem Huskies WC) won by fall over Damon Llanuza (St. Charles WC) Fall 2:26</li>\n<li>Champ. Round 1 - Ryker Gladson (Murphysboro Wrestling) won by decision over Patrick Murphy (Mustang WC) Dec 6-3</li>\n<li>Champ. Round 1 - Cayson Rogers (Lincoln-Way WC) won by fall over Deklyn Thompson (Ottawa Wolfpack WC) Fall 2:47</li>\n<li>Champ. Round 1 - Jogan Lazenby (Southern Illinois Bulldogs WC) won by decision over Kane Gabbert (Morton Youth WC) Dec 4-2</li>\n<li>Champ. Round 1 - Dominic Doljanin (Tinley Park Bulldogs WC) won by decision over Jaxton Zirkle (Brawlers WC) Dec 7-3</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>Champ. Round 1 - Luke Sponsel (Arlington Cardinals WC) won by fall over Jayden White (Urbana Tigers WC) Fall 1:46</li>\n<li>Champ. Round 1 - Quinlan Leyden (Little Celtic WC) won by decision over Bradley Wittenmeier (Vittum Cats WC) Dec 3-1</li>\n<li>Champ. Round 1 - Mincere White (Springs Elite WC) won by fall over Maddox Marsaglia (Iguana WC) Fall 1:47</li>\n<li>Champ. Round 1 - Landon Delisi (Built By Brunson Wrestling) won by decision over Joshua Forsythe (Callan Wrestling Academy) Dec 2-0</li>\n<li>Champ. Round 1 - Jerry Fialka (Martinez Fox Valley Elite WC) won by decision over Jacob Cory (Harlem Huskies WC) Dec 6-2</li>\n<li>Champ. Round 1 - Damoni Ford (PSF Wrestling Academy) won by decision over Jase Lohmeyer (Champions WC) Dec 2-1</li>\n<li>Champ. Round 1 - Cole Kiel (Edwardsville WC) won by fall over Tyrus Stifter (Du-Pec WC) Fall 1:12</li>\n<li>Champ. Round 1 - Austin Villarreal (nWo WC) won by decision over Jake Kichka (Naperville WC) Dec 9-2</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>Champ. Round 1 - Gavin Lange (Falcon Youth Wrestling) won by decision over Henry Eckersley (Champions WC) Dec 6-0</li>\n<li>Champ. Round 1 - Frank Ariola (SCN Youth WC) won by decision over Timothy Wagner (Lil` Coalers WC) Dec 5-2</li>\n<li>Champ. Round 1 - Mauricio Hueramo (Reed Custer Jr. Panthers WC) won in sudden victory - 1 over Coltyn Montgomery (Yorkville WC) SV-1 8-6</li>\n<li>Champ. Round 1 - Sami Abuarqoub (Greg Gomez Trained Wrestling) won by decision over Knox Patient (Champaign WC) Dec 2-1</li>\n<li>Champ. Round 1 - Michael Burns (Beat the Streets Chicago-Oak Park) won by fall over Salim Fakhoury (Junior Patriots WC) Fall 2:24</li>\n<li>Champ. Round 1 - Lyeden Hankins (Highland Bulldog Jr. WC) won by decision over Kolten Lowe (Hawk WC) Dec 5-4</li>\n<li>Champ. Round 1 - Hayes Kustok (Evanston School of Wrestling) won by major decision over Gavin Eich (Dundee Highlanders WC) Maj 14-3</li>\n<li>Champ. Round 1 - Konner Davis (Olney Cubs WC) won by major decision over Kellan Curran (Dinamo Wrestling) Maj 10-2</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>Champ. Round 1 - Odysseus Hale (Midwest Central Youth WC) won by fall over Liam Powell (SJO Youth WC) Fall 2:44</li>\n<li>Champ. Round 1 - Maddox Birchler (Sparta Junior Bulldogs WC) won by fall over Paul Kenny (Dundee Highlanders WC) Fall 0:43</li>\n<li>Champ. Round 1 - Cooper Shepard (Cumberland Youth WC) won by decision over Weston Atkinson (Crystal Lake Wizards WC) Dec 6-2</li>\n<li>Champ. Round 1 - Maxwell Robertson (nWo WC) won by fall over Karmell Jones (East St. Louis WC) Fall 1:45</li>\n<li>Champ. Round 1 - Caleb Weaver (Demolition WC) won in sudden victory - 1 over Anthony Ariola (SCN Youth WC) SV-1 4-2</li>\n<li>Champ. Round 1 - William Dunn (Beat the Streets Chicago-Midway) won in tie breaker - 1 over Andrew Scorza (Arlington Cardinals WC) TB-1 2-1</li>\n<li>Champ. Round 1 - Cameron Gillie (SCN Youth WC) won by decision over Maxwell Schmidt (Lake Zurich Cubs WC) Dec 7-5</li>\n<li>Champ. Round 1 - Jordan Thompson (Lincoln-Way WC) won by decision over Colin Guisinger (Tinley Park Bulldogs WC) Dec 2-0</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>Champ. Round 1 - Grady Gallagher (Monticello Youth WC) won by decision over Nicholas Peisker (Orland Park Pioneers WC) Dec 5-3</li>\n<li>Champ. Round 1 - Mario Montalto (Lemont Bears WC) won by fall over Major McGee (PSF Wrestling Academy) Fall 0:24</li>\n<li>Champ. Round 1 - Rhett Bramley (Iguana WC) won by decision over Zachary Laga (Lemont Bears WC) Dec 2-0</li>\n<li>Champ. Round 1 - Michael Tasnic (Force Elite WC) won by major decision over Jaxon Anderson (Gladiator Elite WC) Maj 11-1</li>\n<li>Champ. Round 1 - Draven Bock (Hawk WC) won by decision over Gino Marino (Headlock Wrestling Academy) Dec 10-6</li>\n<li>Champ. Round 1 - Tiernan Devlin (Glen Ellyn Dungeon WC) won by decision over Gabriel Razo (DC WC) Dec 4-2</li>\n<li>Champ. Round 1 - Brayden Behn (Du-Pec WC) won by fall over Logan Braga (Yorkville WC) Fall 0:40</li>\n<li>Champ. Round 1 - Nikolas Panayi (Arlington Cardinals WC) won by fall over Greyson Glowienke (Wheaton WC) Fall 2:40</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>Champ. Round 1 - Luke Wagner (SJO Youth WC) won by fall over Asher Ericson (Cory Clark Wrestling) Fall 1:37</li>\n<li>Champ. Round 1 - Brendan Beidler (Notre Dame WC) won by decision over Temuulen Binderiya (Beat the Streets Chicago-Midway) Dec 7-0</li>\n<li>Champ. Round 1 - Jack Wiatr (Lemont Bears WC) won by fall over Justin Park (Hoopeston Area Youth Wrestling) Fall 1:51</li>\n<li>Champ. Round 1 - Jack Kosobucki (Arlington Cardinals WC) won in sudden victory - 1 over Max Marshall (Naperville WC) SV-1 2-0</li>\n<li>Champ. Round 1 - Michael Hammer (Demolition WC) won by major decision over Trace Anfinson (TJ Trained Wrestling) Maj 8-0</li>\n<li>Champ. Round 1 - Everett Lehr (Wolves WC) won by decision over Reece Valencia (Bulls WC) Dec 5-3</li>\n<li>Champ. Round 1 - Matthew Smith (Benton WC) won by decision over Karam Olyyan (Orland Park Pioneers WC) Dec 7-0</li>\n<li>Champ. Round 1 - Armani Renteria (Harvard WC) won by major decision over Karter Moffitt (Limestone WC) Maj 8-0</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>Champ. Round 1 - Blaine Drake (The Law WC) won in sudden victory - 1 over Hayden Hicks (Monticello Youth WC) SV-1 7-5</li>\n<li>Champ. Round 1 - Liam Soutar (Bulldog Youth Sports Wrestling) won by fall over Christian Hooker (O`Fallon Little Panthers WC) Fall 2:25</li>\n<li>Champ. Round 1 - Cleotha Spearman Lll (East St. Louis WC) won by fall over Brody Morrissey (Taylorville WC) Fall 2:15</li>\n<li>Champ. Round 1 - Joey Pauling (Mat Rat WC) won by decision over Keith Stepina (Stillman Valley WC) Dec 8-4</li>\n<li>Champ. Round 1 - Mason Vargas (Beat the Streets Chicago-Midway) won by fall over Jasper Aure (Petersburg WC) Fall 1:36</li>\n<li>Champ. Round 1 - Gabriel Musselman (Eureka WC) won by decision over Elijah Griffin (Will County Warriors WC) Dec 5-4</li>\n<li>Champ. Round 1 - Aydan Del Muro (nWo WC) won by decision over Lucas Nicoski (Martinez Fox Valley Elite WC) Dec 13-12</li>\n<li>Champ. Round 1 - Omar Tadros (Lockport Junior Porters WC) won by fall over Antoine Yates (Beat the Streets Chicago-Oak Park) Fall 0:54</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>Champ. Round 1 - Cayden Williams (Harvard WC) won in sudden victory - 1 over Jack Donovan (Meridian Hawks Youth WC) SV-1 4-2</li>\n<li>Champ. Round 1 - Chase Spradau (Yorkville WC) won by fall over Kenneth Woods (Demolition WC) Fall 1:40</li>\n<li>Champ. Round 1 - John Gehrig (Sycamore WC) won by fall over Allen Antolik (Streator WC) Fall 1:00</li>\n<li>Champ. Round 1 - Bransyn VonBehren (Monticello Youth WC) won by decision over Declan Pecho (Frankfort Wildcats Wrestling) Dec 6-0</li>\n<li>Champ. Round 1 - Kameron Davis (Granite City Wrestling Association) won by fall over Jimmy Grapenthien (Maine Eagles WC) Fall 1:11</li>\n<li>Champ. Round 1 - Reid Archer (Oswego WC) won by fall over Daniel Conwell (Mustang WC) Fall 0:58</li>\n<li>Champ. Round 1 - Ethan Pellizzari (Hinsdale Red Devil WC) won by fall over Giancarlo Albavera (Stallions Wrestling Academy) Fall 1:15</li>\n<li>Champ. Round 1 - Carson Mongare (Edwardsville WC) won by fall over Blake Sauceda (Badger WC) Fall 0:54</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>Champ. Round 1 - John Jones (Granite City Wrestling Association) received a bye   () Bye</li>\n<li>Champ. Round 1 - Landry Agney (Shelbyville Jr. Wrestling Rams) won by fall over Easton Noland (Meridian Hawks Youth WC) Fall 0:58</li>\n<li>Champ. Round 1 - Adreice Russell (Rantoul Youth Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Wyatt Miller (Monticello Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Brentlee Jones (Jacksonville Area Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Ulises Sanchez (Doom Wrestling) won by fall over Damyen McGrown (Danville Chargers WC) Fall 0:55</li>\n<li>Champ. Round 1 - Martin Wilson (Force Elite WC) won by fall over Thurlow Grimm (Oakwood Youth WC) Fall 1:57</li>\n<li>Champ. Round 1 - Jack Harper (Jacksonville Area Wrestling) received a bye   () Bye</li>\n</ul>\n</section>",
  "Championship 2nd Round": "<section class=\"tw-list\">\n<h1>Championship 2nd Round</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>Champ. Round 2 - Brooklyn Sharwarko (Lil` Coalers WC) won by major decision over Georgia Blayney (DC WC) Maj 15-3</li>\n<li>Champ. Round 2 - Elena Amendola (Fox Valley WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Raegan Lessner (Fox Lake WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Maleya Campbell (Wilmington WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Isabella Huff (Vandalia Jr WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Quinn Fahey (Wheaton WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Kyla Kucala (Little Celtic WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Rosie Pace (N.Y.A Jr. Rebels WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>Champ. Round 2 - Piper Koning (Cardinals WC) won by decision over Gemma Wagner (Tinley Park Bulldogs WC) Dec 4-2</li>\n<li>Champ. Round 2 - Nicolette Giardino (Rockets WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Adalynn Taylor (Rocket Fuel WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Avery Duckett (Shelbyville Jr. Wrestling Rams) received a bye   () Bye</li>\n<li>Champ. Round 2 - Summer Brockman (Belvidere Bandits WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Swayze Campbell (Wilmington WC) won by fall over Erin Brophy (Lions WC) Fall 1:13</li>\n<li>Champ. Round 2 - Emery Westerberg (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - LaiLani Cruz (Lionheart Intense Wrestling) won by decision over Bethany Schroer (East Peoria River Bandits Wrestling) Dec 6-2</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>Champ. Round 2 - Ella Terhaar (Wolves WC) won by decision over Grace Sinks (TJ Trained Wrestling) Dec 7-2</li>\n<li>Champ. Round 2 - Rose Bucaro (Mat Rat WC) won by fall over Mia Lopez (West Suburban Girls WC) Fall 0:26</li>\n<li>Champ. Round 2 - Anya Rossi (Arlington Cardinals WC) won by fall over Genevieve Augle (Tinley Park Bulldogs WC) Fall 1:22</li>\n<li>Champ. Round 2 - Zoey Willis (DC WC) won by decision over Cambrie Gianokis (Mat Rat WC) Dec 6-5</li>\n<li>Champ. Round 2 - Aleerah Snow (Champions WC) won by fall over Noviana Celestino (Sauk Valley WC) Fall 0:56</li>\n<li>Champ. Round 2 - Ava Voyles (Bulls WC) won by decision over Khloe McCaslin (Sandwich WC) Dec 7-3</li>\n<li>Champ. Round 2 - Elizabeth Kustok (Evanston School of Wrestling) won by major decision over Ryan Donnelly (Tinley Park Bulldogs WC) Maj 13-3</li>\n<li>Champ. Round 2 - Emmerson Lange (Falcon Youth Wrestling) won by decision over Khloe Dominguez (DeKalb WC) Dec 5-0</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>Champ. Round 2 - Amina Perez (Greg Gomez Trained Wrestling) won by disqualification over Kaylynn Goetz (Mt. Zion Kids WC) DQ</li>\n<li>Champ. Round 2 - Penelope Hall (Thunder WC) won by fall over Adalyn Albavera (Stallions Wrestling Academy) Fall 1:00</li>\n<li>Champ. Round 2 - Maggie Larson (DeKalb WC) won by fall over Genevieve Del Muro (nWo WC) Fall 1:44</li>\n<li>Champ. Round 2 - Elise Thomas (Bulls WC) won by fall over Eiselee Hrascinski (Tinley Park Bulldogs WC) Fall 2:44</li>\n<li>Champ. Round 2 - Keagan Jadin (Oak Forest Warriors WC) won by fall over Norah Doyle (Vandalia Jr WC) Fall 0:57</li>\n<li>Champ. Round 2 - Patricia Tytus (RTC Wrestling) won by decision over Chelsea Price (Demolition WC) Dec 6-0</li>\n<li>Champ. Round 2 - Sloane Gabler (Sauk Valley WC) won by fall over Alyce Stone (Glenbard East Jr Rams WC) Fall 0:33</li>\n<li>Champ. Round 2 - Beaux McCartney (Alber Athletics WC) won by fall over Tinliee Sullivan (Westville WC) Fall 0:35</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>Champ. Round 2 - Elise LeCuyer (Sandwich WC) won by decision over Tilly Potocsnak (Lockport Junior Porters WC) Dec 11-4</li>\n<li>Champ. Round 2 - Calli Hickman (Bulls WC) won by fall over Piper Angel (Clinton WC) Fall 1:40</li>\n<li>Champ. Round 2 - Brooklyn Schultz (Naperville WC) won by decision over Abigail Jahnel (Unity Youth WC) Dec 6-0</li>\n<li>Champ. Round 2 - Hadley Slabaugh (Harlem Huskies WC) won by decision over Piper Heisler (Mat Rat WC) Dec 4-2</li>\n<li>Champ. Round 2 - Angelina Perez (Dundee Highlanders WC) won by major decision over Esmeralda Gaytan (Evanston School of Wrestling) Maj 10-1</li>\n<li>Champ. Round 2 - Raenyn Miller (Sparta Junior Bulldogs WC) won in sudden victory - 1 over Mia MeGee (Quincy Little Raiders WC) SV-1 8-6</li>\n<li>Champ. Round 2 - Savannah Paynes (Bulldog Elite WC) won by injury default over Drew Schau (Tinley Park Bulldogs WC) Inj. 1:36</li>\n<li>Champ. Round 2 - Cale Duckett (Shelbyville Jr. Wrestling Rams) won by fall over Makenna Austra (Bulls WC) Fall 0:56</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>Champ. Round 2 - Lexi Suits (Gladiator Elite WC) won by fall over Kinzleigh Kopka (DeKalb WC) Fall 1:57</li>\n<li>Champ. Round 2 - Colette Gaitros (Mt. Zion Kids WC) won by fall over McKenzie Klug (Wolfpak WC) Fall 0:31</li>\n<li>Champ. Round 2 - Londyn Bellamy (Force Elite WC) won by tech fall over Zora Goebel (The Law WC) TF 15-0</li>\n<li>Champ. Round 2 - Quinn Hale (Midwest Central Youth WC) won by decision over Isabella Schoenemann (Orland Park Pioneers WC) Dec 6-3</li>\n<li>Champ. Round 2 - Rylee Colby (Batavia WC) won by fall over Kaylee Carney (Macomb Little Bombers Wrestling) Fall 0:42</li>\n<li>Champ. Round 2 - Elina Del Rio (Caravan Kids WC) won by fall over Melanie Mendez (Crosstown Spartan Elite WC) Fall 2:51</li>\n<li>Champ. Round 2 - Ava Barber (Belvidere Bandits WC) won by decision over Brooklyn McGreehin (Peotone Little Devils WC) Dec 10-4</li>\n<li>Champ. Round 2 - Victoria Kasky (Gladiator Elite WC) won by fall over Natalya Moberg (Rochelle Wrestling Club) Fall 1:52</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>Champ. Round 2 - Trinity Grace Larsen (Fox Lake WC) won by fall over Chloe Finnegan (Belvidere Bandits WC) Fall 0:20</li>\n<li>Champ. Round 2 - Madison Gregoria (Woodstock Cyclones WC) won by decision over Whitney Wood (Peoria Wizards WC) Dec 5-0</li>\n<li>Champ. Round 2 - Natalie Smith (Granite City Wrestling Association) won by fall over Baylee Grimes (Reed Custer Jr. Panthers WC) Fall 1:49</li>\n<li>Champ. Round 2 - Summar Jaber (Badger WC) won by fall over Jocelyn Zicatl (Bulldog Elite WC) Fall 0:14</li>\n<li>Champ. Round 2 - Emmlyne Shaw (Peotone Little Devils WC) won by fall over Camila Rodriguez (Beat the Streets Chicago-Midway) Fall 2:54</li>\n<li>Champ. Round 2 - Samari Hernandez (Bulldog Elite WC) won by fall over Brinley Wrage (Stillman Valley WC) Fall 1:38</li>\n<li>Champ. Round 2 - Hollyn Boggess (Panther Powerhouse Wrestling) won by fall over Anderson Cherry (Mat Rat WC) Fall 1:23</li>\n<li>Champ. Round 2 - Clara Lauer (Petersburg WC) won by fall over Raiza LeCompte (Tinley Park Bulldogs WC) Fall 2:30</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>Champ. Round 2 - Michaelene Andler (Naperville WC) won by fall over Charlotte Mathias (Warrensburg-Latham Jr. Cardinals WC) Fall 2:38</li>\n<li>Champ. Round 2 - Charlize Cartwright (Junior Patriots WC) won by fall over MacKenzie Phelps (Spartan WC) Fall 1:00</li>\n<li>Champ. Round 2 - Kennedy Erickson (DeKalb WC) won by fall over Kimberlyn McGrown (Danville Chargers WC) Fall 0:31</li>\n<li>Champ. Round 2 - Zoey Rousseau (Beat the Streets Chicago-Midway) won by fall over Makaya Linville (Tiger Elite Wrestling Inc) Fall 2:49</li>\n<li>Champ. Round 2 - Ava Durham (Tinley Park Bulldogs WC) won by fall over Genevieve Jones (Granite City Wrestling Association) Fall 0:20</li>\n<li>Champ. Round 2 - Aubrey Taylor (MadDog Wrestling Academy) won by fall over Lanna Learch (Belvidere Bandits WC) Fall 0:20</li>\n<li>Champ. Round 2 - Jazlyn Manning (Blue Crew WC) won by fall over Genesis Green (Vandalia Jr WC) Fall 0:27</li>\n<li>Champ. Round 2 - Mckinley Allen (Riot Room Wrestling) won by fall over Aryana Resendez (Rochelle Wrestling Club) Fall 1:54</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>Champ. Round 2 - Kayden Chapman (Mattoon Youth WC) won by major decision over Julian Ramos (Headlock Wrestling Academy) Maj 14-3</li>\n<li>Champ. Round 2 - Declan Roach (Panther WC) won by fall over Liam Ross (Stillman Valley WC) Fall 2:34</li>\n<li>Champ. Round 2 - Daxton Lillis (Southern Illinois Bulldogs WC) won by fall over Charles McGlennon (Lemont Bears WC) Fall 0:58</li>\n<li>Champ. Round 2 - Peyton Murphy (Downers Grove WC) won by fall over Calvin Grant (Urbana Tigers WC) Fall 1:28</li>\n<li>Champ. Round 2 - Logan Soloff (Lil Reaper WC) won by decision over Tristan Atkins (Lawrence County Knights WC) Dec 7-3</li>\n<li>Champ. Round 2 - Derrick Cue (Astro WC) won by fall over Sam Smith (Stockton Renegades WC) Fall 2:18</li>\n<li>Champ. Round 2 - Maddux Giffin (Reed Custer Jr. Panthers WC) won by fall over Asher Sefton (Vandalia Jr WC) Fall 1:38</li>\n<li>Champ. Round 2 - Cole Wachstetter (Falcon Youth Wrestling) won by decision over Joseph Salzman (Lincoln-Way WC) Dec 8-1</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>Champ. Round 2 - Axel Graves (SJO Youth WC) won by decision over Jameson Chapman (Gladiator Elite WC) Dec 4-2</li>\n<li>Champ. Round 2 - Noah Reyes (Beat the Streets Chicago-Avondale) won by major decision over Dallas Morales (Scorpion WC) Maj 13-0</li>\n<li>Champ. Round 2 - Chase Amorn (RTC Wrestling) won by major decision over Jace Young (Sandwich WC) Maj 9-0</li>\n<li>Champ. Round 2 - Paul Flores (Southside Outlaws WC) won by major decision over Darian Keller (Crystal Lake Wizards WC) Maj 13-4</li>\n<li>Champ. Round 2 - Leonidas Cortese (Cortese WC) won by fall over Graham Terry (River Bend WC) Fall 1:33</li>\n<li>Champ. Round 2 - Cooper Stumbaugh (Scorpion WC) won by decision over Cohen Frederick (Belvidere Bandits WC) Dec 2-0</li>\n<li>Champ. Round 2 - Ethan Heckler (Morris WC) won by decision over Emery Thompson (Lincoln-Way WC) Dec 3-2</li>\n<li>Champ. Round 2 - Andre McGuire (Urbana Tigers WC) won by fall over Trevor Kasky (Gladiator Elite WC) Fall 0:38</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>Champ. Round 2 - Beckam Velarde (Yorkville WC) won by decision over Boston Blakely (Alber Athletics WC) Dec 7-5</li>\n<li>Champ. Round 2 - River Couture (Cory Clark Wrestling) won by decision over Karter Neal (Storm Youth WC) Dec 5-0</li>\n<li>Champ. Round 2 - Samuel Myatt (Fox Lake WC) won by fall over Elijah Fay (Bulls WC) Fall 1:53</li>\n<li>Champ. Round 2 - Abel Muniz (Force Elite WC) won by major decision over Tre`Lyn Morrow (Crystal Lake Wizards WC) Maj 9-0</li>\n<li>Champ. Round 2 - Cooper Corona (Mustang WC) won by major decision over Shane McGinnis (Frankfort Wildcats Wrestling) Maj 10-2</li>\n<li>Champ. Round 2 - Kenton Raab (Stockton Renegades WC) won by fall over Jack Newsom (Cory Clark Wrestling) Fall 1:35</li>\n<li>Champ. Round 2 - Tyler Winterhalter (Arlington Cardinals WC) won by major decision over Vincent Dean (Aces WC) Maj 10-0</li>\n<li>Champ. Round 2 - Carson Gallo (SJO Youth WC) won by major decision over Abrahm Leingang (Sherrard Jr. Tigers WC) Maj 14-6</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>Champ. Round 2 - Grayson Temple (Fox Lake WC) won by decision over Nico Poeta (Champaign WC) Dec 9-2</li>\n<li>Champ. Round 2 - William Fitzgerald (Little Celtic WC) won by fall over Kevin Ippolito (Crawford County WC) Fall 2:14</li>\n<li>Champ. Round 2 - Layton Kraemer (Nomad Wrestling Academy) won by decision over Parker Lilas (Lemont Bears WC) Dec 4-2</li>\n<li>Champ. Round 2 - Hiro Hongmoungkhoune (Alber Athletics WC) won by decision over Gabriel Torres (nWo WC) Dec 5-1</li>\n<li>Champ. Round 2 - Zackary Vest (TJ Trained Wrestling) won by decision over Jacob McMurray (Lions WC) Dec 6-0</li>\n<li>Champ. Round 2 - Evan Ross (Stillman Valley WC) won by fall over Hiram Bulava (SCN Youth WC) Fall 0:36</li>\n<li>Champ. Round 2 - Thomas Reis (Southern Illinois Bulldogs WC) won by fall over Jt Tsokolas (Mustang WC) Fall 1:38</li>\n<li>Champ. Round 2 - Ryan Campos (Fox Lake WC) won by fall over Lane Kesler (Fisher WC) Fall 2:11</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>Champ. Round 2 - John Wiatr (Lemont Bears WC) won by decision over Makar Pavlys (Suplex WC) Dec 2-0</li>\n<li>Champ. Round 2 - Aaron Munks (Pontiac WC) won by decision over Lucian Holder (Frankfort Wildcats Wrestling) Dec 5-0</li>\n<li>Champ. Round 2 - Tagg Hefner (TJ Trained Wrestling) won by fall over David Bugrimov (Suplex WC) Fall 0:33</li>\n<li>Champ. Round 2 - Lennux Mays (PSF Wrestling Academy) won by major decision over Wells Millard (Rochelle Wrestling Club) Maj 8-0</li>\n<li>Champ. Round 2 - Brycen Legue (Stillman Valley WC) won by tech fall over Jack Wood (Granite City Wrestling Association) TF 21-6</li>\n<li>Champ. Round 2 - Maddox Fialka (Martinez Fox Valley Elite WC) won by fall over Abram Schrand (Champions WC) Fall 2:56</li>\n<li>Champ. Round 2 - Justin-Carter Jones (Toss Em Up Wrestling Academy) won by major decision over Elijah Foss (Gladiator Elite WC) Maj 10-2</li>\n<li>Champ. Round 2 - Pedro Legend Rangel (Storm Youth WC) won by fall over Frankie Rivas (Lions WC) Fall 2:43</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>Champ. Round 2 - Timothy Block (Mattoon Youth WC) won by decision over Easton Benyo (Sauk Valley WC) Dec 1-0</li>\n<li>Champ. Round 2 - Camden Fitzgerald (Little Celtic WC) won by fall over Madden Grieve (Highland Bulldog Jr. WC) Fall 3:00</li>\n<li>Champ. Round 2 - Brock Kirschke (Crystal Lake Wizards WC) won by major decision over Dennis LaMonte (Tinley Park Bulldogs WC) Maj 15-5</li>\n<li>Champ. Round 2 - Brody Cohen (Built By Brunson Wrestling) won by decision over Jack Wishnevski (Cory Clark Wrestling) Dec 9-4</li>\n<li>Champ. Round 2 - Mason Trettin (Tinley Park Bulldogs WC) won by tech fall over Cooper Whaley (Rockford WC) TF 15-0</li>\n<li>Champ. Round 2 - Briggs Whiting (Force Elite WC) won by fall over Easton Shinn (Southern Illinois Bulldogs WC) Fall 0:31</li>\n<li>Champ. Round 2 - Dominic Adamo (Arlington Cardinals WC) won by fall over Vincent Jimenez (Crystal Lake Wizards WC) Fall 2:08</li>\n<li>Champ. Round 2 - Jack Gorman (SJO Youth WC) won by fall over Porfivio Celestino (Sauk Valley WC) Fall 1:28</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>Champ. Round 2 - Jordan Benefiel (nWo WC) won in sudden victory - 1 over Cameron Willock (Rockets WC) SV-1 11-9</li>\n<li>Champ. Round 2 - Shane McNulty (Demolition WC) won by decision over Cassius House (Southern Illinois Bulldogs WC) Dec 4-0</li>\n<li>Champ. Round 2 - Armando Perez (Southside Outlaws WC) won by decision over Lodi Morgan (Wilmington WC) Dec 12-6</li>\n<li>Champ. Round 2 - Anthony Ragona (Built By Brunson Wrestling) won by medical forfeit over Pryce Hendriksen (SCN Youth WC) MFF</li>\n<li>Champ. Round 2 - Antonio Medina (Arlington Cardinals WC) won by fall over Liam Santiago (Fox Valley WC) Fall 0:16</li>\n<li>Champ. Round 2 - Adam Krokos (Orland Park Pioneers WC) won by major decision over Benson Grugel (Stillman Valley WC) Maj 9-0</li>\n<li>Champ. Round 2 - Killien Schwarz (Riot Room Wrestling) won by decision over Cameron Thorman (Macomb Little Bombers Wrestling) Dec 6-2</li>\n<li>Champ. Round 2 - James Newell (Springs Elite WC) won by decision over Beau Beiler (Mt. Zion Kids WC) Dec 3-2</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>Champ. Round 2 - Bishop Edmond (Southside Outlaws WC) won by fall over Dawson Dyer (Mattoon Youth WC) Fall 0:28</li>\n<li>Champ. Round 2 - Lincoln Projansky (Built By Brunson Wrestling) won by decision over Immanuel Hampton (Team Mascoutah WC) Dec 2-1</li>\n<li>Champ. Round 2 - Ares Robelo (Scorpion WC) won by major decision over Jackson Deering (Rockets WC) Maj 12-4</li>\n<li>Champ. Round 2 - Padraig Brady (Demolition WC) won by tech fall over Logan Shreve (PSF Wrestling Academy) TF 16-0</li>\n<li>Champ. Round 2 - Logan Linton (Force Elite WC) won by tech fall over Silas Luke (Stockton Renegades WC) TF 17-2</li>\n<li>Champ. Round 2 - Anthony Schaffer (Izzy Style Wrestling) won by decision over Jory Logan (Belleville Little Devils WC) Dec 4-2</li>\n<li>Champ. Round 2 - Traxton Renfroe (East Peoria River Bandits Wrestling) won by fall over Mason Potts (Fox Lake WC) Fall 2:13</li>\n<li>Champ. Round 2 - Oakley Davis (Iguana WC) won by fall over Danny Strode (Demolition WC) Fall 2:32</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>Champ. Round 2 - Miles Schmid (Clinton WC) won by major decision over Asher Anderson (St. Charles WC) Maj 10-1</li>\n<li>Champ. Round 2 - Alexander Cid (Toss Em Up Wrestling Academy) won by fall over Connor Rech (Dinamo Wrestling) Fall 0:51</li>\n<li>Champ. Round 2 - Keegan Mullen (McHenry WC) won by major decision over Ayden McAuliffe (Tinley Park Bulldogs WC) Maj 16-4</li>\n<li>Champ. Round 2 - Cameron Tutko (Streator WC) won by decision over Chase Stroot (Team Mascoutah WC) Dec 9-6</li>\n<li>Champ. Round 2 - Jackson Moreno (Belvidere Bandits WC) won by decision over Declan Wilking (Wilmington WC) Dec 7-1</li>\n<li>Champ. Round 2 - Gabriel Tatum (Lion`s Den Wrestling Academy) won by major decision over Noah Caputo (nWo WC) Maj 12-0</li>\n<li>Champ. Round 2 - Nehemiah Andronic (Rochelle Wrestling Club) won by fall over Julian Orozco (Beat the Streets Chicago-Midway) Fall 0:39</li>\n<li>Champ. Round 2 - Brody Crumly (Petersburg WC) won by decision over Francesco Faso (Barrington Broncos WC) Dec 9-3</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>Champ. Round 2 - Daquain Hubbard Jr (Urbana Tigers WC) won by tech fall over Brevin Whipple (Du-Pec WC) TF 18-3</li>\n<li>Champ. Round 2 - Tyler Wirth (Lemont Bears WC) won by fall over Tyler Goble (Pekin Boys &amp; Girls Club) Fall 2:43</li>\n<li>Champ. Round 2 - Noah Jaber (Badger WC) won by major decision over Quinn Shelby (Little Celtic WC) Maj 14-0</li>\n<li>Champ. Round 2 - Evan Uhls (Gladiator Elite WC) won by decision over Joseph Keigher (Elk Grove Junior Grens WC) Dec 8-2</li>\n<li>Champ. Round 2 - Dion Wilson (Downers Grove WC) won by fall over Joseph Oliver (Peotone Little Devils WC) Fall 2:24</li>\n<li>Champ. Round 2 - Declan Jones (Arlington Cardinals WC) won by fall over Kane Linneman (Harvard WC) Fall 1:53</li>\n<li>Champ. Round 2 - Jack Brown (Mustang WC) won by major decision over Jake Meeks (Lawrence County Knights WC) Maj 11-2</li>\n<li>Champ. Round 2 - Kingston Hamilton (Wildcats Wrestling Academy) won by decision over Conrad Barber (Belvidere Bandits WC) Dec 4-0</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>Champ. Round 2 - Cohen McCarron (Lincoln-Way WC) won by fall over Mackson Bruning (Panther Youth WC) Fall 1:30</li>\n<li>Champ. Round 2 - Bennett Campos (Blue Line Training Academy) won by decision over Liam Lee (Built By Brunson Wrestling) Dec 6-0</li>\n<li>Champ. Round 2 - Vincent Englese (St. Charles WC) won by tech fall over Chase White (Jersey Junior Panthers Wrestling) TF 15-0</li>\n<li>Champ. Round 2 - Jake Jerik (Antioch Predators WC) won by fall over Liam Fitzpatrick (Mustang WC) Fall 0:13</li>\n<li>Champ. Round 2 - Crosby Michaelis (Carlinville WC) won by fall over Aiden Kalchbrenner (Panther WC) Fall 1:02</li>\n<li>Champ. Round 2 - Wells Kustok (Evanston School of Wrestling) won by decision over Brent Hills Ii (Champions WC) Dec 1-0</li>\n<li>Champ. Round 2 - Alexander Martinez (Red Raiders Wrestling Team) won by major decision over William Blomberg (Yorkville WC) Maj 11-0</li>\n<li>Champ. Round 2 - Karter Smith (SJO Youth WC) won by fall over Gino DePaolo (Brawlers WC) Fall 0:25</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>Champ. Round 2 - Joseph Englese (St. Charles WC) won by major decision over Brock Harvey (Hononegah WC) Maj 12-1</li>\n<li>Champ. Round 2 - Jeremiyah Winn (Harvey Twisters WC) won by fall over Abel Orr (Champions WC) Fall 1:16</li>\n<li>Champ. Round 2 - Boston Black (Murphysboro Wrestling) won by decision over Braxton Slack (Belvidere Bandits WC) Dec 10-5</li>\n<li>Champ. Round 2 - Leonard Morgan (Wilmington WC) won by major decision over Maverick Baker (Libertyville WC) Maj 15-2</li>\n<li>Champ. Round 2 - Hunter Archer (Brawlers WC) won by fall over Waylin Rogers (Vandalia Jr WC) Fall 2:39</li>\n<li>Champ. Round 2 - Donnagain Mallory (Mustang WC) won by fall over Noah Baltierrez (nWo WC) Fall 1:39</li>\n<li>Champ. Round 2 - Levi Palmer (Hononegah WC) won by decision over Giovanni Bolognini (Scorpion WC) Dec 6-0</li>\n<li>Champ. Round 2 - Dylan Orozco (Oak Forest Warriors WC) won by decision over Christian Potts (Doom Wrestling) Dec 5-2</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>Champ. Round 2 - Beau Hill (Champions WC) won by fall over Ethan Kennedy (Bulls WC) Fall 0:22</li>\n<li>Champ. Round 2 - Tony Hess (Wildcats Wrestling Academy) won by decision over Jake Pila (Vittum Cats WC) Dec 5-2</li>\n<li>Champ. Round 2 - Remy Meadors (Peotone Little Devils WC) won by decision over Lukas Martin (Lincoln Youth WC) Dec 9-4</li>\n<li>Champ. Round 2 - Cal Butikofer (Yorkville WC) won by fall over Joel Ware (Du-Pec WC) Fall 0:53</li>\n<li>Champ. Round 2 - Landon Haak (Stillman Valley WC) won by fall over Axel Ramos (Toss Em Up Wrestling Academy) Fall 0:37</li>\n<li>Champ. Round 2 - Brayson Foust (Peoria Razorbacks WC) won by fall over Roman Lucio (Badger WC) Fall 1:50</li>\n<li>Champ. Round 2 - Bryce Boltz (Sycamore WC) won by fall over Anthony Coix (Batavia WC) Fall 1:54</li>\n<li>Champ. Round 2 - Crew Miller (Prairie Central Youth Wrestling) won by fall over Pierce Spiller (Murphysboro Wrestling) Fall 2:48</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>Champ. Round 2 - Annabelle Hoffman (Sauk Valley WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Rosemary Hileman (AJ Jr. Wildcats WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Alina Gomez (Oak Forest Warriors WC) received a bye   () Bye</li>\n<li>Champ. Round 2 -   () received a bye   () Bye</li>\n<li>Champ. Round 2 - Maggie Ortiz (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Abigail Cortez (Will County Warriors WC) received a bye   () Bye</li>\n<li>Champ. Round 2 -   () received a bye   () Bye</li>\n<li>Champ. Round 2 - Oakli Gorman (SJO Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>Champ. Round 2 -   () received a bye   () Bye</li>\n<li>Champ. Round 2 - Stella Eimer (TJ Trained Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 2 - Bailey Flanigan (Bulls WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Sophia Olandese (Wheaton WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Jayla Godina (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Rayelynn Hartmann (Tiger Town Tanglers WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Adelle Dunaway (St. Charles WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Marli Cobbs (Belleville Little Devils WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>Champ. Round 2 - Mayleigh Bly (Shelbyville Jr. Wrestling Rams) won by fall over Aubree Anderson (Crosstown Spartan Elite WC) Fall 2:53</li>\n<li>Champ. Round 2 - Elizabeth Agajanian (Sandwich WC) won by major decision over Veda Bailey (Warriors Wrestling Academy) Maj 11-2</li>\n<li>Champ. Round 2 - Saige Danneberger (Shelbyville Jr. Wrestling Rams) won by decision over Henley Hawthorne (Granite City Wrestling Association) Dec 2-0</li>\n<li>Champ. Round 2 - Eliana Ortega (Beat the Streets Chicago-Midway) won by decision over Ava Willock (Rockets WC) Dec 2-0</li>\n<li>Champ. Round 2 - Aubrey Schmieding (O`Fallon Little Panthers WC) won by fall over Charlotte Baker (Dixon WC) Fall 2:48</li>\n<li>Champ. Round 2 - Carrie Larsen (Fox Lake WC) won by decision over Ivy Sullivan (Dixon WC) Dec 4-2</li>\n<li>Champ. Round 2 - Reese Davis (Spartan WC) won by fall over Kathlynn Sturhahn (Quincy Little Raiders WC) Fall 0:36</li>\n<li>Champ. Round 2 - Isabella Hudison (Bismarck-Henning Youth WC) won by fall over Grace Stoller (Clinton WC) Fall 0:40</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>Champ. Round 2 - Layla McFarland (Vandalia Jr WC) won by decision over Koralee Larkin (ISI WC) Dec 8-2</li>\n<li>Champ. Round 2 - Britton Miller (Sparta Junior Bulldogs WC) won by fall over Chyanne Lee (Will County Warriors WC) Fall 2:30</li>\n<li>Champ. Round 2 - Yaili Fortiz (Badger WC) won by fall over Izabella Gustafson (Sherrard Jr. Tigers WC) Fall 0:36</li>\n<li>Champ. Round 2 - Lila Carson (Antioch Predators WC) won by fall over Gabriella Garza (Carbondale WC) Fall 1:48</li>\n<li>Champ. Round 2 - Kaylee Lapitan (Batavia WC) won by fall over Mia Cervone (Red Raiders Wrestling Team) Fall 0:34</li>\n<li>Champ. Round 2 - Zoe Atwell (Callan Wrestling Academy) won by decision over Hazel Bliss (Gladiator Elite WC) Dec 8-2</li>\n<li>Champ. Round 2 - Layla Giertych (nWo WC) won by decision over Fiona O`Connor (Rockets WC) Dec 6-0</li>\n<li>Champ. Round 2 - Jaylie Lackey (Lawrence County Knights WC) won by decision over Piper Mashburn (SOT-C) Dec 9-2</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>Champ. Round 2 - Evelyn Koulis (Demolition WC) won by major decision over Genevieve Howe (Metamora Kids WC) Maj 12-1</li>\n<li>Champ. Round 2 - Maddy Choate (Trico WC) won by decision over Chevi Sanchez (Champaign WC) Dec 7-2</li>\n<li>Champ. Round 2 - Julianna Oceguera (Downers Grove WC) won by decision over Merida Paddock (Antioch Predators WC) Dec 3-0</li>\n<li>Champ. Round 2 - Adriana Ragona (Built By Brunson Wrestling) won by tech fall over HenLeigh Munz (Sauk Valley WC) TF 15-0</li>\n<li>Champ. Round 2 - Pamella Salazar (McHenry WC) won by major decision over Brenna Skinner (Maine Eagles WC) Maj 12-2</li>\n<li>Champ. Round 2 - Hadley Aeschliman (Metamora Kids WC) won by fall over Emersyn McCabe (Villa Park Young Warriors WC) Fall 0:30</li>\n<li>Champ. Round 2 - Jordan Qualkinbush (Beat the Streets Chicago-Avondale) won by decision over Ellie Klein (West Suburban Girls WC) Dec 11-4</li>\n<li>Champ. Round 2 - Brynlee Jones (Falcon Youth Wrestling) won by fall over Ally Atzman (Orland Park Pioneers WC) Fall 2:51</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>Champ. Round 2 - Ellyana Piper (Little Giants WC) won by fall over Gemma Luebke (Woodstock Cyclones WC) Fall 1:11</li>\n<li>Champ. Round 2 - Kylie Kasprak (LaSalle Peru Crunching Cavs Youth WC) won by fall over Olivia Hruska (Antioch Predators WC) Fall 0:54</li>\n<li>Champ. Round 2 - Leila Linton (Force Elite WC) won by fall over Alexi Carrasco (Caravan Kids WC) Fall 0:51</li>\n<li>Champ. Round 2 - Norah Shick (Lawrence County Knights WC) won by fall over Ella Deterding (Sparta Junior Bulldogs WC) Fall 0:48</li>\n<li>Champ. Round 2 - Kolbie Ervin (Sandwich WC) won by fall over Andie Anderson (St. Charles WC) Fall 1:47</li>\n<li>Champ. Round 2 - Nichole Gaskill (Elk Grove Junior Grens WC) won by decision over Kinsley Bratcher (Southern Illinois Bulldogs WC) Dec 2-1</li>\n<li>Champ. Round 2 - Kynlea Doehring (Vandalia Jr WC) won by fall over Dai Zaria Christopher (Astro WC) Fall 1:40</li>\n<li>Champ. Round 2 - Taylinn Young (Rantoul Youth Wrestling) won by decision over Raya Reading (Little Giants WC) Dec 10-3</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>Champ. Round 2 - Braelyn Bunting (Falcon Youth Wrestling) won by tech fall over Kaylie Chmura (Frankfort Gladiator Wrestling) TF 15-0</li>\n<li>Champ. Round 2 - Zoey Barber (Dixon WC) won by decision over Emerson Seaton (Collinsville WC) Dec 5-4</li>\n<li>Champ. Round 2 - Adair Lawrence (O`Fallon Little Panthers WC) won by decision over Kenley Sondgeroth (West Suburban Girls WC) Dec 2-0</li>\n<li>Champ. Round 2 - Kourtney Kanallakan (Edwardsville WC) won by injury default over Delaney Maloney (Tinley Park Bulldogs WC) Inj. 0:00</li>\n<li>Champ. Round 2 - Avi Linhorst (Edwardsville WC) won by fall over Anastasia Rucinski (Tiger Town Tanglers WC) Fall 0:42</li>\n<li>Champ. Round 2 - Kaitlyn Riley (P3 Warrior Wrestling Academy) won by decision over Irene Buzick (Midwest Central Youth WC) Dec 8-2</li>\n<li>Champ. Round 2 - Madelynn Wiebenga (Sauk Valley WC) won by decision over Harper Norris (McHenry WC) Dec 5-2</li>\n<li>Champ. Round 2 - Ella Anderson (Rochelle Wrestling Club) won by fall over Bristol Larson (Demolition WC) Fall 1:23</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>Champ. Round 2 - Annebelle Duller (Stateline Stingers WC) won by fall over Brinley Johnson (Westville WC) Fall 2:58</li>\n<li>Champ. Round 2 - Alayna Oakman (East Peoria River Bandits Wrestling) won by decision over Audriana Herzog (Marengo Youth WC) Dec 11-4</li>\n<li>Champ. Round 2 - Emilee Meier (Belleville Little Devils WC) won by fall over Evangelina Guzman (Will County Warriors WC) Fall 0:24</li>\n<li>Champ. Round 2 - Chloey McBride (Oak Forest Warriors WC) won by major decision over Aria Torres (West Suburban Girls WC) Maj 8-0</li>\n<li>Champ. Round 2 - Mya McDonald (Demolition WC) won by decision over Carly Maloney (Tinley Park Bulldogs WC) Dec 4-0</li>\n<li>Champ. Round 2 - Francesca Yurs (ISI WC) won by tech fall over Myka Roberts (TJ Trained Wrestling) TF 15-0</li>\n<li>Champ. Round 2 - Afton Wininger (West Frankfort Jr. Redbirds WC) won by fall over Maya Moore (West Suburban Girls WC) Fall 0:51</li>\n<li>Champ. Round 2 - Katy Nichols (Cumberland Youth WC) won by fall over Kaylee Koller (Badger WC) Fall 2:38</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>Champ. Round 2 - Dorothy Radtke (Doom Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 2 - Presley Parker (Jr Maroons WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Alexa Nunn (Beat the Streets Chicago-Oak Park) won by fall over Azlynn Wilson (Benton WC) Fall 1:46</li>\n<li>Champ. Round 2 - Blakleigh Foust (Peoria Razorbacks WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Chloe Altgilbers (Vandalia Jr WC) won by fall over Collins Miller (LaSalle Peru Crunching Cavs Youth WC) Fall 0:28</li>\n<li>Champ. Round 2 - Cassie Tolliver (Springs Elite WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Reese Vest (Harvard WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Rosie Inman (Bismarck-Henning Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>Champ. Round 2 - Vincent Zalapi (Antioch Predators WC) won by decision over Kane Deal (SOT-C) Dec 6-0</li>\n<li>Champ. Round 2 - Darek Diaz (ISI WC) won by decision over Hudsyn Pfanz (TJ Trained Wrestling) Dec 6-1</li>\n<li>Champ. Round 2 - Degan Stulce (Southern Illinois Bulldogs WC) won by decision over Maxwell Fauth (Lions WC) Dec 6-2</li>\n<li>Champ. Round 2 - Colton Copstead (St. Charles WC) won by fall over Walker Kelley (Champions WC) Fall 2:29</li>\n<li>Champ. Round 2 - Hayden Bushue (Effingham Youth WC) won by decision over Emmett Fobert (Moline WC) Dec 4-0</li>\n<li>Champ. Round 2 - Jack Donnelly (Tinley Park Bulldogs WC) won by decision over Diego Garcia (North Boone WC) Dec 3-0</li>\n<li>Champ. Round 2 - Maxwell Berner (Lincoln-Way WC) won by decision over Terrell Crowcroft (Spartan WC) Dec 9-2</li>\n<li>Champ. Round 2 - Liam Butts (SJO Youth WC) won by fall over Derek Hayes (SCN Youth WC) Fall 1:53</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>Champ. Round 2 - Grayden Schloemann (Southern Illinois Bulldogs WC) won by decision over Tom Toledo (Demolition WC) Dec 4-0</li>\n<li>Champ. Round 2 - Owen Slabaugh (Alber Athletics WC) won by major decision over Braxton Baum (SCN Youth WC) Maj 9-0</li>\n<li>Champ. Round 2 - Drake Melton (Backyard Brawlers West Wrestling) won by decision over Achilles Cortese (Cortese WC) Dec 10-4</li>\n<li>Champ. Round 2 - Immanuel Morales (Englewood Live Wire WC) won by major decision over Brennan Caruso (McHenry WC) Maj 9-1</li>\n<li>Champ. Round 2 - Lorenzo Caponigri (Headlock Wrestling Academy) won by major decision over Jack DeGroot (Sauk Valley WC) Maj 11-1</li>\n<li>Champ. Round 2 - Ethan Wagner (Alber Athletics WC) won by major decision over Chase Pool (Glenbard East Jr Rams WC) Maj 8-0</li>\n<li>Champ. Round 2 - Mason Akileh (Little Celtic WC) won by decision over Karson Nietzel (Rocket Fuel WC) Dec 9-2</li>\n<li>Champ. Round 2 - Karson Stoeckel (Bulls WC) won by decision over Josiah Callahan (Clinton WC) Dec 6-2</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>Champ. Round 2 - Paxson Minkie (Alber Athletics WC) won by decision over Easton Poss (Yorkville WC) Dec 4-1</li>\n<li>Champ. Round 2 - William Plumb (SCN Youth WC) won by major decision over Henry Bansley (Panther WC) Maj 9-0</li>\n<li>Champ. Round 2 - Ryder Little (Central Illinois Bulldogs WC) won by decision over Emiliano Cid (Toss Em Up Wrestling Academy) Dec 7-2</li>\n<li>Champ. Round 2 - Jayse Amico (Force Elite WC) won by decision over Jordan Easton (Springs Elite WC) Dec 4-1</li>\n<li>Champ. Round 2 - Ryland Brazel (Mustang WC) won by decision over Michael Fangerow (Lincoln-Way WC) Dec 5-2</li>\n<li>Champ. Round 2 - Tate Adamson (SCN Youth WC) won by decision over Jeffrey Forsberg (Wolves WC) Dec 8-3</li>\n<li>Champ. Round 2 - Wyatt McClain (Demolition WC) won by decision over Quinten Shaffer (Lawrence County Knights WC) Dec 9-4</li>\n<li>Champ. Round 2 - Jack Wachstetter (Backyard Brawlers Midwest) won by decision over Weston Brom (Fox Valley WC) Dec 4-0</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>Champ. Round 2 - Malik Mayfield (Toss Em Up Wrestling Academy) won by fall over Will Gallo (SJO Youth WC) Fall 2:15</li>\n<li>Champ. Round 2 - Scott Kilmer (Lion`s Den Wrestling Academy) won by major decision over Eli Zimmerman (Lockport Junior Porters WC) Maj 11-0</li>\n<li>Champ. Round 2 - Nico Distasio (Lemont Bears WC) won by injury default over Sloan Sears (PSF Wrestling Academy) Inj. 2:00</li>\n<li>Champ. Round 2 - Maddox Noonan (Ottawa Wolfpack WC) won by decision over Lane Graybill (Dakota WC) Dec 1-0</li>\n<li>Champ. Round 2 - Charlie Blake (Panther WC) won by fall over Drake Fahnestock (Blue Line Training Academy) Fall 3:00</li>\n<li>Champ. Round 2 - Connor Johnson (Fox Valley WC) won by fall over Derek Keller (Crystal Lake Wizards WC) Fall 2:32</li>\n<li>Champ. Round 2 - Augustine Kirk (Vandalia Jr WC) won by fall over Jordy Teran (Alber Athletics WC) Fall 0:47</li>\n<li>Champ. Round 2 - Kasen Cargo (Backyard Brawlers Midwest) won by major decision over Lawson Lokanc (Lincoln-Way WC) Maj 11-0</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>Champ. Round 2 - Jaxon Sullivan (Antioch Predators WC) won by decision over Caiden Lehman (Beat the Streets Chicago-Midway) Dec 4-2</li>\n<li>Champ. Round 2 - Oz Bellamy (Force Elite WC) won by major decision over Neklous Jones (Alber Athletics WC) Maj 8-0</li>\n<li>Champ. Round 2 - Bennett Ledbetter (Assumption Elite WC) won by decision over Ben Gellings (Barrington Broncos WC) Dec 6-0</li>\n<li>Champ. Round 2 - Dominic Warner (Harlem Huskies WC) won by major decision over Paxton Hoffman (Southern Illinois Bulldogs WC) Maj 10-1</li>\n<li>Champ. Round 2 - Gionni Zapf (Alber Athletics WC) won by decision over Ryker Gladson (Murphysboro Wrestling) Dec 5-1</li>\n<li>Champ. Round 2 - Cayson Rogers (Lincoln-Way WC) won by decision over Hudson Ludwig (SCN Youth WC) Dec 5-1</li>\n<li>Champ. Round 2 - Iaromir Zhukovskii (Built By Brunson Wrestling) won by fall over Jogan Lazenby (Southern Illinois Bulldogs WC) Fall 0:56</li>\n<li>Champ. Round 2 - Braden Larson (TJ Trained-Springfield Wrestling) won by decision over Dominic Doljanin (Tinley Park Bulldogs WC) Dec 6-1</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>Champ. Round 2 - Cash Lucas (Ottawa Wolfpack WC) won by decision over Luke Sponsel (Arlington Cardinals WC) Dec 5-1</li>\n<li>Champ. Round 2 - Eden Hickman (Bulls WC) won by major decision over Quinlan Leyden (Little Celtic WC) Maj 11-1</li>\n<li>Champ. Round 2 - Mincere White (Springs Elite WC) won by fall over Gideon Ayers (ISI WC) Fall 2:25</li>\n<li>Champ. Round 2 - Wyatt Walker (Batavia WC) won by fall over Landon Delisi (Built By Brunson Wrestling) Fall 3:59</li>\n<li>Champ. Round 2 - Kaleb Hollins (Vittum Cats WC) won by decision over Jerry Fialka (Martinez Fox Valley Elite WC) Dec 7-2</li>\n<li>Champ. Round 2 - Ricky Olszta Jr (Lincoln-Way WC) won by decision over Damoni Ford (PSF Wrestling Academy) Dec 4-2</li>\n<li>Champ. Round 2 - Vladimir Dvoryannikov (Built By Brunson Wrestling) won by decision over Cole Kiel (Edwardsville WC) Dec 8-2</li>\n<li>Champ. Round 2 - Ramel Jones (Hoopeston Area Youth Wrestling) won by fall over Austin Villarreal (nWo WC) Fall 2:50</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>Champ. Round 2 - William Connors (Alber Athletics WC) won by fall over Gavin Lange (Falcon Youth Wrestling) Fall 1:25</li>\n<li>Champ. Round 2 - Easton Tolley (Granite City Wrestling Association) won by fall over Frank Ariola (SCN Youth WC) Fall 1:46</li>\n<li>Champ. Round 2 - William Perek (Mustang WC) won by decision over Mauricio Hueramo (Reed Custer Jr. Panthers WC) Dec 5-2</li>\n<li>Champ. Round 2 - Colton Zabinski (Backyard Brawlers North Wrestling) won by fall over Sami Abuarqoub (Greg Gomez Trained Wrestling) Fall 2:35</li>\n<li>Champ. Round 2 - Bryson Wilkinson (SCN Youth WC) won by fall over Michael Burns (Beat the Streets Chicago-Oak Park) Fall 0:56</li>\n<li>Champ. Round 2 - Declan McNulty (Demolition WC) won by major decision over Lyeden Hankins (Highland Bulldog Jr. WC) Maj 15-2</li>\n<li>Champ. Round 2 - Brady Gamage (Macomb Little Bombers Wrestling) won by fall over Hayes Kustok (Evanston School of Wrestling) Fall 2:46</li>\n<li>Champ. Round 2 - Chase Gorman (SJO Youth WC) won by fall over Konner Davis (Olney Cubs WC) Fall 0:54</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>Champ. Round 2 - Beckett McKay (Tinley Park Bulldogs WC) won by decision over Odysseus Hale (Midwest Central Youth WC) Dec 5-2</li>\n<li>Champ. Round 2 - Maddox Birchler (Sparta Junior Bulldogs WC) won by fall over Quinn McCrum (MadDog Wrestling Academy) Fall 2:16</li>\n<li>Champ. Round 2 - Amro Abuarqoub (Greg Gomez Trained Wrestling) won by fall over Cooper Shepard (Cumberland Youth WC) Fall 2:38</li>\n<li>Champ. Round 2 - Gunner Latarewicz (Demolition WC) won by major decision over Maxwell Robertson (nWo WC) Maj 8-0</li>\n<li>Champ. Round 2 - Caleb Weaver (Demolition WC) won by decision over Levi Stott (Hononegah WC) Dec 5-1</li>\n<li>Champ. Round 2 - William Dunn (Beat the Streets Chicago-Midway) won by decision over Liam Lane (Bulls WC) Dec 3-2</li>\n<li>Champ. Round 2 - Marcelo Villarreal (Sandwich WC) won by decision over Cameron Gillie (SCN Youth WC) Dec 5-4</li>\n<li>Champ. Round 2 - Jordan Thompson (Lincoln-Way WC) won by major decision over Payt Titus (Mattoon Youth WC) Maj 8-0</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>Champ. Round 2 - Wyatt Muetze (St. Charles WC) won by fall over Grady Gallagher (Monticello Youth WC) Fall 0:21</li>\n<li>Champ. Round 2 - Mario Montalto (Lemont Bears WC) won by fall over Terrel Hinton (Toss Em Up Wrestling Academy) Fall 1:43</li>\n<li>Champ. Round 2 - Ace Earlywine (Dakota WC) won by fall over Rhett Bramley (Iguana WC) Fall 1:54</li>\n<li>Champ. Round 2 - Michael Tasnic (Force Elite WC) won by fall over Kaiden Miller (Dubtown WC) Fall 0:29</li>\n<li>Champ. Round 2 - Nicholas Finan (Demolition WC) won by decision over Draven Bock (Hawk WC) Dec 7-0</li>\n<li>Champ. Round 2 - Louis Baxton (Bulls WC) won by fall over Tiernan Devlin (Glen Ellyn Dungeon WC) Fall 1:54</li>\n<li>Champ. Round 2 - Brayden Behn (Du-Pec WC) won in tie breaker - 1 over Liam Simon (Oak Forest Warriors WC) TB-1 4-2</li>\n<li>Champ. Round 2 - Cash Brown (Bismarck-Henning Youth WC) won by fall over Nikolas Panayi (Arlington Cardinals WC) Fall 2:48</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>Champ. Round 2 - Canyon Fillers (Alber Athletics WC) won by fall over Luke Wagner (SJO Youth WC) Fall 0:34</li>\n<li>Champ. Round 2 - Brendan Beidler (Notre Dame WC) won by decision over Brycen Miller (LaSalle Peru Crunching Cavs Youth WC) Dec 6-0</li>\n<li>Champ. Round 2 - Jack Wiatr (Lemont Bears WC) won by fall over John Gavoni (Lockport Junior Porters WC) Fall 2:50</li>\n<li>Champ. Round 2 - Jack Kosobucki (Arlington Cardinals WC) won by decision over Easton Meyers (Southern Illinois Bulldogs WC) Dec 4-2</li>\n<li>Champ. Round 2 - Dominic Englese (St. Charles WC) won by fall over Michael Hammer (Demolition WC) Fall 2:50</li>\n<li>Champ. Round 2 - Oliver Schaps (Junior Titans Wrestling) won by decision over Everett Lehr (Wolves WC) Dec 7-3</li>\n<li>Champ. Round 2 - Victor Vargas (Beat the Streets Chicago-Oak Park) won by decision over Matthew Smith (Benton WC) Dec 3-2</li>\n<li>Champ. Round 2 - Xavier Briggs (Storm Youth WC) won by fall over Armani Renteria (Harvard WC) Fall 0:46</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>Champ. Round 2 - Declan Trotter (Lincoln-Way WC) won by fall over Blaine Drake (The Law WC) Fall 0:47</li>\n<li>Champ. Round 2 - Caine Rogers (Fighting Farmers WC) won by decision over Liam Soutar (Bulldog Youth Sports Wrestling) Dec 5-1</li>\n<li>Champ. Round 2 - Cooper Wilson (SCN Youth WC) won by decision over Cleotha Spearman Lll (East St. Louis WC) Dec 11-4</li>\n<li>Champ. Round 2 - Joey Pauling (Mat Rat WC) won by major decision over Jamarion Bell (Englewood Live Wire WC) Maj 11-3</li>\n<li>Champ. Round 2 - Craig Jay (Vandalia Jr WC) won by fall over Mason Vargas (Beat the Streets Chicago-Midway) Fall 1:40</li>\n<li>Champ. Round 2 - Welles Projansky (Built By Brunson Wrestling) won by fall over Gabriel Musselman (Eureka WC) Fall 2:44</li>\n<li>Champ. Round 2 - Aydan Del Muro (nWo WC) won by fall over Hunter Champlain (Stillman Valley WC) Fall 2:42</li>\n<li>Champ. Round 2 - Colten Maness (Olympia WC) won by fall over Omar Tadros (Lockport Junior Porters WC) Fall 2:30</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>Champ. Round 2 - Eli Hill (SCN Youth WC) won by fall over Cayden Williams (Harvard WC) Fall 1:00</li>\n<li>Champ. Round 2 - Gavin Vogler (Oak Forest Warriors WC) won by decision over Chase Spradau (Yorkville WC) Dec 7-0</li>\n<li>Champ. Round 2 - Colt Edwards (Murphysboro Wrestling) won by decision over John Gehrig (Sycamore WC) Dec 3-0</li>\n<li>Champ. Round 2 - Bransyn VonBehren (Monticello Youth WC) won by fall over Donato Saaby (Headlock Wrestling Academy) Fall 1:43</li>\n<li>Champ. Round 2 - Larenzo Hunter (Will County Warriors WC) won by fall over Kameron Davis (Granite City Wrestling Association) Fall 0:44</li>\n<li>Champ. Round 2 - Weston Guerra (Little Giants WC) won by decision over Reid Archer (Oswego WC) Dec 8-5</li>\n<li>Champ. Round 2 - Jacob Hernandez (Harvard WC) won by fall over Ethan Pellizzari (Hinsdale Red Devil WC) Fall 2:59</li>\n<li>Champ. Round 2 - Markel Davey (Champaign WC) won by fall over Carson Mongare (Edwardsville WC) Fall 1:15</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>Champ. Round 2 - Henry Thoms (Salem WC) won by fall over John Jones (Granite City Wrestling Association) Fall 0:19</li>\n<li>Champ. Round 2 - Landry Agney (Shelbyville Jr. Wrestling Rams) won by fall over Henry Brown Iii (Harvey Twisters WC) Fall 0:27</li>\n<li>Champ. Round 2 - Isaiah Jackson (Demolition WC) won by fall over Adreice Russell (Rantoul Youth Wrestling) Fall 1:29</li>\n<li>Champ. Round 2 - Joe Burman (Antioch Predators WC) won by decision over Wyatt Miller (Monticello Youth WC) Dec 2-1</li>\n<li>Champ. Round 2 - Leo Floreani (MadDog Wrestling Academy) won by fall over Brentlee Jones (Jacksonville Area Wrestling) Fall 0:22</li>\n<li>Champ. Round 2 - Ulises Sanchez (Doom Wrestling) won by fall over Henry Miller (Warriors Wrestling Academy) Fall 0:58</li>\n<li>Champ. Round 2 - Martin Wilson (Force Elite WC) won by decision over Patrick Brennan (St. Charles WC) Dec 9-6</li>\n<li>Champ. Round 2 - Trace Young (Monticello Youth WC) won by fall over Jack Harper (Jacksonville Area Wrestling) Fall 1:28</li>\n</ul>\n</section>",
  "Consolation 2nd Round": "<section class=\"tw-list\">\n<h1>Consolation 2nd Round</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Georgia Blayney (DC WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>Cons. Round 2 - Bethany Schroer (East Peoria River Bandits Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Erin Brophy (Lions WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Gemma Wagner (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>Cons. Round 2 - Khloe Dominguez (DeKalb WC) won by major decision over Kayelyn Lee (SJO Youth WC) Maj 16-7</li>\n<li>Cons. Round 2 - Ryan Donnelly (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Khloe McCaslin (Sandwich WC) won by tech fall over Dalilah Fair (Mt. Zion Kids WC) TF 16-1</li>\n<li>Cons. Round 2 - Jesse Skelton (Eureka WC) won by decision over Noviana Celestino (Sauk Valley WC) Dec 6-2</li>\n<li>Cons. Round 2 - Cambrie Gianokis (Mat Rat WC) won by fall over Madelyn Lavery (Tinley Park Bulldogs WC) Fall 1:15</li>\n<li>Cons. Round 2 - Gemma Benning (Belvidere Bandits WC) won by decision over Genevieve Augle (Tinley Park Bulldogs WC) Dec 7-5</li>\n<li>Cons. Round 2 - Mia Lopez (West Suburban Girls WC) won by tech fall over Jackie Glenzinski (Doom Wrestling) TF 17-1</li>\n<li>Cons. Round 2 - Grace Sinks (TJ Trained Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>Cons. Round 2 - Tinliee Sullivan (Westville WC) won by fall over Autumn Dixon (Camp Point Youth Wrestling) Fall 1:23</li>\n<li>Cons. Round 2 - Alyce Stone (Glenbard East Jr Rams WC) won by fall over Allie Sheets (Monticello Youth WC) Fall 0:21</li>\n<li>Cons. Round 2 - Chelsea Price (Demolition WC) won by fall over Lucy Carson (Antioch Predators WC) Fall 1:33</li>\n<li>Cons. Round 2 - Norah Doyle (Vandalia Jr WC) won by fall over Amelia Buckley (SJO Youth WC) Fall 0:54</li>\n<li>Cons. Round 2 - Awbree Corson (Stillman Valley WC) won by decision over Eiselee Hrascinski (Tinley Park Bulldogs WC) Dec 8-5</li>\n<li>Cons. Round 2 - Genevieve Del Muro (nWo WC) won by major decision over Julia Solberg (Batavia WC) Maj 10-0</li>\n<li>Cons. Round 2 - Adalyn Albavera (Stallions Wrestling Academy) won by fall over Sofia Norwood (Team Mascoutah WC) Fall 0:50</li>\n<li>Cons. Round 2 - Kamilla Ulaszek (Orland Park Pioneers WC) won by forfeit over Kaylynn Goetz (Mt. Zion Kids WC) FF</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>Cons. Round 2 - Makenna Austra (Bulls WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Liberty House (Rockford WC) won by medical forfeit over Drew Schau (Tinley Park Bulldogs WC) MFF</li>\n<li>Cons. Round 2 - Mia MeGee (Quincy Little Raiders WC) won by fall over Hilal Nafisa Saleem (Caravan Kids WC) Fall 1:24</li>\n<li>Cons. Round 2 - Esmeralda Gaytan (Evanston School of Wrestling) won in sudden victory - 1 over Paisley Raikes (Ottawa Wolfpack WC) SV-1 7-5</li>\n<li>Cons. Round 2 - Piper Heisler (Mat Rat WC) won by decision over Phoebe Koning (Cardinals WC) Dec 7-4</li>\n<li>Cons. Round 2 - Abigail Jahnel (Unity Youth WC) won by fall over Charlotte Leopold (Belvidere Bandits WC) Fall 0:31</li>\n<li>Cons. Round 2 - Piper Angel (Clinton WC) won by fall over Isabella Martinez (Tribe WC) Fall 0:15</li>\n<li>Cons. Round 2 - Tilly Potocsnak (Lockport Junior Porters WC) won by decision over Evelyn Charlton (Lockport Junior Porters WC) Dec 3-1</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>Cons. Round 2 - Natalya Moberg (Rochelle Wrestling Club) won by fall over Lucy Cox (Tinley Park Bulldogs WC) Fall 0:43</li>\n<li>Cons. Round 2 - Brooklyn McGreehin (Peotone Little Devils WC) won by fall over Brielle Gumm (East Peoria River Bandits Wrestling) Fall 1:00</li>\n<li>Cons. Round 2 - Alaina Linton (Oakwood Youth WC) won by fall over Melanie Mendez (Crosstown Spartan Elite WC) Fall 2:53</li>\n<li>Cons. Round 2 - Kaylee Carney (Macomb Little Bombers Wrestling) won by major decision over Lainey Brugger (Harvard WC) Maj 14-0</li>\n<li>Cons. Round 2 - Isabella Schoenemann (Orland Park Pioneers WC) won by decision over Natalie Strange (Lawrence County Knights WC) Dec 8-7</li>\n<li>Cons. Round 2 - Zora Goebel (The Law WC) won by fall over Hiro Martinez (Evanston School of Wrestling) Fall 0:22</li>\n<li>Cons. Round 2 - Jaeda Lewis (Peoria Razorbacks WC) won by fall over McKenzie Klug (Wolfpak WC) Fall 2:31</li>\n<li>Cons. Round 2 - Kinzleigh Kopka (DeKalb WC) won by decision over Saphira Kamplain (Crawford County WC) Dec 2-0</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>Cons. Round 2 - Raiza LeCompte (Tinley Park Bulldogs WC) won by fall over Emily Lewis (Yorkville WC) Fall 0:30</li>\n<li>Cons. Round 2 - Anderson Cherry (Mat Rat WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Brinley Wrage (Stillman Valley WC) won by tech fall over Micaela Lopez (Clipper WC) TF 16-0</li>\n<li>Cons. Round 2 - Camila Rodriguez (Beat the Streets Chicago-Midway) received a bye   () Bye</li>\n<li>Cons. Round 2 - Olivia Werner (Lion`s Den Wrestling Academy) won by decision over Jocelyn Zicatl (Bulldog Elite WC) Dec 4-0</li>\n<li>Cons. Round 2 - Mercy Lower (Tiger Town Tanglers WC) won by decision over Baylee Grimes (Reed Custer Jr. Panthers WC) Dec 5-0</li>\n<li>Cons. Round 2 - Whitney Wood (Peoria Wizards WC) won by fall over Kaitlyn Lewis (Yorkville WC) Fall 1:59</li>\n<li>Cons. Round 2 - Jenna Alsbury (Wilmington WC) won by fall over Chloe Finnegan (Belvidere Bandits WC) Fall 0:46</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>Cons. Round 2 - Aryana Resendez (Rochelle Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 2 - Genesis Green (Vandalia Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Lanna Learch (Belvidere Bandits WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Kinley Hendricks (El Paso Gridley Youth WC) won by fall over Genevieve Jones (Granite City Wrestling Association) Fall 0:26</li>\n<li>Cons. Round 2 - Makaya Linville (Tiger Elite Wrestling Inc) received a bye   () Bye</li>\n<li>Cons. Round 2 - Kimberlyn McGrown (Danville Chargers WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Erin Wells (Taylorville WC) won by fall over MacKenzie Phelps (Spartan WC) Fall 0:56</li>\n<li>Cons. Round 2 - Charlotte Mathias (Warrensburg-Latham Jr. Cardinals WC) received a bye   () Bye</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>Cons. Round 2 - Joseph Salzman (Lincoln-Way WC) won by decision over Jayce Moon (Demolition WC) Dec 3-0</li>\n<li>Cons. Round 2 - Asher Sefton (Vandalia Jr WC) won by fall over Chase Ebert (Morris WC) Fall 1:51</li>\n<li>Cons. Round 2 - Daniel Garcia (Callan Wrestling Academy) won by fall over Sam Smith (Stockton Renegades WC) Fall 2:26</li>\n<li>Cons. Round 2 - Maddux Bartels (Morris WC) won by decision over Tristan Atkins (Lawrence County Knights WC) Dec 6-4</li>\n<li>Cons. Round 2 - Calvin Grant (Urbana Tigers WC) won by fall over Gerald Spangler (Collinsville WC) Fall 0:22</li>\n<li>Cons. Round 2 - Charles McGlennon (Lemont Bears WC) won by fall over David Kalmanovsky (Built By Brunson Wrestling) Fall 0:47</li>\n<li>Cons. Round 2 - Liam Ross (Stillman Valley WC) won by fall over Elijah Newbold (Marengo Youth WC) Fall 2:48</li>\n<li>Cons. Round 2 - Alexi Stellatos (Junior Titans Wrestling) won by decision over Julian Ramos (Headlock Wrestling Academy) Dec 7-5</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>Cons. Round 2 - Trevor Kasky (Gladiator Elite WC) won by major decision over Brayden Smith (Frankfort Gladiator Wrestling) Maj 12-3</li>\n<li>Cons. Round 2 - Jaxtyn LeConte (Rockford WC) won by decision over Emery Thompson (Lincoln-Way WC) Dec 5-4</li>\n<li>Cons. Round 2 - Cohen Frederick (Belvidere Bandits WC) won by major decision over Kolton Orrick (Iguana WC) Maj 8-0</li>\n<li>Cons. Round 2 - Graham Terry (River Bend WC) won by decision over Omar Salah (Frankfort Wildcats Wrestling) Dec 9-3</li>\n<li>Cons. Round 2 - Darian Keller (Crystal Lake Wizards WC) won by decision over Kyle Nickson (Caravan Kids WC) Dec 7-0</li>\n<li>Cons. Round 2 - Jamerson Bloodworth (Gladiator Elite WC) won by decision over Jace Young (Sandwich WC) Dec 4-2</li>\n<li>Cons. Round 2 - Dallas Morales (Scorpion WC) won by major decision over Levi Mata (Cory Clark Wrestling) Maj 13-3</li>\n<li>Cons. Round 2 - Jameson Chapman (Gladiator Elite WC) won by fall over Daniel Johnson (Tinley Park Bulldogs WC) Fall 0:37</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>Cons. Round 2 - Abrahm Leingang (Sherrard Jr. Tigers WC) won by fall over Rhett White (Roxana WC) Fall 0:50</li>\n<li>Cons. Round 2 - Aaron Jones (Springs Elite WC) won in sudden victory - 1 over Vincent Dean (Aces WC) SV-1 11-9</li>\n<li>Cons. Round 2 - Jack Newsom (Cory Clark Wrestling) won by fall over Asher Thompson (SJO Youth WC) Fall 2:47</li>\n<li>Cons. Round 2 - Jack Kappas (Lemont Bears WC) won by decision over Shane McGinnis (Frankfort Wildcats Wrestling) Dec 8-4</li>\n<li>Cons. Round 2 - Tre`Lyn Morrow (Crystal Lake Wizards WC) won by decision over Krew Raines (Sandwich WC) Dec 5-4</li>\n<li>Cons. Round 2 - Anthony Losurdo (Wolfpak WC) won by decision over Elijah Fay (Bulls WC) Dec 4-3</li>\n<li>Cons. Round 2 - Mason Manning (Lincoln-Way WC) won by decision over Karter Neal (Storm Youth WC) Dec 9-6</li>\n<li>Cons. Round 2 - Boston Blakely (Alber Athletics WC) won by decision over Darian Martinez-Williams (Greg Gomez Trained Wrestling) Dec 6-4</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>Cons. Round 2 - Lane Kesler (Fisher WC) won by decision over Rowan Harsted (Ottawa Wolfpack WC) Dec 7-5</li>\n<li>Cons. Round 2 - Jt Tsokolas (Mustang WC) won by decision over Javier Aguilera (St. Charles WC) Dec 9-2</li>\n<li>Cons. Round 2 - Hiram Bulava (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jacob McMurray (Lions WC) won by decision over Oliver Garcia (St. Charles WC) Dec 3-1</li>\n<li>Cons. Round 2 - Jeremiah Hosman (Little Celtic WC) won by decision over Gabriel Torres (nWo WC) Dec 7-3</li>\n<li>Cons. Round 2 - Parker Lilas (Lemont Bears WC) won by decision over Joey Raimondi (Headlock Wrestling Academy) Dec 3-2</li>\n<li>Cons. Round 2 - Nolan Rodriguez (Riot Room Wrestling) won by decision over Kevin Ippolito (Crawford County WC) Dec 8-5</li>\n<li>Cons. Round 2 - Nico Poeta (Champaign WC) won by decision over Bennett Giffin (Reed Custer Jr. Panthers WC) Dec 4-2</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>Cons. Round 2 - Frankie Rivas (Lions WC) won by decision over Jack Lamb (SCN Youth WC) Dec 2-0</li>\n<li>Cons. Round 2 - Elijah Foss (Gladiator Elite WC) won by disqualification over Brody Connolly (Crystal Lake Wizards WC) DQ</li>\n<li>Cons. Round 2 - Jagger Burrell (Olympia WC) won by decision over Abram Schrand (Champions WC) Dec 6-5</li>\n<li>Cons. Round 2 - Jack Wood (Granite City Wrestling Association) won by major decision over Lucas Kavanagh (Wheaton WC) Maj 13-2</li>\n<li>Cons. Round 2 - Wells Millard (Rochelle Wrestling Club) won by fall over Declan O`Malley (Dinamo Wrestling) Fall 1:38</li>\n<li>Cons. Round 2 - David Bugrimov (Suplex WC) won by major decision over Kingston Smith (Thunder WC) Maj 8-0</li>\n<li>Cons. Round 2 - Abel Bochmann (Assumption Elite WC) won by fall over Lucian Holder (Frankfort Wildcats Wrestling) Fall 2:40</li>\n<li>Cons. Round 2 - Trecyn Holba (Frankfort Gladiator Wrestling) won by decision over Makar Pavlys (Suplex WC) Dec 6-5</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>Cons. Round 2 - Porfivio Celestino (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Vincent Jimenez (Crystal Lake Wizards WC) won by decision over Chase Nickson (Caravan Kids WC) Dec 6-4</li>\n<li>Cons. Round 2 - Easton Shinn (Southern Illinois Bulldogs WC) won by fall over Harte Burrell (Olympia WC) Fall 0:57</li>\n<li>Cons. Round 2 - Cooper Whaley (Rockford WC) won by major decision over Alex Todd (Mat Rat WC) Maj 12-0</li>\n<li>Cons. Round 2 - Jack Wishnevski (Cory Clark Wrestling) won by decision over Hunter Horne (Fox Valley WC) Dec 2-1</li>\n<li>Cons. Round 2 - Azerial Ramirez (Sauk Valley WC) won in sudden victory - 1 over Dennis LaMonte (Tinley Park Bulldogs WC) SV-1 2-0</li>\n<li>Cons. Round 2 - Madden Grieve (Highland Bulldog Jr. WC) won by fall over Jerome Rogers Iii (O`Fallon Little Panthers WC) Fall 2:48</li>\n<li>Cons. Round 2 - Easton Benyo (Sauk Valley WC) won by fall over Nicholas Smelko (Oswego WC) Fall 1:33</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>Cons. Round 2 - Cooper Alger-Scott (Taylorville WC) won by forfeit over Beau Beiler (Mt. Zion Kids WC) FF</li>\n<li>Cons. Round 2 - Zachary Haas (Naperville WC) won by fall over Cameron Thorman (Macomb Little Bombers Wrestling) Fall 1:31</li>\n<li>Cons. Round 2 - Benson Grugel (Stillman Valley WC) won by decision over Landon Punke (Morris WC) Dec 3-0</li>\n<li>Cons. Round 2 - Liam Santiago (Fox Valley WC) won by fall over Calvin Kreke (Decatur Dawgs WC) Fall 2:40</li>\n<li>Cons. Round 2 - Jackson Schaefer (Southside Outlaws WC) won by medical forfeit over Pryce Hendriksen (SCN Youth WC) MFF</li>\n<li>Cons. Round 2 - Lodi Morgan (Wilmington WC) won by fall over Dallas Shelton (Panther Powerhouse Wrestling) Fall 0:29</li>\n<li>Cons. Round 2 - Cassius House (Southern Illinois Bulldogs WC) won by decision over Jordan Caudill (Izzy Style Wrestling) Dec 4-0</li>\n<li>Cons. Round 2 - Drake Baker (Lawrence County Knights WC) won by decision over Cameron Willock (Rockets WC) Dec 2-0</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>Cons. Round 2 - Quinton Odonnell (Morris WC) won by major decision over Danny Strode (Demolition WC) Maj 10-0</li>\n<li>Cons. Round 2 - Mason Potts (Fox Lake WC) won by decision over Caladin Drake (The Law WC) Dec 7-5</li>\n<li>Cons. Round 2 - Jory Logan (Belleville Little Devils WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Emmett Berlin (Tiger Town Tanglers WC) won by decision over Silas Luke (Stockton Renegades WC) Dec 7-2</li>\n<li>Cons. Round 2 - Logan Shreve (PSF Wrestling Academy) won by fall over Donny Grieco (SCN Youth WC) Fall 1:57</li>\n<li>Cons. Round 2 - William Moore (Mustang WC) won by fall over Jackson Deering (Rockets WC) Fall 2:13</li>\n<li>Cons. Round 2 - Immanuel Hampton (Team Mascoutah WC) won by major decision over Thomas Mesch (SCN Youth WC) Maj 13-0</li>\n<li>Cons. Round 2 - Camden Willis (Vittum Cats WC) won by fall over Dawson Dyer (Mattoon Youth WC) Fall 1:53</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>Cons. Round 2 - Francesco Faso (Barrington Broncos WC) won by fall over Michael Patterson (Orland Park Pioneers WC) Fall 2:56</li>\n<li>Cons. Round 2 - Rhett Eastin (Olney Cubs WC) won in sudden victory - 1 over Julian Orozco (Beat the Streets Chicago-Midway) SV-1 5-3</li>\n<li>Cons. Round 2 - Abel Dickerson (Petersburg WC) won by fall over Noah Caputo (nWo WC) Fall 0:59</li>\n<li>Cons. Round 2 - Declan Wilking (Wilmington WC) won by fall over Cooper Lardi (Lil` Coalers WC) Fall 2:31</li>\n<li>Cons. Round 2 - Kaydin Feliciano (Beat the Streets Chicago-Avondale) won by decision over Chase Stroot (Team Mascoutah WC) Dec 8-4</li>\n<li>Cons. Round 2 - Ayden McAuliffe (Tinley Park Bulldogs WC) won by decision over Jaxon Holtzman (Downers Grove WC) Dec 9-2</li>\n<li>Cons. Round 2 - Connor Rech (Dinamo Wrestling) won by major decision over Jackson Doherty (Dragons Lair WC) Maj 11-0</li>\n<li>Cons. Round 2 - Benjamin Townsend (Wheaton WC) won by decision over Asher Anderson (St. Charles WC) Dec 1-0</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>Cons. Round 2 - Conrad Barber (Belvidere Bandits WC) won by major decision over Aedan Perez (Glenbard East Jr Rams WC) Maj 12-1</li>\n<li>Cons. Round 2 - Jake Meeks (Lawrence County Knights WC) won in sudden victory - 1 over David Harris (Toss Em Up Wrestling Academy) SV-1 4-2</li>\n<li>Cons. Round 2 - Vedder Anello (Mattoon Youth WC) won by decision over Kane Linneman (Harvard WC) Dec 8-2</li>\n<li>Cons. Round 2 - Joseph Oliver (Peotone Little Devils WC) won by fall over Rys Tijerina (St. Charles WC) Fall 2:37</li>\n<li>Cons. Round 2 - Joseph Keigher (Elk Grove Junior Grens WC) won by fall over Benson Housman (Macomb Little Bombers Wrestling) Fall 0:40</li>\n<li>Cons. Round 2 - Quinn Shelby (Little Celtic WC) won by decision over NyKel DeLoach (Lion`s Den Wrestling Academy) Dec 9-3</li>\n<li>Cons. Round 2 - Tyler Goble (Pekin Boys &amp; Girls Club) won by decision over Jaxson Pane (Peotone Little Devils WC) Dec 7-0</li>\n<li>Cons. Round 2 - Brevin Whipple (Du-Pec WC) won by decision over Hunter Voss (DC WC) Dec 7-3</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>Cons. Round 2 - Elliott Collins (DeKalb WC) won by decision over Gino DePaolo (Brawlers WC) Dec 8-7</li>\n<li>Cons. Round 2 - William Blomberg (Yorkville WC) won by decision over Kayden Sicka (Southern Illinois Bulldogs WC) Dec 11-5</li>\n<li>Cons. Round 2 - Brent Hills Ii (Champions WC) won by tech fall over Lincoln Stocks (Mt. Zion Kids WC) TF 20-5</li>\n<li>Cons. Round 2 - Declan Wargo (Crystal Lake Wizards WC) won by fall over Aiden Kalchbrenner (Panther WC) Fall 1:57</li>\n<li>Cons. Round 2 - Liam Fitzpatrick (Mustang WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Chase White (Jersey Junior Panthers Wrestling) won by fall over Michael Mucha (Little Celtic WC) Fall 2:35</li>\n<li>Cons. Round 2 - Liam Lee (Built By Brunson Wrestling) won by fall over Hawkins Edgcomb (SCN Youth WC) Fall 1:24</li>\n<li>Cons. Round 2 - Mackson Bruning (Panther Youth WC) won by decision over Malaci Hogan (Harvey Twisters WC) Dec 8-6</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>Cons. Round 2 - Christian Potts (Doom Wrestling) won by fall over Oliver Swallows (Prairie Central Youth Wrestling) Fall 0:34</li>\n<li>Cons. Round 2 - Giovanni Bolognini (Scorpion WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Noah Baltierrez (nWo WC) won by fall over Colton Sahlin (Yorkville WC) Fall 0:17</li>\n<li>Cons. Round 2 - Waylin Rogers (Vandalia Jr WC) won by fall over Keith Feriozzi (Decatur Dawgs WC) Fall 0:51</li>\n<li>Cons. Round 2 - Maverick Baker (Libertyville WC) won by decision over James Shibata (Barrington Broncos WC) Dec 5-3</li>\n<li>Cons. Round 2 - Braxton Slack (Belvidere Bandits WC) won by fall over Julian Alvarado (Batavia WC) Fall 0:57</li>\n<li>Cons. Round 2 - Anthony Poro (Arlington Cardinals WC) won by decision over Abel Orr (Champions WC) Dec 3-2</li>\n<li>Cons. Round 2 - Brock Harvey (Hononegah WC) won by decision over Jonah Findley (Salem WC) Dec 9-3</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>Cons. Round 2 - Pierce Spiller (Murphysboro Wrestling) won by major decision over Declan Guleserian (Fox Valley WC) Maj 12-3</li>\n<li>Cons. Round 2 - Anthony Coix (Batavia WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Roman Lucio (Badger WC) won by decision over William Ortiz (Fox Valley WC) Dec 5-1</li>\n<li>Cons. Round 2 - Axel Ramos (Toss Em Up Wrestling Academy) won by fall over Jackson Albright (Arlington Cardinals WC) Fall 0:37</li>\n<li>Cons. Round 2 - Joel Ware (Du-Pec WC) won by fall over Jonathan Winder (Jersey Junior Panthers Wrestling) Fall 0:22</li>\n<li>Cons. Round 2 - Lukas Martin (Lincoln Youth WC) won by fall over Charlie Redman (Brawlers WC) Fall 1:48</li>\n<li>Cons. Round 2 - Jake Pila (Vittum Cats WC) won by decision over Jacob Harris (Lil` Coalers WC) Dec 6-4</li>\n<li>Cons. Round 2 - Ethan Kennedy (Bulls WC) won by fall over Hunter Lindsey (Dwight WC) Fall 0:26</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>Cons. Round 2 - Grace Stoller (Clinton WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Kathlynn Sturhahn (Quincy Little Raiders WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Ivy Sullivan (Dixon WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Charlotte Baker (Dixon WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Ava Willock (Rockets WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Henley Hawthorne (Granite City Wrestling Association) won by major decision over Kyra Gibson (Tiger Town Tanglers WC) Maj 10-0</li>\n<li>Cons. Round 2 - Veda Bailey (Warriors Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 2 - Aubree Anderson (Crosstown Spartan Elite WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>Cons. Round 2 - Piper Mashburn (SOT-C) won by fall over Salem Harris (Champaign WC) Fall 2:22</li>\n<li>Cons. Round 2 - Fiona O`Connor (Rockets WC) won by fall over Jemalee Bertram (Clinton WC) Fall 0:31</li>\n<li>Cons. Round 2 - Hazel Bliss (Gladiator Elite WC) won by fall over Sophie Burke (Wilmington WC) Fall 0:19</li>\n<li>Cons. Round 2 - Mia Cervone (Red Raiders Wrestling Team) won by major decision over Johanna Daugherty (Taylorville WC) Maj 8-0</li>\n<li>Cons. Round 2 - Gabriella Garza (Carbondale WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Izabella Gustafson (Sherrard Jr. Tigers WC) won by major decision over Lily Beach (Hononegah WC) Maj 11-2</li>\n<li>Cons. Round 2 - Chyanne Lee (Will County Warriors WC) won by decision over Stella Roof (Clinton WC) Dec 6-4</li>\n<li>Cons. Round 2 - Koralee Larkin (ISI WC) won by fall over Madison Brophy (Lions WC) Fall 0:27</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>Cons. Round 2 - Ally Atzman (Orland Park Pioneers WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Ellie Klein (West Suburban Girls WC) won by fall over Kylie Paine (Taylorville WC) Fall 0:35</li>\n<li>Cons. Round 2 - Mylee Swaim (Oakwood Youth WC) won by major decision over Emersyn McCabe (Villa Park Young Warriors WC) Maj 11-0</li>\n<li>Cons. Round 2 - Brenna Skinner (Maine Eagles WC) won by fall over Zoey Houle (Lil Reaper WC) Fall 0:14</li>\n<li>Cons. Round 2 - HenLeigh Munz (Sauk Valley WC) won by fall over Emma Overman (Orland Park Pioneers WC) Fall 2:26</li>\n<li>Cons. Round 2 - Merida Paddock (Antioch Predators WC) won by decision over Marley Bradford (Lockport Junior Porters WC) Dec 6-0</li>\n<li>Cons. Round 2 - Chevi Sanchez (Champaign WC) won by decision over Brittany Milligan (Falcon Youth Wrestling) Dec 8-2</li>\n<li>Cons. Round 2 - Genevieve Howe (Metamora Kids WC) won by fall over Roxanne Houle (Lil Reaper WC) Fall 0:25</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>Cons. Round 2 - Raya Reading (Little Giants WC) won by major decision over Mia Dennison (Rochelle Wrestling Club) Maj 9-1</li>\n<li>Cons. Round 2 - Dai Zaria Christopher (Astro WC) won by decision over Lillian Trost (Oak Forest Warriors WC) Dec 4-0</li>\n<li>Cons. Round 2 - Kinsley Bratcher (Southern Illinois Bulldogs WC) won by fall over Gabriella Young (Hoopeston Area Youth Wrestling) Fall 0:25</li>\n<li>Cons. Round 2 - Andie Anderson (St. Charles WC) won by fall over Ariel Hinojosa (Antioch Predators WC) Fall 1:36</li>\n<li>Cons. Round 2 - Laura Allen (Wilmington WC) won by decision over Ella Deterding (Sparta Junior Bulldogs WC) Dec 8-6</li>\n<li>Cons. Round 2 - Alexi Carrasco (Caravan Kids WC) won by fall over Cheyenne Cervencik (Badger WC) Fall 0:27</li>\n<li>Cons. Round 2 - Olivia Hruska (Antioch Predators WC) won by fall over Isabella Eib (Demolition WC) Fall 0:57</li>\n<li>Cons. Round 2 - Grace McEnaney (McHenry WC) won by decision over Gemma Luebke (Woodstock Cyclones WC) Dec 1-0</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>Cons. Round 2 - Autumn Trowbridge (Highland Bulldog Jr. WC) won by decision over Bristol Larson (Demolition WC) Dec 9-3</li>\n<li>Cons. Round 2 - Harper Norris (McHenry WC) won by fall over Lilybell Valdez (Round Lake Jr. Panthers WC) Fall 2:09</li>\n<li>Cons. Round 2 - Irene Buzick (Midwest Central Youth WC) won by tech fall over Jenna Earles (MS Youth WC) TF 16-0</li>\n<li>Cons. Round 2 - Anastasia Rucinski (Tiger Town Tanglers WC) won by fall over Kylie Nagel (MadDog Wrestling Academy) Fall 1:17</li>\n<li>Cons. Round 2 - Delaney Maloney (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Kenley Sondgeroth (West Suburban Girls WC) won by fall over Hadasha Hesse (Elk Grove Junior Grens WC) Fall 0:11</li>\n<li>Cons. Round 2 - Emerson Seaton (Collinsville WC) won by major decision over Courtney Serafin (Downers Grove WC) Maj 10-0</li>\n<li>Cons. Round 2 - Kaylie Chmura (Frankfort Gladiator Wrestling) won by fall over Kailee Warren (Jacksonville Area Wrestling) Fall 0:20</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>Cons. Round 2 - Kaylee Koller (Badger WC) won by fall over Helen Hansen (Downers Grove WC) Fall 0:55</li>\n<li>Cons. Round 2 - Maya Moore (West Suburban Girls WC) won by decision over Veronica Ziller (Lockport Junior Porters WC) Dec 5-0</li>\n<li>Cons. Round 2 - Maycelynn Holmes (Shelbyville Jr. Wrestling Rams) won by decision over Myka Roberts (TJ Trained Wrestling) Dec 2-1</li>\n<li>Cons. Round 2 - Carly Maloney (Tinley Park Bulldogs WC) won by fall over Adriana Vega (Red Raiders Wrestling Team) Fall 0:17</li>\n<li>Cons. Round 2 - Laura Miller (Crawford County WC) won by major decision over Aria Torres (West Suburban Girls WC) Maj 14-1</li>\n<li>Cons. Round 2 - Evangelina Guzman (Will County Warriors WC) won by fall over Alexandra Carroll (Mat Rat WC) Fall 0:30</li>\n<li>Cons. Round 2 - Audriana Herzog (Marengo Youth WC) won by major decision over Natalie Norberg (Sauk Valley WC) Maj 12-4</li>\n<li>Cons. Round 2 - Rubie Ortega (MadDog Wrestling Academy) won by decision over Brinley Johnson (Westville WC) Dec 4-3</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Collins Miller (LaSalle Peru Crunching Cavs Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Azlynn Wilson (Benton WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>Cons. Round 2 - Derek Hayes (SCN Youth WC) won by major decision over Jack Brown (Frankfort Wildcats Wrestling) Maj 9-0</li>\n<li>Cons. Round 2 - Mason Black (Springs Elite WC) won by fall over Terrell Crowcroft (Spartan WC) Fall 2:29</li>\n<li>Cons. Round 2 - Joseph Major (Force Elite WC) won by major decision over Diego Garcia (North Boone WC) Maj 12-0</li>\n<li>Cons. Round 2 - Emmett Fobert (Moline WC) won by fall over Kai Chambers (Iguana WC) Fall 2:56</li>\n<li>Cons. Round 2 - Luca Bartels (Fox Valley WC) won by decision over Walker Kelley (Champions WC) Dec 3-1</li>\n<li>Cons. Round 2 - Maxwell Fauth (Lions WC) won by fall over Jaiden Valdez (Headlock Wrestling Academy) Fall 0:57</li>\n<li>Cons. Round 2 - Hudsyn Pfanz (TJ Trained Wrestling) won by fall over Diezel Steele (Olney Cubs WC) Fall 2:28</li>\n<li>Cons. Round 2 - Finnegan Campbell (Headlock Wrestling Academy) won by fall over Kane Deal (SOT-C) Fall 0:44</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>Cons. Round 2 - Josiah Callahan (Clinton WC) won by fall over Steven Griffith (Storm Youth WC) Fall 2:57</li>\n<li>Cons. Round 2 - Julian Trujillo (Built By Brunson Wrestling) won by decision over Karson Nietzel (Rocket Fuel WC) Dec 5-2</li>\n<li>Cons. Round 2 - Chase Pool (Glenbard East Jr Rams WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jack DeGroot (Sauk Valley WC) won by decision over Carter Knowles (Lincoln-Way WC) Dec 8-1</li>\n<li>Cons. Round 2 - Brennan Caruso (McHenry WC) won by decision over Quinn Roach (Panther WC) Dec 8-2</li>\n<li>Cons. Round 2 - Achilles Cortese (Cortese WC) won by fall over Nolan St Angelo (PSF Wrestling Academy) Fall 2:43</li>\n<li>Cons. Round 2 - Braxton Baum (SCN Youth WC) won by decision over Bobby Alfaro (Martinez Fox Valley Elite WC) Dec 2-0</li>\n<li>Cons. Round 2 - Tom Toledo (Demolition WC) won by decision over Elijah Czerwiec (Lemont Bears WC) Dec 3-0</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>Cons. Round 2 - Weston Brom (Fox Valley WC) won in sudden victory - 1 over Kree Burkey (Gladiator Elite WC) SV-1 2-0</li>\n<li>Cons. Round 2 - Quinten Shaffer (Lawrence County Knights WC) won by decision over Tyson Jones (SJO Youth WC) Dec 4-1</li>\n<li>Cons. Round 2 - Tucker Brand (Panther Powerhouse Wrestling) won by fall over Jeffrey Forsberg (Wolves WC) Fall 1:50</li>\n<li>Cons. Round 2 - Michael Fangerow (Lincoln-Way WC) won by decision over Riley Reyes (Alber Athletics WC) Dec 7-1</li>\n<li>Cons. Round 2 - Jordan Easton (Springs Elite WC) won by major decision over Anthony Triner (Yorkville WC) Maj 9-1</li>\n<li>Cons. Round 2 - Emiliano Cid (Toss Em Up Wrestling Academy) won by major decision over Ezekiel Martinez (Toss Em Up Wrestling Academy) Maj 15-2</li>\n<li>Cons. Round 2 - Anthony Federici (Headlock Wrestling Academy) won in tie breaker - 1 over Henry Bansley (Panther WC) TB-1 4-3</li>\n<li>Cons. Round 2 - Easton Poss (Yorkville WC) won in sudden victory - 1 over Asher Garretson (Yorkville WC) SV-1 3-1</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>Cons. Round 2 - Lawson Lokanc (Lincoln-Way WC) won by decision over Taitum Wenninger (Champbuilders Wrestling) Dec 8-4</li>\n<li>Cons. Round 2 - Jordy Teran (Alber Athletics WC) won by decision over Maddox Martinez (Tribe WC) Dec 1-0</li>\n<li>Cons. Round 2 - Derek Keller (Crystal Lake Wizards WC) won by decision over Beau Fields (Falcon Youth Wrestling) Dec 7-4</li>\n<li>Cons. Round 2 - Drake Fahnestock (Blue Line Training Academy) won by decision over Wesley Baker (Glenbard East Jr Rams WC) Dec 9-4</li>\n<li>Cons. Round 2 - Lane Graybill (Dakota WC) won by decision over Leo Christensen (Lil` Coalers WC) Dec 7-0</li>\n<li>Cons. Round 2 - Sloan Sears (PSF Wrestling Academy) won by fall over Peter Willis (Arlington Cardinals WC) Fall 0:59</li>\n<li>Cons. Round 2 - Tony Distasio (Lemont Bears WC) won by decision over Eli Zimmerman (Lockport Junior Porters WC) Dec 4-0</li>\n<li>Cons. Round 2 - Ryder Cybul (Antioch Predators WC) won by decision over Will Gallo (SJO Youth WC) Dec 8-2</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>Cons. Round 2 - Elijah Narayanan (Batavia WC) won by decision over Dominic Doljanin (Tinley Park Bulldogs WC) Dec 4-0</li>\n<li>Cons. Round 2 - Carter Johnson (Lincoln Youth WC) won by fall over Jogan Lazenby (Southern Illinois Bulldogs WC) Fall 2:28</li>\n<li>Cons. Round 2 - Hudson Ludwig (SCN Youth WC) won in sudden victory - 1 over Tanner Brucker (Falcon Youth Wrestling) SV-1 4-2</li>\n<li>Cons. Round 2 - Damon Llanuza (St. Charles WC) won by decision over Ryker Gladson (Murphysboro Wrestling) Dec 6-0</li>\n<li>Cons. Round 2 - Patrick Murphy (Mustang WC) won by decision over Paxton Hoffman (Southern Illinois Bulldogs WC) Dec 2-0</li>\n<li>Cons. Round 2 - Ben Gellings (Barrington Broncos WC) won by fall over Deklyn Thompson (Ottawa Wolfpack WC) Fall 2:53</li>\n<li>Cons. Round 2 - Kane Gabbert (Morton Youth WC) won by decision over Neklous Jones (Alber Athletics WC) Dec 4-1</li>\n<li>Cons. Round 2 - Jaxton Zirkle (Brawlers WC) won in tie breaker - 1 over Caiden Lehman (Beat the Streets Chicago-Midway) TB-1 4-2</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>Cons. Round 2 - Austin Villarreal (nWo WC) won by fall over Jayden White (Urbana Tigers WC) Fall 2:45</li>\n<li>Cons. Round 2 - Bradley Wittenmeier (Vittum Cats WC) won by major decision over Cole Kiel (Edwardsville WC) Maj 16-8</li>\n<li>Cons. Round 2 - Damoni Ford (PSF Wrestling Academy) won by fall over Maddox Marsaglia (Iguana WC) Fall 0:35</li>\n<li>Cons. Round 2 - Jerry Fialka (Martinez Fox Valley Elite WC) won in tie breaker - 1 over Joshua Forsythe (Callan Wrestling Academy) TB-1 3-2</li>\n<li>Cons. Round 2 - Landon Delisi (Built By Brunson Wrestling) won by fall over Jacob Cory (Harlem Huskies WC) Fall 1:51</li>\n<li>Cons. Round 2 - Gideon Ayers (ISI WC) won by major decision over Jase Lohmeyer (Champions WC) Maj 16-7</li>\n<li>Cons. Round 2 - Tyrus Stifter (Du-Pec WC) won by decision over Quinlan Leyden (Little Celtic WC) Dec 1-0</li>\n<li>Cons. Round 2 - Luke Sponsel (Arlington Cardinals WC) won by fall over Jake Kichka (Naperville WC) Fall 0:32</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>Cons. Round 2 - Henry Eckersley (Champions WC) won by major decision over Konner Davis (Olney Cubs WC) Maj 14-5</li>\n<li>Cons. Round 2 - Hayes Kustok (Evanston School of Wrestling) won by decision over Timothy Wagner (Lil` Coalers WC) Dec 4-2</li>\n<li>Cons. Round 2 - Lyeden Hankins (Highland Bulldog Jr. WC) won by fall over Coltyn Montgomery (Yorkville WC) Fall 1:31</li>\n<li>Cons. Round 2 - Knox Patient (Champaign WC) won by major decision over Michael Burns (Beat the Streets Chicago-Oak Park) Maj 8-0</li>\n<li>Cons. Round 2 - Sami Abuarqoub (Greg Gomez Trained Wrestling) won by decision over Salim Fakhoury (Junior Patriots WC) Dec 8-5</li>\n<li>Cons. Round 2 - Kolten Lowe (Hawk WC) won by fall over Mauricio Hueramo (Reed Custer Jr. Panthers WC) Fall 1:56</li>\n<li>Cons. Round 2 - Gavin Eich (Dundee Highlanders WC) won by decision over Frank Ariola (SCN Youth WC) Dec 4-0</li>\n<li>Cons. Round 2 - Gavin Lange (Falcon Youth Wrestling) won by decision over Kellan Curran (Dinamo Wrestling) Dec 6-0</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>Cons. Round 2 - Liam Powell (SJO Youth WC) won by decision over Payt Titus (Mattoon Youth WC) Dec 4-3</li>\n<li>Cons. Round 2 - Cameron Gillie (SCN Youth WC) won by decision over Paul Kenny (Dundee Highlanders WC) Dec 6-0</li>\n<li>Cons. Round 2 - Liam Lane (Bulls WC) won by fall over Weston Atkinson (Crystal Lake Wizards WC) Fall 1:54</li>\n<li>Cons. Round 2 - Karmell Jones (East St. Louis WC) won by major decision over Levi Stott (Hononegah WC) Maj 12-0</li>\n<li>Cons. Round 2 - Anthony Ariola (SCN Youth WC) won by major decision over Maxwell Robertson (nWo WC) Maj 8-0</li>\n<li>Cons. Round 2 - Andrew Scorza (Arlington Cardinals WC) won by decision over Cooper Shepard (Cumberland Youth WC) Dec 13-8</li>\n<li>Cons. Round 2 - Quinn McCrum (MadDog Wrestling Academy) won by fall over Maxwell Schmidt (Lake Zurich Cubs WC) Fall 2:24</li>\n<li>Cons. Round 2 - Colin Guisinger (Tinley Park Bulldogs WC) won by decision over Odysseus Hale (Midwest Central Youth WC) Dec 4-1</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>Cons. Round 2 - Nikolas Panayi (Arlington Cardinals WC) won by decision over Nicholas Peisker (Orland Park Pioneers WC) Dec 4-3</li>\n<li>Cons. Round 2 - Major McGee (PSF Wrestling Academy) won by fall over Liam Simon (Oak Forest Warriors WC) Fall 2:00</li>\n<li>Cons. Round 2 - Zachary Laga (Lemont Bears WC) won by decision over Tiernan Devlin (Glen Ellyn Dungeon WC) Dec 6-0</li>\n<li>Cons. Round 2 - Draven Bock (Hawk WC) won by decision over Jaxon Anderson (Gladiator Elite WC) Dec 5-3</li>\n<li>Cons. Round 2 - Gino Marino (Headlock Wrestling Academy) won by fall over Kaiden Miller (Dubtown WC) Fall 0:14</li>\n<li>Cons. Round 2 - Rhett Bramley (Iguana WC) won by fall over Gabriel Razo (DC WC) Fall 2:51</li>\n<li>Cons. Round 2 - Terrel Hinton (Toss Em Up Wrestling Academy) won by major decision over Logan Braga (Yorkville WC) Maj 13-0</li>\n<li>Cons. Round 2 - Grady Gallagher (Monticello Youth WC) won by fall over Greyson Glowienke (Wheaton WC) Fall 1:40</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>Cons. Round 2 - Armani Renteria (Harvard WC) won in sudden victory - 1 over Asher Ericson (Cory Clark Wrestling) SV-1 8-6</li>\n<li>Cons. Round 2 - Matthew Smith (Benton WC) won by decision over Temuulen Binderiya (Beat the Streets Chicago-Midway) Dec 6-1</li>\n<li>Cons. Round 2 - Everett Lehr (Wolves WC) won by fall over Justin Park (Hoopeston Area Youth Wrestling) Fall 0:52</li>\n<li>Cons. Round 2 - Max Marshall (Naperville WC) won by decision over Michael Hammer (Demolition WC) Dec 7-5</li>\n<li>Cons. Round 2 - Easton Meyers (Southern Illinois Bulldogs WC) won by decision over Trace Anfinson (TJ Trained Wrestling) Dec 5-0</li>\n<li>Cons. Round 2 - John Gavoni (Lockport Junior Porters WC) won by fall over Reece Valencia (Bulls WC) Fall 2:18</li>\n<li>Cons. Round 2 - Karam Olyyan (Orland Park Pioneers WC) won by decision over Brycen Miller (LaSalle Peru Crunching Cavs Youth WC) Dec 4-1</li>\n<li>Cons. Round 2 - Luke Wagner (SJO Youth WC) won by fall over Karter Moffitt (Limestone WC) Fall 2:30</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>Cons. Round 2 - Omar Tadros (Lockport Junior Porters WC) won by decision over Hayden Hicks (Monticello Youth WC) Dec 7-0</li>\n<li>Cons. Round 2 - Hunter Champlain (Stillman Valley WC) won by decision over Christian Hooker (O`Fallon Little Panthers WC) Dec 6-2</li>\n<li>Cons. Round 2 - Gabriel Musselman (Eureka WC) won by fall over Brody Morrissey (Taylorville WC) Fall 2:59</li>\n<li>Cons. Round 2 - Keith Stepina (Stillman Valley WC) won by fall over Mason Vargas (Beat the Streets Chicago-Midway) Fall 1:38</li>\n<li>Cons. Round 2 - Jamarion Bell (Englewood Live Wire WC) won by fall over Jasper Aure (Petersburg WC) Fall 1:35</li>\n<li>Cons. Round 2 - Elijah Griffin (Will County Warriors WC) won by fall over Cleotha Spearman Lll (East St. Louis WC) Fall 0:43</li>\n<li>Cons. Round 2 - Liam Soutar (Bulldog Youth Sports Wrestling) won by fall over Lucas Nicoski (Martinez Fox Valley Elite WC) Fall 1:51</li>\n<li>Cons. Round 2 - Blaine Drake (The Law WC) won by fall over Antoine Yates (Beat the Streets Chicago-Oak Park) Fall 1:39</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>Cons. Round 2 - Carson Mongare (Edwardsville WC) won by fall over Jack Donovan (Meridian Hawks Youth WC) Fall 2:18</li>\n<li>Cons. Round 2 - Ethan Pellizzari (Hinsdale Red Devil WC) won by decision over Kenneth Woods (Demolition WC) Dec 4-3</li>\n<li>Cons. Round 2 - Reid Archer (Oswego WC) won by decision over Allen Antolik (Streator WC) Dec 6-0</li>\n<li>Cons. Round 2 - Kameron Davis (Granite City Wrestling Association) won by fall over Declan Pecho (Frankfort Wildcats Wrestling) Fall 2:54</li>\n<li>Cons. Round 2 - Donato Saaby (Headlock Wrestling Academy) won by fall over Jimmy Grapenthien (Maine Eagles WC) Fall 1:28</li>\n<li>Cons. Round 2 - John Gehrig (Sycamore WC) won by fall over Daniel Conwell (Mustang WC) Fall 1:25</li>\n<li>Cons. Round 2 - Chase Spradau (Yorkville WC) won by fall over Giancarlo Albavera (Stallions Wrestling Academy) Fall 2:35</li>\n<li>Cons. Round 2 - Cayden Williams (Harvard WC) won by fall over Blake Sauceda (Badger WC) Fall 1:46</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>Cons. Round 2 - Jack Harper (Jacksonville Area Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 2 - Patrick Brennan (St. Charles WC) won by fall over Easton Noland (Meridian Hawks Youth WC) Fall 0:12</li>\n<li>Cons. Round 2 - Henry Miller (Warriors Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 2 - Brentlee Jones (Jacksonville Area Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 2 - Wyatt Miller (Monticello Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Adreice Russell (Rantoul Youth Wrestling) won by fall over Damyen McGrown (Danville Chargers WC) Fall 0:38</li>\n<li>Cons. Round 2 - Thurlow Grimm (Oakwood Youth WC) won by fall over Henry Brown Iii (Harvey Twisters WC) Fall 0:31</li>\n<li>Cons. Round 2 - John Jones (Granite City Wrestling Association) received a bye   () Bye</li>\n</ul>\n</section>",
  "Champ Quarters & Consolation 3rd Round": "<section class=\"tw-list\">\n<h1>Champ Quarters &amp; Consolation 3rd Round</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>Quarterfinal - Brooklyn Sharwarko (Lil` Coalers WC) won by fall over Elena Amendola (Fox Valley WC) Fall 0:36</li>\n<li>Quarterfinal - Maleya Campbell (Wilmington WC) won by fall over Raegan Lessner (Fox Lake WC) Fall 0:23</li>\n<li>Quarterfinal - Isabella Huff (Vandalia Jr WC) won by fall over Quinn Fahey (Wheaton WC) Fall 1:27</li>\n<li>Quarterfinal - Kyla Kucala (Little Celtic WC) won by fall over Rosie Pace (N.Y.A Jr. Rebels WC) Fall 0:18</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 - Georgia Blayney (DC WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>Quarterfinal - Nicolette Giardino (Rockets WC) won by major decision over Piper Koning (Cardinals WC) Maj 9-1</li>\n<li>Quarterfinal - Adalynn Taylor (Rocket Fuel WC) won by fall over Avery Duckett (Shelbyville Jr. Wrestling Rams) Fall 0:57</li>\n<li>Quarterfinal - Swayze Campbell (Wilmington WC) won by fall over Summer Brockman (Belvidere Bandits WC) Fall 0:53</li>\n<li>Quarterfinal - Emery Westerberg (Tinley Park Bulldogs WC) won by decision over LaiLani Cruz (Lionheart Intense Wrestling) Dec 9-5</li>\n<li>Cons. Round 3 - Bethany Schroer (East Peoria River Bandits Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 3 - Erin Brophy (Lions WC) received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 - Gemma Wagner (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>Quarterfinal - Ella Terhaar (Wolves WC) won by fall over Rose Bucaro (Mat Rat WC) Fall 1:32</li>\n<li>Quarterfinal - Anya Rossi (Arlington Cardinals WC) won by decision over Zoey Willis (DC WC) Dec 8-2</li>\n<li>Quarterfinal - Aleerah Snow (Champions WC) won by decision over Ava Voyles (Bulls WC) Dec 5-4</li>\n<li>Quarterfinal - Emmerson Lange (Falcon Youth Wrestling) won by fall over Elizabeth Kustok (Evanston School of Wrestling) Fall 0:23</li>\n<li>Cons. Round 3 - Ryan Donnelly (Tinley Park Bulldogs WC) won by major decision over Khloe Dominguez (DeKalb WC) Maj 11-3</li>\n<li>Cons. Round 3 - Khloe McCaslin (Sandwich WC) won in sudden victory - 1 over Jesse Skelton (Eureka WC) SV-1 8-3</li>\n<li>Cons. Round 3 - Cambrie Gianokis (Mat Rat WC) won by fall over Gemma Benning (Belvidere Bandits WC) Fall 1:54</li>\n<li>Cons. Round 3 - Grace Sinks (TJ Trained Wrestling) won by decision over Mia Lopez (West Suburban Girls WC) Dec 8-3</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>Quarterfinal - Amina Perez (Greg Gomez Trained Wrestling) won by fall over Penelope Hall (Thunder WC) Fall 0:41</li>\n<li>Quarterfinal - Maggie Larson (DeKalb WC) won by major decision over Elise Thomas (Bulls WC) Maj 12-1</li>\n<li>Quarterfinal - Patricia Tytus (RTC Wrestling) won by fall over Keagan Jadin (Oak Forest Warriors WC) Fall 1:48</li>\n<li>Quarterfinal - Sloane Gabler (Sauk Valley WC) won by fall over Beaux McCartney (Alber Athletics WC) Fall 1:41</li>\n<li>Cons. Round 3 - Alyce Stone (Glenbard East Jr Rams WC) won by fall over Tinliee Sullivan (Westville WC) Fall 0:22</li>\n<li>Cons. Round 3 - Chelsea Price (Demolition WC) won by fall over Norah Doyle (Vandalia Jr WC) Fall 0:27</li>\n<li>Cons. Round 3 - Genevieve Del Muro (nWo WC) won by tech fall over Awbree Corson (Stillman Valley WC) TF 15-0</li>\n<li>Cons. Round 3 - Adalyn Albavera (Stallions Wrestling Academy) won by medical forfeit over Kamilla Ulaszek (Orland Park Pioneers WC) MFF</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>Quarterfinal - Calli Hickman (Bulls WC) won by fall over Elise LeCuyer (Sandwich WC) Fall 0:23</li>\n<li>Quarterfinal - Hadley Slabaugh (Harlem Huskies WC) won by fall over Brooklyn Schultz (Naperville WC) Fall 2:25</li>\n<li>Quarterfinal - Angelina Perez (Dundee Highlanders WC) won by fall over Raenyn Miller (Sparta Junior Bulldogs WC) Fall 0:56</li>\n<li>Quarterfinal - Savannah Paynes (Bulldog Elite WC) won by major decision over Cale Duckett (Shelbyville Jr. Wrestling Rams) Maj 12-1</li>\n<li>Cons. Round 3 - Makenna Austra (Bulls WC) won by decision over Liberty House (Rockford WC) Dec 5-2</li>\n<li>Cons. Round 3 - Mia MeGee (Quincy Little Raiders WC) won by decision over Esmeralda Gaytan (Evanston School of Wrestling) Dec 5-1</li>\n<li>Cons. Round 3 - Abigail Jahnel (Unity Youth WC) won by decision over Piper Heisler (Mat Rat WC) Dec 3-1</li>\n<li>Cons. Round 3 - Piper Angel (Clinton WC) won by fall over Tilly Potocsnak (Lockport Junior Porters WC) Fall 0:52</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>Quarterfinal - Lexi Suits (Gladiator Elite WC) won by fall over Colette Gaitros (Mt. Zion Kids WC) Fall 1:59</li>\n<li>Quarterfinal - Londyn Bellamy (Force Elite WC) won by major decision over Quinn Hale (Midwest Central Youth WC) Maj 14-0</li>\n<li>Quarterfinal - Rylee Colby (Batavia WC) won by fall over Elina Del Rio (Caravan Kids WC) Fall 0:56</li>\n<li>Quarterfinal - Victoria Kasky (Gladiator Elite WC) won by fall over Ava Barber (Belvidere Bandits WC) Fall 2:28</li>\n<li>Cons. Round 3 - Brooklyn McGreehin (Peotone Little Devils WC) won by decision over Natalya Moberg (Rochelle Wrestling Club) Dec 3-2</li>\n<li>Cons. Round 3 - Alaina Linton (Oakwood Youth WC) won by fall over Kaylee Carney (Macomb Little Bombers Wrestling) Fall 0:31</li>\n<li>Cons. Round 3 - Zora Goebel (The Law WC) won by decision over Isabella Schoenemann (Orland Park Pioneers WC) Dec 4-0</li>\n<li>Cons. Round 3 - Kinzleigh Kopka (DeKalb WC) won by fall over Jaeda Lewis (Peoria Razorbacks WC) Fall 2:32</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>Quarterfinal - Trinity Grace Larsen (Fox Lake WC) won by fall over Madison Gregoria (Woodstock Cyclones WC) Fall 0:30</li>\n<li>Quarterfinal - Natalie Smith (Granite City Wrestling Association) won by decision over Summar Jaber (Badger WC) Dec 6-3</li>\n<li>Quarterfinal - Emmlyne Shaw (Peotone Little Devils WC) won by decision over Samari Hernandez (Bulldog Elite WC) Dec 7-2</li>\n<li>Quarterfinal - Hollyn Boggess (Panther Powerhouse Wrestling) won by fall over Clara Lauer (Petersburg WC) Fall 1:47</li>\n<li>Cons. Round 3 - Raiza LeCompte (Tinley Park Bulldogs WC) won by major decision over Anderson Cherry (Mat Rat WC) Maj 9-0</li>\n<li>Cons. Round 3 - Brinley Wrage (Stillman Valley WC) won by fall over Camila Rodriguez (Beat the Streets Chicago-Midway) Fall 0:40</li>\n<li>Cons. Round 3 - Mercy Lower (Tiger Town Tanglers WC) won by decision over Olivia Werner (Lion`s Den Wrestling Academy) Dec 4-2</li>\n<li>Cons. Round 3 - Whitney Wood (Peoria Wizards WC) won by fall over Jenna Alsbury (Wilmington WC) Fall 1:48</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>Quarterfinal - Michaelene Andler (Naperville WC) won by fall over Charlize Cartwright (Junior Patriots WC) Fall 0:49</li>\n<li>Quarterfinal - Kennedy Erickson (DeKalb WC) won by fall over Zoey Rousseau (Beat the Streets Chicago-Midway) Fall 2:29</li>\n<li>Quarterfinal - Ava Durham (Tinley Park Bulldogs WC) won by decision over Aubrey Taylor (MadDog Wrestling Academy) Dec 7-4</li>\n<li>Quarterfinal - Mckinley Allen (Riot Room Wrestling) won by major decision over Jazlyn Manning (Blue Crew WC) Maj 9-0</li>\n<li>Cons. Round 3 - Aryana Resendez (Rochelle Wrestling Club) won by fall over Genesis Green (Vandalia Jr WC) Fall 1:33</li>\n<li>Cons. Round 3 - Kinley Hendricks (El Paso Gridley Youth WC) won by fall over Lanna Learch (Belvidere Bandits WC) Fall 0:23</li>\n<li>Cons. Round 3 - Makaya Linville (Tiger Elite Wrestling Inc) won by decision over Kimberlyn McGrown (Danville Chargers WC) Dec 4-3</li>\n<li>Cons. Round 3 - Charlotte Mathias (Warrensburg-Latham Jr. Cardinals WC) won by fall over Erin Wells (Taylorville WC) Fall 0:20</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>Quarterfinal - Declan Roach (Panther WC) won by decision over Kayden Chapman (Mattoon Youth WC) Dec 6-3</li>\n<li>Quarterfinal - Daxton Lillis (Southern Illinois Bulldogs WC) won by major decision over Peyton Murphy (Downers Grove WC) Maj 12-1</li>\n<li>Quarterfinal - Derrick Cue (Astro WC) won by fall over Logan Soloff (Lil Reaper WC) Fall 3:00</li>\n<li>Quarterfinal - Maddux Giffin (Reed Custer Jr. Panthers WC) won by fall over Cole Wachstetter (Falcon Youth Wrestling) Fall 1:49</li>\n<li>Cons. Round 3 - Joseph Salzman (Lincoln-Way WC) won by decision over Asher Sefton (Vandalia Jr WC) Dec 2-1</li>\n<li>Cons. Round 3 - Daniel Garcia (Callan Wrestling Academy) won by decision over Maddux Bartels (Morris WC) Dec 8-2</li>\n<li>Cons. Round 3 - Calvin Grant (Urbana Tigers WC) won by fall over Charles McGlennon (Lemont Bears WC) Fall 1:24</li>\n<li>Cons. Round 3 - Liam Ross (Stillman Valley WC) won by major decision over Alexi Stellatos (Junior Titans Wrestling) Maj 12-4</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>Quarterfinal - Axel Graves (SJO Youth WC) won by decision over Noah Reyes (Beat the Streets Chicago-Avondale) Dec 5-2</li>\n<li>Quarterfinal - Chase Amorn (RTC Wrestling) won by fall over Paul Flores (Southside Outlaws WC) Fall 2:34</li>\n<li>Quarterfinal - Leonidas Cortese (Cortese WC) won by major decision over Cooper Stumbaugh (Scorpion WC) Maj 14-6</li>\n<li>Quarterfinal - Andre McGuire (Urbana Tigers WC) won by decision over Ethan Heckler (Morris WC) Dec 7-1</li>\n<li>Cons. Round 3 - Jaxtyn LeConte (Rockford WC) won by fall over Trevor Kasky (Gladiator Elite WC) Fall 1:21</li>\n<li>Cons. Round 3 - Cohen Frederick (Belvidere Bandits WC) won by decision over Graham Terry (River Bend WC) Dec 9-4</li>\n<li>Cons. Round 3 - Darian Keller (Crystal Lake Wizards WC) won by decision over Jamerson Bloodworth (Gladiator Elite WC) Dec 2-0</li>\n<li>Cons. Round 3 - Jameson Chapman (Gladiator Elite WC) won by fall over Dallas Morales (Scorpion WC) Fall 2:44</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>Quarterfinal - River Couture (Cory Clark Wrestling) won by decision over Beckam Velarde (Yorkville WC) Dec 3-0</li>\n<li>Quarterfinal - Abel Muniz (Force Elite WC) won in sudden victory - 1 over Samuel Myatt (Fox Lake WC) SV-1 4-2</li>\n<li>Quarterfinal - Kenton Raab (Stockton Renegades WC) won by major decision over Cooper Corona (Mustang WC) Maj 11-2</li>\n<li>Quarterfinal - Carson Gallo (SJO Youth WC) won by decision over Tyler Winterhalter (Arlington Cardinals WC) Dec 5-2</li>\n<li>Cons. Round 3 - Abrahm Leingang (Sherrard Jr. Tigers WC) won by fall over Aaron Jones (Springs Elite WC) Fall 0:55</li>\n<li>Cons. Round 3 - Jack Kappas (Lemont Bears WC) won by decision over Jack Newsom (Cory Clark Wrestling) Dec 10-5</li>\n<li>Cons. Round 3 - Tre`Lyn Morrow (Crystal Lake Wizards WC) won by major decision over Anthony Losurdo (Wolfpak WC) Maj 13-4</li>\n<li>Cons. Round 3 - Boston Blakely (Alber Athletics WC) won by decision over Mason Manning (Lincoln-Way WC) Dec 3-1</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>Quarterfinal - Grayson Temple (Fox Lake WC) won by fall over William Fitzgerald (Little Celtic WC) Fall 0:39</li>\n<li>Quarterfinal - Layton Kraemer (Nomad Wrestling Academy) won by decision over Hiro Hongmoungkhoune (Alber Athletics WC) Dec 9-4</li>\n<li>Quarterfinal - Evan Ross (Stillman Valley WC) won by decision over Zackary Vest (TJ Trained Wrestling) Dec 4-0</li>\n<li>Quarterfinal - Thomas Reis (Southern Illinois Bulldogs WC) won by major decision over Ryan Campos (Fox Lake WC) Maj 10-1</li>\n<li>Cons. Round 3 - Lane Kesler (Fisher WC) won in sudden victory - 1 over Jt Tsokolas (Mustang WC) SV-1 9-7</li>\n<li>Cons. Round 3 - Hiram Bulava (SCN Youth WC) won in tie breaker - 1 over Jacob McMurray (Lions WC) TB-1 2-1</li>\n<li>Cons. Round 3 - Parker Lilas (Lemont Bears WC) won by decision over Jeremiah Hosman (Little Celtic WC) Dec 7-0</li>\n<li>Cons. Round 3 - Nolan Rodriguez (Riot Room Wrestling) won in sudden victory - 1 over Nico Poeta (Champaign WC) SV-1 6-4</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>Quarterfinal - Aaron Munks (Pontiac WC) won by fall over John Wiatr (Lemont Bears WC) Fall 2:59</li>\n<li>Quarterfinal - Tagg Hefner (TJ Trained Wrestling) won by decision over Lennux Mays (PSF Wrestling Academy) Dec 4-3</li>\n<li>Quarterfinal - Maddox Fialka (Martinez Fox Valley Elite WC) won by major decision over Brycen Legue (Stillman Valley WC) Maj 11-1</li>\n<li>Quarterfinal - Pedro Legend Rangel (Storm Youth WC) won by fall over Justin-Carter Jones (Toss Em Up Wrestling Academy) Fall 0:21</li>\n<li>Cons. Round 3 - Elijah Foss (Gladiator Elite WC) won in sudden victory - 1 over Frankie Rivas (Lions WC) SV-1 4-2</li>\n<li>Cons. Round 3 - Jack Wood (Granite City Wrestling Association) won by fall over Jagger Burrell (Olympia WC) Fall 0:39</li>\n<li>Cons. Round 3 - Wells Millard (Rochelle Wrestling Club) won by fall over David Bugrimov (Suplex WC) Fall 0:56</li>\n<li>Cons. Round 3 - Trecyn Holba (Frankfort Gladiator Wrestling) won by fall over Abel Bochmann (Assumption Elite WC) Fall 1:53</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>Quarterfinal - Camden Fitzgerald (Little Celtic WC) won by fall over Timothy Block (Mattoon Youth WC) Fall 1:41</li>\n<li>Quarterfinal - Brock Kirschke (Crystal Lake Wizards WC) won by decision over Brody Cohen (Built By Brunson Wrestling) Dec 9-8</li>\n<li>Quarterfinal - Briggs Whiting (Force Elite WC) won by fall over Mason Trettin (Tinley Park Bulldogs WC) Fall 0:32</li>\n<li>Quarterfinal - Jack Gorman (SJO Youth WC) won by decision over Dominic Adamo (Arlington Cardinals WC) Dec 4-1</li>\n<li>Cons. Round 3 - Vincent Jimenez (Crystal Lake Wizards WC) won by decision over Porfivio Celestino (Sauk Valley WC) Dec 7-5</li>\n<li>Cons. Round 3 - Cooper Whaley (Rockford WC) won by decision over Easton Shinn (Southern Illinois Bulldogs WC) Dec 13-11</li>\n<li>Cons. Round 3 - Jack Wishnevski (Cory Clark Wrestling) won by decision over Azerial Ramirez (Sauk Valley WC) Dec 6-2</li>\n<li>Cons. Round 3 - Madden Grieve (Highland Bulldog Jr. WC) won by decision over Easton Benyo (Sauk Valley WC) Dec 9-3</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>Quarterfinal - Shane McNulty (Demolition WC) won by decision over Jordan Benefiel (nWo WC) Dec 1-0</li>\n<li>Quarterfinal - Anthony Ragona (Built By Brunson Wrestling) won by fall over Armando Perez (Southside Outlaws WC) Fall 2:52</li>\n<li>Quarterfinal - Adam Krokos (Orland Park Pioneers WC) won by decision over Antonio Medina (Arlington Cardinals WC) Dec 9-2</li>\n<li>Quarterfinal - Killien Schwarz (Riot Room Wrestling) won by decision over James Newell (Springs Elite WC) Dec 9-3</li>\n<li>Cons. Round 3 - Zachary Haas (Naperville WC) won by decision over Cooper Alger-Scott (Taylorville WC) Dec 5-4</li>\n<li>Cons. Round 3 - Liam Santiago (Fox Valley WC) won by decision over Benson Grugel (Stillman Valley WC) Dec 5-2</li>\n<li>Cons. Round 3 - Lodi Morgan (Wilmington WC) won by fall over Jackson Schaefer (Southside Outlaws WC) Fall 2:48</li>\n<li>Cons. Round 3 - Drake Baker (Lawrence County Knights WC) won by fall over Cassius House (Southern Illinois Bulldogs WC) Fall 0:21</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>Quarterfinal - Lincoln Projansky (Built By Brunson Wrestling) won by decision over Bishop Edmond (Southside Outlaws WC) Dec 2-1</li>\n<li>Quarterfinal - Padraig Brady (Demolition WC) won by fall over Ares Robelo (Scorpion WC) Fall 1:37</li>\n<li>Quarterfinal - Logan Linton (Force Elite WC) won by decision over Anthony Schaffer (Izzy Style Wrestling) Dec 5-0</li>\n<li>Quarterfinal - Traxton Renfroe (East Peoria River Bandits Wrestling) won by tech fall over Oakley Davis (Iguana WC) TF 18-3</li>\n<li>Cons. Round 3 - Quinton Odonnell (Morris WC) won by decision over Mason Potts (Fox Lake WC) Dec 6-4</li>\n<li>Cons. Round 3 - Jory Logan (Belleville Little Devils WC) won by major decision over Emmett Berlin (Tiger Town Tanglers WC) Maj 13-2</li>\n<li>Cons. Round 3 - Logan Shreve (PSF Wrestling Academy) won by fall over William Moore (Mustang WC) Fall 2:28</li>\n<li>Cons. Round 3 - Immanuel Hampton (Team Mascoutah WC) won by decision over Camden Willis (Vittum Cats WC) Dec 12-6</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>Quarterfinal - Alexander Cid (Toss Em Up Wrestling Academy) won by fall over Miles Schmid (Clinton WC) Fall 2:23</li>\n<li>Quarterfinal - Keegan Mullen (McHenry WC) won by major decision over Cameron Tutko (Streator WC) Maj 12-0</li>\n<li>Quarterfinal - Jackson Moreno (Belvidere Bandits WC) won by major decision over Gabriel Tatum (Lion`s Den Wrestling Academy) Maj 9-1</li>\n<li>Quarterfinal - Nehemiah Andronic (Rochelle Wrestling Club) won by major decision over Brody Crumly (Petersburg WC) Maj 10-1</li>\n<li>Cons. Round 3 - Rhett Eastin (Olney Cubs WC) won by major decision over Francesco Faso (Barrington Broncos WC) Maj 10-1</li>\n<li>Cons. Round 3 - Declan Wilking (Wilmington WC) won by major decision over Abel Dickerson (Petersburg WC) Maj 11-1</li>\n<li>Cons. Round 3 - Ayden McAuliffe (Tinley Park Bulldogs WC) won by major decision over Kaydin Feliciano (Beat the Streets Chicago-Avondale) Maj 8-0</li>\n<li>Cons. Round 3 - Benjamin Townsend (Wheaton WC) won by fall over Connor Rech (Dinamo Wrestling) Fall 0:47</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>Quarterfinal - Daquain Hubbard Jr (Urbana Tigers WC) won by fall over Tyler Wirth (Lemont Bears WC) Fall 0:54</li>\n<li>Quarterfinal - Evan Uhls (Gladiator Elite WC) won by decision over Noah Jaber (Badger WC) Dec 8-5</li>\n<li>Quarterfinal - Declan Jones (Arlington Cardinals WC) won by fall over Dion Wilson (Downers Grove WC) Fall 1:45</li>\n<li>Quarterfinal - Kingston Hamilton (Wildcats Wrestling Academy) won by fall over Jack Brown (Mustang WC) Fall 2:25</li>\n<li>Cons. Round 3 - Jake Meeks (Lawrence County Knights WC) won by decision over Conrad Barber (Belvidere Bandits WC) Dec 5-3</li>\n<li>Cons. Round 3 - Vedder Anello (Mattoon Youth WC) won by decision over Joseph Oliver (Peotone Little Devils WC) Dec 6-0</li>\n<li>Cons. Round 3 - Quinn Shelby (Little Celtic WC) won by decision over Joseph Keigher (Elk Grove Junior Grens WC) Dec 13-6</li>\n<li>Cons. Round 3 - Brevin Whipple (Du-Pec WC) won by major decision over Tyler Goble (Pekin Boys &amp; Girls Club) Maj 12-0</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>Quarterfinal - Bennett Campos (Blue Line Training Academy) won by major decision over Cohen McCarron (Lincoln-Way WC) Maj 11-3</li>\n<li>Quarterfinal - Vincent Englese (St. Charles WC) won by fall over Jake Jerik (Antioch Predators WC) Fall 0:36</li>\n<li>Quarterfinal - Wells Kustok (Evanston School of Wrestling) won by decision over Crosby Michaelis (Carlinville WC) Dec 7-2</li>\n<li>Quarterfinal - Alexander Martinez (Red Raiders Wrestling Team) won by fall over Karter Smith (SJO Youth WC) Fall 0:57</li>\n<li>Cons. Round 3 - William Blomberg (Yorkville WC) won by fall over Elliott Collins (DeKalb WC) Fall 0:38</li>\n<li>Cons. Round 3 - Brent Hills Ii (Champions WC) won by tech fall over Declan Wargo (Crystal Lake Wizards WC) TF 19-0</li>\n<li>Cons. Round 3 - Liam Fitzpatrick (Mustang WC) won by major decision over Chase White (Jersey Junior Panthers Wrestling) Maj 10-0</li>\n<li>Cons. Round 3 - Liam Lee (Built By Brunson Wrestling) won by fall over Mackson Bruning (Panther Youth WC) Fall 1:27</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>Quarterfinal - Joseph Englese (St. Charles WC) won by fall over Jeremiyah Winn (Harvey Twisters WC) Fall 0:36</li>\n<li>Quarterfinal - Leonard Morgan (Wilmington WC) won by fall over Boston Black (Murphysboro Wrestling) Fall 1:50</li>\n<li>Quarterfinal - Hunter Archer (Brawlers WC) won by fall over Donnagain Mallory (Mustang WC) Fall 1:38</li>\n<li>Quarterfinal - Levi Palmer (Hononegah WC) won by decision over Dylan Orozco (Oak Forest Warriors WC) Dec 4-1</li>\n<li>Cons. Round 3 - Christian Potts (Doom Wrestling) won by fall over Giovanni Bolognini (Scorpion WC) Fall 0:51</li>\n<li>Cons. Round 3 - Waylin Rogers (Vandalia Jr WC) won by fall over Noah Baltierrez (nWo WC) Fall 2:27</li>\n<li>Cons. Round 3 - Braxton Slack (Belvidere Bandits WC) won by fall over Maverick Baker (Libertyville WC) Fall 1:43</li>\n<li>Cons. Round 3 - Brock Harvey (Hononegah WC) won by fall over Anthony Poro (Arlington Cardinals WC) Fall 1:44</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>Quarterfinal - Tony Hess (Wildcats Wrestling Academy) won in tie breaker - 1 over Beau Hill (Champions WC) TB-1 4-3</li>\n<li>Quarterfinal - Cal Butikofer (Yorkville WC) won by fall over Remy Meadors (Peotone Little Devils WC) Fall 2:37</li>\n<li>Quarterfinal - Brayson Foust (Peoria Razorbacks WC) won by fall over Landon Haak (Stillman Valley WC) Fall 0:42</li>\n<li>Quarterfinal - Bryce Boltz (Sycamore WC) won by decision over Crew Miller (Prairie Central Youth Wrestling) Dec 3-0</li>\n<li>Cons. Round 3 - Anthony Coix (Batavia WC) won by fall over Pierce Spiller (Murphysboro Wrestling) Fall 0:26</li>\n<li>Cons. Round 3 - Roman Lucio (Badger WC) won by decision over Axel Ramos (Toss Em Up Wrestling Academy) Dec 8-5</li>\n<li>Cons. Round 3 - Joel Ware (Du-Pec WC) won by fall over Lukas Martin (Lincoln Youth WC) Fall 1:57</li>\n<li>Cons. Round 3 - Ethan Kennedy (Bulls WC) won by fall over Jake Pila (Vittum Cats WC) Fall 0:36</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>Quarterfinal - Annabelle Hoffman (Sauk Valley WC) won by decision over Rosemary Hileman (AJ Jr. Wildcats WC) Dec 4-3</li>\n<li>Quarterfinal - Alina Gomez (Oak Forest Warriors WC) received a bye   () Bye</li>\n<li>Quarterfinal - Maggie Ortiz (Tinley Park Bulldogs WC) won by fall over Abigail Cortez (Will County Warriors WC) Fall 2:25</li>\n<li>Quarterfinal - Oakli Gorman (SJO Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>Quarterfinal - Stella Eimer (TJ Trained Wrestling) received a bye   () Bye</li>\n<li>Quarterfinal - Bailey Flanigan (Bulls WC) won by fall over Sophia Olandese (Wheaton WC) Fall 0:26</li>\n<li>Quarterfinal - Jayla Godina (Lincoln-Way WC) won by fall over Rayelynn Hartmann (Tiger Town Tanglers WC) Fall 1:49</li>\n<li>Quarterfinal - Adelle Dunaway (St. Charles WC) won by decision over Marli Cobbs (Belleville Little Devils WC) Dec 2-0</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>Quarterfinal - Elizabeth Agajanian (Sandwich WC) won by fall over Mayleigh Bly (Shelbyville Jr. Wrestling Rams) Fall 0:50</li>\n<li>Quarterfinal - Eliana Ortega (Beat the Streets Chicago-Midway) won by decision over Saige Danneberger (Shelbyville Jr. Wrestling Rams) Dec 4-2</li>\n<li>Quarterfinal - Carrie Larsen (Fox Lake WC) won by decision over Aubrey Schmieding (O`Fallon Little Panthers WC) Dec 6-0</li>\n<li>Quarterfinal - Reese Davis (Spartan WC) won by fall over Isabella Hudison (Bismarck-Henning Youth WC) Fall 1:58</li>\n<li>Cons. Round 3 - Kathlynn Sturhahn (Quincy Little Raiders WC) won by fall over Grace Stoller (Clinton WC) Fall 1:58</li>\n<li>Cons. Round 3 - Ivy Sullivan (Dixon WC) won by fall over Charlotte Baker (Dixon WC) Fall 1:49</li>\n<li>Cons. Round 3 - Ava Willock (Rockets WC) won by decision over Henley Hawthorne (Granite City Wrestling Association) Dec 8-4</li>\n<li>Cons. Round 3 - Veda Bailey (Warriors Wrestling Academy) won by fall over Aubree Anderson (Crosstown Spartan Elite WC) Fall 1:44</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>Quarterfinal - Britton Miller (Sparta Junior Bulldogs WC) won by major decision over Layla McFarland (Vandalia Jr WC) Maj 16-2</li>\n<li>Quarterfinal - Lila Carson (Antioch Predators WC) won by tech fall over Yaili Fortiz (Badger WC) TF 15-0</li>\n<li>Quarterfinal - Zoe Atwell (Callan Wrestling Academy) won by fall over Kaylee Lapitan (Batavia WC) Fall 1:34</li>\n<li>Quarterfinal - Layla Giertych (nWo WC) won by fall over Jaylie Lackey (Lawrence County Knights WC) Fall 1:46</li>\n<li>Cons. Round 3 - Fiona O`Connor (Rockets WC) won by major decision over Piper Mashburn (SOT-C) Maj 9-1</li>\n<li>Cons. Round 3 - Hazel Bliss (Gladiator Elite WC) won by fall over Mia Cervone (Red Raiders Wrestling Team) Fall 0:36</li>\n<li>Cons. Round 3 - Izabella Gustafson (Sherrard Jr. Tigers WC) won by decision over Gabriella Garza (Carbondale WC) Dec 12-6</li>\n<li>Cons. Round 3 - Koralee Larkin (ISI WC) won by decision over Chyanne Lee (Will County Warriors WC) Dec 4-0</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>Quarterfinal - Evelyn Koulis (Demolition WC) won in sudden victory - 1 over Maddy Choate (Trico WC) SV-1 7-5</li>\n<li>Quarterfinal - Adriana Ragona (Built By Brunson Wrestling) won by fall over Julianna Oceguera (Downers Grove WC) Fall 0:31</li>\n<li>Quarterfinal - Hadley Aeschliman (Metamora Kids WC) won by decision over Pamella Salazar (McHenry WC) Dec 11-5</li>\n<li>Quarterfinal - Brynlee Jones (Falcon Youth Wrestling) won by decision over Jordan Qualkinbush (Beat the Streets Chicago-Avondale) Dec 9-4</li>\n<li>Cons. Round 3 - Ally Atzman (Orland Park Pioneers WC) won by decision over Ellie Klein (West Suburban Girls WC) Dec 11-4</li>\n<li>Cons. Round 3 - Brenna Skinner (Maine Eagles WC) won by decision over Mylee Swaim (Oakwood Youth WC) Dec 9-5</li>\n<li>Cons. Round 3 - HenLeigh Munz (Sauk Valley WC) won in sudden victory - 1 over Merida Paddock (Antioch Predators WC) SV-1 10-8</li>\n<li>Cons. Round 3 - Genevieve Howe (Metamora Kids WC) won by decision over Chevi Sanchez (Champaign WC) Dec 4-0</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>Quarterfinal - Kylie Kasprak (LaSalle Peru Crunching Cavs Youth WC) won by fall over Ellyana Piper (Little Giants WC) Fall 2:31</li>\n<li>Quarterfinal - Norah Shick (Lawrence County Knights WC) won by decision over Leila Linton (Force Elite WC) Dec 2-0</li>\n<li>Quarterfinal - Nichole Gaskill (Elk Grove Junior Grens WC) won by decision over Kolbie Ervin (Sandwich WC) Dec 5-3</li>\n<li>Quarterfinal - Taylinn Young (Rantoul Youth Wrestling) won by decision over Kynlea Doehring (Vandalia Jr WC) Dec 7-2</li>\n<li>Cons. Round 3 - Dai Zaria Christopher (Astro WC) won by decision over Raya Reading (Little Giants WC) Dec 6-1</li>\n<li>Cons. Round 3 - Kinsley Bratcher (Southern Illinois Bulldogs WC) won by decision over Andie Anderson (St. Charles WC) Dec 3-2</li>\n<li>Cons. Round 3 - Laura Allen (Wilmington WC) won by fall over Alexi Carrasco (Caravan Kids WC) Fall 2:36</li>\n<li>Cons. Round 3 - Olivia Hruska (Antioch Predators WC) won by fall over Grace McEnaney (McHenry WC) Fall 1:46</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>Quarterfinal - Braelyn Bunting (Falcon Youth Wrestling) won by decision over Zoey Barber (Dixon WC) Dec 4-0</li>\n<li>Quarterfinal - Adair Lawrence (O`Fallon Little Panthers WC) won by fall over Kourtney Kanallakan (Edwardsville WC) Fall 2:29</li>\n<li>Quarterfinal - Avi Linhorst (Edwardsville WC) won by fall over Kaitlyn Riley (P3 Warrior Wrestling Academy) Fall 2:52</li>\n<li>Quarterfinal - Ella Anderson (Rochelle Wrestling Club) won by fall over Madelynn Wiebenga (Sauk Valley WC) Fall 1:31</li>\n<li>Cons. Round 3 - Harper Norris (McHenry WC) won by decision over Autumn Trowbridge (Highland Bulldog Jr. WC) Dec 8-3</li>\n<li>Cons. Round 3 - Irene Buzick (Midwest Central Youth WC) won by fall over Anastasia Rucinski (Tiger Town Tanglers WC) Fall 0:47</li>\n<li>Cons. Round 3 - Kenley Sondgeroth (West Suburban Girls WC) won by medical forfeit over Delaney Maloney (Tinley Park Bulldogs WC) MFF</li>\n<li>Cons. Round 3 - Emerson Seaton (Collinsville WC) won by fall over Kaylie Chmura (Frankfort Gladiator Wrestling) Fall 1:27</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>Quarterfinal - Annebelle Duller (Stateline Stingers WC) won by fall over Alayna Oakman (East Peoria River Bandits Wrestling) Fall 1:34</li>\n<li>Quarterfinal - Emilee Meier (Belleville Little Devils WC) won by fall over Chloey McBride (Oak Forest Warriors WC) Fall 2:52</li>\n<li>Quarterfinal - Mya McDonald (Demolition WC) won by fall over Francesca Yurs (ISI WC) Fall 1:19</li>\n<li>Quarterfinal - Afton Wininger (West Frankfort Jr. Redbirds WC) won by fall over Katy Nichols (Cumberland Youth WC) Fall 0:54</li>\n<li>Cons. Round 3 - Maya Moore (West Suburban Girls WC) won by fall over Kaylee Koller (Badger WC) Fall 2:35</li>\n<li>Cons. Round 3 - Carly Maloney (Tinley Park Bulldogs WC) won by fall over Maycelynn Holmes (Shelbyville Jr. Wrestling Rams) Fall 1:13</li>\n<li>Cons. Round 3 - Evangelina Guzman (Will County Warriors WC) won by fall over Laura Miller (Crawford County WC) Fall 0:38</li>\n<li>Cons. Round 3 - Rubie Ortega (MadDog Wrestling Academy) won by fall over Audriana Herzog (Marengo Youth WC) Fall 1:41</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>Quarterfinal - Dorothy Radtke (Doom Wrestling) won by fall over Presley Parker (Jr Maroons WC) Fall 1:41</li>\n<li>Quarterfinal - Blakleigh Foust (Peoria Razorbacks WC) won by fall over Alexa Nunn (Beat the Streets Chicago-Oak Park) Fall 0:37</li>\n<li>Quarterfinal - Cassie Tolliver (Springs Elite WC) won by fall over Chloe Altgilbers (Vandalia Jr WC) Fall 0:33</li>\n<li>Quarterfinal - Rosie Inman (Bismarck-Henning Youth WC) won by major decision over Reese Vest (Harvard WC) Maj 10-0</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 - Collins Miller (LaSalle Peru Crunching Cavs Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 3 - Azlynn Wilson (Benton WC) received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>Quarterfinal - Darek Diaz (ISI WC) won by major decision over Vincent Zalapi (Antioch Predators WC) Maj 10-1</li>\n<li>Quarterfinal - Degan Stulce (Southern Illinois Bulldogs WC) won in sudden victory - 1 over Colton Copstead (St. Charles WC) SV-1 6-2</li>\n<li>Quarterfinal - Jack Donnelly (Tinley Park Bulldogs WC) won by decision over Hayden Bushue (Effingham Youth WC) Dec 4-0</li>\n<li>Quarterfinal - Maxwell Berner (Lincoln-Way WC) won by decision over Liam Butts (SJO Youth WC) Dec 5-2</li>\n<li>Cons. Round 3 - Mason Black (Springs Elite WC) won by fall over Derek Hayes (SCN Youth WC) Fall 0:55</li>\n<li>Cons. Round 3 - Joseph Major (Force Elite WC) won by decision over Emmett Fobert (Moline WC) Dec 6-1</li>\n<li>Cons. Round 3 - Maxwell Fauth (Lions WC) won by decision over Luca Bartels (Fox Valley WC) Dec 4-0</li>\n<li>Cons. Round 3 - Finnegan Campbell (Headlock Wrestling Academy) won by decision over Hudsyn Pfanz (TJ Trained Wrestling) Dec 7-3</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>Quarterfinal - Grayden Schloemann (Southern Illinois Bulldogs WC) won by decision over Owen Slabaugh (Alber Athletics WC) Dec 4-0</li>\n<li>Quarterfinal - Immanuel Morales (Englewood Live Wire WC) won by decision over Drake Melton (Backyard Brawlers West Wrestling) Dec 1-0</li>\n<li>Quarterfinal - Ethan Wagner (Alber Athletics WC) won by decision over Lorenzo Caponigri (Headlock Wrestling Academy) Dec 6-0</li>\n<li>Quarterfinal - Karson Stoeckel (Bulls WC) won by major decision over Mason Akileh (Little Celtic WC) Maj 9-0</li>\n<li>Cons. Round 3 - Julian Trujillo (Built By Brunson Wrestling) won by major decision over Josiah Callahan (Clinton WC) Maj 8-0</li>\n<li>Cons. Round 3 - Jack DeGroot (Sauk Valley WC) won by decision over Chase Pool (Glenbard East Jr Rams WC) Dec 4-3</li>\n<li>Cons. Round 3 - Achilles Cortese (Cortese WC) won by fall over Brennan Caruso (McHenry WC) Fall 1:52</li>\n<li>Cons. Round 3 - Braxton Baum (SCN Youth WC) won by decision over Tom Toledo (Demolition WC) Dec 5-0</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>Quarterfinal - William Plumb (SCN Youth WC) won by decision over Paxson Minkie (Alber Athletics WC) Dec 3-0</li>\n<li>Quarterfinal - Jayse Amico (Force Elite WC) won by decision over Ryder Little (Central Illinois Bulldogs WC) Dec 3-0</li>\n<li>Quarterfinal - Ryland Brazel (Mustang WC) won by decision over Tate Adamson (SCN Youth WC) Dec 2-0</li>\n<li>Quarterfinal - Jack Wachstetter (Backyard Brawlers Midwest) won by fall over Wyatt McClain (Demolition WC) Fall 0:47</li>\n<li>Cons. Round 3 - Weston Brom (Fox Valley WC) won by decision over Quinten Shaffer (Lawrence County Knights WC) Dec 6-3</li>\n<li>Cons. Round 3 - Tucker Brand (Panther Powerhouse Wrestling) won by decision over Michael Fangerow (Lincoln-Way WC) Dec 3-2</li>\n<li>Cons. Round 3 - Jordan Easton (Springs Elite WC) won by decision over Emiliano Cid (Toss Em Up Wrestling Academy) Dec 6-2</li>\n<li>Cons. Round 3 - Anthony Federici (Headlock Wrestling Academy) won in sudden victory - 1 over Easton Poss (Yorkville WC) SV-1 2-0</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>Quarterfinal - Malik Mayfield (Toss Em Up Wrestling Academy) won by fall over Scott Kilmer (Lion`s Den Wrestling Academy) Fall 1:41</li>\n<li>Quarterfinal - Nico Distasio (Lemont Bears WC) won by major decision over Maddox Noonan (Ottawa Wolfpack WC) Maj 14-0</li>\n<li>Quarterfinal - Charlie Blake (Panther WC) won by decision over Connor Johnson (Fox Valley WC) Dec 3-0</li>\n<li>Quarterfinal - Kasen Cargo (Backyard Brawlers Midwest) won by fall over Augustine Kirk (Vandalia Jr WC) Fall 1:37</li>\n<li>Cons. Round 3 - Lawson Lokanc (Lincoln-Way WC) won by decision over Jordy Teran (Alber Athletics WC) Dec 5-1</li>\n<li>Cons. Round 3 - Drake Fahnestock (Blue Line Training Academy) won by fall over Derek Keller (Crystal Lake Wizards WC) Fall 0:35</li>\n<li>Cons. Round 3 - Sloan Sears (PSF Wrestling Academy) won by decision over Lane Graybill (Dakota WC) Dec 6-2</li>\n<li>Cons. Round 3 - Ryder Cybul (Antioch Predators WC) won in sudden victory - 1 over Tony Distasio (Lemont Bears WC) SV-1 2-0</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>Quarterfinal - Oz Bellamy (Force Elite WC) won by decision over Jaxon Sullivan (Antioch Predators WC) Dec 4-0</li>\n<li>Quarterfinal - Bennett Ledbetter (Assumption Elite WC) won in sudden victory - 1 over Dominic Warner (Harlem Huskies WC) SV-1 4-2</li>\n<li>Quarterfinal - Gionni Zapf (Alber Athletics WC) won by decision over Cayson Rogers (Lincoln-Way WC) Dec 3-0</li>\n<li>Quarterfinal - Iaromir Zhukovskii (Built By Brunson Wrestling) won by fall over Braden Larson (TJ Trained-Springfield Wrestling) Fall 1:20</li>\n<li>Cons. Round 3 - Carter Johnson (Lincoln Youth WC) won by decision over Elijah Narayanan (Batavia WC) Dec 10-6</li>\n<li>Cons. Round 3 - Damon Llanuza (St. Charles WC) won in sudden victory - 1 over Hudson Ludwig (SCN Youth WC) SV-1 2-0</li>\n<li>Cons. Round 3 - Patrick Murphy (Mustang WC) won by fall over Ben Gellings (Barrington Broncos WC) Fall 2:58</li>\n<li>Cons. Round 3 - Jaxton Zirkle (Brawlers WC) won by major decision over Kane Gabbert (Morton Youth WC) Maj 13-2</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>Quarterfinal - Cash Lucas (Ottawa Wolfpack WC) won by major decision over Eden Hickman (Bulls WC) Maj 11-1</li>\n<li>Quarterfinal - Wyatt Walker (Batavia WC) won by decision over Mincere White (Springs Elite WC) Dec 4-2</li>\n<li>Quarterfinal - Kaleb Hollins (Vittum Cats WC) won by decision over Ricky Olszta Jr (Lincoln-Way WC) Dec 5-1</li>\n<li>Quarterfinal - Vladimir Dvoryannikov (Built By Brunson Wrestling) won by decision over Ramel Jones (Hoopeston Area Youth Wrestling) Dec 2-0</li>\n<li>Cons. Round 3 - Bradley Wittenmeier (Vittum Cats WC) won by fall over Austin Villarreal (nWo WC) Fall 0:31</li>\n<li>Cons. Round 3 - Jerry Fialka (Martinez Fox Valley Elite WC) won by decision over Damoni Ford (PSF Wrestling Academy) Dec 7-1</li>\n<li>Cons. Round 3 - Gideon Ayers (ISI WC) won by decision over Landon Delisi (Built By Brunson Wrestling) Dec 4-0</li>\n<li>Cons. Round 3 - Luke Sponsel (Arlington Cardinals WC) won by fall over Tyrus Stifter (Du-Pec WC) Fall 1:56</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>Quarterfinal - Easton Tolley (Granite City Wrestling Association) won by fall over William Connors (Alber Athletics WC) Fall 1:00</li>\n<li>Quarterfinal - Colton Zabinski (Backyard Brawlers North Wrestling) won by major decision over William Perek (Mustang WC) Maj 11-2</li>\n<li>Quarterfinal - Bryson Wilkinson (SCN Youth WC) won by fall over Declan McNulty (Demolition WC) Fall 2:00</li>\n<li>Quarterfinal - Chase Gorman (SJO Youth WC) won by fall over Brady Gamage (Macomb Little Bombers Wrestling) Fall 1:54</li>\n<li>Cons. Round 3 - Hayes Kustok (Evanston School of Wrestling) won by fall over Henry Eckersley (Champions WC) Fall 0:45</li>\n<li>Cons. Round 3 - Lyeden Hankins (Highland Bulldog Jr. WC) won by decision over Knox Patient (Champaign WC) Dec 7-6</li>\n<li>Cons. Round 3 - Kolten Lowe (Hawk WC) won by decision over Sami Abuarqoub (Greg Gomez Trained Wrestling) Dec 5-2</li>\n<li>Cons. Round 3 - Gavin Eich (Dundee Highlanders WC) won by decision over Gavin Lange (Falcon Youth Wrestling) Dec 7-0</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>Quarterfinal - Maddox Birchler (Sparta Junior Bulldogs WC) won by fall over Beckett McKay (Tinley Park Bulldogs WC) Fall 1:30</li>\n<li>Quarterfinal - Gunner Latarewicz (Demolition WC) won by decision over Amro Abuarqoub (Greg Gomez Trained Wrestling) Dec 4-2</li>\n<li>Quarterfinal - William Dunn (Beat the Streets Chicago-Midway) won by decision over Caleb Weaver (Demolition WC) Dec 6-0</li>\n<li>Quarterfinal - Jordan Thompson (Lincoln-Way WC) won by decision over Marcelo Villarreal (Sandwich WC) Dec 6-2</li>\n<li>Cons. Round 3 - Liam Powell (SJO Youth WC) won by decision over Cameron Gillie (SCN Youth WC) Dec 2-0</li>\n<li>Cons. Round 3 - Liam Lane (Bulls WC) won by injury default over Karmell Jones (East St. Louis WC) Inj. 0:39</li>\n<li>Cons. Round 3 - Anthony Ariola (SCN Youth WC) won by major decision over Andrew Scorza (Arlington Cardinals WC) Maj 16-2</li>\n<li>Cons. Round 3 - Quinn McCrum (MadDog Wrestling Academy) won by decision over Colin Guisinger (Tinley Park Bulldogs WC) Dec 3-1</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>Quarterfinal - Mario Montalto (Lemont Bears WC) won by fall over Wyatt Muetze (St. Charles WC) Fall 2:35</li>\n<li>Quarterfinal - Michael Tasnic (Force Elite WC) won by disqualification over Ace Earlywine (Dakota WC) DQ</li>\n<li>Quarterfinal - Louis Baxton (Bulls WC) won by decision over Nicholas Finan (Demolition WC) Dec 9-2</li>\n<li>Quarterfinal - Cash Brown (Bismarck-Henning Youth WC) won in sudden victory - 1 over Brayden Behn (Du-Pec WC) SV-1 8-4</li>\n<li>Cons. Round 3 - Nikolas Panayi (Arlington Cardinals WC) won by decision over Major McGee (PSF Wrestling Academy) Dec 5-1</li>\n<li>Cons. Round 3 - Draven Bock (Hawk WC) won in sudden victory - 1 over Zachary Laga (Lemont Bears WC) SV-1 4-2</li>\n<li>Cons. Round 3 - Gino Marino (Headlock Wrestling Academy) won by fall over Rhett Bramley (Iguana WC) Fall 0:40</li>\n<li>Cons. Round 3 - Terrel Hinton (Toss Em Up Wrestling Academy) won by major decision over Grady Gallagher (Monticello Youth WC) Maj 12-2</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>Quarterfinal - Canyon Fillers (Alber Athletics WC) won by fall over Brendan Beidler (Notre Dame WC) Fall 1:33</li>\n<li>Quarterfinal - Jack Kosobucki (Arlington Cardinals WC) won in sudden victory - 1 over Jack Wiatr (Lemont Bears WC) SV-1 8-6</li>\n<li>Quarterfinal - Dominic Englese (St. Charles WC) won by decision over Oliver Schaps (Junior Titans Wrestling) Dec 4-0</li>\n<li>Quarterfinal - Xavier Briggs (Storm Youth WC) won by fall over Victor Vargas (Beat the Streets Chicago-Oak Park) Fall 0:52</li>\n<li>Cons. Round 3 - Matthew Smith (Benton WC) won by decision over Armani Renteria (Harvard WC) Dec 4-3</li>\n<li>Cons. Round 3 - Max Marshall (Naperville WC) won by fall over Everett Lehr (Wolves WC) Fall 2:48</li>\n<li>Cons. Round 3 - John Gavoni (Lockport Junior Porters WC) won by decision over Easton Meyers (Southern Illinois Bulldogs WC) Dec 3-2</li>\n<li>Cons. Round 3 - Luke Wagner (SJO Youth WC) won by decision over Karam Olyyan (Orland Park Pioneers WC) Dec 6-2</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>Quarterfinal - Declan Trotter (Lincoln-Way WC) won in sudden victory - 1 over Caine Rogers (Fighting Farmers WC) SV-1 6-4</li>\n<li>Quarterfinal - Cooper Wilson (SCN Youth WC) won by major decision over Joey Pauling (Mat Rat WC) Maj 16-7</li>\n<li>Quarterfinal - Welles Projansky (Built By Brunson Wrestling) won by decision over Craig Jay (Vandalia Jr WC) Dec 5-4</li>\n<li>Quarterfinal - Colten Maness (Olympia WC) won by decision over Aydan Del Muro (nWo WC) Dec 4-3</li>\n<li>Cons. Round 3 - Omar Tadros (Lockport Junior Porters WC) won by fall over Hunter Champlain (Stillman Valley WC) Fall 0:45</li>\n<li>Cons. Round 3 - Keith Stepina (Stillman Valley WC) won by decision over Gabriel Musselman (Eureka WC) Dec 5-2</li>\n<li>Cons. Round 3 - Jamarion Bell (Englewood Live Wire WC) won by fall over Elijah Griffin (Will County Warriors WC) Fall 1:18</li>\n<li>Cons. Round 3 - Liam Soutar (Bulldog Youth Sports Wrestling) won in sudden victory - 1 over Blaine Drake (The Law WC) SV-1 4-2</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>Quarterfinal - Eli Hill (SCN Youth WC) won by fall over Gavin Vogler (Oak Forest Warriors WC) Fall 2:52</li>\n<li>Quarterfinal - Colt Edwards (Murphysboro Wrestling) won by decision over Bransyn VonBehren (Monticello Youth WC) Dec 7-2</li>\n<li>Quarterfinal - Larenzo Hunter (Will County Warriors WC) won by fall over Weston Guerra (Little Giants WC) Fall 1:07</li>\n<li>Quarterfinal - Markel Davey (Champaign WC) won by fall over Jacob Hernandez (Harvard WC) Fall 0:54</li>\n<li>Cons. Round 3 - Carson Mongare (Edwardsville WC) won by major decision over Ethan Pellizzari (Hinsdale Red Devil WC) Maj 9-0</li>\n<li>Cons. Round 3 - Kameron Davis (Granite City Wrestling Association) won by decision over Reid Archer (Oswego WC) Dec 4-2</li>\n<li>Cons. Round 3 - John Gehrig (Sycamore WC) won in sudden victory - 1 over Donato Saaby (Headlock Wrestling Academy) SV-1 7-5</li>\n<li>Cons. Round 3 - Cayden Williams (Harvard WC) won by decision over Chase Spradau (Yorkville WC) Dec 6-0</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>Quarterfinal - Henry Thoms (Salem WC) won by fall over Landry Agney (Shelbyville Jr. Wrestling Rams) Fall 0:29</li>\n<li>Quarterfinal - Isaiah Jackson (Demolition WC) won by decision over Joe Burman (Antioch Predators WC) Dec 3-0</li>\n<li>Quarterfinal - Leo Floreani (MadDog Wrestling Academy) won by fall over Ulises Sanchez (Doom Wrestling) Fall 2:35</li>\n<li>Quarterfinal - Trace Young (Monticello Youth WC) won by fall over Martin Wilson (Force Elite WC) Fall 1:43</li>\n<li>Cons. Round 3 - Patrick Brennan (St. Charles WC) won by fall over Jack Harper (Jacksonville Area Wrestling) Fall 2:08</li>\n<li>Cons. Round 3 - Henry Miller (Warriors Wrestling Academy) won by fall over Brentlee Jones (Jacksonville Area Wrestling) Fall 0:28</li>\n<li>Cons. Round 3 - Adreice Russell (Rantoul Youth Wrestling) won by fall over Wyatt Miller (Monticello Youth WC) Fall 0:23</li>\n<li>Cons. Round 3 - John Jones (Granite City Wrestling Association) won by fall over Thurlow Grimm (Oakwood Youth WC) Fall 1:54</li>\n</ul>\n</section>",
  "Consolation 4th Round": "<section class=\"tw-list\">\n<h1>Consolation 4th Round</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>Cons. Round 4 - Raegan Lessner (Fox Lake WC) received a bye   () Bye</li>\n<li>Cons. Round 4 - Elena Amendola (Fox Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 4 - Rosie Pace (N.Y.A Jr. Rebels WC) received a bye   () Bye</li>\n<li>Cons. Round 4 - Georgia Blayney (DC WC) won by decision over Quinn Fahey (Wheaton WC) Dec 1-0</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>Cons. Round 4 - Bethany Schroer (East Peoria River Bandits Wrestling) won by fall over Avery Duckett (Shelbyville Jr. Wrestling Rams) Fall 1:27</li>\n<li>Cons. Round 4 - Piper Koning (Cardinals WC) won by fall over Erin Brophy (Lions WC) Fall 0:29</li>\n<li>Cons. Round 4 - LaiLani Cruz (Lionheart Intense Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 4 - Gemma Wagner (Tinley Park Bulldogs WC) won by fall over Summer Brockman (Belvidere Bandits WC) Fall 0:34</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>Cons. Round 4 - Ryan Donnelly (Tinley Park Bulldogs WC) won by decision over Zoey Willis (DC WC) Dec 5-4</li>\n<li>Cons. Round 4 - Khloe McCaslin (Sandwich WC) won by fall over Rose Bucaro (Mat Rat WC) Fall 1:49</li>\n<li>Cons. Round 4 - Elizabeth Kustok (Evanston School of Wrestling) won by fall over Cambrie Gianokis (Mat Rat WC) Fall 0:17</li>\n<li>Cons. Round 4 - Grace Sinks (TJ Trained Wrestling) won by fall over Ava Voyles (Bulls WC) Fall 0:51</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>Cons. Round 4 - Alyce Stone (Glenbard East Jr Rams WC) won by fall over Elise Thomas (Bulls WC) Fall 0:42</li>\n<li>Cons. Round 4 - Penelope Hall (Thunder WC) won by fall over Chelsea Price (Demolition WC) Fall 1:52</li>\n<li>Cons. Round 4 - Beaux McCartney (Alber Athletics WC) won by fall over Genevieve Del Muro (nWo WC) Fall 0:41</li>\n<li>Cons. Round 4 - Adalyn Albavera (Stallions Wrestling Academy) won by fall over Keagan Jadin (Oak Forest Warriors WC) Fall 1:39</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>Cons. Round 4 - Brooklyn Schultz (Naperville WC) won by fall over Makenna Austra (Bulls WC) Fall 1:30</li>\n<li>Cons. Round 4 - Mia MeGee (Quincy Little Raiders WC) won by fall over Elise LeCuyer (Sandwich WC) Fall 0:32</li>\n<li>Cons. Round 4 - Cale Duckett (Shelbyville Jr. Wrestling Rams) won by fall over Abigail Jahnel (Unity Youth WC) Fall 1:39</li>\n<li>Cons. Round 4 - Piper Angel (Clinton WC) won by fall over Raenyn Miller (Sparta Junior Bulldogs WC) Fall 0:46</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>Cons. Round 4 - Quinn Hale (Midwest Central Youth WC) won by major decision over Brooklyn McGreehin (Peotone Little Devils WC) Maj 14-2</li>\n<li>Cons. Round 4 - Alaina Linton (Oakwood Youth WC) won by major decision over Colette Gaitros (Mt. Zion Kids WC) Maj 13-3</li>\n<li>Cons. Round 4 - Ava Barber (Belvidere Bandits WC) won by decision over Zora Goebel (The Law WC) Dec 6-0</li>\n<li>Cons. Round 4 - Kinzleigh Kopka (DeKalb WC) won by fall over Elina Del Rio (Caravan Kids WC) Fall 1:24</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>Cons. Round 4 - Summar Jaber (Badger WC) won by fall over Raiza LeCompte (Tinley Park Bulldogs WC) Fall 0:13</li>\n<li>Cons. Round 4 - Brinley Wrage (Stillman Valley WC) won by decision over Madison Gregoria (Woodstock Cyclones WC) Dec 10-9</li>\n<li>Cons. Round 4 - Clara Lauer (Petersburg WC) won by fall over Mercy Lower (Tiger Town Tanglers WC) Fall 1:20</li>\n<li>Cons. Round 4 - Samari Hernandez (Bulldog Elite WC) won by fall over Whitney Wood (Peoria Wizards WC) Fall 0:33</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>Cons. Round 4 - Aryana Resendez (Rochelle Wrestling Club) won by fall over Zoey Rousseau (Beat the Streets Chicago-Midway) Fall 2:44</li>\n<li>Cons. Round 4 - Charlize Cartwright (Junior Patriots WC) won by fall over Kinley Hendricks (El Paso Gridley Youth WC) Fall 1:51</li>\n<li>Cons. Round 4 - Jazlyn Manning (Blue Crew WC) won by fall over Makaya Linville (Tiger Elite Wrestling Inc) Fall 0:35</li>\n<li>Cons. Round 4 - Charlotte Mathias (Warrensburg-Latham Jr. Cardinals WC) won by decision over Aubrey Taylor (MadDog Wrestling Academy) Dec 9-6</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>Cons. Round 4 - Peyton Murphy (Downers Grove WC) won by decision over Joseph Salzman (Lincoln-Way WC) Dec 7-0</li>\n<li>Cons. Round 4 - Kayden Chapman (Mattoon Youth WC) won in sudden victory - 1 over Daniel Garcia (Callan Wrestling Academy) SV-1 7-5</li>\n<li>Cons. Round 4 - Cole Wachstetter (Falcon Youth Wrestling) won by fall over Calvin Grant (Urbana Tigers WC) Fall 0:19</li>\n<li>Cons. Round 4 - Liam Ross (Stillman Valley WC) won by decision over Logan Soloff (Lil Reaper WC) Dec 1-0</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>Cons. Round 4 - Paul Flores (Southside Outlaws WC) won by decision over Jaxtyn LeConte (Rockford WC) Dec 5-2</li>\n<li>Cons. Round 4 - Cohen Frederick (Belvidere Bandits WC) won by decision over Noah Reyes (Beat the Streets Chicago-Avondale) Dec 4-0</li>\n<li>Cons. Round 4 - Darian Keller (Crystal Lake Wizards WC) won by decision over Ethan Heckler (Morris WC) Dec 3-2</li>\n<li>Cons. Round 4 - Jameson Chapman (Gladiator Elite WC) won by fall over Cooper Stumbaugh (Scorpion WC) Fall 0:49</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>Cons. Round 4 - Samuel Myatt (Fox Lake WC) won in sudden victory - 1 over Abrahm Leingang (Sherrard Jr. Tigers WC) SV-1 5-3</li>\n<li>Cons. Round 4 - Beckam Velarde (Yorkville WC) won by decision over Jack Kappas (Lemont Bears WC) Dec 2-1</li>\n<li>Cons. Round 4 - Tre`Lyn Morrow (Crystal Lake Wizards WC) won by decision over Tyler Winterhalter (Arlington Cardinals WC) Dec 7-2</li>\n<li>Cons. Round 4 - Boston Blakely (Alber Athletics WC) won by fall over Cooper Corona (Mustang WC) Fall 2:25</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>Cons. Round 4 - Hiro Hongmoungkhoune (Alber Athletics WC) won by decision over Lane Kesler (Fisher WC) Dec 4-2</li>\n<li>Cons. Round 4 - Hiram Bulava (SCN Youth WC) won by fall over William Fitzgerald (Little Celtic WC) Fall 1:23</li>\n<li>Cons. Round 4 - Parker Lilas (Lemont Bears WC) won by decision over Ryan Campos (Fox Lake WC) Dec 2-1</li>\n<li>Cons. Round 4 - Zackary Vest (TJ Trained Wrestling) won by fall over Nolan Rodriguez (Riot Room Wrestling) Fall 1:46</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>Cons. Round 4 - Lennux Mays (PSF Wrestling Academy) won by fall over Elijah Foss (Gladiator Elite WC) Fall 1:27</li>\n<li>Cons. Round 4 - Jack Wood (Granite City Wrestling Association) won by decision over John Wiatr (Lemont Bears WC) Dec 6-3</li>\n<li>Cons. Round 4 - Justin-Carter Jones (Toss Em Up Wrestling Academy) won by decision over Wells Millard (Rochelle Wrestling Club) Dec 5-4</li>\n<li>Cons. Round 4 - Brycen Legue (Stillman Valley WC) won by fall over Trecyn Holba (Frankfort Gladiator Wrestling) Fall 2:30</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>Cons. Round 4 - Vincent Jimenez (Crystal Lake Wizards WC) won by fall over Brody Cohen (Built By Brunson Wrestling) Fall 1:29</li>\n<li>Cons. Round 4 - Cooper Whaley (Rockford WC) won by decision over Timothy Block (Mattoon Youth WC) Dec 5-0</li>\n<li>Cons. Round 4 - Jack Wishnevski (Cory Clark Wrestling) won by decision over Dominic Adamo (Arlington Cardinals WC) Dec 6-0</li>\n<li>Cons. Round 4 - Madden Grieve (Highland Bulldog Jr. WC) won by fall over Mason Trettin (Tinley Park Bulldogs WC) Fall 0:27</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>Cons. Round 4 - Armando Perez (Southside Outlaws WC) won by fall over Zachary Haas (Naperville WC) Fall 0:30</li>\n<li>Cons. Round 4 - Jordan Benefiel (nWo WC) won in sudden victory - 1 over Liam Santiago (Fox Valley WC) SV-1 6-8</li>\n<li>Cons. Round 4 - Lodi Morgan (Wilmington WC) won by major decision over James Newell (Springs Elite WC) Maj 8-0</li>\n<li>Cons. Round 4 - Drake Baker (Lawrence County Knights WC) won by fall over Antonio Medina (Arlington Cardinals WC) Fall 0:35</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>Cons. Round 4 - Quinton Odonnell (Morris WC) won by decision over Ares Robelo (Scorpion WC) Dec 4-2</li>\n<li>Cons. Round 4 - Bishop Edmond (Southside Outlaws WC) won by fall over Jory Logan (Belleville Little Devils WC) Fall 0:40</li>\n<li>Cons. Round 4 - Oakley Davis (Iguana WC) won by fall over Logan Shreve (PSF Wrestling Academy) Fall 0:48</li>\n<li>Cons. Round 4 - Anthony Schaffer (Izzy Style Wrestling) won by fall over Immanuel Hampton (Team Mascoutah WC) Fall 1:59</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>Cons. Round 4 - Cameron Tutko (Streator WC) won by fall over Rhett Eastin (Olney Cubs WC) Fall 1:00</li>\n<li>Cons. Round 4 - Declan Wilking (Wilmington WC) won by fall over Miles Schmid (Clinton WC) Fall 0:55</li>\n<li>Cons. Round 4 - Brody Crumly (Petersburg WC) won by fall over Ayden McAuliffe (Tinley Park Bulldogs WC) Fall 2:40</li>\n<li>Cons. Round 4 - Gabriel Tatum (Lion`s Den Wrestling Academy) won by tech fall over Benjamin Townsend (Wheaton WC) TF 16-1</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>Cons. Round 4 - Noah Jaber (Badger WC) won by fall over Jake Meeks (Lawrence County Knights WC) Fall 2:26</li>\n<li>Cons. Round 4 - Tyler Wirth (Lemont Bears WC) won by fall over Vedder Anello (Mattoon Youth WC) Fall 2:00</li>\n<li>Cons. Round 4 - Jack Brown (Mustang WC) won by decision over Quinn Shelby (Little Celtic WC) Dec 7-6</li>\n<li>Cons. Round 4 - Brevin Whipple (Du-Pec WC) won by fall over Dion Wilson (Downers Grove WC) Fall 1:49</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>Cons. Round 4 - Jake Jerik (Antioch Predators WC) won by fall over William Blomberg (Yorkville WC) Fall 1:40</li>\n<li>Cons. Round 4 - Cohen McCarron (Lincoln-Way WC) won by tech fall over Brent Hills Ii (Champions WC) TF 15-0</li>\n<li>Cons. Round 4 - Karter Smith (SJO Youth WC) won by fall over Liam Fitzpatrick (Mustang WC) Fall 0:29</li>\n<li>Cons. Round 4 - Liam Lee (Built By Brunson Wrestling) won by fall over Crosby Michaelis (Carlinville WC) Fall 2:26</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>Cons. Round 4 - Christian Potts (Doom Wrestling) won by fall over Boston Black (Murphysboro Wrestling) Fall 0:49</li>\n<li>Cons. Round 4 - Waylin Rogers (Vandalia Jr WC) won by decision over Jeremiyah Winn (Harvey Twisters WC) Dec 8-5</li>\n<li>Cons. Round 4 - Braxton Slack (Belvidere Bandits WC) won by decision over Dylan Orozco (Oak Forest Warriors WC) Dec 3-2</li>\n<li>Cons. Round 4 - Brock Harvey (Hononegah WC) won by decision over Donnagain Mallory (Mustang WC) Dec 7-5</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>Cons. Round 4 - Anthony Coix (Batavia WC) won by fall over Remy Meadors (Peotone Little Devils WC) Fall 0:34</li>\n<li>Cons. Round 4 - Beau Hill (Champions WC) won by fall over Roman Lucio (Badger WC) Fall 1:20</li>\n<li>Cons. Round 4 - Joel Ware (Du-Pec WC) won by major decision over Crew Miller (Prairie Central Youth Wrestling) Maj 11-0</li>\n<li>Cons. Round 4 - Ethan Kennedy (Bulls WC) won by fall over Landon Haak (Stillman Valley WC) Fall 1:46</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>Cons. Round 4 -   () received a bye   () Bye</li>\n<li>Cons. Round 4 - Rosemary Hileman (AJ Jr. Wildcats WC) received a bye   () Bye</li>\n<li>Cons. Round 4 -   () received a bye   () Bye</li>\n<li>Cons. Round 4 - Abigail Cortez (Will County Warriors WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>Cons. Round 4 - Sophia Olandese (Wheaton WC) received a bye   () Bye</li>\n<li>Cons. Round 4 -   () received a bye   () Bye</li>\n<li>Cons. Round 4 - Marli Cobbs (Belleville Little Devils WC) received a bye   () Bye</li>\n<li>Cons. Round 4 - Rayelynn Hartmann (Tiger Town Tanglers WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>Cons. Round 4 - Kathlynn Sturhahn (Quincy Little Raiders WC) won by decision over Saige Danneberger (Shelbyville Jr. Wrestling Rams) Dec 3-1</li>\n<li>Cons. Round 4 - Ivy Sullivan (Dixon WC) won by fall over Mayleigh Bly (Shelbyville Jr. Wrestling Rams) Fall 0:45</li>\n<li>Cons. Round 4 - Isabella Hudison (Bismarck-Henning Youth WC) won by decision over Ava Willock (Rockets WC) Dec 3-0</li>\n<li>Cons. Round 4 - Aubrey Schmieding (O`Fallon Little Panthers WC) won by fall over Veda Bailey (Warriors Wrestling Academy) Fall 0:48</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>Cons. Round 4 - Yaili Fortiz (Badger WC) won by decision over Fiona O`Connor (Rockets WC) Dec 8-2</li>\n<li>Cons. Round 4 - Hazel Bliss (Gladiator Elite WC) won by decision over Layla McFarland (Vandalia Jr WC) Dec 3-0</li>\n<li>Cons. Round 4 - Jaylie Lackey (Lawrence County Knights WC) won by major decision over Izabella Gustafson (Sherrard Jr. Tigers WC) Maj 9-0</li>\n<li>Cons. Round 4 - Kaylee Lapitan (Batavia WC) won by major decision over Koralee Larkin (ISI WC) Maj 11-1</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>Cons. Round 4 - Julianna Oceguera (Downers Grove WC) won by decision over Ally Atzman (Orland Park Pioneers WC) Dec 6-2</li>\n<li>Cons. Round 4 - Maddy Choate (Trico WC) won by fall over Brenna Skinner (Maine Eagles WC) Fall 2:28</li>\n<li>Cons. Round 4 - Jordan Qualkinbush (Beat the Streets Chicago-Avondale) won by decision over HenLeigh Munz (Sauk Valley WC) Dec 9-5</li>\n<li>Cons. Round 4 - Genevieve Howe (Metamora Kids WC) won by decision over Pamella Salazar (McHenry WC) Dec 6-1</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>Cons. Round 4 - Leila Linton (Force Elite WC) won by fall over Dai Zaria Christopher (Astro WC) Fall 1:34</li>\n<li>Cons. Round 4 - Kinsley Bratcher (Southern Illinois Bulldogs WC) won by decision over Ellyana Piper (Little Giants WC) Dec 5-2</li>\n<li>Cons. Round 4 - Laura Allen (Wilmington WC) won by major decision over Kynlea Doehring (Vandalia Jr WC) Maj 11-3</li>\n<li>Cons. Round 4 - Olivia Hruska (Antioch Predators WC) won by major decision over Kolbie Ervin (Sandwich WC) Maj 9-0</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>Cons. Round 4 - Kourtney Kanallakan (Edwardsville WC) won by fall over Harper Norris (McHenry WC) Fall 0:18</li>\n<li>Cons. Round 4 - Zoey Barber (Dixon WC) won by decision over Irene Buzick (Midwest Central Youth WC) Dec 7-0</li>\n<li>Cons. Round 4 - Kenley Sondgeroth (West Suburban Girls WC) won by fall over Madelynn Wiebenga (Sauk Valley WC) Fall 0:21</li>\n<li>Cons. Round 4 - Emerson Seaton (Collinsville WC) won by fall over Kaitlyn Riley (P3 Warrior Wrestling Academy) Fall 2:30</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>Cons. Round 4 - Chloey McBride (Oak Forest Warriors WC) won by decision over Maya Moore (West Suburban Girls WC) Dec 5-0</li>\n<li>Cons. Round 4 - Carly Maloney (Tinley Park Bulldogs WC) won by fall over Alayna Oakman (East Peoria River Bandits Wrestling) Fall 0:34</li>\n<li>Cons. Round 4 - Evangelina Guzman (Will County Warriors WC) won by fall over Katy Nichols (Cumberland Youth WC) Fall 0:44</li>\n<li>Cons. Round 4 - Francesca Yurs (ISI WC) won by fall over Rubie Ortega (MadDog Wrestling Academy) Fall 0:56</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>Cons. Round 4 - Alexa Nunn (Beat the Streets Chicago-Oak Park) received a bye   () Bye</li>\n<li>Cons. Round 4 - Collins Miller (LaSalle Peru Crunching Cavs Youth WC) won by fall over Presley Parker (Jr Maroons WC) Fall 0:40</li>\n<li>Cons. Round 4 - Reese Vest (Harvard WC) won by decision over Azlynn Wilson (Benton WC) Dec 5-3</li>\n<li>Cons. Round 4 - Chloe Altgilbers (Vandalia Jr WC) received a bye   () Bye</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>Cons. Round 4 - Colton Copstead (St. Charles WC) won by fall over Mason Black (Springs Elite WC) Fall 2:25</li>\n<li>Cons. Round 4 - Vincent Zalapi (Antioch Predators WC) won in sudden victory - 1 over Joseph Major (Force Elite WC) SV-1 3-2</li>\n<li>Cons. Round 4 - Maxwell Fauth (Lions WC) won by decision over Liam Butts (SJO Youth WC) Dec 5-4</li>\n<li>Cons. Round 4 - Finnegan Campbell (Headlock Wrestling Academy) won by major decision over Hayden Bushue (Effingham Youth WC) Maj 12-2</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>Cons. Round 4 - Drake Melton (Backyard Brawlers West Wrestling) won by major decision over Julian Trujillo (Built By Brunson Wrestling) Maj 11-0</li>\n<li>Cons. Round 4 - Owen Slabaugh (Alber Athletics WC) won by fall over Jack DeGroot (Sauk Valley WC) Fall 1:27</li>\n<li>Cons. Round 4 - Achilles Cortese (Cortese WC) won by fall over Mason Akileh (Little Celtic WC) Fall 0:59</li>\n<li>Cons. Round 4 - Lorenzo Caponigri (Headlock Wrestling Academy) won by fall over Braxton Baum (SCN Youth WC) Fall 0:53</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>Cons. Round 4 - Ryder Little (Central Illinois Bulldogs WC) won by decision over Weston Brom (Fox Valley WC) Dec 3-0</li>\n<li>Cons. Round 4 - Paxson Minkie (Alber Athletics WC) won by decision over Tucker Brand (Panther Powerhouse Wrestling) Dec 6-2</li>\n<li>Cons. Round 4 - Wyatt McClain (Demolition WC) won by fall over Jordan Easton (Springs Elite WC) Fall 0:43</li>\n<li>Cons. Round 4 - Anthony Federici (Headlock Wrestling Academy) won by decision over Tate Adamson (SCN Youth WC) Dec 4-0</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>Cons. Round 4 - Maddox Noonan (Ottawa Wolfpack WC) won by decision over Lawson Lokanc (Lincoln-Way WC) Dec 7-2</li>\n<li>Cons. Round 4 - Drake Fahnestock (Blue Line Training Academy) won by major decision over Scott Kilmer (Lion`s Den Wrestling Academy) Maj 14-0</li>\n<li>Cons. Round 4 - Sloan Sears (PSF Wrestling Academy) won by fall over Augustine Kirk (Vandalia Jr WC) Fall 2:54</li>\n<li>Cons. Round 4 - Connor Johnson (Fox Valley WC) won by decision over Ryder Cybul (Antioch Predators WC) Dec 8-1</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>Cons. Round 4 - Dominic Warner (Harlem Huskies WC) won by decision over Carter Johnson (Lincoln Youth WC) Dec 6-3</li>\n<li>Cons. Round 4 - Jaxon Sullivan (Antioch Predators WC) won by major decision over Damon Llanuza (St. Charles WC) Maj 10-2</li>\n<li>Cons. Round 4 - Braden Larson (TJ Trained-Springfield Wrestling) won by decision over Patrick Murphy (Mustang WC) Dec 5-0</li>\n<li>Cons. Round 4 - Cayson Rogers (Lincoln-Way WC) won by fall over Jaxton Zirkle (Brawlers WC) Fall 0:57</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>Cons. Round 4 - Bradley Wittenmeier (Vittum Cats WC) won by fall over Mincere White (Springs Elite WC) Fall 2:19</li>\n<li>Cons. Round 4 - Jerry Fialka (Martinez Fox Valley Elite WC) won in sudden victory - 1 over Eden Hickman (Bulls WC) SV-1 6-4</li>\n<li>Cons. Round 4 - Gideon Ayers (ISI WC) won by decision over Ramel Jones (Hoopeston Area Youth Wrestling) Dec 8-1</li>\n<li>Cons. Round 4 - Luke Sponsel (Arlington Cardinals WC) won by decision over Ricky Olszta Jr (Lincoln-Way WC) Dec 5-3</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>Cons. Round 4 - William Perek (Mustang WC) won by decision over Hayes Kustok (Evanston School of Wrestling) Dec 3-2</li>\n<li>Cons. Round 4 - William Connors (Alber Athletics WC) won by major decision over Lyeden Hankins (Highland Bulldog Jr. WC) Maj 11-0</li>\n<li>Cons. Round 4 - Kolten Lowe (Hawk WC) won by decision over Brady Gamage (Macomb Little Bombers Wrestling) Dec 5-4</li>\n<li>Cons. Round 4 - Declan McNulty (Demolition WC) won by fall over Gavin Eich (Dundee Highlanders WC) Fall 2:23</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>Cons. Round 4 - Amro Abuarqoub (Greg Gomez Trained Wrestling) won by major decision over Liam Powell (SJO Youth WC) Maj 13-2</li>\n<li>Cons. Round 4 - Liam Lane (Bulls WC) won by fall over Beckett McKay (Tinley Park Bulldogs WC) Fall 1:39</li>\n<li>Cons. Round 4 - Marcelo Villarreal (Sandwich WC) won by decision over Anthony Ariola (SCN Youth WC) Dec 5-4</li>\n<li>Cons. Round 4 - Quinn McCrum (MadDog Wrestling Academy) won by decision over Caleb Weaver (Demolition WC) Dec 7-2</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>Cons. Round 4 - Nikolas Panayi (Arlington Cardinals WC) won by forfeit over Ace Earlywine (Dakota WC) FF</li>\n<li>Cons. Round 4 - Draven Bock (Hawk WC) won by decision over Wyatt Muetze (St. Charles WC) Dec 4-0</li>\n<li>Cons. Round 4 - Gino Marino (Headlock Wrestling Academy) won by decision over Brayden Behn (Du-Pec WC) Dec 8-2</li>\n<li>Cons. Round 4 - Nicholas Finan (Demolition WC) won by fall over Terrel Hinton (Toss Em Up Wrestling Academy) Fall 0:50</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>Cons. Round 4 - Matthew Smith (Benton WC) won by decision over Jack Wiatr (Lemont Bears WC) Dec 6-2</li>\n<li>Cons. Round 4 - Brendan Beidler (Notre Dame WC) won by decision over Max Marshall (Naperville WC) Dec 4-2</li>\n<li>Cons. Round 4 - Victor Vargas (Beat the Streets Chicago-Oak Park) won by decision over John Gavoni (Lockport Junior Porters WC) Dec 3-1</li>\n<li>Cons. Round 4 - Oliver Schaps (Junior Titans Wrestling) won by decision over Luke Wagner (SJO Youth WC) Dec 4-3</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>Cons. Round 4 - Omar Tadros (Lockport Junior Porters WC) won by fall over Joey Pauling (Mat Rat WC) Fall 1:46</li>\n<li>Cons. Round 4 - Caine Rogers (Fighting Farmers WC) won by major decision over Keith Stepina (Stillman Valley WC) Maj 8-0</li>\n<li>Cons. Round 4 - Aydan Del Muro (nWo WC) won by decision over Jamarion Bell (Englewood Live Wire WC) Dec 10-6</li>\n<li>Cons. Round 4 - Craig Jay (Vandalia Jr WC) won by fall over Liam Soutar (Bulldog Youth Sports Wrestling) Fall 2:44</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>Cons. Round 4 - Carson Mongare (Edwardsville WC) won by decision over Bransyn VonBehren (Monticello Youth WC) Dec 9-2</li>\n<li>Cons. Round 4 - Gavin Vogler (Oak Forest Warriors WC) won by fall over Kameron Davis (Granite City Wrestling Association) Fall 0:52</li>\n<li>Cons. Round 4 - John Gehrig (Sycamore WC) won by fall over Jacob Hernandez (Harvard WC) Fall 1:39</li>\n<li>Cons. Round 4 - Cayden Williams (Harvard WC) won by decision over Weston Guerra (Little Giants WC) Dec 4-0</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>Cons. Round 4 - Patrick Brennan (St. Charles WC) won by fall over Joe Burman (Antioch Predators WC) Fall 2:45</li>\n<li>Cons. Round 4 - Landry Agney (Shelbyville Jr. Wrestling Rams) won by fall over Henry Miller (Warriors Wrestling Academy) Fall 0:39</li>\n<li>Cons. Round 4 - Martin Wilson (Force Elite WC) won by fall over Adreice Russell (Rantoul Youth Wrestling) Fall 0:44</li>\n<li>Cons. Round 4 - Ulises Sanchez (Doom Wrestling) won by fall over John Jones (Granite City Wrestling Association) Fall 2:43</li>\n</ul>\n</section>",
  "Champ Semis & Consolation 5th Round": "<section class=\"tw-list\">\n<h1>Champ Semis &amp; Consolation 5th Round</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>Semifinal - Maleya Campbell (Wilmington WC) won by fall over Brooklyn Sharwarko (Lil` Coalers WC) Fall 0:42</li>\n<li>Semifinal - Kyla Kucala (Little Celtic WC) won by fall over Isabella Huff (Vandalia Jr WC) Fall 0:21</li>\n<li>Cons. Round 5 - Raegan Lessner (Fox Lake WC) won by decision over Elena Amendola (Fox Valley WC) Dec 6-1</li>\n<li>Cons. Round 5 - Georgia Blayney (DC WC) won by fall over Rosie Pace (N.Y.A Jr. Rebels WC) Fall 0:38</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>Semifinal - Adalynn Taylor (Rocket Fuel WC) won by fall over Nicolette Giardino (Rockets WC) Fall 2:21</li>\n<li>Semifinal - Swayze Campbell (Wilmington WC) won by fall over Emery Westerberg (Tinley Park Bulldogs WC) Fall 0:20</li>\n<li>Cons. Round 5 - Piper Koning (Cardinals WC) won by decision over Bethany Schroer (East Peoria River Bandits Wrestling) Dec 12-8</li>\n<li>Cons. Round 5 - LaiLani Cruz (Lionheart Intense Wrestling) won by fall over Gemma Wagner (Tinley Park Bulldogs WC) Fall 0:50</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>Semifinal - Ella Terhaar (Wolves WC) won by major decision over Anya Rossi (Arlington Cardinals WC) Maj 13-1</li>\n<li>Semifinal - Emmerson Lange (Falcon Youth Wrestling) won by decision over Aleerah Snow (Champions WC) Dec 6-4</li>\n<li>Cons. Round 5 - Khloe McCaslin (Sandwich WC) won in sudden victory - 1 over Ryan Donnelly (Tinley Park Bulldogs WC) SV-1 11-9</li>\n<li>Cons. Round 5 - Grace Sinks (TJ Trained Wrestling) won by major decision over Elizabeth Kustok (Evanston School of Wrestling) Maj 15-2</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>Semifinal - Amina Perez (Greg Gomez Trained Wrestling) won by major decision over Maggie Larson (DeKalb WC) Maj 9-1</li>\n<li>Semifinal - Sloane Gabler (Sauk Valley WC) won by decision over Patricia Tytus (RTC Wrestling) Dec 5-4</li>\n<li>Cons. Round 5 - Penelope Hall (Thunder WC) won by fall over Alyce Stone (Glenbard East Jr Rams WC) Fall 0:39</li>\n<li>Cons. Round 5 - Adalyn Albavera (Stallions Wrestling Academy) won by fall over Beaux McCartney (Alber Athletics WC) Fall 1:15</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>Semifinal - Hadley Slabaugh (Harlem Huskies WC) won in sudden victory - 1 over Calli Hickman (Bulls WC) SV-1 4-2</li>\n<li>Semifinal - Savannah Paynes (Bulldog Elite WC) won by decision over Angelina Perez (Dundee Highlanders WC) Dec 7-2</li>\n<li>Cons. Round 5 - Mia MeGee (Quincy Little Raiders WC) won by fall over Brooklyn Schultz (Naperville WC) Fall 1:50</li>\n<li>Cons. Round 5 - Cale Duckett (Shelbyville Jr. Wrestling Rams) won by fall over Piper Angel (Clinton WC) Fall 1:36</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>Semifinal - Londyn Bellamy (Force Elite WC) won by fall over Lexi Suits (Gladiator Elite WC) Fall 1:31</li>\n<li>Semifinal - Victoria Kasky (Gladiator Elite WC) won by fall over Rylee Colby (Batavia WC) Fall 1:23</li>\n<li>Cons. Round 5 - Quinn Hale (Midwest Central Youth WC) won by fall over Alaina Linton (Oakwood Youth WC) Fall 2:59</li>\n<li>Cons. Round 5 - Ava Barber (Belvidere Bandits WC) won by fall over Kinzleigh Kopka (DeKalb WC) Fall 2:45</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>Semifinal - Trinity Grace Larsen (Fox Lake WC) won by decision over Natalie Smith (Granite City Wrestling Association) Dec 4-3</li>\n<li>Semifinal - Emmlyne Shaw (Peotone Little Devils WC) won by decision over Hollyn Boggess (Panther Powerhouse Wrestling) Dec 4-1</li>\n<li>Cons. Round 5 - Summar Jaber (Badger WC) won by fall over Brinley Wrage (Stillman Valley WC) Fall 2:41</li>\n<li>Cons. Round 5 - Samari Hernandez (Bulldog Elite WC) won by fall over Clara Lauer (Petersburg WC) Fall 2:43</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>Semifinal - Kennedy Erickson (DeKalb WC) won by fall over Michaelene Andler (Naperville WC) Fall 2:57</li>\n<li>Semifinal - Mckinley Allen (Riot Room Wrestling) won by decision over Ava Durham (Tinley Park Bulldogs WC) Dec 5-1</li>\n<li>Cons. Round 5 - Aryana Resendez (Rochelle Wrestling Club) won by fall over Charlize Cartwright (Junior Patriots WC) Fall 2:59</li>\n<li>Cons. Round 5 - Jazlyn Manning (Blue Crew WC) won by fall over Charlotte Mathias (Warrensburg-Latham Jr. Cardinals WC) Fall 2:40</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>Semifinal - Declan Roach (Panther WC) won by decision over Daxton Lillis (Southern Illinois Bulldogs WC) Dec 8-1</li>\n<li>Semifinal - Derrick Cue (Astro WC) won by major decision over Maddux Giffin (Reed Custer Jr. Panthers WC) Maj 13-5</li>\n<li>Cons. Round 5 - Peyton Murphy (Downers Grove WC) won by fall over Kayden Chapman (Mattoon Youth WC) Fall 1:45</li>\n<li>Cons. Round 5 - Liam Ross (Stillman Valley WC) won by decision over Cole Wachstetter (Falcon Youth Wrestling) Dec 6-4</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>Semifinal - Chase Amorn (RTC Wrestling) won by major decision over Axel Graves (SJO Youth WC) Maj 9-1</li>\n<li>Semifinal - Leonidas Cortese (Cortese WC) won by medical forfeit over Andre McGuire (Urbana Tigers WC) MFF</li>\n<li>Cons. Round 5 - Paul Flores (Southside Outlaws WC) won by major decision over Cohen Frederick (Belvidere Bandits WC) Maj 10-2</li>\n<li>Cons. Round 5 - Darian Keller (Crystal Lake Wizards WC) won by decision over Jameson Chapman (Gladiator Elite WC) Dec 2-0</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>Semifinal - River Couture (Cory Clark Wrestling) won by fall over Abel Muniz (Force Elite WC) Fall 0:32</li>\n<li>Semifinal - Carson Gallo (SJO Youth WC) won by decision over Kenton Raab (Stockton Renegades WC) Dec 8-6</li>\n<li>Cons. Round 5 - Beckam Velarde (Yorkville WC) won by medical forfeit over Samuel Myatt (Fox Lake WC) MFF</li>\n<li>Cons. Round 5 - Boston Blakely (Alber Athletics WC) won by major decision over Tre`Lyn Morrow (Crystal Lake Wizards WC) Maj 9-0</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>Semifinal - Grayson Temple (Fox Lake WC) won by major decision over Layton Kraemer (Nomad Wrestling Academy) Maj 13-5</li>\n<li>Semifinal - Thomas Reis (Southern Illinois Bulldogs WC) won by fall over Evan Ross (Stillman Valley WC) Fall 2:31</li>\n<li>Cons. Round 5 - Hiram Bulava (SCN Youth WC) won by decision over Hiro Hongmoungkhoune (Alber Athletics WC) Dec 4-2</li>\n<li>Cons. Round 5 - Zackary Vest (TJ Trained Wrestling) won by fall over Parker Lilas (Lemont Bears WC) Fall 1:50</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>Semifinal - Tagg Hefner (TJ Trained Wrestling) won by major decision over Aaron Munks (Pontiac WC) Maj 12-0</li>\n<li>Semifinal - Maddox Fialka (Martinez Fox Valley Elite WC) won by decision over Pedro Legend Rangel (Storm Youth WC) Dec 6-0</li>\n<li>Cons. Round 5 - Lennux Mays (PSF Wrestling Academy) won by decision over Jack Wood (Granite City Wrestling Association) Dec 8-2</li>\n<li>Cons. Round 5 - Brycen Legue (Stillman Valley WC) won by decision over Justin-Carter Jones (Toss Em Up Wrestling Academy) Dec 8-3</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>Semifinal - Camden Fitzgerald (Little Celtic WC) won by tech fall over Brock Kirschke (Crystal Lake Wizards WC) TF 16-1</li>\n<li>Semifinal - Jack Gorman (SJO Youth WC) won by decision over Briggs Whiting (Force Elite WC) Dec 4-0</li>\n<li>Cons. Round 5 - Cooper Whaley (Rockford WC) won by fall over Vincent Jimenez (Crystal Lake Wizards WC) Fall 1:08</li>\n<li>Cons. Round 5 - Jack Wishnevski (Cory Clark Wrestling) won by decision over Madden Grieve (Highland Bulldog Jr. WC) Dec 7-0</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>Semifinal - Anthony Ragona (Built By Brunson Wrestling) won by decision over Shane McNulty (Demolition WC) Dec 4-0</li>\n<li>Semifinal - Killien Schwarz (Riot Room Wrestling) won by decision over Adam Krokos (Orland Park Pioneers WC) Dec 4-0</li>\n<li>Cons. Round 5 - Armando Perez (Southside Outlaws WC) won by fall over Jordan Benefiel (nWo WC) Fall 0:16</li>\n<li>Cons. Round 5 - Lodi Morgan (Wilmington WC) won by fall over Drake Baker (Lawrence County Knights WC) Fall 2:41</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>Semifinal - Padraig Brady (Demolition WC) won by decision over Lincoln Projansky (Built By Brunson Wrestling) Dec 2-0</li>\n<li>Semifinal - Logan Linton (Force Elite WC) won by fall over Traxton Renfroe (East Peoria River Bandits Wrestling) Fall 1:58</li>\n<li>Cons. Round 5 - Bishop Edmond (Southside Outlaws WC) won by decision over Quinton Odonnell (Morris WC) Dec 4-1</li>\n<li>Cons. Round 5 - Anthony Schaffer (Izzy Style Wrestling) won by decision over Oakley Davis (Iguana WC) Dec 12-10</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>Semifinal - Alexander Cid (Toss Em Up Wrestling Academy) won by decision over Keegan Mullen (McHenry WC) Dec 6-0</li>\n<li>Semifinal - Nehemiah Andronic (Rochelle Wrestling Club) won by major decision over Jackson Moreno (Belvidere Bandits WC) Maj 12-1</li>\n<li>Cons. Round 5 - Declan Wilking (Wilmington WC) won by tech fall over Cameron Tutko (Streator WC) TF 18-2</li>\n<li>Cons. Round 5 - Brody Crumly (Petersburg WC) won by decision over Gabriel Tatum (Lion`s Den Wrestling Academy) Dec 5-2</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>Semifinal - Daquain Hubbard Jr (Urbana Tigers WC) won by fall over Evan Uhls (Gladiator Elite WC) Fall 0:41</li>\n<li>Semifinal - Kingston Hamilton (Wildcats Wrestling Academy) won by fall over Declan Jones (Arlington Cardinals WC) Fall 2:58</li>\n<li>Cons. Round 5 - Noah Jaber (Badger WC) won by fall over Tyler Wirth (Lemont Bears WC) Fall 2:48</li>\n<li>Cons. Round 5 - Jack Brown (Mustang WC) won by major decision over Brevin Whipple (Du-Pec WC) Maj 12-2</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>Semifinal - Vincent Englese (St. Charles WC) won by major decision over Bennett Campos (Blue Line Training Academy) Maj 11-0</li>\n<li>Semifinal - Wells Kustok (Evanston School of Wrestling) won by decision over Alexander Martinez (Red Raiders Wrestling Team) Dec 4-0</li>\n<li>Cons. Round 5 - Cohen McCarron (Lincoln-Way WC) won by decision over Jake Jerik (Antioch Predators WC) Dec 12-11</li>\n<li>Cons. Round 5 - Karter Smith (SJO Youth WC) won by decision over Liam Lee (Built By Brunson Wrestling) Dec 7-6</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>Semifinal - Joseph Englese (St. Charles WC) won by fall over Leonard Morgan (Wilmington WC) Fall 0:42</li>\n<li>Semifinal - Hunter Archer (Brawlers WC) won by major decision over Levi Palmer (Hononegah WC) Maj 12-0</li>\n<li>Cons. Round 5 - Waylin Rogers (Vandalia Jr WC) won by fall over Christian Potts (Doom Wrestling) Fall 2:32</li>\n<li>Cons. Round 5 - Braxton Slack (Belvidere Bandits WC) won by decision over Brock Harvey (Hononegah WC) Dec 6-5</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>Semifinal - Cal Butikofer (Yorkville WC) won by decision over Tony Hess (Wildcats Wrestling Academy) Dec 2-0</li>\n<li>Semifinal - Bryce Boltz (Sycamore WC) won by decision over Brayson Foust (Peoria Razorbacks WC) Dec 8-1</li>\n<li>Cons. Round 5 - Beau Hill (Champions WC) won by fall over Anthony Coix (Batavia WC) Fall 0:47</li>\n<li>Cons. Round 5 - Joel Ware (Du-Pec WC) won by fall over Ethan Kennedy (Bulls WC) Fall 2:12</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>Semifinal - Annabelle Hoffman (Sauk Valley WC) won by decision over Alina Gomez (Oak Forest Warriors WC) Dec 7-1</li>\n<li>Semifinal - Maggie Ortiz (Tinley Park Bulldogs WC) won by fall over Oakli Gorman (SJO Youth WC) Fall 1:43</li>\n<li>Cons. Round 5 - Rosemary Hileman (AJ Jr. Wildcats WC) received a bye   () Bye</li>\n<li>Cons. Round 5 - Abigail Cortez (Will County Warriors WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>Semifinal - Bailey Flanigan (Bulls WC) won in sudden victory - 1 over Stella Eimer (TJ Trained Wrestling) SV-1 2-0</li>\n<li>Semifinal - Adelle Dunaway (St. Charles WC) won by decision over Jayla Godina (Lincoln-Way WC) Dec 9-5</li>\n<li>Cons. Round 5 - Sophia Olandese (Wheaton WC) received a bye   () Bye</li>\n<li>Cons. Round 5 - Marli Cobbs (Belleville Little Devils WC) won by fall over Rayelynn Hartmann (Tiger Town Tanglers WC) Fall 0:25</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>Semifinal - Elizabeth Agajanian (Sandwich WC) won by decision over Eliana Ortega (Beat the Streets Chicago-Midway) Dec 2-0</li>\n<li>Semifinal - Reese Davis (Spartan WC) won by major decision over Carrie Larsen (Fox Lake WC) Maj 9-0</li>\n<li>Cons. Round 5 - Ivy Sullivan (Dixon WC) won by decision over Kathlynn Sturhahn (Quincy Little Raiders WC) Dec 7-1</li>\n<li>Cons. Round 5 - Isabella Hudison (Bismarck-Henning Youth WC) won by decision over Aubrey Schmieding (O`Fallon Little Panthers WC) Dec 9-4</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>Semifinal - Lila Carson (Antioch Predators WC) won by decision over Britton Miller (Sparta Junior Bulldogs WC) Dec 5-0</li>\n<li>Semifinal - Zoe Atwell (Callan Wrestling Academy) won in sudden victory - 1 over Layla Giertych (nWo WC) SV-1 6-4</li>\n<li>Cons. Round 5 - Yaili Fortiz (Badger WC) won by decision over Hazel Bliss (Gladiator Elite WC) Dec 4-0</li>\n<li>Cons. Round 5 - Kaylee Lapitan (Batavia WC) won by major decision over Jaylie Lackey (Lawrence County Knights WC) Maj 10-0</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>Semifinal - Adriana Ragona (Built By Brunson Wrestling) won by fall over Evelyn Koulis (Demolition WC) Fall 0:36</li>\n<li>Semifinal - Brynlee Jones (Falcon Youth Wrestling) won by decision over Hadley Aeschliman (Metamora Kids WC) Dec 9-2</li>\n<li>Cons. Round 5 - Maddy Choate (Trico WC) won by fall over Julianna Oceguera (Downers Grove WC) Fall 2:40</li>\n<li>Cons. Round 5 - Jordan Qualkinbush (Beat the Streets Chicago-Avondale) won by major decision over Genevieve Howe (Metamora Kids WC) Maj 13-4</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>Semifinal - Norah Shick (Lawrence County Knights WC) won by decision over Kylie Kasprak (LaSalle Peru Crunching Cavs Youth WC) Dec 4-2</li>\n<li>Semifinal - Nichole Gaskill (Elk Grove Junior Grens WC) won by decision over Taylinn Young (Rantoul Youth Wrestling) Dec 4-3</li>\n<li>Cons. Round 5 - Leila Linton (Force Elite WC) won by fall over Kinsley Bratcher (Southern Illinois Bulldogs WC) Fall 0:43</li>\n<li>Cons. Round 5 - Laura Allen (Wilmington WC) won by major decision over Olivia Hruska (Antioch Predators WC) Maj 16-6</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>Semifinal - Braelyn Bunting (Falcon Youth Wrestling) won by decision over Adair Lawrence (O`Fallon Little Panthers WC) Dec 3-2</li>\n<li>Semifinal - Ella Anderson (Rochelle Wrestling Club) won by fall over Avi Linhorst (Edwardsville WC) Fall 1:58</li>\n<li>Cons. Round 5 - Kourtney Kanallakan (Edwardsville WC) won by fall over Zoey Barber (Dixon WC) Fall 0:28</li>\n<li>Cons. Round 5 - Kenley Sondgeroth (West Suburban Girls WC) won by decision over Emerson Seaton (Collinsville WC) Dec 6-0</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>Semifinal - Emilee Meier (Belleville Little Devils WC) won by major decision over Annebelle Duller (Stateline Stingers WC) Maj 10-0</li>\n<li>Semifinal - Afton Wininger (West Frankfort Jr. Redbirds WC) won by fall over Mya McDonald (Demolition WC) Fall 2:18</li>\n<li>Cons. Round 5 - Carly Maloney (Tinley Park Bulldogs WC) won by decision over Chloey McBride (Oak Forest Warriors WC) Dec 7-4</li>\n<li>Cons. Round 5 - Evangelina Guzman (Will County Warriors WC) won by decision over Francesca Yurs (ISI WC) Dec 12-10</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>Semifinal - Blakleigh Foust (Peoria Razorbacks WC) won by fall over Dorothy Radtke (Doom Wrestling) Fall 2:26</li>\n<li>Semifinal - Cassie Tolliver (Springs Elite WC) won by decision over Rosie Inman (Bismarck-Henning Youth WC) Dec 7-0</li>\n<li>Cons. Round 5 - Alexa Nunn (Beat the Streets Chicago-Oak Park) won by decision over Collins Miller (LaSalle Peru Crunching Cavs Youth WC) Dec 4-0</li>\n<li>Cons. Round 5 - Chloe Altgilbers (Vandalia Jr WC) won by fall over Reese Vest (Harvard WC) Fall 0:22</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>Semifinal - Darek Diaz (ISI WC) won by decision over Degan Stulce (Southern Illinois Bulldogs WC) Dec 8-2</li>\n<li>Semifinal - Jack Donnelly (Tinley Park Bulldogs WC) won by decision over Maxwell Berner (Lincoln-Way WC) Dec 6-0</li>\n<li>Cons. Round 5 - Colton Copstead (St. Charles WC) won by decision over Vincent Zalapi (Antioch Predators WC) Dec 7-0</li>\n<li>Cons. Round 5 - Maxwell Fauth (Lions WC) won by fall over Finnegan Campbell (Headlock Wrestling Academy) Fall 1:54</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>Semifinal - Grayden Schloemann (Southern Illinois Bulldogs WC) won by decision over Immanuel Morales (Englewood Live Wire WC) Dec 7-3</li>\n<li>Semifinal - Ethan Wagner (Alber Athletics WC) won by decision over Karson Stoeckel (Bulls WC) Dec 7-0</li>\n<li>Cons. Round 5 - Drake Melton (Backyard Brawlers West Wrestling) won by decision over Owen Slabaugh (Alber Athletics WC) Dec 7-2</li>\n<li>Cons. Round 5 - Lorenzo Caponigri (Headlock Wrestling Academy) won by major decision over Achilles Cortese (Cortese WC) Maj 13-4</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>Semifinal - William Plumb (SCN Youth WC) won by decision over Jayse Amico (Force Elite WC) Dec 5-2</li>\n<li>Semifinal - Ryland Brazel (Mustang WC) won by decision over Jack Wachstetter (Backyard Brawlers Midwest) Dec 6-4</li>\n<li>Cons. Round 5 - Paxson Minkie (Alber Athletics WC) won in sudden victory - 1 over Ryder Little (Central Illinois Bulldogs WC) SV-1 6-2</li>\n<li>Cons. Round 5 - Wyatt McClain (Demolition WC) won by major decision over Anthony Federici (Headlock Wrestling Academy) Maj 10-0</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>Semifinal - Nico Distasio (Lemont Bears WC) won by decision over Malik Mayfield (Toss Em Up Wrestling Academy) Dec 13-6</li>\n<li>Semifinal - Kasen Cargo (Backyard Brawlers Midwest) won in tie breaker - 1 over Charlie Blake (Panther WC) TB-1 2-0</li>\n<li>Cons. Round 5 - Drake Fahnestock (Blue Line Training Academy) won by decision over Maddox Noonan (Ottawa Wolfpack WC) Dec 6-1</li>\n<li>Cons. Round 5 - Connor Johnson (Fox Valley WC) won by decision over Sloan Sears (PSF Wrestling Academy) Dec 6-4</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>Semifinal - Bennett Ledbetter (Assumption Elite WC) won in sudden victory - 1 over Oz Bellamy (Force Elite WC) SV-1 4-2</li>\n<li>Semifinal - Iaromir Zhukovskii (Built By Brunson Wrestling) won by fall over Gionni Zapf (Alber Athletics WC) Fall 0:13</li>\n<li>Cons. Round 5 - Jaxon Sullivan (Antioch Predators WC) won by decision over Dominic Warner (Harlem Huskies WC) Dec 6-3</li>\n<li>Cons. Round 5 - Cayson Rogers (Lincoln-Way WC) won by fall over Braden Larson (TJ Trained-Springfield Wrestling) Fall 1:41</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>Semifinal - Cash Lucas (Ottawa Wolfpack WC) won in sudden victory - 1 over Wyatt Walker (Batavia WC) SV-1 2-0</li>\n<li>Semifinal - Kaleb Hollins (Vittum Cats WC) won by decision over Vladimir Dvoryannikov (Built By Brunson Wrestling) Dec 7-0</li>\n<li>Cons. Round 5 - Bradley Wittenmeier (Vittum Cats WC) won by decision over Jerry Fialka (Martinez Fox Valley Elite WC) Dec 4-0</li>\n<li>Cons. Round 5 - Gideon Ayers (ISI WC) won by decision over Luke Sponsel (Arlington Cardinals WC) Dec 5-1</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>Semifinal - Colton Zabinski (Backyard Brawlers North Wrestling) won by major decision over Easton Tolley (Granite City Wrestling Association) Maj 9-0</li>\n<li>Semifinal - Bryson Wilkinson (SCN Youth WC) won by decision over Chase Gorman (SJO Youth WC) Dec 4-2</li>\n<li>Cons. Round 5 - William Connors (Alber Athletics WC) won by fall over William Perek (Mustang WC) Fall 2:56</li>\n<li>Cons. Round 5 - Declan McNulty (Demolition WC) won by decision over Kolten Lowe (Hawk WC) Dec 2-1</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>Semifinal - Maddox Birchler (Sparta Junior Bulldogs WC) won by decision over Gunner Latarewicz (Demolition WC) Dec 3-0</li>\n<li>Semifinal - Jordan Thompson (Lincoln-Way WC) won by decision over William Dunn (Beat the Streets Chicago-Midway) Dec 5-2</li>\n<li>Cons. Round 5 - Liam Lane (Bulls WC) won by major decision over Amro Abuarqoub (Greg Gomez Trained Wrestling) Maj 8-0</li>\n<li>Cons. Round 5 - Quinn McCrum (MadDog Wrestling Academy) won by decision over Marcelo Villarreal (Sandwich WC) Dec 8-2</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>Semifinal - Michael Tasnic (Force Elite WC) won by fall over Mario Montalto (Lemont Bears WC) Fall 1:42</li>\n<li>Semifinal - Louis Baxton (Bulls WC) won in sudden victory - 1 over Cash Brown (Bismarck-Henning Youth WC) SV-1 2-0</li>\n<li>Cons. Round 5 - Draven Bock (Hawk WC) won by fall over Nikolas Panayi (Arlington Cardinals WC) Fall 0:38</li>\n<li>Cons. Round 5 - Nicholas Finan (Demolition WC) won by fall over Gino Marino (Headlock Wrestling Academy) Fall 0:54</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>Semifinal - Canyon Fillers (Alber Athletics WC) won by fall over Jack Kosobucki (Arlington Cardinals WC) Fall 1:13</li>\n<li>Semifinal - Dominic Englese (St. Charles WC) won by fall over Xavier Briggs (Storm Youth WC) Fall 1:51</li>\n<li>Cons. Round 5 - Matthew Smith (Benton WC) won by decision over Brendan Beidler (Notre Dame WC) Dec 6-4</li>\n<li>Cons. Round 5 - Victor Vargas (Beat the Streets Chicago-Oak Park) won by decision over Oliver Schaps (Junior Titans Wrestling) Dec 4-1</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>Semifinal - Declan Trotter (Lincoln-Way WC) won by decision over Cooper Wilson (SCN Youth WC) Dec 7-3</li>\n<li>Semifinal - Colten Maness (Olympia WC) won by decision over Welles Projansky (Built By Brunson Wrestling) Dec 2-0</li>\n<li>Cons. Round 5 - Caine Rogers (Fighting Farmers WC) won by fall over Omar Tadros (Lockport Junior Porters WC) Fall 2:25</li>\n<li>Cons. Round 5 - Craig Jay (Vandalia Jr WC) won by major decision over Aydan Del Muro (nWo WC) Maj 14-5</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>Semifinal - Colt Edwards (Murphysboro Wrestling) won by decision over Eli Hill (SCN Youth WC) Dec 1-0</li>\n<li>Semifinal - Markel Davey (Champaign WC) won by fall over Larenzo Hunter (Will County Warriors WC) Fall 0:24</li>\n<li>Cons. Round 5 - Carson Mongare (Edwardsville WC) won by fall over Gavin Vogler (Oak Forest Warriors WC) Fall 1:27</li>\n<li>Cons. Round 5 - John Gehrig (Sycamore WC) won in tie breaker - 1 over Cayden Williams (Harvard WC) TB-1 3-2</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>Semifinal - Isaiah Jackson (Demolition WC) won by fall over Henry Thoms (Salem WC) Fall 0:21</li>\n<li>Semifinal - Trace Young (Monticello Youth WC) won by fall over Leo Floreani (MadDog Wrestling Academy) Fall 0:41</li>\n<li>Cons. Round 5 - Patrick Brennan (St. Charles WC) won by fall over Landry Agney (Shelbyville Jr. Wrestling Rams) Fall 0:35</li>\n<li>Cons. Round 5 - Martin Wilson (Force Elite WC) won by decision over Ulises Sanchez (Doom Wrestling) Dec 7-0</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>Cons. Semi - Isabella Huff (Vandalia Jr WC) won by fall over Raegan Lessner (Fox Lake WC) Fall 0:23</li>\n<li>Cons. Semi - Brooklyn Sharwarko (Lil` Coalers WC) won by fall over Georgia Blayney (DC WC) Fall 1:51</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>Cons. Semi - Emery Westerberg (Tinley Park Bulldogs WC) won by decision over Piper Koning (Cardinals WC) Dec 4-0</li>\n<li>Cons. Semi - Nicolette Giardino (Rockets WC) won by decision over LaiLani Cruz (Lionheart Intense Wrestling) Dec 11-4</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>Cons. Semi - Khloe McCaslin (Sandwich WC) won by decision over Aleerah Snow (Champions WC) Dec 5-2</li>\n<li>Cons. Semi - Grace Sinks (TJ Trained Wrestling) won by fall over Anya Rossi (Arlington Cardinals WC) Fall 0:52</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>Cons. Semi - Patricia Tytus (RTC Wrestling) won by disqualification over Penelope Hall (Thunder WC) DQ</li>\n<li>Cons. Semi - Maggie Larson (DeKalb WC) won by major decision over Adalyn Albavera (Stallions Wrestling Academy) Maj 14-0</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>Cons. Semi - Angelina Perez (Dundee Highlanders WC) won by decision over Mia MeGee (Quincy Little Raiders WC) Dec 6-2</li>\n<li>Cons. Semi - Cale Duckett (Shelbyville Jr. Wrestling Rams) won by decision over Calli Hickman (Bulls WC) Dec 6-0</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>Cons. Semi - Quinn Hale (Midwest Central Youth WC) won by major decision over Rylee Colby (Batavia WC) Maj 9-0</li>\n<li>Cons. Semi - Lexi Suits (Gladiator Elite WC) won by fall over Ava Barber (Belvidere Bandits WC) Fall 2:00</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>Cons. Semi - Summar Jaber (Badger WC) won by decision over Hollyn Boggess (Panther Powerhouse Wrestling) Dec 6-2</li>\n<li>Cons. Semi - Natalie Smith (Granite City Wrestling Association) won by fall over Samari Hernandez (Bulldog Elite WC) Fall 2:35</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>Cons. Semi - Aryana Resendez (Rochelle Wrestling Club) won by decision over Ava Durham (Tinley Park Bulldogs WC) Dec 2-1</li>\n<li>Cons. Semi - Michaelene Andler (Naperville WC) won by fall over Jazlyn Manning (Blue Crew WC) Fall 3:00</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>Cons. Semi - Maddux Giffin (Reed Custer Jr. Panthers WC) won by decision over Peyton Murphy (Downers Grove WC) Dec 5-1</li>\n<li>Cons. Semi - Daxton Lillis (Southern Illinois Bulldogs WC) won in sudden victory - 1 over Liam Ross (Stillman Valley WC) SV-1 4-2</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>Cons. Semi - Andre McGuire (Urbana Tigers WC) won by fall over Paul Flores (Southside Outlaws WC) Fall 1:21</li>\n<li>Cons. Semi - Axel Graves (SJO Youth WC) won by decision over Darian Keller (Crystal Lake Wizards WC) Dec 4-0</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>Cons. Semi - Beckam Velarde (Yorkville WC) won by decision over Kenton Raab (Stockton Renegades WC) Dec 3-2</li>\n<li>Cons. Semi - Abel Muniz (Force Elite WC) won by decision over Boston Blakely (Alber Athletics WC) Dec 4-1</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>Cons. Semi - Evan Ross (Stillman Valley WC) won by fall over Hiram Bulava (SCN Youth WC) Fall 0:27</li>\n<li>Cons. Semi - Layton Kraemer (Nomad Wrestling Academy) won by fall over Zackary Vest (TJ Trained Wrestling) Fall 1:25</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>Cons. Semi - Pedro Legend Rangel (Storm Youth WC) won by major decision over Lennux Mays (PSF Wrestling Academy) Maj 9-0</li>\n<li>Cons. Semi - Brycen Legue (Stillman Valley WC) won by decision over Aaron Munks (Pontiac WC) Dec 8-5</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>Cons. Semi - Briggs Whiting (Force Elite WC) won by fall over Cooper Whaley (Rockford WC) Fall 1:21</li>\n<li>Cons. Semi - Jack Wishnevski (Cory Clark Wrestling) won by decision over Brock Kirschke (Crystal Lake Wizards WC) Dec 4-0</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>Cons. Semi - Armando Perez (Southside Outlaws WC) won by decision over Adam Krokos (Orland Park Pioneers WC) Dec 10-5</li>\n<li>Cons. Semi - Lodi Morgan (Wilmington WC) won by fall over Shane McNulty (Demolition WC) Fall 2:52</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>Cons. Semi - Bishop Edmond (Southside Outlaws WC) won by decision over Traxton Renfroe (East Peoria River Bandits Wrestling) Dec 3-2</li>\n<li>Cons. Semi - Lincoln Projansky (Built By Brunson Wrestling) won by decision over Anthony Schaffer (Izzy Style Wrestling) Dec 2-1</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>Cons. Semi - Jackson Moreno (Belvidere Bandits WC) won by decision over Declan Wilking (Wilmington WC) Dec 7-4</li>\n<li>Cons. Semi - Keegan Mullen (McHenry WC) won by fall over Brody Crumly (Petersburg WC) Fall 2:40</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>Cons. Semi - Noah Jaber (Badger WC) won by decision over Declan Jones (Arlington Cardinals WC) Dec 11-4</li>\n<li>Cons. Semi - Evan Uhls (Gladiator Elite WC) won by major decision over Jack Brown (Mustang WC) Maj 8-0</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>Cons. Semi - Alexander Martinez (Red Raiders Wrestling Team) won in sudden victory - 1 over Cohen McCarron (Lincoln-Way WC) SV-1 6-4</li>\n<li>Cons. Semi - Karter Smith (SJO Youth WC) won by decision over Bennett Campos (Blue Line Training Academy) Dec 7-1</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>Cons. Semi - Waylin Rogers (Vandalia Jr WC) won by decision over Levi Palmer (Hononegah WC) Dec 4-2</li>\n<li>Cons. Semi - Leonard Morgan (Wilmington WC) won by fall over Braxton Slack (Belvidere Bandits WC) Fall 0:43</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>Cons. Semi - Brayson Foust (Peoria Razorbacks WC) won by fall over Beau Hill (Champions WC) Fall 1:33</li>\n<li>Cons. Semi - Joel Ware (Du-Pec WC) won by decision over Tony Hess (Wildcats Wrestling Academy) Dec 5-1</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>Cons. Semi - Oakli Gorman (SJO Youth WC) won by decision over Rosemary Hileman (AJ Jr. Wildcats WC) Dec 4-3</li>\n<li>Cons. Semi - Abigail Cortez (Will County Warriors WC) won by fall over Alina Gomez (Oak Forest Warriors WC) Fall 0:53</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>Cons. Semi - Jayla Godina (Lincoln-Way WC) won by decision over Sophia Olandese (Wheaton WC) Dec 11-5</li>\n<li>Cons. Semi - Stella Eimer (TJ Trained Wrestling) won by decision over Marli Cobbs (Belleville Little Devils WC) Dec 7-2</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>Cons. Semi - Ivy Sullivan (Dixon WC) won in tie breaker - 1 over Carrie Larsen (Fox Lake WC) TB-1 3-2</li>\n<li>Cons. Semi - Eliana Ortega (Beat the Streets Chicago-Midway) won by decision over Isabella Hudison (Bismarck-Henning Youth WC) Dec 4-1</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>Cons. Semi - Layla Giertych (nWo WC) won by decision over Yaili Fortiz (Badger WC) Dec 6-4</li>\n<li>Cons. Semi - Britton Miller (Sparta Junior Bulldogs WC) won by fall over Kaylee Lapitan (Batavia WC) Fall 0:46</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>Cons. Semi - Hadley Aeschliman (Metamora Kids WC) won by injury default over Maddy Choate (Trico WC) Inj. 1:05</li>\n<li>Cons. Semi - Evelyn Koulis (Demolition WC) won by major decision over Jordan Qualkinbush (Beat the Streets Chicago-Avondale) Maj 10-1</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>Cons. Semi - Leila Linton (Force Elite WC) won by fall over Taylinn Young (Rantoul Youth Wrestling) Fall 0:29</li>\n<li>Cons. Semi - Kylie Kasprak (LaSalle Peru Crunching Cavs Youth WC) won by major decision over Laura Allen (Wilmington WC) Maj 16-2</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>Cons. Semi - Avi Linhorst (Edwardsville WC) won by decision over Kourtney Kanallakan (Edwardsville WC) Dec 6-1</li>\n<li>Cons. Semi - Adair Lawrence (O`Fallon Little Panthers WC) won by fall over Kenley Sondgeroth (West Suburban Girls WC) Fall 2:43</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>Cons. Semi - Mya McDonald (Demolition WC) won by major decision over Carly Maloney (Tinley Park Bulldogs WC) Maj 12-2</li>\n<li>Cons. Semi - Annebelle Duller (Stateline Stingers WC) won by decision over Evangelina Guzman (Will County Warriors WC) Dec 5-2</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>Cons. Semi - Rosie Inman (Bismarck-Henning Youth WC) won by decision over Alexa Nunn (Beat the Streets Chicago-Oak Park) Dec 7-0</li>\n<li>Cons. Semi - Dorothy Radtke (Doom Wrestling) won by fall over Chloe Altgilbers (Vandalia Jr WC) Fall 1:44</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>Cons. Semi - Colton Copstead (St. Charles WC) won by medical forfeit over Maxwell Berner (Lincoln-Way WC) MFF</li>\n<li>Cons. Semi - Degan Stulce (Southern Illinois Bulldogs WC) won by decision over Maxwell Fauth (Lions WC) Dec 8-4</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>Cons. Semi - Drake Melton (Backyard Brawlers West Wrestling) won by major decision over Karson Stoeckel (Bulls WC) Maj 10-0</li>\n<li>Cons. Semi - Immanuel Morales (Englewood Live Wire WC) won by decision over Lorenzo Caponigri (Headlock Wrestling Academy) Dec 10-3</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>Cons. Semi - Paxson Minkie (Alber Athletics WC) won by decision over Jack Wachstetter (Backyard Brawlers Midwest) Dec 7-3</li>\n<li>Cons. Semi - Jayse Amico (Force Elite WC) won by decision over Wyatt McClain (Demolition WC) Dec 6-0</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>Cons. Semi - Drake Fahnestock (Blue Line Training Academy) won by decision over Charlie Blake (Panther WC) Dec 9-2</li>\n<li>Cons. Semi - Malik Mayfield (Toss Em Up Wrestling Academy) won by decision over Connor Johnson (Fox Valley WC) Dec 10-5</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>Cons. Semi - Gionni Zapf (Alber Athletics WC) won in sudden victory - 1 over Jaxon Sullivan (Antioch Predators WC) SV-1 5-4</li>\n<li>Cons. Semi - Oz Bellamy (Force Elite WC) won by decision over Cayson Rogers (Lincoln-Way WC) Dec 3-0</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>Cons. Semi - Bradley Wittenmeier (Vittum Cats WC) won by fall over Vladimir Dvoryannikov (Built By Brunson Wrestling) Fall 2:39</li>\n<li>Cons. Semi - Wyatt Walker (Batavia WC) won by decision over Gideon Ayers (ISI WC) Dec 7-2</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>Cons. Semi - William Connors (Alber Athletics WC) won by decision over Chase Gorman (SJO Youth WC) Dec 4-3</li>\n<li>Cons. Semi - Easton Tolley (Granite City Wrestling Association) won by decision over Declan McNulty (Demolition WC) Dec 5-1</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>Cons. Semi - Liam Lane (Bulls WC) won by major decision over William Dunn (Beat the Streets Chicago-Midway) Maj 10-0</li>\n<li>Cons. Semi - Gunner Latarewicz (Demolition WC) won by major decision over Quinn McCrum (MadDog Wrestling Academy) Maj 9-0</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>Cons. Semi - Cash Brown (Bismarck-Henning Youth WC) won by decision over Draven Bock (Hawk WC) Dec 6-0</li>\n<li>Cons. Semi - Nicholas Finan (Demolition WC) won by decision over Mario Montalto (Lemont Bears WC) Dec 6-0</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>Cons. Semi - Xavier Briggs (Storm Youth WC) won by decision over Matthew Smith (Benton WC) Dec 5-4</li>\n<li>Cons. Semi - Victor Vargas (Beat the Streets Chicago-Oak Park) won by decision over Jack Kosobucki (Arlington Cardinals WC) Dec 6-0</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>Cons. Semi - Caine Rogers (Fighting Farmers WC) won by major decision over Welles Projansky (Built By Brunson Wrestling) Maj 9-0</li>\n<li>Cons. Semi - Craig Jay (Vandalia Jr WC) won by fall over Cooper Wilson (SCN Youth WC) Fall 1:00</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>Cons. Semi - Larenzo Hunter (Will County Warriors WC) won by fall over Carson Mongare (Edwardsville WC) Fall 1:53</li>\n<li>Cons. Semi - John Gehrig (Sycamore WC) won by fall over Eli Hill (SCN Youth WC) Fall 2:39</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>Cons. Semi - Patrick Brennan (St. Charles WC) won by fall over Leo Floreani (MadDog Wrestling Academy) Fall 1:27</li>\n<li>Cons. Semi - Henry Thoms (Salem WC) won by fall over Martin Wilson (Force Elite WC) Fall 1:54</li>\n</ul>\n</section>",
  "3rd, 5th, & 7th Place Bouts": "<section class=\"tw-list\">\n<h1>3rd, 5th, &amp; 7th Place Bouts</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>3rd Place Match - Isabella Huff (Vandalia Jr WC) won by fall over Brooklyn Sharwarko (Lil` Coalers WC) Fall 1:39</li>\n<li>5th Place Match - Raegan Lessner (Fox Lake WC) won by decision over Georgia Blayney (DC WC) Dec 9-2</li>\n<li>7th Place Match - Elena Amendola (Fox Valley WC) won by fall over Rosie Pace (N.Y.A Jr. Rebels WC) Fall 2:56</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>3rd Place Match - Nicolette Giardino (Rockets WC) won by fall over Emery Westerberg (Tinley Park Bulldogs WC) Fall 2:24</li>\n<li>5th Place Match - LaiLani Cruz (Lionheart Intense Wrestling) won by fall over Piper Koning (Cardinals WC) Fall 2:49</li>\n<li>7th Place Match - Gemma Wagner (Tinley Park Bulldogs WC) won by fall over Bethany Schroer (East Peoria River Bandits Wrestling) Fall 0:23</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>3rd Place Match - Grace Sinks (TJ Trained Wrestling) won by decision over Khloe McCaslin (Sandwich WC) Dec 7-4</li>\n<li>5th Place Match - Anya Rossi (Arlington Cardinals WC) won by fall over Aleerah Snow (Champions WC) Fall 0:59</li>\n<li>7th Place Match - Elizabeth Kustok (Evanston School of Wrestling) won by decision over Ryan Donnelly (Tinley Park Bulldogs WC) Dec 8-5</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>3rd Place Match - Patricia Tytus (RTC Wrestling) won by major decision over Maggie Larson (DeKalb WC) Maj 10-1</li>\n<li>5th Place Match - Adalyn Albavera (Stallions Wrestling Academy) won by forfeit over   () FF</li>\n<li>7th Place Match - Alyce Stone (Glenbard East Jr Rams WC) won by major decision over Beaux McCartney (Alber Athletics WC) Maj 15-2</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>3rd Place Match - Angelina Perez (Dundee Highlanders WC) won by fall over Cale Duckett (Shelbyville Jr. Wrestling Rams) Fall 1:33</li>\n<li>5th Place Match - Calli Hickman (Bulls WC) won by decision over Mia MeGee (Quincy Little Raiders WC) Dec 4-0</li>\n<li>7th Place Match - Piper Angel (Clinton WC) won by fall over Brooklyn Schultz (Naperville WC) Fall 1:25</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>3rd Place Match - Lexi Suits (Gladiator Elite WC) won by major decision over Quinn Hale (Midwest Central Youth WC) Maj 10-0</li>\n<li>5th Place Match - Rylee Colby (Batavia WC) won by fall over Ava Barber (Belvidere Bandits WC) Fall 0:53</li>\n<li>7th Place Match - Alaina Linton (Oakwood Youth WC) won by decision over Kinzleigh Kopka (DeKalb WC) Dec 4-2</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>3rd Place Match - Summar Jaber (Badger WC) won by major decision over Natalie Smith (Granite City Wrestling Association) Maj 11-2</li>\n<li>5th Place Match - Hollyn Boggess (Panther Powerhouse Wrestling) won by fall over Samari Hernandez (Bulldog Elite WC) Fall 1:34</li>\n<li>7th Place Match - Brinley Wrage (Stillman Valley WC) won by decision over Clara Lauer (Petersburg WC) Dec 3-2</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>3rd Place Match - Aryana Resendez (Rochelle Wrestling Club) won by decision over Michaelene Andler (Naperville WC) Dec 6-3</li>\n<li>5th Place Match - Jazlyn Manning (Blue Crew WC) won by fall over Ava Durham (Tinley Park Bulldogs WC) Fall 2:20</li>\n<li>7th Place Match - Charlize Cartwright (Junior Patriots WC) won by fall over Charlotte Mathias (Warrensburg-Latham Jr. Cardinals WC) Fall 0:32</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>3rd Place Match - Daxton Lillis (Southern Illinois Bulldogs WC) won by decision over Maddux Giffin (Reed Custer Jr. Panthers WC) Dec 12-9</li>\n<li>5th Place Match - Peyton Murphy (Downers Grove WC) won by fall over Liam Ross (Stillman Valley WC) Fall 0:34</li>\n<li>7th Place Match - Cole Wachstetter (Falcon Youth Wrestling) won by decision over Kayden Chapman (Mattoon Youth WC) Dec 9-8</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>3rd Place Match - Andre McGuire (Urbana Tigers WC) won by decision over Axel Graves (SJO Youth WC) Dec 8-1</li>\n<li>5th Place Match - Paul Flores (Southside Outlaws WC) won by decision over Darian Keller (Crystal Lake Wizards WC) Dec 4-0</li>\n<li>7th Place Match - Jameson Chapman (Gladiator Elite WC) won by major decision over Cohen Frederick (Belvidere Bandits WC) Maj 14-3</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>3rd Place Match - Abel Muniz (Force Elite WC) won by decision over Beckam Velarde (Yorkville WC) Dec 3-0</li>\n<li>5th Place Match - Boston Blakely (Alber Athletics WC) won by decision over Kenton Raab (Stockton Renegades WC) Dec 5-0</li>\n<li>7th Place Match - Tre`Lyn Morrow (Crystal Lake Wizards WC) won by medical forfeit over Samuel Myatt (Fox Lake WC) MFF</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>3rd Place Match - Evan Ross (Stillman Valley WC) won by decision over Layton Kraemer (Nomad Wrestling Academy) Dec 2-0</li>\n<li>5th Place Match - Zackary Vest (TJ Trained Wrestling) won by decision over Hiram Bulava (SCN Youth WC) Dec 9-7</li>\n<li>7th Place Match - Parker Lilas (Lemont Bears WC) won by medical forfeit over Hiro Hongmoungkhoune (Alber Athletics WC) MFF</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>3rd Place Match - Pedro Legend Rangel (Storm Youth WC) won by fall over Brycen Legue (Stillman Valley WC) Fall 0:52</li>\n<li>5th Place Match - Lennux Mays (PSF Wrestling Academy) won by decision over Aaron Munks (Pontiac WC) Dec 4-1</li>\n<li>7th Place Match - Jack Wood (Granite City Wrestling Association) won by decision over Justin-Carter Jones (Toss Em Up Wrestling Academy) Dec 4-3</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>3rd Place Match - Jack Wishnevski (Cory Clark Wrestling) won by decision over Briggs Whiting (Force Elite WC) Dec 2-0</li>\n<li>5th Place Match - Brock Kirschke (Crystal Lake Wizards WC) won by fall over Cooper Whaley (Rockford WC) Fall 1:27</li>\n<li>7th Place Match - Madden Grieve (Highland Bulldog Jr. WC) won by decision over Vincent Jimenez (Crystal Lake Wizards WC) Dec 10-4</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>3rd Place Match - Armando Perez (Southside Outlaws WC) won by fall over Lodi Morgan (Wilmington WC) Fall 0:15</li>\n<li>5th Place Match - Shane McNulty (Demolition WC) won by fall over Adam Krokos (Orland Park Pioneers WC) Fall 2:39</li>\n<li>7th Place Match - Drake Baker (Lawrence County Knights WC) won by decision over Jordan Benefiel (nWo WC) Dec 2-0</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>3rd Place Match - Bishop Edmond (Southside Outlaws WC) won by decision over Lincoln Projansky (Built By Brunson Wrestling) Dec 9-2</li>\n<li>5th Place Match - Traxton Renfroe (East Peoria River Bandits Wrestling) won by decision over Anthony Schaffer (Izzy Style Wrestling) Dec 4-0</li>\n<li>7th Place Match - Oakley Davis (Iguana WC) won in sudden victory - 1 over Quinton Odonnell (Morris WC) SV-1 4-2</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>3rd Place Match - Jackson Moreno (Belvidere Bandits WC) won by major decision over Keegan Mullen (McHenry WC) Maj 9-1</li>\n<li>5th Place Match - Declan Wilking (Wilmington WC) won by decision over Brody Crumly (Petersburg WC) Dec 3-2</li>\n<li>7th Place Match - Gabriel Tatum (Lion`s Den Wrestling Academy) won by decision over Cameron Tutko (Streator WC) Dec 8-3</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>3rd Place Match - Evan Uhls (Gladiator Elite WC) won by decision over Noah Jaber (Badger WC) Dec 5-2</li>\n<li>5th Place Match - Jack Brown (Mustang WC) won by decision over Declan Jones (Arlington Cardinals WC) Dec 10-5</li>\n<li>7th Place Match - Brevin Whipple (Du-Pec WC) won by fall over Tyler Wirth (Lemont Bears WC) Fall 2:54</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>3rd Place Match - Karter Smith (SJO Youth WC) won by fall over Alexander Martinez (Red Raiders Wrestling Team) Fall 1:00</li>\n<li>5th Place Match - Bennett Campos (Blue Line Training Academy) won by fall over Cohen McCarron (Lincoln-Way WC) Fall 2:59</li>\n<li>7th Place Match - Liam Lee (Built By Brunson Wrestling) won by decision over Jake Jerik (Antioch Predators WC) Dec 8-2</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>3rd Place Match - Leonard Morgan (Wilmington WC) won by major decision over Waylin Rogers (Vandalia Jr WC) Maj 10-0</li>\n<li>5th Place Match - Levi Palmer (Hononegah WC) won by fall over Braxton Slack (Belvidere Bandits WC) Fall 2:32</li>\n<li>7th Place Match - Brock Harvey (Hononegah WC) won by decision over Christian Potts (Doom Wrestling) Dec 12-6</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>3rd Place Match - Joel Ware (Du-Pec WC) won by fall over Brayson Foust (Peoria Razorbacks WC) Fall 1:14</li>\n<li>5th Place Match - Beau Hill (Champions WC) won by fall over Tony Hess (Wildcats Wrestling Academy) Fall 1:14</li>\n<li>7th Place Match - Ethan Kennedy (Bulls WC) won by fall over Anthony Coix (Batavia WC) Fall 0:35</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>3rd Place Match - Abigail Cortez (Will County Warriors WC) won by fall over Oakli Gorman (SJO Youth WC) Fall 0:37</li>\n<li>5th Place Match - Alina Gomez (Oak Forest Warriors WC) won by decision over Rosemary Hileman (AJ Jr. Wildcats WC) Dec 5-4</li>\n<li>7th Place Match -   () received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>3rd Place Match - Stella Eimer (TJ Trained Wrestling) won by major decision over Jayla Godina (Lincoln-Way WC) Maj 10-2</li>\n<li>5th Place Match - Marli Cobbs (Belleville Little Devils WC) won by decision over Sophia Olandese (Wheaton WC) Dec 2-0</li>\n<li>7th Place Match - Rayelynn Hartmann (Tiger Town Tanglers WC) received a bye   () Bye</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>3rd Place Match - Eliana Ortega (Beat the Streets Chicago-Midway) won by fall over Ivy Sullivan (Dixon WC) Fall 0:27</li>\n<li>5th Place Match - Isabella Hudison (Bismarck-Henning Youth WC) won by fall over Carrie Larsen (Fox Lake WC) Fall 1:48</li>\n<li>7th Place Match - Aubrey Schmieding (O`Fallon Little Panthers WC) won by decision over Kathlynn Sturhahn (Quincy Little Raiders WC) Dec 5-2</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>3rd Place Match - Britton Miller (Sparta Junior Bulldogs WC) won by decision over Layla Giertych (nWo WC) Dec 11-5</li>\n<li>5th Place Match - Kaylee Lapitan (Batavia WC) won by fall over Yaili Fortiz (Badger WC) Fall 1:59</li>\n<li>7th Place Match - Hazel Bliss (Gladiator Elite WC) won by fall over Jaylie Lackey (Lawrence County Knights WC) Fall 1:00</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>3rd Place Match - Evelyn Koulis (Demolition WC) won by decision over Hadley Aeschliman (Metamora Kids WC) Dec 7-2</li>\n<li>5th Place Match - Jordan Qualkinbush (Beat the Streets Chicago-Avondale) won by medical forfeit over Maddy Choate (Trico WC) MFF</li>\n<li>7th Place Match - Genevieve Howe (Metamora Kids WC) won in tie breaker - 1 over Julianna Oceguera (Downers Grove WC) TB-1 2-1</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>3rd Place Match - Leila Linton (Force Elite WC) won by decision over Kylie Kasprak (LaSalle Peru Crunching Cavs Youth WC) Dec 7-2</li>\n<li>5th Place Match - Laura Allen (Wilmington WC) won by fall over Taylinn Young (Rantoul Youth Wrestling) Fall 1:38</li>\n<li>7th Place Match - Olivia Hruska (Antioch Predators WC) won by fall over Kinsley Bratcher (Southern Illinois Bulldogs WC) Fall 0:49</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>3rd Place Match - Avi Linhorst (Edwardsville WC) won by decision over Adair Lawrence (O`Fallon Little Panthers WC) Dec 4-0</li>\n<li>5th Place Match - Kourtney Kanallakan (Edwardsville WC) won by fall over Kenley Sondgeroth (West Suburban Girls WC) Fall 2:13</li>\n<li>7th Place Match - Emerson Seaton (Collinsville WC) won by fall over Zoey Barber (Dixon WC) Fall 1:16</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>3rd Place Match - Annebelle Duller (Stateline Stingers WC) won by decision over Mya McDonald (Demolition WC) Dec 3-2</li>\n<li>5th Place Match - Evangelina Guzman (Will County Warriors WC) won by fall over Carly Maloney (Tinley Park Bulldogs WC) Fall 0:50</li>\n<li>7th Place Match - Chloey McBride (Oak Forest Warriors WC) won by fall over Francesca Yurs (ISI WC) Fall 0:27</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>3rd Place Match - Rosie Inman (Bismarck-Henning Youth WC) won by fall over Dorothy Radtke (Doom Wrestling) Fall 2:21</li>\n<li>5th Place Match - Chloe Altgilbers (Vandalia Jr WC) won by fall over Alexa Nunn (Beat the Streets Chicago-Oak Park) Fall 0:19</li>\n<li>7th Place Match - Reese Vest (Harvard WC) won by fall over Collins Miller (LaSalle Peru Crunching Cavs Youth WC) Fall 1:39</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>3rd Place Match - Degan Stulce (Southern Illinois Bulldogs WC) won by decision over Colton Copstead (St. Charles WC) Dec 5-4</li>\n<li>5th Place Match - Maxwell Fauth (Lions WC) won by medical forfeit over Maxwell Berner (Lincoln-Way WC) MFF</li>\n<li>7th Place Match - Vincent Zalapi (Antioch Predators WC) won by decision over Finnegan Campbell (Headlock Wrestling Academy) Dec 4-2</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>3rd Place Match - Drake Melton (Backyard Brawlers West Wrestling) won by decision over Immanuel Morales (Englewood Live Wire WC) Dec 6-0</li>\n<li>5th Place Match - Lorenzo Caponigri (Headlock Wrestling Academy) won by fall over Karson Stoeckel (Bulls WC) Fall 0:15</li>\n<li>7th Place Match - Owen Slabaugh (Alber Athletics WC) won by major decision over Achilles Cortese (Cortese WC) Maj 18-4</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>3rd Place Match - Jayse Amico (Force Elite WC) won by decision over Paxson Minkie (Alber Athletics WC) Dec 3-0</li>\n<li>5th Place Match - Wyatt McClain (Demolition WC) won by major decision over Jack Wachstetter (Backyard Brawlers Midwest) Maj 10-2</li>\n<li>7th Place Match - Ryder Little (Central Illinois Bulldogs WC) won in tie breaker - 1 over Anthony Federici (Headlock Wrestling Academy) TB-1 2-1</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>3rd Place Match - Malik Mayfield (Toss Em Up Wrestling Academy) won by fall over Drake Fahnestock (Blue Line Training Academy) Fall 2:30</li>\n<li>5th Place Match - Charlie Blake (Panther WC) won by decision over Connor Johnson (Fox Valley WC) Dec 6-0</li>\n<li>7th Place Match - Sloan Sears (PSF Wrestling Academy) won by decision over Maddox Noonan (Ottawa Wolfpack WC) Dec 2-0</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>3rd Place Match - Oz Bellamy (Force Elite WC) won by fall over Gionni Zapf (Alber Athletics WC) Fall 0:49</li>\n<li>5th Place Match - Jaxon Sullivan (Antioch Predators WC) won by decision over Cayson Rogers (Lincoln-Way WC) Dec 5-0</li>\n<li>7th Place Match - Dominic Warner (Harlem Huskies WC) won by fall over Braden Larson (TJ Trained-Springfield Wrestling) Fall 2:43</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>3rd Place Match - Wyatt Walker (Batavia WC) won by fall over Bradley Wittenmeier (Vittum Cats WC) Fall 0:30</li>\n<li>5th Place Match - Gideon Ayers (ISI WC) won by tech fall over Vladimir Dvoryannikov (Built By Brunson Wrestling) TF 15-0</li>\n<li>7th Place Match - Luke Sponsel (Arlington Cardinals WC) won by decision over Jerry Fialka (Martinez Fox Valley Elite WC) Dec 4-1</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>3rd Place Match - Easton Tolley (Granite City Wrestling Association) won by decision over William Connors (Alber Athletics WC) Dec 5-2</li>\n<li>5th Place Match - Chase Gorman (SJO Youth WC) won in sudden victory - 1 over Declan McNulty (Demolition WC) SV-1 2-0</li>\n<li>7th Place Match - William Perek (Mustang WC) won by decision over Kolten Lowe (Hawk WC) Dec 9-4</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>3rd Place Match - Liam Lane (Bulls WC) won by decision over Gunner Latarewicz (Demolition WC) Dec 4-0</li>\n<li>5th Place Match - Quinn McCrum (MadDog Wrestling Academy) won by decision over William Dunn (Beat the Streets Chicago-Midway) Dec 7-0</li>\n<li>7th Place Match - Amro Abuarqoub (Greg Gomez Trained Wrestling) won by fall over Marcelo Villarreal (Sandwich WC) Fall 3:35</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>3rd Place Match - Cash Brown (Bismarck-Henning Youth WC) won by fall over Nicholas Finan (Demolition WC) Fall 2:49</li>\n<li>5th Place Match - Draven Bock (Hawk WC) won by fall over Mario Montalto (Lemont Bears WC) Fall 1:58</li>\n<li>7th Place Match - Gino Marino (Headlock Wrestling Academy) won by decision over Nikolas Panayi (Arlington Cardinals WC) Dec 8-5</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>3rd Place Match - Xavier Briggs (Storm Youth WC) won by decision over Victor Vargas (Beat the Streets Chicago-Oak Park) Dec 2-0</li>\n<li>5th Place Match - Matthew Smith (Benton WC) won by tech fall over Jack Kosobucki (Arlington Cardinals WC) TF 16-0</li>\n<li>7th Place Match - Oliver Schaps (Junior Titans Wrestling) won by decision over Brendan Beidler (Notre Dame WC) Dec 4-2</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>3rd Place Match - Caine Rogers (Fighting Farmers WC) won by fall over Craig Jay (Vandalia Jr WC) Fall 1:24</li>\n<li>5th Place Match - Cooper Wilson (SCN Youth WC) won by decision over Welles Projansky (Built By Brunson Wrestling) Dec 7-6</li>\n<li>7th Place Match - Omar Tadros (Lockport Junior Porters WC) won by decision over Aydan Del Muro (nWo WC) Dec 4-3</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>3rd Place Match - John Gehrig (Sycamore WC) won by fall over Larenzo Hunter (Will County Warriors WC) Fall 0:38</li>\n<li>5th Place Match - Carson Mongare (Edwardsville WC) won by fall over Eli Hill (SCN Youth WC) Fall 3:48</li>\n<li>7th Place Match - Gavin Vogler (Oak Forest Warriors WC) won by decision over Cayden Williams (Harvard WC) Dec 5-2</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>3rd Place Match - Patrick Brennan (St. Charles WC) won by fall over Henry Thoms (Salem WC) Fall 2:19</li>\n<li>5th Place Match - Martin Wilson (Force Elite WC) won by fall over Leo Floreani (MadDog Wrestling Academy) Fall 0:56</li>\n<li>7th Place Match - Ulises Sanchez (Doom Wrestling) won by fall over Landry Agney (Shelbyville Jr. Wrestling Rams) Fall 0:59</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Girls Bantam 43</h2>\n<ul>\n<li>1st Place Match - Maleya Campbell (Wilmington WC) won by decision over Kyla Kucala (Little Celtic WC) Dec 7-4</li>\n</ul>\n<h2>Girls Bantam 46</h2>\n<ul>\n<li>1st Place Match - Swayze Campbell (Wilmington WC) won by fall over Adalynn Taylor (Rocket Fuel WC) Fall 1:30</li>\n</ul>\n<h2>Girls Bantam 50</h2>\n<ul>\n<li>1st Place Match - Ella Terhaar (Wolves WC) won by decision over Emmerson Lange (Falcon Youth Wrestling) Dec 10-4</li>\n</ul>\n<h2>Girls Bantam 55</h2>\n<ul>\n<li>1st Place Match - Amina Perez (Greg Gomez Trained Wrestling) won by fall over Sloane Gabler (Sauk Valley WC) Fall 2:18</li>\n</ul>\n<h2>Girls Bantam 62</h2>\n<ul>\n<li>1st Place Match - Hadley Slabaugh (Harlem Huskies WC) won by fall over Savannah Paynes (Bulldog Elite WC) Fall 2:30</li>\n</ul>\n<h2>Girls Bantam 68</h2>\n<ul>\n<li>1st Place Match - Victoria Kasky (Gladiator Elite WC) won by decision over Londyn Bellamy (Force Elite WC) Dec 5-3</li>\n</ul>\n<h2>Girls Bantam 74</h2>\n<ul>\n<li>1st Place Match - Emmlyne Shaw (Peotone Little Devils WC) won by decision over Trinity Grace Larsen (Fox Lake WC) Dec 6-0</li>\n</ul>\n<h2>Girls Bantam 85</h2>\n<ul>\n<li>1st Place Match - Kennedy Erickson (DeKalb WC) won by decision over Mckinley Allen (Riot Room Wrestling) Dec 2-0</li>\n</ul>\n<h2>Boys Bantam 43</h2>\n<ul>\n<li>1st Place Match - Declan Roach (Panther WC) won by decision over Derrick Cue (Astro WC) Dec 4-2</li>\n</ul>\n<h2>Boys Bantam 46</h2>\n<ul>\n<li>1st Place Match - Chase Amorn (RTC Wrestling) won by major decision over Leonidas Cortese (Cortese WC) Maj 9-0</li>\n</ul>\n<h2>Boys Bantam 49</h2>\n<ul>\n<li>1st Place Match - Carson Gallo (SJO Youth WC) won by decision over River Couture (Cory Clark Wrestling) Dec 5-1</li>\n</ul>\n<h2>Boys Bantam 52</h2>\n<ul>\n<li>1st Place Match - Thomas Reis (Southern Illinois Bulldogs WC) won by decision over Grayson Temple (Fox Lake WC) Dec 11-4</li>\n</ul>\n<h2>Boys Bantam 55</h2>\n<ul>\n<li>1st Place Match - Maddox Fialka (Martinez Fox Valley Elite WC) won by major decision over Tagg Hefner (TJ Trained Wrestling) Maj 11-0</li>\n</ul>\n<h2>Boys Bantam 58</h2>\n<ul>\n<li>1st Place Match - Jack Gorman (SJO Youth WC) won by decision over Camden Fitzgerald (Little Celtic WC) Dec 6-2</li>\n</ul>\n<h2>Boys Bantam 62</h2>\n<ul>\n<li>1st Place Match - Anthony Ragona (Built By Brunson Wrestling) won by tech fall over Killien Schwarz (Riot Room Wrestling) TF 16-1</li>\n</ul>\n<h2>Boys Bantam 66</h2>\n<ul>\n<li>1st Place Match - Padraig Brady (Demolition WC) won in sudden victory - 1 over Logan Linton (Force Elite WC) SV-1 2-0</li>\n</ul>\n<h2>Boys Bantam 70</h2>\n<ul>\n<li>1st Place Match - Nehemiah Andronic (Rochelle Wrestling Club) won by injury default over Alexander Cid (Toss Em Up Wrestling Academy) Inj. 1:30</li>\n</ul>\n<h2>Boys Bantam 76</h2>\n<ul>\n<li>1st Place Match - Kingston Hamilton (Wildcats Wrestling Academy) won by decision over Daquain Hubbard Jr (Urbana Tigers WC) Dec 7-4</li>\n</ul>\n<h2>Boys Bantam 84</h2>\n<ul>\n<li>1st Place Match - Vincent Englese (St. Charles WC) won by tech fall over Wells Kustok (Evanston School of Wrestling) TF 15-0</li>\n</ul>\n<h2>Boys Bantam 95</h2>\n<ul>\n<li>1st Place Match - Joseph Englese (St. Charles WC) won by decision over Hunter Archer (Brawlers WC) Dec 4-1</li>\n</ul>\n<h2>Boys Bantam 120</h2>\n<ul>\n<li>1st Place Match - Cal Butikofer (Yorkville WC) won by decision over Bryce Boltz (Sycamore WC) Dec 4-0</li>\n</ul>\n<h2>Girls Intermediate 53</h2>\n<ul>\n<li>1st Place Match - Maggie Ortiz (Tinley Park Bulldogs WC) won by fall over Annabelle Hoffman (Sauk Valley WC) Fall 0:34</li>\n</ul>\n<h2>Girls Intermediate 57</h2>\n<ul>\n<li>1st Place Match - Bailey Flanigan (Bulls WC) won by fall over Adelle Dunaway (St. Charles WC) Fall 2:59</li>\n</ul>\n<h2>Girls Intermediate 62</h2>\n<ul>\n<li>1st Place Match - Reese Davis (Spartan WC) won by decision over Elizabeth Agajanian (Sandwich WC) Dec 3-0</li>\n</ul>\n<h2>Girls Intermediate 67</h2>\n<ul>\n<li>1st Place Match - Lila Carson (Antioch Predators WC) won by decision over Zoe Atwell (Callan Wrestling Academy) Dec 6-4</li>\n</ul>\n<h2>Girls Intermediate 73</h2>\n<ul>\n<li>1st Place Match - Adriana Ragona (Built By Brunson Wrestling) won by fall over Brynlee Jones (Falcon Youth Wrestling) Fall 0:18</li>\n</ul>\n<h2>Girls Intermediate 80</h2>\n<ul>\n<li>1st Place Match - Norah Shick (Lawrence County Knights WC) won by fall over Nichole Gaskill (Elk Grove Junior Grens WC) Fall 0:39</li>\n</ul>\n<h2>Girls Intermediate 90</h2>\n<ul>\n<li>1st Place Match - Ella Anderson (Rochelle Wrestling Club) won by fall over Braelyn Bunting (Falcon Youth Wrestling) Fall 1:13</li>\n</ul>\n<h2>Girls Intermediate 113</h2>\n<ul>\n<li>1st Place Match - Emilee Meier (Belleville Little Devils WC) won in sudden victory - 1 over Afton Wininger (West Frankfort Jr. Redbirds WC) SV-1 2-0</li>\n</ul>\n<h2>Girls Intermediate 135</h2>\n<ul>\n<li>1st Place Match - Cassie Tolliver (Springs Elite WC) won by fall over Blakleigh Foust (Peoria Razorbacks WC) Fall 1:58</li>\n</ul>\n<h2>Boys Intermediate 55</h2>\n<ul>\n<li>1st Place Match - Darek Diaz (ISI WC) won by major decision over Jack Donnelly (Tinley Park Bulldogs WC) Maj 11-0</li>\n</ul>\n<h2>Boys Intermediate 59</h2>\n<ul>\n<li>1st Place Match - Grayden Schloemann (Southern Illinois Bulldogs WC) won by decision over Ethan Wagner (Alber Athletics WC) Dec 7-0</li>\n</ul>\n<h2>Boys Intermediate 64</h2>\n<ul>\n<li>1st Place Match - William Plumb (SCN Youth WC) won by decision over Ryland Brazel (Mustang WC) Dec 6-1</li>\n</ul>\n<h2>Boys Intermediate 69</h2>\n<ul>\n<li>1st Place Match - Kasen Cargo (Backyard Brawlers Midwest) won by decision over Nico Distasio (Lemont Bears WC) Dec 4-2</li>\n</ul>\n<h2>Boys Intermediate 74</h2>\n<ul>\n<li>1st Place Match - Iaromir Zhukovskii (Built By Brunson Wrestling) won by decision over Bennett Ledbetter (Assumption Elite WC) Dec 7-2</li>\n</ul>\n<h2>Boys Intermediate 79</h2>\n<ul>\n<li>1st Place Match - Kaleb Hollins (Vittum Cats WC) won by decision over Cash Lucas (Ottawa Wolfpack WC) Dec 7-5</li>\n</ul>\n<h2>Boys Intermediate 84</h2>\n<ul>\n<li>1st Place Match - Colton Zabinski (Backyard Brawlers North Wrestling) won by decision over Bryson Wilkinson (SCN Youth WC) Dec 4-3</li>\n</ul>\n<h2>Boys Intermediate 90</h2>\n<ul>\n<li>1st Place Match - Maddox Birchler (Sparta Junior Bulldogs WC) won by major decision over Jordan Thompson (Lincoln-Way WC) Maj 8-0</li>\n</ul>\n<h2>Boys Intermediate 98</h2>\n<ul>\n<li>1st Place Match - Michael Tasnic (Force Elite WC) won in sudden victory - 1 over Louis Baxton (Bulls WC) SV-1 6-4</li>\n</ul>\n<h2>Boys Intermediate 108</h2>\n<ul>\n<li>1st Place Match - Dominic Englese (St. Charles WC) won in sudden victory - 1 over Canyon Fillers (Alber Athletics WC) SV-1 4-2</li>\n</ul>\n<h2>Boys Intermediate 122</h2>\n<ul>\n<li>1st Place Match - Declan Trotter (Lincoln-Way WC) won by fall over Colten Maness (Olympia WC) Fall 0:57</li>\n</ul>\n<h2>Boys Intermediate 148</h2>\n<ul>\n<li>1st Place Match - Markel Davey (Champaign WC) won by fall over Colt Edwards (Murphysboro Wrestling) Fall 0:24</li>\n</ul>\n<h2>Boys Intermediate 177</h2>\n<ul>\n<li>1st Place Match - Trace Young (Monticello Youth WC) won by fall over Isaiah Jackson (Demolition WC) Fall 2:39</li>\n</ul>\n</section>"
}
