{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Brady Wilsie (XTREME WRESTLING) won by decision over Tyler Burlington (YORKVILLE WRESTLING CLUB) Dec 8-6</li>\n<li>Champ. Round 1 - Anthony Cheloni (SCN YOUTH WC) won by fall over Anthony Rink (BRAWLERS WC) Fall 0:45</li>\n<li>Champ. Round 1 - Zachary Lorek (BRAWLERS WC) won by decision over Kyle Szlenk (CRYSTAL LAKE WIZARDS) Dec 2-1</li>\n<li>Champ. Round 1 - Joe Antonelle (SCN YOUTH WC) won by major decision over Jacob Hiles (INDIANS ELITE) Maj 16-6</li>\n<li>Champ. Round 1 - Michael Milan (GOMEZ WRESTLING ACADEMY) won by decision over Hunter Lowry (FISHER WC) Dec 10-7</li>\n<li>Champ. Round 1 - Mark Ferguson (VITTUM CATS) won by fall over Shaun Henderson (JJK WRESTLING) Fall 4:03</li>\n<li>Champ. Round 1 - Stuart Chestney (BLOOMINGTON RAIDER WC) won by major decision over Greylin Powers (GRANITE CITY WC) Maj 12-0</li>\n<li>Champ. Round 1 - Pat Walker (GOMEZ WRESTLING ACADEMY) won by decision over Devin Michicich (SOUTHSIDE STALLIONS) Dec 6-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Rudy Yates (VITTUM CATS) won by decision over Keegan Powers (HONONEGAH KIDS WC) Dec 9-2</li>\n<li>Champ. Round 1 - Cameron Roat (LITTLE CELTIC WC) won by major decision over Joseph Eads (SAUK VALLEY WC) Maj 9-0</li>\n<li>Champ. Round 1 - Francis Edelen (TINLEY PARK BULLDOGS) won by fall over Devin Beaston (WEST HANCOCK TITAN WC) Fall 0:30</li>\n<li>Champ. Round 1 - Andrew Mcfall (FORCE WRESTLING) won by decision over Christopher Dranka (CRYSTAL LAKE WIZARDS) Dec 9-2</li>\n<li>Champ. Round 1 - Raul Marrero (SPRINGFIELD CAPITAL KIDS WC) won by fall over Jarod Foiles (ROXANA KIDS WC) Fall 2:26</li>\n<li>Champ. Round 1 - Patrick Augustyn (GOMEZ WRESTLING ACADEMY) won by decision over Nick Lukanich (BRONCO WRESTLING) Dec 8-5</li>\n<li>Champ. Round 1 - Kyle Peisker (GOMEZ WRESTLING ACADEMY) won by fall over Christian Schaub (BULLS WC) Fall 0:22</li>\n<li>Champ. Round 1 - Thomas Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Dalton Kinison (SPRINGFIELD CAPITAL KIDS WC) Dec 4-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Christian Robertson (VITTUM CATS) won by decision over Vinnie Piunti (MARTINEZ FOX VALLEY ELITE) Dec 6-2</li>\n<li>Champ. Round 1 - Gunner Wenger (PANTHER CUB WC) won by decision over Grant Sutton (GOMEZ WRESTLING ACADEMY) Dec 4-0</li>\n<li>Champ. Round 1 - Jacob Silzer (TINLEY PARK BULLDOGS) won by major decision over Zachery Mccullough (DUNDEE HIGHLANDERS) Maj 11-1</li>\n<li>Champ. Round 1 - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won by decision over Andrew Verr (VILLA PARK YOUNG WARRIORS) Dec 8-5</li>\n<li>Champ. Round 1 - Will Lucie (WEST HANCOCK TITAN WC) won by decision over Kaleb Cheung (SPRINGFIELD CAPITAL KIDS WC) Dec 7-3</li>\n<li>Champ. Round 1 - Marquez Roberson (BELLEVILLE LITTLE DEVILS) won by major decision over Sean Augello (FORCE WRESTLING) Maj 8-0</li>\n<li>Champ. Round 1 - Ian Meagher (LITTLE CELTIC WC) won by fall over Joey Nauman (YORKVILLE WRESTLING CLUB) Fall 0:46</li>\n<li>Champ. Round 1 - Javeontae Crider (LIONHEART INTENSE WRESTLING) won by major decision over Derek Heil (EDWARDSVILLE WC) Maj 18-4</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - James Wolfe (HARLEM COUGARS) won by fall over Johnathan Turner (SPRINGFIELD CAPITAL KIDS WC) Fall 3:35</li>\n<li>Champ. Round 1 - Kevin Pate (HARVEY PARK DIST TWISTERS) won by fall over Dylan Chambers (MURPHYSBORO WRESTLING) Fall 3:47</li>\n<li>Champ. Round 1 - Brandon Briggs (MARENGO YOUTH WRESTLING) won by decision over Kristopher Williams (HARVEY PARK DIST TWISTERS) Dec 7-4</li>\n<li>Champ. Round 1 - Brock Danko (BLOOMINGTON RAIDER WC) won by decision over Dylan Torrey (JERSEY JUNIOR PANTHERS WC) Dec 4-2</li>\n<li>Champ. Round 1 - Camiran Sadeghi (WEST HANCOCK TITAN WC) won by major decision over Philly Partipilo (GOMEZ WRESTLING ACADEMY) Maj 12-2</li>\n<li>Champ. Round 1 - Michael Callahan (SCN YOUTH WC) won by tech fall over Shain Hennessy (ROMEOVILLE YOUTH WC) TF 16-0</li>\n<li>Champ. Round 1 - Eric Carter (BARRINGTON BRONCOS) won by decision over Miguel Silva Jr (MARTINEZ FOX VALLEY ELITE) Dec 2-0</li>\n<li>Champ. Round 1 - Shaun Wasso (LITTLE CELTIC WC) won by fall over Hunter Grau (GENESEO SPIDER WC) Fall 0:50</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Jake Tisza (CROSSTOWN WC) won by fall over Drake Boverie (BULLS WC) Fall 4:28</li>\n<li>Champ. Round 1 - Josh Alber (DAKOTA WC) won by fall over Colten Ratz (FOX VALLEY WC) Fall 2:30</li>\n<li>Champ. Round 1 - Kyle Simpkins (BRAWLERS WC) won by decision over Gregory Krulas (DAKOTA WC) Dec 6-3</li>\n<li>Champ. Round 1 - Peyton Smith (BENTON JR WC) won by decision over Graham Novak (NAPERVILLE WC) Dec 12-5</li>\n<li>Champ. Round 1 - Jack Diana (MUSTANG WC) won by decision over Pernevlon Sheppard (GOMEZ WRESTLING ACADEMY) Dec 7-1</li>\n<li>Champ. Round 1 - Vaughn Hobart (PONTIAC WC) won by decision over Brody Sharp (YORKVILLE WRESTLING CLUB) Dec 5-1</li>\n<li>Champ. Round 1 - Michael Burke (TINLEY PARK BULLDOGS) won by decision over Ryder Punke (CENTRAL ELITE REBELS) Dec 3-2</li>\n<li>Champ. Round 1 - Jake Drew (GOMEZ WRESTLING ACADEMY) won by major decision over Jaron Robinson (MENDOTA MAT MASTERS) Maj 10-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - David Riojas (ROMEOVILLE YOUTH WC) won by decision over Logan Lundelius (CRYSTAL LAKE WIZARDS) Dec 8-2</li>\n<li>Champ. Round 1 - Levi Smith (LAKELAND PREDATORS) won in double overtime over Malcolm Hill (INDIANS ELITE) 2-OT 1-0</li>\n<li>Champ. Round 1 - Eric Barone (WOLVES WC) won by decision over Bobby Alexander (JUNIOR COUGARS WC) Dec 3-1</li>\n<li>Champ. Round 1 - Larry Early (ROMEOVILLE YOUTH WC) won by fall over Luke Brozovich (INDIANS ELITE) Fall 1:15</li>\n<li>Champ. Round 1 - Cole Witzig (TRIAD LITTLE KNIGHTS) won by decision over Carlos Jacquez (BLACKHAWK WC) Dec 3-1</li>\n<li>Champ. Round 1 - Ryan Willett (RENEGADE WC (NFP)) won by fall over Jake Lanning (PONTIAC WC) Fall 3:31</li>\n<li>Champ. Round 1 - Alex Madrigal (SOUTHSIDE STALLIONS) won by decision over Andrew Ives (WW TIGER WC) Dec 7-2</li>\n<li>Champ. Round 1 - James Zeigler Jr. (EDWARDSVILLE WC) won by fall over Sevonte Mcgrown (LIONHEART INTENSE WRESTLING) Fall 4:16</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Carver James (DAKOTA WC) won by major decision over Samuel Lack (CHAMPAIGN KIDS WRESTLING) Maj 9-0</li>\n<li>Champ. Round 1 - Alante Walker (ORLAND PARK PIONEERS) won by decision over Travis Cysewski (BARRINGTON BRONCOS) Dec 6-1</li>\n<li>Champ. Round 1 - Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) won by decision over John Bradtmueller (FORCE WRESTLING) Dec 5-4</li>\n<li>Champ. Round 1 - Jacob Plekavic (IRON MAN) won by decision over John Peterson (MARENGO YOUTH WRESTLING) Dec 8-4</li>\n<li>Champ. Round 1 - Juwan Edmond (BROADVIEW PARK DISTRICT) won by fall over Riley Demoss (SCN YOUTH WC) Fall 2:08</li>\n<li>Champ. Round 1 - Cole Wysocki (TRIAD LITTLE KNIGHTS) won by major decision over Ethan Cain (SAUK VALLEY WC) Maj 13-0</li>\n<li>Champ. Round 1 - Kamal Bey (HARVEY PARK DIST TWISTERS) won by major decision over Nicholas Notestine (O`FALLON LITTLE PANTHERS) Maj 13-4</li>\n<li>Champ. Round 1 - Scott Oglanian (WEST CHICAGO JUNIOR WILDCATS) won by fall over Brady Best (CHILLI DAWGS WC) Fall 1:28</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Dawson Ford (SPRINGFIELD CAPITAL KIDS WC) won by major decision over Tanner Anthony (HARLEM COUGARS) Maj 21-8</li>\n<li>Champ. Round 1 - Brayton Williams (BULLS WC) won by fall over Bryce Ivey (SAUK VALLEY WC) Fall 2:13</li>\n<li>Champ. Round 1 - Cody Tournear (CHAMPAIGN KIDS WRESTLING) won by decision over Brandon Gregory (PEORIA RAZORBACKS YOUTH WC) Dec 10-5</li>\n<li>Champ. Round 1 - Hunter Binns (PANTHER CUB WC) won by fall over Ryan Sullivan (BELLEVILLE LITTLE DEVILS) Fall 3:18</li>\n<li>Champ. Round 1 - Matthew Rundell (ARLINGTON CARDINALS) won by decision over Clayton Ledbetter (FORCE WRESTLING) Dec 9-2</li>\n<li>Champ. Round 1 - Nick Schultz (MARTINEZ FOX VALLEY ELITE) won by decision over Anfernee Hale (HARVEY PARK DIST TWISTERS) Dec 4-0</li>\n<li>Champ. Round 1 - Josh Martin (GLENBARD EAST JR RAMS) won by fall over Beau Gabel (BRAWLERS WC) Fall 1:26</li>\n<li>Champ. Round 1 - John Blanke (BARRINGTON BRONCOS) won by decision over Taj Marks (GLADIATORS) Dec 8-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) won by fall over Tommy Calkins (MAINE EAGLES) Fall 2:07</li>\n<li>Champ. Round 1 - Anthony Scaccia (SCN YOUTH WC) won by decision over Timothy Schanmier (DUNDEE HIGHLANDERS) Dec 5-0</li>\n<li>Champ. Round 1 - Tyler Demoss (HONONEGAH KIDS WC) won by decision over Clayton Mckimmy (LAKELAND PREDATORS) Dec 5-3</li>\n<li>Champ. Round 1 - Nicholas Bonomo (BRONCO WRESTLING) won by fall over Nick Poff (SJO SPARTAN YOUTH WC) Fall 0:25</li>\n<li>Champ. Round 1 - Tyler Mackessy (FORCE WRESTLING) won by fall over Sage Friese (SENECA IRISH CADETS) Fall 4:18</li>\n<li>Champ. Round 1 - Christopher Golden (VITTUM CATS) won by decision over Garrett Gresham (PANTHER POWERHOUSE WC) Dec 7-4</li>\n<li>Champ. Round 1 - Brent Hakeman (BRAWLERS WC) won by decision over Cody Notestine (O`FALLON LITTLE PANTHERS) Dec 9-3</li>\n<li>Champ. Round 1 - Randy Meneweather (KNOX COUNTY KRUSHERS) won by decision over Jim Brennan (LEMONT BEARS WC) Dec 2-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Austin Armstrong (SYCAMORE WC) won by fall over Dallas Appleman (CLIPPER WC) Fall 0:44</li>\n<li>Champ. Round 1 - Jake Storck (MUSTANG WC) won by fall over Billy Thomas (HOFFMAN ESTATES WC) Fall 1:09</li>\n<li>Champ. Round 1 - Nathan Romero (DUNDEE HIGHLANDERS) won by decision over Tyler Tsagalis (ARLINGTON CARDINALS) Dec 5-2</li>\n<li>Champ. Round 1 - Jeffrey Burzinski (VITTUM CATS) won by fall over Alex Wright (CHAMPIONS WC) Fall 0:26</li>\n<li>Champ. Round 1 - Mason Delong (BRAWLERS WC) won by decision over Lucas Reifsteck (WAUBONSIE WC) Dec 4-0</li>\n<li>Champ. Round 1 - Bradley Herzberg (BULLS WC) won by fall over Austin Shelton (OAKWOOD WC) Fall 3:27</li>\n<li>Champ. Round 1 - Brandon Klein (CHAMPAIGN KIDS WRESTLING) won by decision over Keone Derain (ST. CHARLES EAST WC) Dec 11-8</li>\n<li>Champ. Round 1 - Kevin Mcnally (CROSSTOWN WC) won by decision over Alec Foutch (EDWARDSVILLE WC) Dec 6-1</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Vincent Anderson (HONONEGAH KIDS WC) won by fall over Jaggar Goeken (TRIAD LITTLE KNIGHTS) Fall 1:18</li>\n<li>Champ. Round 1 - Dustin Pindel (ORLAND PARK PIONEERS) won by decision over Mia Calamari (BARRINGTON BRONCOS) Dec 4-2</li>\n<li>Champ. Round 1 - Larry Thomas Jr (IRON MAN) won by tech fall over Andrew Massetti (HARLEM COUGARS) TF 18-3</li>\n<li>Champ. Round 1 - Zachary Prinz (FORCE WRESTLING) won by decision over Matthew Striegel (O`FALLON LITTLE PANTHERS) Dec 7-0</li>\n<li>Champ. Round 1 - Austin Hedrick (SJO SPARTAN YOUTH WC) won by fall over Austin Shoup (SAUK VALLEY WC) Fall 2:46</li>\n<li>Champ. Round 1 - Michael Kozyra (LITTLE HUSKIE WC) won by fall over Stefan Ivanisevic (HINSDALE WC) Fall 0:45</li>\n<li>Champ. Round 1 - Mitchel Humphrey (MENDOTA MAT MASTERS) won by fall over Patrick Kristin (TINLEY PARK BULLDOGS) Fall 0:25</li>\n<li>Champ. Round 1 - Zach Wehde (BRONCO WRESTLING) won by decision over Jarod Noel (BISMARCK HENNING WC) Dec 7-5</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Zac Keller (LAKELAND PREDATORS) won by fall over Matt Allen (HINSDALE WC) Fall 3:35</li>\n<li>Champ. Round 1 - Alex Dobson (SYCAMORE WC) won by fall over Blake Cripe (VANDALIA JR WRESTLING) Fall 4:29</li>\n<li>Champ. Round 1 - Louis Giovannetti (NAPERVILLE WC) won by decision over Matthew Hughes (CARY MATMEN WC) Dec 8-6</li>\n<li>Champ. Round 1 - Emery Parker (GRAPPLIN` DEVILS WC) won by fall over Kane Garcia (ACES WC) Fall 0:40</li>\n<li>Champ. Round 1 - Levi Rice (MONTICELLO KIDS WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Matt Brozovich (INDIANS ELITE) won by decision over Kyle Plekavic (LINCOLN-WAY WC) Dec 7-2</li>\n<li>Champ. Round 1 - Ryan Scharf (MT. ZION WC) won by fall over Joshua Wessels (PEORIA HEIGHTS MINUTEMEN JR WRESTLING) Fall 2:30</li>\n<li>Champ. Round 1 - Nicholas Spacek (LIONS WC) won by fall over Caleb Rojas (BRAWLERS WC) Fall 2:43</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Kailor Hecox (HECOX TEAM BENAIAH) won by fall over Brooke Hughes (DANVILLE BRONCOS YOUTH WC) Fall 0:36</li>\n<li>Champ. Round 1 - Hasan Jehan (CHICAGO WOLVES DEN) won by fall over Austin Rosenbaum (FALCON YOUTH WC) Fall 2:55</li>\n<li>Champ. Round 1 - Alexander Girona (LAKELAND PREDATORS) won by decision over Jacob Bowman (SJO SPARTAN YOUTH WC) Dec 5-1</li>\n<li>Champ. Round 1 - Brian Pence (CRYSTAL LAKE WIZARDS) won by fall over Justin Esposito (FALCON WC) Fall 0:43</li>\n<li>Champ. Round 1 - Collin Cronberg (LITTLE CELTIC WC) won by fall over Tyquan Jones (HARVEY PARK DIST TWISTERS) Fall 0:20</li>\n<li>Champ. Round 1 - Lucas Greenberg (VILLA LOMBARD COUGARS) won by decision over Josh Levan (ROXANA KIDS WC) Dec 4-0</li>\n<li>Champ. Round 1 - Mark Dinardo (FORCE WRESTLING) won by major decision over Floyd Lomelino Iv (JACKSONVILLE AREA YOUTH WRESTLING) Maj 11-2</li>\n<li>Champ. Round 1 - Niko Portokalis (NOTRE DAME WRESTLING) won by fall over Neil Smith (MUSTANG WC) Fall 3:39</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Cody Barnes (CRYSTAL LAKE WIZARDS) won by fall over Tristan Penrod (MT. VERNON LIONS) Fall 1:05</li>\n<li>Champ. Round 1 - Cain Bialas (WW TIGER WC) won by decision over Chase Rohs (RIVERDALE JR RAMS WC) Dec 5-2</li>\n<li>Champ. Round 1 - Joshua Bouie (INDIANS ELITE) won by fall over Brady Atherton (PANTHER CUB WC) Fall 1:21</li>\n<li>Champ. Round 1 - Mykel Gary (CARBONDALE WC) won by fall over Costaki Danegelis (LITTLE FALCONS WC) Fall 2:15</li>\n<li>Champ. Round 1 - Keyshawn Bulls (GLADIATORS) won in overtime over Blake Drazner (JUNIOR PATRIOTS) OT 4-2</li>\n<li>Champ. Round 1 - Jeffrey Simmons (LIL` STORM) won by fall over Patrick Iwinski (ROMEOVILLE YOUTH WC) Fall 0:47</li>\n<li>Champ. Round 1 - Tyler Johnson (LEMONT BEARS WC) won by fall over Tristun Reeves (EL PASO GRIDLEY YOUTH WC) Fall 0:28</li>\n<li>Champ. Round 1 - Austin Treichel (CROSSTOWN WC) won by decision over Daniel Andress (JUNIOR COUGARS WC) Dec 5-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Mackenzie Noel (BISMARCK HENNING WC) won by fall over Grant Carmody (JACKSONVILLE AREA YOUTH WRESTLING) Fall 0:42</li>\n<li>Champ. Round 1 - Eli Burdick (DURAND WC) won by fall over Dj Schmidt (FALCON WC) Fall 1:42</li>\n<li>Champ. Round 1 - Marc Gomez (BELVIDERE BANDITS) won by fall over Kory Loew (EDWARDSVILLE WC) Fall 0:47</li>\n<li>Champ. Round 1 - Kyle Tex (TAYLORVILLE WC) won by decision over Nathan Karas (PLAINFIELD WC) Dec 7-1</li>\n<li>Champ. Round 1 - Stu Landin (TINLEY PARK BULLDOGS) won by fall over Christian Brown (WAUBONSIE WC) Fall 1:17</li>\n<li>Champ. Round 1 - Mark Miller (ZEE BEE STINGERS) won by major decision over David Newman (INDIANS ELITE) Maj 14-0</li>\n<li>Champ. Round 1 - Corey Harrell (CHAMPBUILDERS) won by fall over Ryan Carmody (OSWEGO EAST TEAM NO EGO) Fall 0:59</li>\n<li>Champ. Round 1 - Moises Pina (MORTON LITTLE MUSTANGS) won by fall over Wayne Sobotka (SHAMROCK WC) Fall 0:49</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Brandon Anderson (WEST CARROLL WC) won by fall over Todd Haney (MURPHYSBORO WRESTLING) Fall 0:57</li>\n<li>Champ. Round 1 - Bryan Ditchman (TINLEY PARK BULLDOGS) won by decision over Alexander Zentner (BARRINGTON BRONCOS) Dec 8-3</li>\n<li>Champ. Round 1 - Noah Fleckenstein (LIONS WC) won by fall over Tristan Miller (PANTHER CUB WC) Fall 0:27</li>\n<li>Champ. Round 1 - Terrion Jones (JJK WRESTLING) received a bye   () Bye</li>\n<li>Champ. Round 1 - Zachary Simpson (RICH RATTLERS WC) won by fall over Philip Kruis (FALCON WC) Fall 3:13</li>\n<li>Champ. Round 1 - Diandre Smith (CALUMET MEM. P.D. WOLVERINES) won by fall over Sam Deisher (BLACKHAWK WC) Fall 0:53</li>\n<li>Champ. Round 1 - Matthew Iwinski (ROMEOVILLE YOUTH WC) won by fall over Michael Parks (JJK WRESTLING) Fall 1:21</li>\n<li>Champ. Round 1 - David Baze (QUINCY WC) won by decision over Derek Caskey (MARENGO YOUTH WRESTLING) Dec 5-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Trey Kerrens (MURPHYSBORO WRESTLING) received a bye   () Bye</li>\n<li>Champ. Round 1 - Christopher Bartels (DUNDEE HIGHLANDERS) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Joshua Smith (JACKSONVILLE AREA YOUTH WRESTLING) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jake Ford (MUSTANG WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Connor Willis (HOOPESTON AREA WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jordan Taylor (SPRINGFIELD CAPITAL KIDS WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Jeffery Morrow (CRYSTAL LAKE WIZARDS) won by fall over Ruben Garza (RIVERDALE JR RAMS WC) Fall 0:53</li>\n<li>Champ. Round 1 - Grant Smiley (FORCE WRESTLING) won by fall over Conrad Zaucha (WAUBONSIE WC) Fall 3:38</li>\n<li>Champ. Round 1 - Dylan Cramer (FORCE WRESTLING) won by decision over Nicholas Meyer (CRYSTAL LAKE WIZARDS) Dec 6-2</li>\n<li>Champ. Round 1 - Shane Mart (INDIANS ELITE) won by decision over Matthew Patton (BATAVIA PINNERS) Dec 7-0</li>\n<li>Champ. Round 1 - Carlos Fuentez (VILLA LOMBARD COUGARS) won by major decision over Henry Becker (OAK FOREST WARRIORS) Maj 13-4</li>\n<li>Champ. Round 1 - Jesus Vasquez (SOUTHSIDE STALLIONS) won by fall over Dalton Wesley (EDWARDSVILLE WC) Fall 3:47</li>\n<li>Champ. Round 1 - Christian Poupard (EDWARDSVILLE WC) won by major decision over Noah Mcbee (DANVILLE BRONCOS YOUTH WC) Maj 14-0</li>\n<li>Champ. Round 1 - Johnathan Gahagan (SOUTHSIDE STALLIONS) won by major decision over Chris Sommers (ARLINGTON CARDINALS) Maj 10-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Devin Tortorice (WOLVES WC) won by decision over Matthew Fleming (SOUTHSIDE STALLIONS) Dec 11-6</li>\n<li>Champ. Round 1 - Joseph Bertolino (Fighting Titan) won by fall over Dylan Licka (BRAWLERS WC) Fall 2:30</li>\n<li>Champ. Round 1 - Brendan Gaynor (TINLEY PARK BULLDOGS) won by major decision over Josh Harvill (GRANITE CITY WC) Maj 12-2</li>\n<li>Champ. Round 1 - Collin Druck (SYCAMORE WC) won by decision over Cory Winchell (LITTLE CELTIC WC) Dec 4-0</li>\n<li>Champ. Round 1 - Keith Mcdonough (BULLS WC) won by fall over Jaspor Capriotti (ROCHESTER WC) Fall 2:56</li>\n<li>Champ. Round 1 - Jacob Field (SCN YOUTH WC) won by tech fall over Daniel Cervantes (RICH RATTLERS WC) TF 17-1</li>\n<li>Champ. Round 1 - Sam Martino (GOMEZ WRESTLING ACADEMY) won by decision over Chris Worthey (BENTON JR WC) Dec 14-11</li>\n<li>Champ. Round 1 - Andrew Brooks (SCN YOUTH WC) won by decision over Dj Clarey (TITAN YOUTH WRESTLING) Dec 6-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Brad Martens (SCN YOUTH WC) won by decision over Corey Perkins-willett (RENEGADE WC (NFP)) Dec 5-2</li>\n<li>Champ. Round 1 - Martin Martinez (WAUKEGAN YOUTH WC) won by decision over Jake Holian (RICHMOND WC) Dec 3-0</li>\n<li>Champ. Round 1 - Ricardo Roman (BELVIDERE BANDITS) won by decision over Kyle Rodriguez (VITTUM CATS) Dec 4-1</li>\n<li>Champ. Round 1 - Jordan Scalice (GOMEZ WRESTLING ACADEMY) won by tech fall over Kyle Chapman (MARTINEZ FOX VALLEY ELITE) TF 16-0</li>\n<li>Champ. Round 1 - Jacob Wever (L-P CRUNCHING CAVS) won by fall over Randall Hornbaker (TIGER WC) Fall 1:59</li>\n<li>Champ. Round 1 - Jason Moerlien (GRANITE CITY WC) won by tech fall over Daniel Valenzio (FORCE WRESTLING) TF 17-2</li>\n<li>Champ. Round 1 - Jordan Laster (ROMEOVILLE YOUTH WC) won by decision over Nathan Newman (MIDWEST CENTRAL YOUTH) Dec 4-2</li>\n<li>Champ. Round 1 - Austen Schott (CHAMPAIGN KIDS WRESTLING) won by decision over Sean Mulligan (EDWARDSVILLE WC) Dec 7-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Esai Ponce (KNIGHTS WRESTLING) won by fall over Ryan Stringham (PLAINFIELD WC) Fall 1:16</li>\n<li>Champ. Round 1 - Michael Harris (BELLEVILLE LITTLE DEVILS) won by fall over Shakuan Waller (HARVEY PARK DIST TWISTERS) Fall 0:58</li>\n<li>Champ. Round 1 - Jimmy Regan (VITTUM CATS) won by decision over Jordan Pierson (HONONEGAH KIDS WC) Dec 7-1</li>\n<li>Champ. Round 1 - Jordon Mrvos (EDWARDSVILLE WC) won by fall over Jonathon Martin (HOOPESTON AREA WC) Fall 3:27</li>\n<li>Champ. Round 1 - Alex Cowan (IRON MAN) won by decision over Kyle White (METAMORA KIDS WC) Dec 7-6</li>\n<li>Champ. Round 1 - Trayvon Zabala (FORCE WRESTLING) won by major decision over Charlie Smorczewski (BATAVIA PINNERS) Maj 10-2</li>\n<li>Champ. Round 1 - Robert Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Johnny Gosinski (VILLA LOMBARD COUGARS) Dec 7-5</li>\n<li>Champ. Round 1 - Matthew Sears (LITTLE CELTIC WC) won by tech fall over Cole Ebenroth (RIVERDALE JR RAMS WC) TF 15-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Wade Lardy (CRYSTAL LAKE WIZARDS) won by fall over Zachary Moody (LIONHEART INTENSE WRESTLING) Fall 3:42</li>\n<li>Champ. Round 1 - Rob Mikenis (LINCOLN-WAY WC) won by fall over Daniel Russell (BADGER WC) Fall 3:50</li>\n<li>Champ. Round 1 - Blake Tisza (CROSSTOWN WC) won by decision over Jake Messink (HARLEM COUGARS) Dec 6-5</li>\n<li>Champ. Round 1 - Tanner Modglin (SJO SPARTAN YOUTH WC) won by decision over Anthony Felix-reyes (CHICAGO WOLVES DEN) Dec 14-8</li>\n<li>Champ. Round 1 - Danny Carlson (REBELS WC) won by fall over Luke Schlueter (EDWARDSVILLE WC) Fall 2:09</li>\n<li>Champ. Round 1 - Austin Graham (MARTINEZ FOX VALLEY ELITE) won by major decision over Mitchell Dite (LITTLE REDSKINS WC) Maj 13-0</li>\n<li>Champ. Round 1 - Kevin Conrad (BARRINGTON BRONCOS) won by major decision over Alexander Genn (RIVERBEND WC) Maj 14-0</li>\n<li>Champ. Round 1 - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by decision over Brady Pierce (GRANITE CITY WC) Dec 7-4</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Cotey Mccallister (GMO EAGLES KIDS WRESTLING) won by decision over Drake Debenedetti (HILLTOPPERS WC) Dec 4-3</li>\n<li>Champ. Round 1 - Dustin Chapman (PANTHER CUB WC) won by decision over Sean Murray (LITTLE FALCONS WC) Dec 7-4</li>\n<li>Champ. Round 1 - Nicholas Peters (CRYSTAL LAKE WIZARDS) won by decision over Jorge Ulloa (JOLIET JUNIOR STEELMEN) Dec 3-2</li>\n<li>Champ. Round 1 - Mark Henriksen (BATAVIA PINNERS) won by fall over Payton Stifle (JUNIOR MAROON WC) Fall 0:00</li>\n<li>Champ. Round 1 - Steven Galiardo (SHAMROCK WC) won by decision over Rudolph Johnson (HARVEY PARK DIST TWISTERS) Dec 5-0</li>\n<li>Champ. Round 1 - Daniel Ruettiger (INDIANS ELITE) won by fall over Deric Mool (CENTRAL ELITE REBELS) Fall 1:09</li>\n<li>Champ. Round 1 - Michael O`connor (TINLEY PARK BULLDOGS) won by fall over Brady Musson (OAKWOOD WC) Fall 2:50</li>\n<li>Champ. Round 1 - Sal Annoreno (GOMEZ WRESTLING ACADEMY) won by fall over Mark Breedlove (GENESEO SPIDER WC) Fall 2:44</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Dan Goress (KNIGHTS WRESTLING) won by fall over Evan Brown (TIGER WC) Fall 0:34</li>\n<li>Champ. Round 1 - Frank Voltattorni (CROSSTOWN WC) won by decision over Sean Heneghan (ST. TARCISSUS) Dec 4-1</li>\n<li>Champ. Round 1 - Dylan Swan (ORLAND PARK PIONEERS) won by fall over Brendan Ramsey (SPRINGFIELD CAPITAL KIDS WC) Fall 3:29</li>\n<li>Champ. Round 1 - Zachary Denny (HARLEM COUGARS) won by fall over Mitchell Alexander (JUNIOR COUGARS WC) Fall 2:46</li>\n<li>Champ. Round 1 - Kevin Golden (VITTUM CATS) won by fall over Laren Eustace (BATAVIA PINNERS) Fall 3:50</li>\n<li>Champ. Round 1 - Xavier Sneed (PEORIA HEIGHTS MINUTEMEN JR WRESTLING) won by fall over Jacob Dabbs (ALTON LITTLE REDBIRD WC) Fall 2:33</li>\n<li>Champ. Round 1 - Nate Higgins (UNITED SOUTHERN ALLSTARS) won by fall over Rodrigo Garay (MUSTANG WC) Fall 4:18</li>\n<li>Champ. Round 1 - Ernest Battaglia (FOX VALLEY WC) won by fall over Chase Wiggins (ROCK ISLAND WC) Fall 2:45</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Mitchel Kennington (HARLEM RENEGADES) won by major decision over Austin Upton (SJO SPARTAN YOUTH WC) Maj 10-0</li>\n<li>Champ. Round 1 - Michael Mcnulty-ferguson (INDIANS ELITE) won by major decision over Keegan Gardner (WEST FRANKFORT JR WRESTLING) Maj 14-0</li>\n<li>Champ. Round 1 - Dustin Beswick (RIVERBEND WC) won by fall over Michael Martin (OAKWOOD WC) Fall 2:22</li>\n<li>Champ. Round 1 - Austin Mcpeek (RENEGADES (STOCKTON)) won by decision over Elijah Blecha (O`FALLON LITTLE PANTHERS) Dec 3-1</li>\n<li>Champ. Round 1 - Mitchell Cook (ORLAND PARK PIONEERS) won by major decision over Jack Norwood (MAINE EAGLES) Maj 11-0</li>\n<li>Champ. Round 1 - Matthew Stapleton (TINLEY PARK BULLDOGS) won by decision over Brandon Kupczyk (ELMHURST JR. DUKES) Dec 5-3</li>\n<li>Champ. Round 1 - Jose Villarreal (MARTINEZ FOX VALLEY ELITE) won by fall over Joe Soltis (FALCON WC) Fall 1:58</li>\n<li>Champ. Round 1 - Joshua Foster (HARVEY PARK DIST TWISTERS) won by decision over John Doyle (SHAMROCK WC) Dec 8-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Damon Cloe (MARENGO YOUTH WRESTLING) won by major decision over Zach Poe (CUMBERLAND YOUTH WC) Maj 12-0</li>\n<li>Champ. Round 1 - Zach Pickering (SOUTHSIDE STALLIONS) won by tech fall over John Sullivan (BRONCO WRESTLING) TF 15-0</li>\n<li>Champ. Round 1 - Matthew Fetherling (CRYSTAL LAKE WIZARDS) won by major decision over Robert Vodicka-hirschmann (WAUBONSIE WC) Maj 11-1</li>\n<li>Champ. Round 1 - Jameer Thurman (GLADIATORS) won by fall over Darren Wynn (CHAMPAIGN KIDS WRESTLING) Fall 3:33</li>\n<li>Champ. Round 1 - Jon Solberg (GENESEO SPIDER WC) won by major decision over Thomas Grove (LAWRENCE COUNTY WC) Maj 9-0</li>\n<li>Champ. Round 1 - Nick Fanella (LAKELAND PREDATORS) won by fall over Tyler Schneider (ORLAND PARK PIONEERS) Fall 3:27</li>\n<li>Champ. Round 1 - Davonte Mahomes (JOLIET JUNIOR STEELMEN) won by fall over Delvon Anderson (OILERS WRESTLING) Fall 2:07</li>\n<li>Champ. Round 1 - Eric Lovill (GOMEZ WRESTLING ACADEMY) won by fall over Taylor Ikens (CLIPPER WC) Fall 0:31</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Alec Jarnagin (SHELBYVILLE JR RAMS WRESTLING) won by fall over Nick Sandowski (SHAMROCK WC) Fall 3:43</li>\n<li>Champ. Round 1 - Jake Turk (CRYSTAL LAKE WIZARDS) won by fall over Miguel Flores (WEST CHICAGO JUNIOR WILDCATS) Fall 3:14</li>\n<li>Champ. Round 1 - Quincy Kalkbrenner (PANTHER CUB WC) won by major decision over Anthony Ferraro (GOMEZ WRESTLING ACADEMY) Maj 11-2</li>\n<li>Champ. Round 1 - John Whalen (CHAMPAIGN KIDS WRESTLING) won by decision over Ramond King (WW TIGER WC) Dec 8-2</li>\n<li>Champ. Round 1 - Tim Gillooley (LINCOLN-WAY WC) won by fall over Brandon Mizlo (RIVERDALE JR RAMS WC) Fall 1:35</li>\n<li>Champ. Round 1 - Tim Mathias (EDWARDSVILLE WC) won by fall over Kyle Casillo (BADGER WC) Fall 2:38</li>\n<li>Champ. Round 1 - Torrie Williams (GRANITE CITY WC) won by decision over Elliott Jansma (CROSSTOWN WC) Dec 12-8</li>\n<li>Champ. Round 1 - Mitch Miller (GENESEO SPIDER WC) won by fall over Von Hill (HARVEY PARK DIST TWISTERS) Fall 2:58</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Patrick O`malley (CARY MATMEN WC) won by decision over Cory Bee (INDIANS ELITE) Dec 6-4</li>\n<li>Champ. Round 1 - Kenard Washington (GLADIATORS) won by major decision over Mark Shealy (BARRINGTON BRONCOS) Maj 10-2</li>\n<li>Champ. Round 1 - Mario Rodriguez (VILLA LOMBARD COUGARS) won by fall over Corben Campuzano (SYCAMORE WC) Fall 2:23</li>\n<li>Champ. Round 1 - Mark Coleman (REDHAWK WC) won by decision over Joshua Stracner (MOLINE WC) Dec 5-1</li>\n<li>Champ. Round 1 - Kellen Cleveland (LITTLE FALCONS WC) won by fall over Vincent Ambrose (ORLAND PARK PIONEERS) Fall 2:21</li>\n<li>Champ. Round 1 - James Baggett (HIGHLAND BULLDOG JR WC) won by fall over Austin Jamison (CUMBERLAND YOUTH WC) Fall 2:06</li>\n<li>Champ. Round 1 - Breon Hoosier (MARTINEZ FOX VALLEY ELITE) won by fall over Dustin Adams (WARRENSBURG WC) Fall 1:54</li>\n<li>Champ. Round 1 - Zach Abney (SAUKEE YOUTH WC) won by fall over Cody Wilhoyt (BRAWLERS WC) Fall 3:29</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Nathaniel Magiera (WOLVES WC) won by fall over A.j. Stroer (EDWARDSVILLE WC) Fall 1:08</li>\n<li>Champ. Round 1 - Brad Evangelista (PALATINE PANTHERS WC) won by major decision over Steven Cothern (LITTLE CELTIC WC) Maj 12-1</li>\n<li>Champ. Round 1 - Tony Cashmore (LAKELAND PREDATORS) won by fall over Zack Hagemann (XTREME WRESTLING) Fall 1:03</li>\n<li>Champ. Round 1 - Richard Kruis (FALCON WC) won by fall over Bruce Henley (JJK WRESTLING) Fall 0:42</li>\n<li>Champ. Round 1 - Bailey Appleman (CLIPPER WC) won by fall over Toby Rivera (CHAMPAIGN KIDS WRESTLING) Fall 4:29</li>\n<li>Champ. Round 1 - Brian Allen (HINSDALE WC) won by fall over Tyler Gray (BADGER WC) Fall 1:18</li>\n<li>Champ. Round 1 - Max Brozovich (INDIANS ELITE) won by major decision over Joe Urso (LITTLE HUSKIE WC) Maj 16-4</li>\n<li>Champ. Round 1 - Kaelen Bradford (LITTLE FALCONS WC) won by fall over Craig Ayers (OAKWOOD WC) Fall 2:40</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Joey Welsh (HONONEGAH KIDS WC) won by fall over Max Hively (MARTINEZ FOX VALLEY ELITE) Fall 0:35</li>\n<li>Champ. Round 1 - Ethan Benoit (REDHAWK WC) won by decision over Keagan Griffin (FORCE WRESTLING) Dec 4-0</li>\n<li>Champ. Round 1 - Billy Gore (TINLEY PARK BULLDOGS) won by major decision over Jacob Klein (WEST CARROLL WC) Maj 16-2</li>\n<li>Champ. Round 1 - Nicholas Favale (LITTLE FALCONS WC) won by fall over Justin Harris (LIMESTONE CRUSHERS WC) Fall 2:21</li>\n<li>Champ. Round 1 - Brandon Cooper (ACES WC) won by fall over Samuel Conrad (TEAM WEST WOLVES) Fall 1:11</li>\n<li>Champ. Round 1 - Dalton Stokes (TAYLORVILLE WC) won by fall over Brendan Sadeghi (WEST HANCOCK TITAN WC) Fall 1:06</li>\n<li>Champ. Round 1 - Colt Brummer (CUMBERLAND YOUTH WC) won by major decision over Henry Jones (HERRIN JUNIOR WC) Maj 12-2</li>\n<li>Champ. Round 1 - Ben West (JUNIOR PIONEER WC) won by decision over Shawn Lenahan (VILLA LOMBARD COUGARS) Dec 6-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Sage Hecox (HECOX TEAM BENAIAH) won by fall over Luke Roth (NAPERVILLE WC) Fall 0:20</li>\n<li>Champ. Round 1 - Zach Cilella (MENDOTA MAT MASTERS) won by decision over Alexander Lynch (TIGER WC) Dec 6-1</li>\n<li>Champ. Round 1 - Mickey Watson (BATAVIA PINNERS) won by fall over Zachary Akins (BISMARCK HENNING WC) Fall 3:53</li>\n<li>Champ. Round 1 - Ren Swick (SYCAMORE WC) won by fall over Markel Richardson (ROCK ISLAND WC) Fall 3:30</li>\n<li>Champ. Round 1 - Thomas Howell (VITTUM CATS) won by decision over Timothy O`sullivan (FORCE WRESTLING) Dec 9-2</li>\n<li>Champ. Round 1 - Natereace Strong (JJK WRESTLING) won by fall over Sammy Klukas (SHAMROCK WC) Fall 2:53</li>\n<li>Champ. Round 1 - Josh Masters (GRANITE CITY WC) won by fall over Cameron Panicucci (GENESEO SPIDER WC) Fall 3:19</li>\n<li>Champ. Round 1 - Ben Threloff (REDHAWK WC) won by tech fall over Alex Tooren (HOFFMAN ESTATES WC) TF 15-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Cole Whitford (GRANITE CITY WC) won by fall over Zachary Theis (KNIGHTS WRESTLING) Fall 1:11</li>\n<li>Champ. Round 1 - D`reginald Alexander (LITTLE FALCONS WC) won by fall over Blake Whitmer (GENESEO SPIDER WC) Fall 0:42</li>\n<li>Champ. Round 1 - Zachary Hare (STILLMAN VALLEY WC) won by decision over Dylan Lagerstam (MOLINE WC) Dec 11-4</li>\n<li>Champ. Round 1 - Shane Hunt (EDWARDSVILLE WC) won by decision over Alexander Kunkel (BATAVIA PINNERS) Dec 6-0</li>\n<li>Champ. Round 1 - Dan Drew (VITTUM CATS) won by decision over Gino Orlandi (ST. TARCISSUS) Dec 6-5</li>\n<li>Champ. Round 1 - Derek Schultz (MT. ZION WC) won by fall over Devin Pontious (GENESEO SPIDER WC) Fall 1:40</li>\n<li>Champ. Round 1 - Nickolas Kowalczuk (LITTLE HUSKIE WC) won by fall over Kevin Allen (BISMARCK HENNING WC) Fall 2:09</li>\n<li>Champ. Round 1 - Eric Berkovich (TEAM WEST WOLVES) won by decision over Sean Hough (FORCE WRESTLING) Dec 2-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Carl Witt, Iii (TOMCAT WC) won by fall over Hunter Schmidt (TRIAD LITTLE KNIGHTS) Fall 4:02</li>\n<li>Champ. Round 1 - Connor Jones (HARLEM COUGARS) won by decision over William Sierzaga (VITTUM CATS) Dec 3-0</li>\n<li>Champ. Round 1 - Joel Cooper (EDWARDSVILLE WC) won by fall over John Beaudoin (SYCAMORE WC) Fall 1:03</li>\n<li>Champ. Round 1 - Angelo Cervantes (FORCE WRESTLING) won by fall over Chad Phillips (BULLS WC) Fall 1:11</li>\n<li>Champ. Round 1 - Joshua Fikes (HARVEY PARK DIST TWISTERS) won by major decision over Jacob Bergroschtje (KANE COUNTY GRAPPLERS) Maj 15-4</li>\n<li>Champ. Round 1 - Vaughn Monreal-berner (TEAM WEST WOLVES) won by fall over Zachary Ziegler (TIMBERWOLVES WC) Fall 0:46</li>\n<li>Champ. Round 1 - William Canales (SAUK VALLEY WC) won by fall over Ammar Al-ghoul (GLENBARD EAST JR RAMS) Fall 3:40</li>\n<li>Champ. Round 1 - Deonte Eiland (GLADIATORS) won by fall over David Sarkan (LANCER WC) Fall 1:54</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Raymond Griggel (DUNDEE HIGHLANDERS) won by fall over Matthew Kent (EDWARDSVILLE WC) Fall 1:53</li>\n<li>Champ. Round 1 - Matthew Villalobos (WAUKEGAN YOUTH WC) won by fall over Brendan Galbraith (MUSTANG WC) Fall 0:12</li>\n<li>Champ. Round 1 - Alec Gordon (TINLEY PARK BULLDOGS) won by decision over Jonathon Porter (HARLEM RENEGADES) Dec 3-0</li>\n<li>Champ. Round 1 - Tazvier Sanders (WAUKEGAN YOUTH WC) won by fall over Linden Rossing (SAUKEE YOUTH WC) Fall 2:20</li>\n<li>Champ. Round 1 - Mustafa Odeh (TIGER WC) won by fall over Jacob Faso (CROSSTOWN WC) Fall 0:18</li>\n<li>Champ. Round 1 - Andrew Geers (FOX VALLEY WC) won by fall over Nyle Nestor (SAUK VALLEY WC) Fall 2:07</li>\n<li>Champ. Round 1 - Miguel Moreno (TOMCAT WC) won by fall over Brandon Minniti (PLAINFIELD WC) Fall 0:35</li>\n<li>Champ. Round 1 - Mikshadd Townsend (TIGER WC) won by fall over Ray Trevino (YORKVILLE WRESTLING CLUB) Fall 2:51</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Souza- (CRYSTAL LAKE WIZARDS) won by fall over Gregory Strawhacker (GENESEO SPIDER WC) Fall 2:59</li>\n<li>Champ. Round 1 - Ryan Tetlow (LEMONT BEARS WC) won by fall over Preston Lunon (HERRIN JUNIOR WC) Fall 4:25</li>\n<li>Champ. Round 1 - Joshua Jones (GLADIATORS) won by fall over Tyler Heavlin (WARRIOR MONKS) Fall 0:30</li>\n<li>Champ. Round 1 - Jonathan Pollock (MOLINE WC) won by fall over Derek Massey (A-J JUNIOR WILDCATS) Fall 0:45</li>\n<li>Champ. Round 1 - Federico Diaz (TOMCAT WC) won by fall over Joshua Pratt (TIGER WC) Fall 1:26</li>\n<li>Champ. Round 1 - Michael Behrends (WARRENSBURG WC) won by fall over Daniel Epling (MORTON LITTLE MUSTANGS) Fall 0:32</li>\n<li>Champ. Round 1 - Ethan Linder (HOOPESTON AREA WC) won by fall over Zach Burdick (DURAND WC) Fall 2:50</li>\n<li>Champ. Round 1 - Sycory Walker (ORLAND PARK PIONEERS) won by fall over Zachary Heinz (DUNDEE HIGHLANDERS) Fall 1:10</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Louie Hayes (TINLEY PARK BULLDOGS) won by major decision over Brady Wilsie (XTREME WRESTLING) Maj 15-1</li>\n<li>Champ. Round 2 - Anthony Cheloni (SCN YOUTH WC) won by fall over James Higdon (COLLINSVILLE RAIDERS) Fall 3:45</li>\n<li>Champ. Round 2 - Dack Punke (CENTRAL ELITE REBELS) won by injury default over Zachary Lorek (BRAWLERS WC) Inj. 0:00</li>\n<li>Champ. Round 2 - Austin Gomez (GOMEZ WRESTLING ACADEMY) won by decision over Joe Antonelle (SCN YOUTH WC) Dec 6-0</li>\n<li>Champ. Round 2 - Tyler Myers (PLAINFIELD WC) won by decision over Michael Milan (GOMEZ WRESTLING ACADEMY) Dec 6-5</li>\n<li>Champ. Round 2 - Dylan Duncan (SCN YOUTH WC) won by major decision over Mark Ferguson (VITTUM CATS) Maj 10-0</li>\n<li>Champ. Round 2 - Logan Voss (E/P JUNIOR PANTHERS) won by fall over Stuart Chestney (BLOOMINGTON RAIDER WC) Fall 0:50</li>\n<li>Champ. Round 2 - Pat Walker (GOMEZ WRESTLING ACADEMY) won by decision over Travis Piotrowski (WOLVES WC) Dec 7-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Rudy Yates (VITTUM CATS) won by decision over Gavin Sutton (GOMEZ WRESTLING ACADEMY) Dec 6-0</li>\n<li>Champ. Round 2 - Anthony Bosco (SCN YOUTH WC) won by decision over Cameron Roat (LITTLE CELTIC WC) Dec 11-5</li>\n<li>Champ. Round 2 - Francis Edelen (TINLEY PARK BULLDOGS) won by major decision over Tristan Birt (FALCON YOUTH WC) Maj 11-0</li>\n<li>Champ. Round 2 - Andrew Mcfall (FORCE WRESTLING) won by decision over Dalton Brito (EDWARDSVILLE WC) Dec 4-2</li>\n<li>Champ. Round 2 - Brian Rossi (FALCON WC) won by tech fall over Raul Marrero (SPRINGFIELD CAPITAL KIDS WC) TF 16-0</li>\n<li>Champ. Round 2 - Riley Beard (PEORIA RAZORBACKS YOUTH WC) won by decision over Patrick Augustyn (GOMEZ WRESTLING ACADEMY) Dec 6-2</li>\n<li>Champ. Round 2 - Austin O`connor (TINLEY PARK BULLDOGS) won by decision over Kyle Peisker (GOMEZ WRESTLING ACADEMY) Dec 5-2</li>\n<li>Champ. Round 2 - Brady Powers (HONONEGAH KIDS WC) won by major decision over Thomas Svestka (MARTINEZ FOX VALLEY ELITE) Maj 16-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Christian Robertson (VITTUM CATS) won by major decision over Cameron Schwing (FISHER WC) Maj 8-0</li>\n<li>Champ. Round 2 - Gunner Wenger (PANTHER CUB WC) won by decision over Sam Turner (O`FALLON LITTLE PANTHERS) Dec 2-1</li>\n<li>Champ. Round 2 - Jacob Silzer (TINLEY PARK BULLDOGS) won by decision over Shavez Hawkins Jr (CROSSTOWN WC) Dec 4-0</li>\n<li>Champ. Round 2 - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won by fall over Braxten Ary (MIDWEST CENTRAL YOUTH) Fall 3:38</li>\n<li>Champ. Round 2 - Michael Cullen (WRESTLING FACTORY) won by fall over Will Lucie (WEST HANCOCK TITAN WC) Fall 4:14</li>\n<li>Champ. Round 2 - Aj Jaffe (SCN YOUTH WC) won by major decision over Marquez Roberson (BELLEVILLE LITTLE DEVILS) Maj 9-1</li>\n<li>Champ. Round 2 - Elijah Oliver (HARVEY PARK DIST TWISTERS) won by decision over Ian Meagher (LITTLE CELTIC WC) Dec 2-1</li>\n<li>Champ. Round 2 - Garrett Dziedzic (CRYSTAL LAKE WIZARDS) won by tech fall over Javeontae Crider (LIONHEART INTENSE WRESTLING) TF 18-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - James Wolfe (HARLEM COUGARS) won by decision over Brian Krasowski (ORLAND PARK PIONEERS) Dec 5-1</li>\n<li>Champ. Round 2 - Zachary Akers (INDIANS ELITE) won in overtime over Kevin Pate (HARVEY PARK DIST TWISTERS) OT 6-4</li>\n<li>Champ. Round 2 - Israel Santiago (GRAPPLIN` DEVILS WC) won by decision over Brandon Briggs (MARENGO YOUTH WRESTLING) Dec 8-2</li>\n<li>Champ. Round 2 - Matt Rowland (SCN YOUTH WC) won by fall over Brock Danko (BLOOMINGTON RAIDER WC) Fall 2:00</li>\n<li>Champ. Round 2 - Antonio Alvarez (OAKWOOD WC) won by decision over Camiran Sadeghi (WEST HANCOCK TITAN WC) Dec 13-6</li>\n<li>Champ. Round 2 - Titus Taylor (BELLEVILLE LITTLE DEVILS) won by decision over Michael Callahan (SCN YOUTH WC) Dec 6-4</li>\n<li>Champ. Round 2 - David Kasper (SOUTHSIDE STALLIONS) won by major decision over Eric Carter (BARRINGTON BRONCOS) Maj 12-0</li>\n<li>Champ. Round 2 - Vincent Turk (CRYSTAL LAKE WIZARDS) won by decision over Shaun Wasso (LITTLE CELTIC WC) Dec 7-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Michael Hrdlicka (GOMEZ WRESTLING ACADEMY) won by major decision over Jake Tisza (CROSSTOWN WC) Maj 9-0</li>\n<li>Champ. Round 2 - Josh Alber (DAKOTA WC) won by decision over Brandon Ahlgrim (SAUK VALLEY WC) Dec 6-0</li>\n<li>Champ. Round 2 - Jake Eckenrod (MT. ZION WC) won by decision over Kyle Simpkins (BRAWLERS WC) Dec 5-3</li>\n<li>Champ. Round 2 - Isaih White (HARVEY PARK DIST TWISTERS) won by fall over Peyton Smith (BENTON JR WC) Fall 2:41</li>\n<li>Champ. Round 2 - Jack Diana (MUSTANG WC) won by decision over Gunnar Hjorth (MARTINEZ FOX VALLEY ELITE) Dec 2-0</li>\n<li>Champ. Round 2 - Vaughn Hobart (PONTIAC WC) won by decision over Sam Andresen (EDWARDSVILLE WC) Dec 11-6</li>\n<li>Champ. Round 2 - Joshua Fuqua (CROSSTOWN WC) won by fall over Michael Burke (TINLEY PARK BULLDOGS) Fall 2:52</li>\n<li>Champ. Round 2 - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by decision over Jake Drew (GOMEZ WRESTLING ACADEMY) Dec 4-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Randle Taborn (SPRINGFIELD CAPITAL KIDS WC) won by decision over David Riojas (ROMEOVILLE YOUTH WC) Dec 8-2</li>\n<li>Champ. Round 2 - Fred Johnson (HARVEY PARK DIST TWISTERS) won by decision over Levi Smith (LAKELAND PREDATORS) Dec 7-0</li>\n<li>Champ. Round 2 - Matthew Ferraro (SCN YOUTH WC) won by decision over Eric Barone (WOLVES WC) Dec 9-7</li>\n<li>Champ. Round 2 - Larry Early (ROMEOVILLE YOUTH WC) won by decision over Trace Carello (MT. VERNON LIONS) Dec 1-0</li>\n<li>Champ. Round 2 - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won by major decision over Cole Witzig (TRIAD LITTLE KNIGHTS) Maj 14-1</li>\n<li>Champ. Round 2 - Dillion Chase (RIVERBEND WC) won by fall over Ryan Willett (RENEGADE WC (NFP)) Fall 1:59</li>\n<li>Champ. Round 2 - Nick Nasenbeny (FORCE WRESTLING) won by fall over Alex Madrigal (SOUTHSIDE STALLIONS) Fall 1:18</li>\n<li>Champ. Round 2 - Kyle Akins (SYCAMORE WC) won by decision over James Zeigler Jr. (EDWARDSVILLE WC) Dec 7-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Carver James (DAKOTA WC) won by decision over Chase Vosburgh (MT. VERNON LIONS) Dec 5-1</li>\n<li>Champ. Round 2 - Alante Walker (ORLAND PARK PIONEERS) won by decision over Ethan Jones (RIVERBEND WC) Dec 7-4</li>\n<li>Champ. Round 2 - John Jimenez (SCN YOUTH WC) won by tech fall over Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) TF 17-1</li>\n<li>Champ. Round 2 - Mario Leveille (OAK FOREST WARRIORS) won by decision over Jacob Plekavic (IRON MAN) Dec 9-4</li>\n<li>Champ. Round 2 - Juwan Edmond (BROADVIEW PARK DISTRICT) won by fall over Robert Fox (MAD DOG WRESTLING ACADEMY) Fall 3:38</li>\n<li>Champ. Round 2 - Cole Wysocki (TRIAD LITTLE KNIGHTS) won by injury default over Brad Wood (ORLAND PARK PIONEERS) Inj. 0:00</li>\n<li>Champ. Round 2 - Kamal Bey (HARVEY PARK DIST TWISTERS) won by fall over Haratio Austin (SPRINGFIELD CAPITAL KIDS WC) Fall 3:55</li>\n<li>Champ. Round 2 - Michael Zelasco (CRYSTAL LAKE WIZARDS) won by fall over Scott Oglanian (WEST CHICAGO JUNIOR WILDCATS) Fall 4:03</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Nicholas Ferraro (SCN YOUTH WC) won by decision over Dawson Ford (SPRINGFIELD CAPITAL KIDS WC) Dec 6-3</li>\n<li>Champ. Round 2 - Flynn Nagel (VITTUM CATS) won by decision over Brayton Williams (BULLS WC) Dec 11-6</li>\n<li>Champ. Round 2 - Brandon Arteaga (GOMEZ WRESTLING ACADEMY) won by major decision over Cody Tournear (CHAMPAIGN KIDS WRESTLING) Maj 15-2</li>\n<li>Champ. Round 2 - Andrew Collins (ROMEOVILLE YOUTH WC) won by fall over Hunter Binns (PANTHER CUB WC) Fall 0:32</li>\n<li>Champ. Round 2 - Matthew Rundell (ARLINGTON CARDINALS) won by fall over Gage Overton (UNITED SOUTHERN ALLSTARS) Fall 3:52</li>\n<li>Champ. Round 2 - Nick Schultz (MARTINEZ FOX VALLEY ELITE) won by fall over Mike Kurtz (YORKVILLE WRESTLING CLUB) Fall 1:26</li>\n<li>Champ. Round 2 - Josh Martin (GLENBARD EAST JR RAMS) won by major decision over Jacob Morgan (MT. ZION WC) Maj 11-2</li>\n<li>Champ. Round 2 - John Blanke (BARRINGTON BRONCOS) won by decision over Nicholas Gil (CRYSTAL LAKE WIZARDS) Dec 3-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Brady Rude (SAUK VALLEY WC) won by decision over Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) Dec 8-1</li>\n<li>Champ. Round 2 - Ryan Fish (LITTLE HUSKIE WC) won by decision over Anthony Scaccia (SCN YOUTH WC) Dec 3-2</li>\n<li>Champ. Round 2 - Tyler Demoss (HONONEGAH KIDS WC) won by decision over Ronald Shafer Iii (GRANITE CITY WC) Dec 8-1</li>\n<li>Champ. Round 2 - Joseph Fulco (FORCE WRESTLING) won by decision over Nicholas Bonomo (BRONCO WRESTLING) Dec 11-4</li>\n<li>Champ. Round 2 - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won by fall over Tyler Mackessy (FORCE WRESTLING) Fall 1:52</li>\n<li>Champ. Round 2 - Harrison Williams (SPRINGFIELD CAPITAL KIDS WC) won by decision over Christopher Golden (VITTUM CATS) Dec 9-6</li>\n<li>Champ. Round 2 - Brent Hakeman (BRAWLERS WC) won by decision over Morgan Drew (WRESTLING FACTORY) Dec 7-5</li>\n<li>Champ. Round 2 - Randy Meneweather (KNOX COUNTY KRUSHERS) won by decision over Andrew Marsden (CRYSTAL LAKE WIZARDS) Dec 11-8</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Michael Pixley (GRANITE CITY WC) won by major decision over Austin Armstrong (SYCAMORE WC) Maj 12-1</li>\n<li>Champ. Round 2 - Jake Storck (MUSTANG WC) won by major decision over Danny Saracco (ROMEOVILLE YOUTH WC) Maj 11-2</li>\n<li>Champ. Round 2 - Thomas O`brien (SCN YOUTH WC) won by major decision over Nathan Romero (DUNDEE HIGHLANDERS) Maj 11-0</li>\n<li>Champ. Round 2 - Lucas Duckett (SHELBYVILLE JR RAMS WRESTLING) won by decision over Jeffrey Burzinski (VITTUM CATS) Dec 1-0</li>\n<li>Champ. Round 2 - Christopher Hiscock (INDIANS ELITE) won by decision over Mason Delong (BRAWLERS WC) Dec 8-1</li>\n<li>Champ. Round 2 - Dru Worker (TINLEY PARK BULLDOGS) won by decision over Bradley Herzberg (BULLS WC) Dec 7-6</li>\n<li>Champ. Round 2 - Xavier Montalvo (ANIMAL WC) won by major decision over Brandon Klein (CHAMPAIGN KIDS WRESTLING) Maj 11-3</li>\n<li>Champ. Round 2 - Jeffrey Casey (WEST CARROLL WC) won by major decision over Kevin Mcnally (CROSSTOWN WC) Maj 9-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Vincent Anderson (HONONEGAH KIDS WC) won by decision over Nate Kearney (BATAVIA PINNERS) Dec 10-4</li>\n<li>Champ. Round 2 - Jack Rossi (CHAMPAIGN KIDS WRESTLING) won by fall over Dustin Pindel (ORLAND PARK PIONEERS) Fall 2:33</li>\n<li>Champ. Round 2 - Jeffery Klank (INDIANS ELITE) won by major decision over Larry Thomas Jr (IRON MAN) Maj 9-0</li>\n<li>Champ. Round 2 - Tyre Lee (RENEGADE WC (NFP)) won by decision over Zachary Prinz (FORCE WRESTLING) Dec 4-2</li>\n<li>Champ. Round 2 - Cameron Throneberry (EDWARDSVILLE WC) won by fall over Austin Hedrick (SJO SPARTAN YOUTH WC) Fall 2:04</li>\n<li>Champ. Round 2 - Anthony Palacios (JOLIET JUNIOR STEELMEN) won by fall over Michael Kozyra (LITTLE HUSKIE WC) Fall 2:39</li>\n<li>Champ. Round 2 - Mitchel Humphrey (MENDOTA MAT MASTERS) won by major decision over Nicholas Whitehead (ZEE BEE STINGERS) Maj 23-9</li>\n<li>Champ. Round 2 - Charley Popp (CARY MATMEN WC) won by decision over Zach Wehde (BRONCO WRESTLING) Dec 4-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Zac Keller (LAKELAND PREDATORS) won by decision over Joshua Hettiger (REDHAWK WC) Dec 5-0</li>\n<li>Champ. Round 2 - Jim Geier (FORCE WRESTLING) won by fall over Alex Dobson (SYCAMORE WC) Fall 1:08</li>\n<li>Champ. Round 2 - Connor Doak (JUNIOR PIONEER WC) won by fall over Louis Giovannetti (NAPERVILLE WC) Fall 0:18</li>\n<li>Champ. Round 2 - Emery Parker (GRAPPLIN` DEVILS WC) won by fall over Richard Rinehart (FALCON YOUTH WC) Fall 3:40</li>\n<li>Champ. Round 2 - Michael Johnson (EDWARDSVILLE WC) won by decision over Levi Rice (MONTICELLO KIDS WC) Dec 7-0</li>\n<li>Champ. Round 2 - Edmond Hogan (LANCER WC) won by tech fall over Matt Brozovich (INDIANS ELITE) TF 15-0</li>\n<li>Champ. Round 2 - Xian Jerez (VILLA PARK YOUNG WARRIORS) won by decision over Ryan Scharf (MT. ZION WC) Dec 4-2</li>\n<li>Champ. Round 2 - Ian Harwick (HARLEM RENEGADES) won by major decision over Nicholas Spacek (LIONS WC) Maj 13-1</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Kailor Hecox (HECOX TEAM BENAIAH) won by decision over Tad Cravens (HERRIN JUNIOR WC) Dec 10-7</li>\n<li>Champ. Round 2 - Keegan Mugerditchian (HOFFMAN ESTATES WC) won by fall over Hasan Jehan (CHICAGO WOLVES DEN) Fall 1:21</li>\n<li>Champ. Round 2 - Kenny Condon (VITTUM CATS) won by fall over Alexander Girona (LAKELAND PREDATORS) Fall 2:51</li>\n<li>Champ. Round 2 - Bryce Gorman (LITTLE CELTIC WC) won by decision over Brian Pence (CRYSTAL LAKE WIZARDS) Dec 6-1</li>\n<li>Champ. Round 2 - Collin Cronberg (LITTLE CELTIC WC) won by fall over Kaler Deakin (GENESEO SPIDER WC) Fall 0:25</li>\n<li>Champ. Round 2 - Lucas Greenberg (VILLA LOMBARD COUGARS) won by fall over Kacy Jent (SHELBYVILLE JR RAMS WRESTLING) Fall 3:38</li>\n<li>Champ. Round 2 - Mark Dinardo (FORCE WRESTLING) won by fall over Christopher Malone (SYCAMORE WC) Fall 1:29</li>\n<li>Champ. Round 2 - Bradley Dunn (CRYSTAL LAKE WIZARDS) won by fall over Niko Portokalis (NOTRE DAME WRESTLING) Fall 2:28</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Sean Kelly (LITTLE CELTIC WC) won by fall over Cody Barnes (CRYSTAL LAKE WIZARDS) Fall 0:38</li>\n<li>Champ. Round 2 - Cain Bialas (WW TIGER WC) won by decision over Jeremy Rivers (WESTVILLE YOUTH WC) Dec 6-4</li>\n<li>Champ. Round 2 - Alex Benoit (REDHAWK WC) won by fall over Joshua Bouie (INDIANS ELITE) Fall 1:23</li>\n<li>Champ. Round 2 - Mykel Gary (CARBONDALE WC) won by fall over Colton Wegner (VILLA LOMBARD COUGARS) Fall 0:49</li>\n<li>Champ. Round 2 - Keyshawn Bulls (GLADIATORS) won by decision over Dalton Ness (LITTLE REDSKINS WC) Dec 8-7</li>\n<li>Champ. Round 2 - Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) won by fall over Jeffrey Simmons (LIL` STORM) Fall 3:25</li>\n<li>Champ. Round 2 - Tyler Johnson (LEMONT BEARS WC) won by decision over Justin Heavilon (GRANITE CITY WC) Dec 6-1</li>\n<li>Champ. Round 2 - Austin Treichel (CROSSTOWN WC) won by fall over Justin Dauphin (MARENGO YOUTH WRESTLING) Fall 1:01</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Andre Mickens (TINLEY PARK BULLDOGS) won by fall over Mackenzie Noel (BISMARCK HENNING WC) Fall 4:04</li>\n<li>Champ. Round 2 - Jimique Davis (VILLA LOMBARD COUGARS) won by fall over Eli Burdick (DURAND WC) Fall 0:30</li>\n<li>Champ. Round 2 - Aj Friedrich (METAMORA KIDS WC) won by fall over Marc Gomez (BELVIDERE BANDITS) Fall 1:38</li>\n<li>Champ. Round 2 - Sam Erickson (DOWNERS GROVE COUGARS) won by fall over Kyle Tex (TAYLORVILLE WC) Fall 1:48</li>\n<li>Champ. Round 2 - Stu Landin (TINLEY PARK BULLDOGS) won by fall over Chris Yaros (ORLAND PARK PIONEERS) Fall 2:04</li>\n<li>Champ. Round 2 - Mason Jett (HOOPESTON AREA WC) won by decision over Mark Miller (ZEE BEE STINGERS) Dec 11-7</li>\n<li>Champ. Round 2 - Corey Harrell (CHAMPBUILDERS) won by fall over Shane Favier (MURPHYSBORO WRESTLING) Fall 3:40</li>\n<li>Champ. Round 2 - Moises Pina (MORTON LITTLE MUSTANGS) won by tech fall over Tyler Barton (SYCAMORE WC) TF 19-3</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Dalton Kettering (ROCK ISLAND WC) won by decision over Brandon Anderson (WEST CARROLL WC) Dec 6-2</li>\n<li>Champ. Round 2 - Lucas Warren (BLACKHAWK WC) won by decision over Bryan Ditchman (TINLEY PARK BULLDOGS) Dec 11-8</li>\n<li>Champ. Round 2 - Noah Fleckenstein (LIONS WC) won by fall over Ryan Berman (LITTLE CELTIC WC) Fall 4:16</li>\n<li>Champ. Round 2 - Tyler Rohrer (LIL` STORM) won by fall over Terrion Jones (JJK WRESTLING) Fall 1:20</li>\n<li>Champ. Round 2 - Deontae Brown (HARVEY PARK DIST TWISTERS) won by tech fall over Zachary Simpson (RICH RATTLERS WC) TF 16-1</li>\n<li>Champ. Round 2 - D`andre Johnson (VILLA LOMBARD COUGARS) won by fall over Diandre Smith (CALUMET MEM. P.D. WOLVERINES) Fall 2:17</li>\n<li>Champ. Round 2 - Tanner Farmer (HIGHLAND BULLDOG JR WC) won by fall over Matthew Iwinski (ROMEOVILLE YOUTH WC) Fall 4:05</li>\n<li>Champ. Round 2 - Zach Reed (DAKOTA WC) won by fall over David Baze (QUINCY WC) Fall 0:17</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Frank Pavlik (PALATINE PANTHERS WC) won by fall over Trey Kerrens (MURPHYSBORO WRESTLING) Fall 1:00</li>\n<li>Champ. Round 2 - Jordan Ladd (CHILLI DAWGS WC) won by fall over Christopher Bartels (DUNDEE HIGHLANDERS) Fall 3:48</li>\n<li>Champ. Round 2 - Tyler Dicken (WESTVILLE YOUTH WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Nicky Allegretti (VITTUM CATS) won by fall over Joshua Smith (JACKSONVILLE AREA YOUTH WRESTLING) Fall 4:09</li>\n<li>Champ. Round 2 - Jake Ford (MUSTANG WC) won by fall over Keidrion Redd (JJK WRESTLING) Fall 1:12</li>\n<li>Champ. Round 2 - Charles Fisher (BENTON JR WC) won by fall over Connor Willis (HOOPESTON AREA WC) Fall 0:25</li>\n<li>Champ. Round 2 - Nicholas Wolf (FORCE WRESTLING) won by fall over Jordan Taylor (SPRINGFIELD CAPITAL KIDS WC) Fall 0:23</li>\n<li>Champ. Round 2 - Jacob Heavlin (WARRIOR MONKS) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Jabari Moody (HARVEY PARK DIST TWISTERS) won by decision over Jeffery Morrow (CRYSTAL LAKE WIZARDS) Dec 6-1</li>\n<li>Champ. Round 2 - Justin Nelson (UNITED SOUTHERN ALLSTARS) won by major decision over Grant Smiley (FORCE WRESTLING) Maj 9-0</li>\n<li>Champ. Round 2 - Dylan Cramer (FORCE WRESTLING) won by fall over Deven Reese (WESTVILLE YOUTH WC) Fall 0:26</li>\n<li>Champ. Round 2 - Tommy Pawelski (MAINE EAGLES) won by decision over Shane Mart (INDIANS ELITE) Dec 5-0</li>\n<li>Champ. Round 2 - Sean Sibley (FALCON WC) won by major decision over Carlos Fuentez (VILLA LOMBARD COUGARS) Maj 10-0</li>\n<li>Champ. Round 2 - Aj Villarreal (DOWNERS GROVE COUGARS) won by fall over Jesus Vasquez (SOUTHSIDE STALLIONS) Fall 0:54</li>\n<li>Champ. Round 2 - Christian Poupard (EDWARDSVILLE WC) won by decision over Kenneth Baldridge (LITTLE REDSKINS WC) Dec 5-3</li>\n<li>Champ. Round 2 - Austin Ryan (CRYSTAL LAKE WIZARDS) won by decision over Johnathan Gahagan (SOUTHSIDE STALLIONS) Dec 4-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Cameron Kennedy (GOMEZ WRESTLING ACADEMY) won by fall over Devin Tortorice (WOLVES WC) Fall 3:52</li>\n<li>Champ. Round 2 - Tyler Svestka (MARTINEZ FOX VALLEY ELITE) won by fall over Joseph Bertolino (Fighting Titan) Fall 1:22</li>\n<li>Champ. Round 2 - Stephen Richardson (PONTIAC WC) won by major decision over Brendan Gaynor (TINLEY PARK BULLDOGS) Maj 9-0</li>\n<li>Champ. Round 2 - Haydon Grammer (EDWARDSVILLE WC) won by decision over Collin Druck (SYCAMORE WC) Dec 2-0</li>\n<li>Champ. Round 2 - Dominic Naso (FORCE WRESTLING) won by fall over Keith Mcdonough (BULLS WC) Fall 3:30</li>\n<li>Champ. Round 2 - Jacob Field (SCN YOUTH WC) won by decision over Tristan Thies (GENESEO SPIDER WC) Dec 10-5</li>\n<li>Champ. Round 2 - Sam Martino (GOMEZ WRESTLING ACADEMY) won by decision over Mike Falco (SOUTHSIDE STALLIONS) Dec 6-2</li>\n<li>Champ. Round 2 - Nelson Baker (XTREME WRESTLING) won by fall over Andrew Brooks (SCN YOUTH WC) Fall 0:55</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Jordan Lind (PONTIAC WC) won by decision over Brad Martens (SCN YOUTH WC) Dec 1-0</li>\n<li>Champ. Round 2 - Briar King (UNITED SOUTHERN ALLSTARS) won by decision over Martin Martinez (WAUKEGAN YOUTH WC) Dec 7-4</li>\n<li>Champ. Round 2 - Jim Pellegrino (ORLAND PARK PIONEERS) won by major decision over Ricardo Roman (BELVIDERE BANDITS) Maj 9-1</li>\n<li>Champ. Round 2 - Anthony Devriese (JUNIOR PIONEER WC) won by decision over Jordan Scalice (GOMEZ WRESTLING ACADEMY) Dec 6-0</li>\n<li>Champ. Round 2 - Richard Browne (GOMEZ WRESTLING ACADEMY) won by decision over Jacob Wever (L-P CRUNCHING CAVS) Dec 4-1</li>\n<li>Champ. Round 2 - Joey Shump (BATAVIA PINNERS) won by fall over Jason Moerlien (GRANITE CITY WC) Fall 3:53</li>\n<li>Champ. Round 2 - Sean Mcmahon (TINLEY PARK BULLDOGS) won by decision over Jordan Laster (ROMEOVILLE YOUTH WC) Dec 7-4</li>\n<li>Champ. Round 2 - Jordan Northrup (HARLEM COUGARS) won by major decision over Austen Schott (CHAMPAIGN KIDS WRESTLING) Maj 9-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Mark Duda (CROSSTOWN WC) won by decision over Esai Ponce (KNIGHTS WRESTLING) Dec 5-3</li>\n<li>Champ. Round 2 - Jake Snow (SAUK VALLEY WC) won by decision over Michael Harris (BELLEVILLE LITTLE DEVILS) Dec 4-2</li>\n<li>Champ. Round 2 - Garrett Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Jimmy Regan (VITTUM CATS) Dec 6-0</li>\n<li>Champ. Round 2 - Frank Yattoni (MARTINEZ FOX VALLEY ELITE) won by decision over Jordon Mrvos (EDWARDSVILLE WC) Dec 7-2</li>\n<li>Champ. Round 2 - Alex Cowan (IRON MAN) won by decision over Isaiah Stedwill (CENTRAL ELITE REBELS) Dec 7-6</li>\n<li>Champ. Round 2 - Steve Turner (O`FALLON LITTLE PANTHERS) won by fall over Trayvon Zabala (FORCE WRESTLING) Fall 2:32</li>\n<li>Champ. Round 2 - Robert Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Quinton Starzyk (VITTUM CATS) Dec 4-3</li>\n<li>Champ. Round 2 - Gacob Lenox (HARLEM COUGARS) won by fall over Matthew Sears (LITTLE CELTIC WC) Fall 1:04</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Michael Sepke (BRONCO WRESTLING) won by major decision over Wade Lardy (CRYSTAL LAKE WIZARDS) Maj 12-2</li>\n<li>Champ. Round 2 - Demechico Spraggins (UNITED SOUTHERN ALLSTARS) won by major decision over Rob Mikenis (LINCOLN-WAY WC) Maj 14-4</li>\n<li>Champ. Round 2 - Blake Tisza (CROSSTOWN WC) won by decision over Ben Clifford (GOMEZ WRESTLING ACADEMY) Dec 6-3</li>\n<li>Champ. Round 2 - Christian Smith (MOLINE WC) won by decision over Tanner Modglin (SJO SPARTAN YOUTH WC) Dec 11-7</li>\n<li>Champ. Round 2 - Chet Mcclure (FALCON YOUTH WC) won by decision over Danny Carlson (REBELS WC) Dec 3-0</li>\n<li>Champ. Round 2 - Austin Graham (MARTINEZ FOX VALLEY ELITE) won by decision over Derrick Curry (GLADIATORS) Dec 12-8</li>\n<li>Champ. Round 2 - John Pellegrino (ORLAND PARK PIONEERS) won by decision over Kevin Conrad (BARRINGTON BRONCOS) Dec 9-2</li>\n<li>Champ. Round 2 - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by decision over Trent Atkins (CARY MATMEN WC) Dec 5-3</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Boggess (ARLINGTON CARDINALS) won by major decision over Cotey Mccallister (GMO EAGLES KIDS WRESTLING) Maj 13-2</li>\n<li>Champ. Round 2 - Corbett Oughton (INDIANS ELITE) won by decision over Dustin Chapman (PANTHER CUB WC) Dec 7-0</li>\n<li>Champ. Round 2 - Nicholas Peters (CRYSTAL LAKE WIZARDS) won by decision over Dylan Donner (FALCON YOUTH WC) Dec 6-0</li>\n<li>Champ. Round 2 - Nuntreae Jackson (HARVEY PARK DIST TWISTERS) won by major decision over Mark Henriksen (BATAVIA PINNERS) Maj 14-3</li>\n<li>Champ. Round 2 - Bryce Brill (FOX VALLEY WC) won by decision over Steven Galiardo (SHAMROCK WC) Dec 10-3</li>\n<li>Champ. Round 2 - Daniel Ruettiger (INDIANS ELITE) won by decision over Alex Vosburgh (MT. VERNON LIONS) Dec 2-0</li>\n<li>Champ. Round 2 - Ryan Holzrichter (FORCE WRESTLING) won by decision over Michael O`connor (TINLEY PARK BULLDOGS) Dec 4-1</li>\n<li>Champ. Round 2 - Sal Annoreno (GOMEZ WRESTLING ACADEMY) won by decision over Erik Nord (BELVIDERE BANDITS) Dec 2-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Cain Salas (GRANITE CITY WC) won by major decision over Dan Goress (KNIGHTS WRESTLING) Maj 15-7</li>\n<li>Champ. Round 2 - Barlow Mcghee (ROCK ISLAND WC) won by decision over Frank Voltattorni (CROSSTOWN WC) Dec 15-10</li>\n<li>Champ. Round 2 - George Fisher (SCN YOUTH WC) won by fall over Dylan Swan (ORLAND PARK PIONEERS) Fall 0:40</li>\n<li>Champ. Round 2 - Notay Jackson (HARVEY PARK DIST TWISTERS) won by decision over Zachary Denny (HARLEM COUGARS) Dec 9-5</li>\n<li>Champ. Round 2 - Abel Rios (ZEE BEE STINGERS) won by decision over Kevin Golden (VITTUM CATS) Dec 11-4</li>\n<li>Champ. Round 2 - Kyle Langenderfer (ORLAND PARK PIONEERS) won by fall over Xavier Sneed (PEORIA HEIGHTS MINUTEMEN JR WRESTLING) Fall 3:53</li>\n<li>Champ. Round 2 - Nate Higgins (UNITED SOUTHERN ALLSTARS) won by fall over Blaine Haines (TIGER WC) Fall 1:13</li>\n<li>Champ. Round 2 - Ernest Battaglia (FOX VALLEY WC) won by decision over Brandon Lizer (DAKOTA WC) Dec 4-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Eddie Gonzalez (FOX VALLEY WC) won by fall over Mitchel Kennington (HARLEM RENEGADES) Fall 4:27</li>\n<li>Champ. Round 2 - Connor Bandy (TINLEY PARK BULLDOGS) won by fall over Michael Mcnulty-ferguson (INDIANS ELITE) Fall 4:15</li>\n<li>Champ. Round 2 - Dustin Beswick (RIVERBEND WC) won by decision over Salvador Ayala (LIBERTYVILLE WILDCATS) Dec 2-0</li>\n<li>Champ. Round 2 - Colin Holler (EAGLE ONE) won by fall over Austin Mcpeek (RENEGADES (STOCKTON)) Fall 1:26</li>\n<li>Champ. Round 2 - Mitchell Cook (ORLAND PARK PIONEERS) won by decision over Ethan Pullum (HERRIN JUNIOR WC) Dec 1-0</li>\n<li>Champ. Round 2 - Alberto Herrera (ROCK ISLAND WC) won by decision over Matthew Stapleton (TINLEY PARK BULLDOGS) Dec 7-4</li>\n<li>Champ. Round 2 - Alex Friedman (PONTIAC WC) won by fall over Jose Villarreal (MARTINEZ FOX VALLEY ELITE) Fall 3:44</li>\n<li>Champ. Round 2 - Jj Whaley (XTREME WRESTLING) won by fall over Joshua Foster (HARVEY PARK DIST TWISTERS) Fall 0:27</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Brian Murphy (VILLA LOMBARD COUGARS) won by major decision over Damon Cloe (MARENGO YOUTH WRESTLING) Maj 18-4</li>\n<li>Champ. Round 2 - Peter Andreotti (ORLAND PARK PIONEERS) won by decision over Zach Pickering (SOUTHSIDE STALLIONS) Dec 13-8</li>\n<li>Champ. Round 2 - Hadin Restivo (WEST FRANKFORT JR WRESTLING) won by decision over Matthew Fetherling (CRYSTAL LAKE WIZARDS) Dec 8-3</li>\n<li>Champ. Round 2 - Jameer Thurman (GLADIATORS) won by fall over Kolbie Schilson (WEST HANCOCK TITAN WC) Fall 2:09</li>\n<li>Champ. Round 2 - Fabian Lara (MARTINEZ FOX VALLEY ELITE) won by fall over Jon Solberg (GENESEO SPIDER WC) Fall 2:21</li>\n<li>Champ. Round 2 - Richard Robertson (VITTUM CATS) won by major decision over Nick Fanella (LAKELAND PREDATORS) Maj 10-0</li>\n<li>Champ. Round 2 - Colton Gladwell (CENTRAL ELITE REBELS) won by fall over Davonte Mahomes (JOLIET JUNIOR STEELMEN) Fall 4:09</li>\n<li>Champ. Round 2 - Manny Silva (HONONEGAH KIDS WC) won by decision over Eric Lovill (GOMEZ WRESTLING ACADEMY) Dec 4-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Alec Jarnagin (SHELBYVILLE JR RAMS WRESTLING) won by decision over Stephen Adamecz (SAUK VALLEY WC) Dec 7-3</li>\n<li>Champ. Round 2 - Jake Turk (CRYSTAL LAKE WIZARDS) won by decision over Patrick Vitek (VITTUM CATS) Dec 5-1</li>\n<li>Champ. Round 2 - Lonnie Cleveland Iii (UNITED SOUTHERN ALLSTARS) won by decision over Quincy Kalkbrenner (PANTHER CUB WC) Dec 4-0</li>\n<li>Champ. Round 2 - Mitchell Murphy (ORLAND PARK PIONEERS) won by decision over John Whalen (CHAMPAIGN KIDS WRESTLING) Dec 4-3</li>\n<li>Champ. Round 2 - Dan Rowland (SCN YOUTH WC) won by decision over Tim Gillooley (LINCOLN-WAY WC) Dec 8-3</li>\n<li>Champ. Round 2 - Brett Meyer (CENTRAL ELITE REBELS) won by major decision over Tim Mathias (EDWARDSVILLE WC) Maj 9-0</li>\n<li>Champ. Round 2 - Hunter Rollins (ARLINGTON CARDINALS) won by decision over Torrie Williams (GRANITE CITY WC) Dec 10-3</li>\n<li>Champ. Round 2 - Austin Culton (SYCAMORE WC) won by decision over Mitch Miller (GENESEO SPIDER WC) Dec 8-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Patrick O`malley (CARY MATMEN WC) won by decision over Alex Brooks (GRANITE CITY WC) Dec 5-2</li>\n<li>Champ. Round 2 - Kenard Washington (GLADIATORS) won by fall over Michael Stepuszek (LITTLE CELTIC WC) Fall 1:09</li>\n<li>Champ. Round 2 - Mario Rodriguez (VILLA LOMBARD COUGARS) won by decision over Alex Anaya (DOWNERS GROVE COUGARS) Dec 10-8</li>\n<li>Champ. Round 2 - Mark Coleman (REDHAWK WC) won by decision over Dominic Harris (CENTRAL ELITE REBELS) Dec 5-4</li>\n<li>Champ. Round 2 - Brandon Sklavanitis (SAUK VALLEY WC) won by decision over Kellen Cleveland (LITTLE FALCONS WC) Dec 3-1</li>\n<li>Champ. Round 2 - Jack Sears (VITTUM CATS) won by tech fall over James Baggett (HIGHLAND BULLDOG JR WC) TF 15-0</li>\n<li>Champ. Round 2 - Breon Hoosier (MARTINEZ FOX VALLEY ELITE) won by decision over Joe Cortese (MAINE EAGLES) Dec 5-2</li>\n<li>Champ. Round 2 - Logan Staver (PANTHER CUB WC) won by major decision over Zach Abney (SAUKEE YOUTH WC) Maj 9-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Connor Swier (FOX VALLEY WC) won by fall over Nathaniel Magiera (WOLVES WC) Fall 1:14</li>\n<li>Champ. Round 2 - Cameron Mammen (TIGER WC) won by fall over Brad Evangelista (PALATINE PANTHERS WC) Fall 1:25</li>\n<li>Champ. Round 2 - Brian Bahrs (SAUK VALLEY WC) won by decision over Tony Cashmore (LAKELAND PREDATORS) Dec 5-1</li>\n<li>Champ. Round 2 - Jamonni Anderson (VITTUM CATS) won by fall over Richard Kruis (FALCON WC) Fall 0:54</li>\n<li>Champ. Round 2 - Bailey Appleman (CLIPPER WC) won by major decision over Nathan Vaughn (HERRIN JUNIOR WC) Maj 12-3</li>\n<li>Champ. Round 2 - Brian Allen (HINSDALE WC) won by decision over August Tholl (ORLAND PARK PIONEERS) Dec 6-1</li>\n<li>Champ. Round 2 - Max Brozovich (INDIANS ELITE) won by decision over Joseph Dedick (GOMEZ WRESTLING ACADEMY) Dec 6-4</li>\n<li>Champ. Round 2 - Sam Klenske (MARENGO YOUTH WRESTLING) won by fall over Kaelen Bradford (LITTLE FALCONS WC) Fall 0:51</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Tj Lowe (RIVERDALE JR RAMS WC) won by fall over Joey Welsh (HONONEGAH KIDS WC) Fall 3:25</li>\n<li>Champ. Round 2 - Gavin Kitson (CLINTON WC) won by decision over Ethan Benoit (REDHAWK WC) Dec 2-1</li>\n<li>Champ. Round 2 - Corry Williams (GRANITE CITY WC) won by fall over Billy Gore (TINLEY PARK BULLDOGS) Fall 1:44</li>\n<li>Champ. Round 2 - Jordan Ellingwood (GOMEZ WRESTLING ACADEMY) won by major decision over Nicholas Favale (LITTLE FALCONS WC) Maj 17-3</li>\n<li>Champ. Round 2 - Chris Giatras (LEMONT BEARS WC) won by fall over Brandon Cooper (ACES WC) Fall 2:32</li>\n<li>Champ. Round 2 - Dalton Major (BRAWLERS WC) won by fall over Dalton Stokes (TAYLORVILLE WC) Fall 4:00</li>\n<li>Champ. Round 2 - Colt Brummer (CUMBERLAND YOUTH WC) won by decision over Jacob Boser (MARTINEZ FOX VALLEY ELITE) Dec 5-2</li>\n<li>Champ. Round 2 - Mitchell Jordan (SYCAMORE WC) won by decision over Ben West (JUNIOR PIONEER WC) Dec 6-3</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Sage Hecox (HECOX TEAM BENAIAH) won by fall over Samuel Wampler (ACES WC) Fall 2:54</li>\n<li>Champ. Round 2 - Zach Cilella (MENDOTA MAT MASTERS) won by fall over Ian Burns (JUNIOR PATRIOTS) Fall 3:50</li>\n<li>Champ. Round 2 - Alec Brown (OAK FOREST WARRIORS) won by fall over Mickey Watson (BATAVIA PINNERS) Fall 2:09</li>\n<li>Champ. Round 2 - Ren Swick (SYCAMORE WC) won by decision over Johnny Moore (JOLIET JUNIOR STEELMEN) Dec 9-5</li>\n<li>Champ. Round 2 - Robert Schillinger (YORKVILLE WRESTLING CLUB) won by fall over Thomas Howell (VITTUM CATS) Fall 4:01</li>\n<li>Champ. Round 2 - Natereace Strong (JJK WRESTLING) won by decision over Tyler Godden (CUMBERLAND YOUTH WC) Dec 9-2</li>\n<li>Champ. Round 2 - Cody Snodgrass (MARTINEZ FOX VALLEY ELITE) won by fall over Josh Masters (GRANITE CITY WC) Fall 2:12</li>\n<li>Champ. Round 2 - Ben Threloff (REDHAWK WC) won by decision over John Lesiak (MARENGO YOUTH WRESTLING) Dec 8-5</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Adrian Bolognani (LITTLE CELTIC WC) won by fall over Cole Whitford (GRANITE CITY WC) Fall 2:11</li>\n<li>Champ. Round 2 - Adrien Payne (MT. ZION WC) won by fall over D`reginald Alexander (LITTLE FALCONS WC) Fall 0:35</li>\n<li>Champ. Round 2 - Josh Pruitt (OAK FOREST WARRIORS) won by fall over Zachary Hare (STILLMAN VALLEY WC) Fall 2:08</li>\n<li>Champ. Round 2 - Ben Calamari (BARRINGTON BRONCOS) won by decision over Shane Hunt (EDWARDSVILLE WC) Dec 9-8</li>\n<li>Champ. Round 2 - Dan Drew (VITTUM CATS) won by fall over Preston Miracle (LITTLE REDSKINS WC) Fall 2:00</li>\n<li>Champ. Round 2 - Antony Touchstone (MARTINEZ FOX VALLEY ELITE) won by decision over Derek Schultz (MT. ZION WC) Dec 9-8</li>\n<li>Champ. Round 2 - Nickolas Kowalczuk (LITTLE HUSKIE WC) won by major decision over Owen Abarca (CARBONDALE WC) Maj 17-3</li>\n<li>Champ. Round 2 - Sean Jones (HARLEM COUGARS) won by fall over Eric Berkovich (TEAM WEST WOLVES) Fall 2:53</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - David Denne (CALUMET MEM. P.D. WOLVERINES) won by fall over Carl Witt, Iii (TOMCAT WC) Fall 1:52</li>\n<li>Champ. Round 2 - Connor Jones (HARLEM COUGARS) won by decision over Akeel Adbelhadi (BARRINGTON BRONCOS) Dec 5-2</li>\n<li>Champ. Round 2 - Blake Angusich (ROCK ISLAND WC) won by fall over Joel Cooper (EDWARDSVILLE WC) Fall 4:00</li>\n<li>Champ. Round 2 - Angelo Cervantes (FORCE WRESTLING) won by fall over Jovanni Correa (BATAVIA PINNERS) Fall 2:33</li>\n<li>Champ. Round 2 - Edgar Ruano (ROMEOVILLE YOUTH WC) won by fall over Joshua Fikes (HARVEY PARK DIST TWISTERS) Fall 2:22</li>\n<li>Champ. Round 2 - Vaughn Monreal-berner (TEAM WEST WOLVES) won by fall over Sawyer Neal (HOOPESTON AREA WC) Fall 2:07</li>\n<li>Champ. Round 2 - Blake Blair (EDWARDSVILLE WC) won by fall over William Canales (SAUK VALLEY WC) Fall 0:55</li>\n<li>Champ. Round 2 - Deonte Eiland (GLADIATORS) won by decision over Simon Montez (BELVIDERE BANDITS) Dec 10-5</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Raymond Griggel (DUNDEE HIGHLANDERS) won by fall over Shay Hill (PEKIN BOYS &amp; GIRLS CLUB) Fall 2:59</li>\n<li>Champ. Round 2 - Michael Johnson Jr (DOWNERS GROVE COUGARS) won by fall over Matthew Villalobos (WAUKEGAN YOUTH WC) Fall 0:56</li>\n<li>Champ. Round 2 - Alec Gordon (TINLEY PARK BULLDOGS) won by fall over David Gehr (FORCE WRESTLING) Fall 2:04</li>\n<li>Champ. Round 2 - Joshua Wallick (FISHER WC) won by fall over Tazvier Sanders (WAUKEGAN YOUTH WC) Fall 0:21</li>\n<li>Champ. Round 2 - Josh Hickey (VITTUM CATS) won by fall over Mustafa Odeh (TIGER WC) Fall 1:09</li>\n<li>Champ. Round 2 - Andrew Geers (FOX VALLEY WC) won by fall over Kevin Kaufhold (TEAM WEST WOLVES) Fall 4:27</li>\n<li>Champ. Round 2 - Timothy Burch (JJK WRESTLING) won by fall over Miguel Moreno (TOMCAT WC) Fall 2:43</li>\n<li>Champ. Round 2 - Jacob Weltzin (RENEGADES (STOCKTON)) won by fall over Mikshadd Townsend (TIGER WC) Fall 0:22</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Morgan Supergan (BISMARCK HENNING WC) won by fall over Jacob Souza- (CRYSTAL LAKE WIZARDS) Fall 0:43</li>\n<li>Champ. Round 2 - Michael Sheets (PALATINE JUNIOR PIRATES) won by fall over Ryan Tetlow (LEMONT BEARS WC) Fall 1:49</li>\n<li>Champ. Round 2 - Joshua Jones (GLADIATORS) won by fall over Tony Pendleton (FORCE WRESTLING) Fall 2:15</li>\n<li>Champ. Round 2 - Alex Fritz (ACADEMY GRAPPLERS) won by fall over Jonathan Pollock (MOLINE WC) Fall 2:56</li>\n<li>Champ. Round 2 - Federico Diaz (TOMCAT WC) won by fall over Jacob Robinson (OAK LAWN SPARTAN YOUTH WC NFP) Fall 2:25</li>\n<li>Champ. Round 2 - Michael Behrends (WARRENSBURG WC) won by fall over Maximilian Sutton (ALTON LITTLE REDBIRD WC) Fall 0:59</li>\n<li>Champ. Round 2 - Ethan Linder (HOOPESTON AREA WC) won by fall over Michael Denyes (L-P CRUNCHING CAVS) Fall 2:18</li>\n<li>Champ. Round 2 - Jake Cochrane (CRYSTAL LAKE WIZARDS) won by decision over Sycory Walker (ORLAND PARK PIONEERS) Dec 3-0</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Louie Hayes (TINLEY PARK BULLDOGS) won by decision over Anthony Cheloni (SCN YOUTH WC) Dec 8-3</li>\n<li>Quarterfinal - Austin Gomez (GOMEZ WRESTLING ACADEMY) won by decision over Dack Punke (CENTRAL ELITE REBELS) Dec 10-4</li>\n<li>Quarterfinal - Dylan Duncan (SCN YOUTH WC) won by tech fall over Tyler Myers (PLAINFIELD WC) TF 16-0</li>\n<li>Quarterfinal - Pat Walker (GOMEZ WRESTLING ACADEMY) won by fall over Logan Voss (E/P JUNIOR PANTHERS) Fall 2:16</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Anthony Bosco (SCN YOUTH WC) won by decision over Rudy Yates (VITTUM CATS) Dec 5-0</li>\n<li>Quarterfinal - Francis Edelen (TINLEY PARK BULLDOGS) won by decision over Andrew Mcfall (FORCE WRESTLING) Dec 8-3</li>\n<li>Quarterfinal - Brian Rossi (FALCON WC) won by fall over Riley Beard (PEORIA RAZORBACKS YOUTH WC) Fall 4:17</li>\n<li>Quarterfinal - Austin O`connor (TINLEY PARK BULLDOGS) won by decision over Brady Powers (HONONEGAH KIDS WC) Dec 8-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Christian Robertson (VITTUM CATS) won by decision over Gunner Wenger (PANTHER CUB WC) Dec 7-2</li>\n<li>Quarterfinal - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won by decision over Jacob Silzer (TINLEY PARK BULLDOGS) Dec 6-4</li>\n<li>Quarterfinal - Aj Jaffe (SCN YOUTH WC) won by decision over Michael Cullen (WRESTLING FACTORY) Dec 4-2</li>\n<li>Quarterfinal - Elijah Oliver (HARVEY PARK DIST TWISTERS) won by decision over Garrett Dziedzic (CRYSTAL LAKE WIZARDS) Dec 4-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - James Wolfe (HARLEM COUGARS) won by decision over Zachary Akers (INDIANS ELITE) Dec 4-0</li>\n<li>Quarterfinal - Israel Santiago (GRAPPLIN` DEVILS WC) won by fall over Matt Rowland (SCN YOUTH WC) Fall 1:09</li>\n<li>Quarterfinal - Titus Taylor (BELLEVILLE LITTLE DEVILS) won by fall over Antonio Alvarez (OAKWOOD WC) Fall 2:55</li>\n<li>Quarterfinal - Vincent Turk (CRYSTAL LAKE WIZARDS) won by injury default over David Kasper (SOUTHSIDE STALLIONS) Inj. 0:00</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Josh Alber (DAKOTA WC) won by decision over Michael Hrdlicka (GOMEZ WRESTLING ACADEMY) Dec 6-0</li>\n<li>Quarterfinal - Isaih White (HARVEY PARK DIST TWISTERS) won by decision over Jake Eckenrod (MT. ZION WC) Dec 7-1</li>\n<li>Quarterfinal - Jack Diana (MUSTANG WC) won by decision over Vaughn Hobart (PONTIAC WC) Dec 3-0</li>\n<li>Quarterfinal - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by decision over Joshua Fuqua (CROSSTOWN WC) Dec 4-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Randle Taborn (SPRINGFIELD CAPITAL KIDS WC) won by decision over Fred Johnson (HARVEY PARK DIST TWISTERS) Dec 4-2</li>\n<li>Quarterfinal - Larry Early (ROMEOVILLE YOUTH WC) won by fall over Matthew Ferraro (SCN YOUTH WC) Fall 4:26</li>\n<li>Quarterfinal - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won by decision over Dillion Chase (RIVERBEND WC) Dec 5-0</li>\n<li>Quarterfinal - Nick Nasenbeny (FORCE WRESTLING) won by decision over Kyle Akins (SYCAMORE WC) Dec 4-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Carver James (DAKOTA WC) won by decision over Alante Walker (ORLAND PARK PIONEERS) Dec 8-3</li>\n<li>Quarterfinal - John Jimenez (SCN YOUTH WC) won by fall over Mario Leveille (OAK FOREST WARRIORS) Fall 4:22</li>\n<li>Quarterfinal - Juwan Edmond (BROADVIEW PARK DISTRICT) won by major decision over Cole Wysocki (TRIAD LITTLE KNIGHTS) Maj 10-2</li>\n<li>Quarterfinal - Michael Zelasco (CRYSTAL LAKE WIZARDS) won by major decision over Kamal Bey (HARVEY PARK DIST TWISTERS) Maj 13-4</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Nicholas Ferraro (SCN YOUTH WC) won by fall over Flynn Nagel (VITTUM CATS) Fall 3:59</li>\n<li>Quarterfinal - Brandon Arteaga (GOMEZ WRESTLING ACADEMY) won by decision over Andrew Collins (ROMEOVILLE YOUTH WC) Dec 6-4</li>\n<li>Quarterfinal - Matthew Rundell (ARLINGTON CARDINALS) won by decision over Nick Schultz (MARTINEZ FOX VALLEY ELITE) Dec 6-3</li>\n<li>Quarterfinal - Josh Martin (GLENBARD EAST JR RAMS) won by decision over John Blanke (BARRINGTON BRONCOS) Dec 6-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Brady Rude (SAUK VALLEY WC) won by decision over Ryan Fish (LITTLE HUSKIE WC) Dec 4-3</li>\n<li>Quarterfinal - Joseph Fulco (FORCE WRESTLING) won by fall over Tyler Demoss (HONONEGAH KIDS WC) Fall 0:51</li>\n<li>Quarterfinal - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won by decision over Harrison Williams (SPRINGFIELD CAPITAL KIDS WC) Dec 9-3</li>\n<li>Quarterfinal - Randy Meneweather (KNOX COUNTY KRUSHERS) won by decision over Brent Hakeman (BRAWLERS WC) Dec 5-4</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Michael Pixley (GRANITE CITY WC) won by fall over Jake Storck (MUSTANG WC) Fall 1:45</li>\n<li>Quarterfinal - Thomas O`brien (SCN YOUTH WC) won by major decision over Lucas Duckett (SHELBYVILLE JR RAMS WRESTLING) Maj 16-3</li>\n<li>Quarterfinal - Dru Worker (TINLEY PARK BULLDOGS) won by decision over Christopher Hiscock (INDIANS ELITE) Dec 8-6</li>\n<li>Quarterfinal - Xavier Montalvo (ANIMAL WC) won in overtime over Jeffrey Casey (WEST CARROLL WC) OT 2-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Jack Rossi (CHAMPAIGN KIDS WRESTLING) won by decision over Vincent Anderson (HONONEGAH KIDS WC) Dec 6-4</li>\n<li>Quarterfinal - Tyre Lee (RENEGADE WC (NFP)) won by fall over Jeffery Klank (INDIANS ELITE) Fall 1:30</li>\n<li>Quarterfinal - Cameron Throneberry (EDWARDSVILLE WC) won by major decision over Anthony Palacios (JOLIET JUNIOR STEELMEN) Maj 14-3</li>\n<li>Quarterfinal - Mitchel Humphrey (MENDOTA MAT MASTERS) won by decision over Charley Popp (CARY MATMEN WC) Dec 7-4</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Jim Geier (FORCE WRESTLING) won by fall over Zac Keller (LAKELAND PREDATORS) Fall 1:09</li>\n<li>Quarterfinal - Connor Doak (JUNIOR PIONEER WC) won by fall over Emery Parker (GRAPPLIN` DEVILS WC) Fall 0:34</li>\n<li>Quarterfinal - Edmond Hogan (LANCER WC) won by major decision over Michael Johnson (EDWARDSVILLE WC) Maj 12-0</li>\n<li>Quarterfinal - Ian Harwick (HARLEM RENEGADES) won by decision over Xian Jerez (VILLA PARK YOUNG WARRIORS) Dec 9-3</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Kailor Hecox (HECOX TEAM BENAIAH) won by decision over Keegan Mugerditchian (HOFFMAN ESTATES WC) Dec 9-2</li>\n<li>Quarterfinal - Bryce Gorman (LITTLE CELTIC WC) won by fall over Kenny Condon (VITTUM CATS) Fall 1:08</li>\n<li>Quarterfinal - Collin Cronberg (LITTLE CELTIC WC) won by fall over Lucas Greenberg (VILLA LOMBARD COUGARS) Fall 0:50</li>\n<li>Quarterfinal - Bradley Dunn (CRYSTAL LAKE WIZARDS) won by fall over Mark Dinardo (FORCE WRESTLING) Fall 2:07</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Sean Kelly (LITTLE CELTIC WC) won by decision over Cain Bialas (WW TIGER WC) Dec 10-7</li>\n<li>Quarterfinal - Alex Benoit (REDHAWK WC) won by fall over Mykel Gary (CARBONDALE WC) Fall 1:08</li>\n<li>Quarterfinal - Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) won by major decision over Keyshawn Bulls (GLADIATORS) Maj 10-0</li>\n<li>Quarterfinal - Tyler Johnson (LEMONT BEARS WC) won by fall over Austin Treichel (CROSSTOWN WC) Fall 0:35</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Andre Mickens (TINLEY PARK BULLDOGS) won by decision over Jimique Davis (VILLA LOMBARD COUGARS) Dec 6-3</li>\n<li>Quarterfinal - Aj Friedrich (METAMORA KIDS WC) won by fall over Sam Erickson (DOWNERS GROVE COUGARS) Fall 2:17</li>\n<li>Quarterfinal - Mason Jett (HOOPESTON AREA WC) won by fall over Stu Landin (TINLEY PARK BULLDOGS) Fall 0:46</li>\n<li>Quarterfinal - Moises Pina (MORTON LITTLE MUSTANGS) won by disqualification over Corey Harrell (CHAMPBUILDERS) DQ</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Lucas Warren (BLACKHAWK WC) won by decision over Dalton Kettering (ROCK ISLAND WC) Dec 6-1</li>\n<li>Quarterfinal - Noah Fleckenstein (LIONS WC) won by fall over Tyler Rohrer (LIL` STORM) Fall 0:28</li>\n<li>Quarterfinal - Deontae Brown (HARVEY PARK DIST TWISTERS) won by fall over D`andre Johnson (VILLA LOMBARD COUGARS) Fall 1:15</li>\n<li>Quarterfinal - Tanner Farmer (HIGHLAND BULLDOG JR WC) won by fall over Zach Reed (DAKOTA WC) Fall 0:29</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Jordan Ladd (CHILLI DAWGS WC) won by fall over Frank Pavlik (PALATINE PANTHERS WC) Fall 0:42</li>\n<li>Quarterfinal - Tyler Dicken (WESTVILLE YOUTH WC) won by decision over Nicky Allegretti (VITTUM CATS) Dec 3-1</li>\n<li>Quarterfinal - Charles Fisher (BENTON JR WC) won by fall over Jake Ford (MUSTANG WC) Fall 0:51</li>\n<li>Quarterfinal - Nicholas Wolf (FORCE WRESTLING) won by fall over Jacob Heavlin (WARRIOR MONKS) Fall 2:38</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Jabari Moody (HARVEY PARK DIST TWISTERS) won by decision over Justin Nelson (UNITED SOUTHERN ALLSTARS) Dec 6-3</li>\n<li>Quarterfinal - Tommy Pawelski (MAINE EAGLES) won by decision over Dylan Cramer (FORCE WRESTLING) Dec 6-2</li>\n<li>Quarterfinal - Aj Villarreal (DOWNERS GROVE COUGARS) won by major decision over Sean Sibley (FALCON WC) Maj 12-1</li>\n<li>Quarterfinal - Austin Ryan (CRYSTAL LAKE WIZARDS) won by tech fall over Christian Poupard (EDWARDSVILLE WC) TF 15-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Cameron Kennedy (GOMEZ WRESTLING ACADEMY) won by tech fall over Tyler Svestka (MARTINEZ FOX VALLEY ELITE) TF 18-3</li>\n<li>Quarterfinal - Haydon Grammer (EDWARDSVILLE WC) won by decision over Stephen Richardson (PONTIAC WC) Dec 5-3</li>\n<li>Quarterfinal - Dominic Naso (FORCE WRESTLING) won by decision over Jacob Field (SCN YOUTH WC) Dec 4-1</li>\n<li>Quarterfinal - Nelson Baker (XTREME WRESTLING) won by fall over Sam Martino (GOMEZ WRESTLING ACADEMY) Fall 0:51</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Briar King (UNITED SOUTHERN ALLSTARS) won by decision over Jordan Lind (PONTIAC WC) Dec 7-5</li>\n<li>Quarterfinal - Anthony Devriese (JUNIOR PIONEER WC) won by decision over Jim Pellegrino (ORLAND PARK PIONEERS) Dec 6-2</li>\n<li>Quarterfinal - Richard Browne (GOMEZ WRESTLING ACADEMY) won by decision over Joey Shump (BATAVIA PINNERS) Dec 3-1</li>\n<li>Quarterfinal - Jordan Northrup (HARLEM COUGARS) won by fall over Sean Mcmahon (TINLEY PARK BULLDOGS) Fall 0:57</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Mark Duda (CROSSTOWN WC) won by decision over Jake Snow (SAUK VALLEY WC) Dec 5-1</li>\n<li>Quarterfinal - Garrett Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Frank Yattoni (MARTINEZ FOX VALLEY ELITE) Dec 6-1</li>\n<li>Quarterfinal - Steve Turner (O`FALLON LITTLE PANTHERS) won by fall over Alex Cowan (IRON MAN) Fall 0:34</li>\n<li>Quarterfinal - Gacob Lenox (HARLEM COUGARS) won by major decision over Robert Svestka (MARTINEZ FOX VALLEY ELITE) Maj 13-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Demechico Spraggins (UNITED SOUTHERN ALLSTARS) won by decision over Michael Sepke (BRONCO WRESTLING) Dec 6-4</li>\n<li>Quarterfinal - Blake Tisza (CROSSTOWN WC) won by fall over Christian Smith (MOLINE WC) Fall 3:43</li>\n<li>Quarterfinal - Austin Graham (MARTINEZ FOX VALLEY ELITE) won by decision over Chet Mcclure (FALCON YOUTH WC) Dec 3-2</li>\n<li>Quarterfinal - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by decision over John Pellegrino (ORLAND PARK PIONEERS) Dec 8-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Joshua Boggess (ARLINGTON CARDINALS) won by decision over Corbett Oughton (INDIANS ELITE) Dec 5-1</li>\n<li>Quarterfinal - Nuntreae Jackson (HARVEY PARK DIST TWISTERS) won by decision over Nicholas Peters (CRYSTAL LAKE WIZARDS) Dec 8-5</li>\n<li>Quarterfinal - Bryce Brill (FOX VALLEY WC) won by fall over Daniel Ruettiger (INDIANS ELITE) Fall 2:57</li>\n<li>Quarterfinal - Sal Annoreno (GOMEZ WRESTLING ACADEMY) won by decision over Ryan Holzrichter (FORCE WRESTLING) Dec 6-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Cain Salas (GRANITE CITY WC) won by major decision over Barlow Mcghee (ROCK ISLAND WC) Maj 11-3</li>\n<li>Quarterfinal - Notay Jackson (HARVEY PARK DIST TWISTERS) won by decision over George Fisher (SCN YOUTH WC) Dec 10-7</li>\n<li>Quarterfinal - Kyle Langenderfer (ORLAND PARK PIONEERS) won by decision over Abel Rios (ZEE BEE STINGERS) Dec 6-0</li>\n<li>Quarterfinal - Ernest Battaglia (FOX VALLEY WC) won by decision over Nate Higgins (UNITED SOUTHERN ALLSTARS) Dec 8-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Eddie Gonzalez (FOX VALLEY WC) won by fall over Connor Bandy (TINLEY PARK BULLDOGS) Fall 0:26</li>\n<li>Quarterfinal - Colin Holler (EAGLE ONE) won by fall over Dustin Beswick (RIVERBEND WC) Fall 2:21</li>\n<li>Quarterfinal - Mitchell Cook (ORLAND PARK PIONEERS) won by fall over Alberto Herrera (ROCK ISLAND WC) Fall 4:16</li>\n<li>Quarterfinal - Jj Whaley (XTREME WRESTLING) won by tech fall over Alex Friedman (PONTIAC WC) TF 15-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Brian Murphy (VILLA LOMBARD COUGARS) won by decision over Peter Andreotti (ORLAND PARK PIONEERS) Dec 9-2</li>\n<li>Quarterfinal - Jameer Thurman (GLADIATORS) won by fall over Hadin Restivo (WEST FRANKFORT JR WRESTLING) Fall 1:46</li>\n<li>Quarterfinal - Richard Robertson (VITTUM CATS) won by decision over Fabian Lara (MARTINEZ FOX VALLEY ELITE) Dec 7-2</li>\n<li>Quarterfinal - Manny Silva (HONONEGAH KIDS WC) won by decision over Colton Gladwell (CENTRAL ELITE REBELS) Dec 4-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Jake Turk (CRYSTAL LAKE WIZARDS) won by decision over Alec Jarnagin (SHELBYVILLE JR RAMS WRESTLING) Dec 4-1</li>\n<li>Quarterfinal - Lonnie Cleveland Iii (UNITED SOUTHERN ALLSTARS) won by major decision over Mitchell Murphy (ORLAND PARK PIONEERS) Maj 12-4</li>\n<li>Quarterfinal - Dan Rowland (SCN YOUTH WC) won by fall over Brett Meyer (CENTRAL ELITE REBELS) Fall 0:59</li>\n<li>Quarterfinal - Austin Culton (SYCAMORE WC) won by decision over Hunter Rollins (ARLINGTON CARDINALS) Dec 8-1</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Kenard Washington (GLADIATORS) won by decision over Patrick O`malley (CARY MATMEN WC) Dec 7-3</li>\n<li>Quarterfinal - Mario Rodriguez (VILLA LOMBARD COUGARS) won by major decision over Mark Coleman (REDHAWK WC) Maj 15-7</li>\n<li>Quarterfinal - Jack Sears (VITTUM CATS) won by decision over Brandon Sklavanitis (SAUK VALLEY WC) Dec 3-0</li>\n<li>Quarterfinal - Logan Staver (PANTHER CUB WC) won by decision over Breon Hoosier (MARTINEZ FOX VALLEY ELITE) Dec 7-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Cameron Mammen (TIGER WC) won by fall over Connor Swier (FOX VALLEY WC) Fall 2:01</li>\n<li>Quarterfinal - Brian Bahrs (SAUK VALLEY WC) won by decision over Jamonni Anderson (VITTUM CATS) Dec 4-1</li>\n<li>Quarterfinal - Bailey Appleman (CLIPPER WC) won by fall over Brian Allen (HINSDALE WC) Fall 2:13</li>\n<li>Quarterfinal - Max Brozovich (INDIANS ELITE) won by decision over Sam Klenske (MARENGO YOUTH WRESTLING) Dec 4-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Tj Lowe (RIVERDALE JR RAMS WC) won by fall over Gavin Kitson (CLINTON WC) Fall 3:22</li>\n<li>Quarterfinal - Jordan Ellingwood (GOMEZ WRESTLING ACADEMY) won by decision over Corry Williams (GRANITE CITY WC) Dec 2-0</li>\n<li>Quarterfinal - Chris Giatras (LEMONT BEARS WC) won by decision over Dalton Major (BRAWLERS WC) Dec 7-5</li>\n<li>Quarterfinal - Mitchell Jordan (SYCAMORE WC) won by fall over Colt Brummer (CUMBERLAND YOUTH WC) Fall 0:44</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Sage Hecox (HECOX TEAM BENAIAH) won by fall over Zach Cilella (MENDOTA MAT MASTERS) Fall 2:39</li>\n<li>Quarterfinal - Alec Brown (OAK FOREST WARRIORS) won by major decision over Ren Swick (SYCAMORE WC) Maj 11-1</li>\n<li>Quarterfinal - Robert Schillinger (YORKVILLE WRESTLING CLUB) won by fall over Natereace Strong (JJK WRESTLING) Fall 3:36</li>\n<li>Quarterfinal - Cody Snodgrass (MARTINEZ FOX VALLEY ELITE) won by decision over Ben Threloff (REDHAWK WC) Dec 4-2</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Adrian Bolognani (LITTLE CELTIC WC) won by decision over Adrien Payne (MT. ZION WC) Dec 3-1</li>\n<li>Quarterfinal - Josh Pruitt (OAK FOREST WARRIORS) won by tech fall over Ben Calamari (BARRINGTON BRONCOS) TF 15-0</li>\n<li>Quarterfinal - Antony Touchstone (MARTINEZ FOX VALLEY ELITE) won by fall over Dan Drew (VITTUM CATS) Fall 0:29</li>\n<li>Quarterfinal - Nickolas Kowalczuk (LITTLE HUSKIE WC) won by decision over Sean Jones (HARLEM COUGARS) Dec 3-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - David Denne (CALUMET MEM. P.D. WOLVERINES) won by fall over Connor Jones (HARLEM COUGARS) Fall 0:20</li>\n<li>Quarterfinal - Blake Angusich (ROCK ISLAND WC) won by decision over Angelo Cervantes (FORCE WRESTLING) Dec 8-1</li>\n<li>Quarterfinal - Edgar Ruano (ROMEOVILLE YOUTH WC) won by decision over Vaughn Monreal-berner (TEAM WEST WOLVES) Dec 6-0</li>\n<li>Quarterfinal - Deonte Eiland (GLADIATORS) won by decision over Blake Blair (EDWARDSVILLE WC) Dec 2-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Michael Johnson Jr (DOWNERS GROVE COUGARS) won by fall over Raymond Griggel (DUNDEE HIGHLANDERS) Fall 0:59</li>\n<li>Quarterfinal - Joshua Wallick (FISHER WC) won by decision over Alec Gordon (TINLEY PARK BULLDOGS) Dec 9-4</li>\n<li>Quarterfinal - Josh Hickey (VITTUM CATS) won by fall over Andrew Geers (FOX VALLEY WC) Fall 2:45</li>\n<li>Quarterfinal - Timothy Burch (JJK WRESTLING) won by fall over Jacob Weltzin (RENEGADES (STOCKTON)) Fall 0:38</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Morgan Supergan (BISMARCK HENNING WC) won by fall over Michael Sheets (PALATINE JUNIOR PIRATES) Fall 0:32</li>\n<li>Quarterfinal - Alex Fritz (ACADEMY GRAPPLERS) won by fall over Joshua Jones (GLADIATORS) Fall 3:12</li>\n<li>Quarterfinal - Federico Diaz (TOMCAT WC) won by decision over Michael Behrends (WARRENSBURG WC) Dec 7-0</li>\n<li>Quarterfinal - Ethan Linder (HOOPESTON AREA WC) won by decision over Jake Cochrane (CRYSTAL LAKE WIZARDS) Dec 2-0</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Brady Wilsie (XTREME WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joe Antonelle (SCN YOUTH WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mark Ferguson (VITTUM CATS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Travis Piotrowski (WOLVES WC) won by decision over Devin Michicich (SOUTHSIDE STALLIONS) Dec 8-7</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Cameron Roat (LITTLE CELTIC WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tristan Birt (FALCON YOUTH WC) won by fall over Devin Beaston (WEST HANCOCK TITAN WC) Fall 1:23</li>\n<li>Cons. Round 1 - Raul Marrero (SPRINGFIELD CAPITAL KIDS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Peisker (GOMEZ WRESTLING ACADEMY) received a bye   () Bye</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Cameron Schwing (FISHER WC) won by decision over Vinnie Piunti (MARTINEZ FOX VALLEY ELITE) Dec 5-0</li>\n<li>Cons. Round 1 - Braxten Ary (MIDWEST CENTRAL YOUTH) won by major decision over Andrew Verr (VILLA PARK YOUNG WARRIORS) Maj 13-3</li>\n<li>Cons. Round 1 - Marquez Roberson (BELLEVILLE LITTLE DEVILS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ian Meagher (LITTLE CELTIC WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Brian Krasowski (ORLAND PARK PIONEERS) won by decision over Johnathan Turner (SPRINGFIELD CAPITAL KIDS WC) Dec 8-3</li>\n<li>Cons. Round 1 - Brandon Briggs (MARENGO YOUTH WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Callahan (SCN YOUTH WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Shaun Wasso (LITTLE CELTIC WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Brandon Ahlgrim (SAUK VALLEY WC) won by fall over Colten Ratz (FOX VALLEY WC) Fall 2:40</li>\n<li>Cons. Round 1 - Peyton Smith (BENTON JR WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gunnar Hjorth (MARTINEZ FOX VALLEY ELITE) won by decision over Pernevlon Sheppard (GOMEZ WRESTLING ACADEMY) Dec 10-6</li>\n<li>Cons. Round 1 - Jake Drew (GOMEZ WRESTLING ACADEMY) received a bye   () Bye</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - David Riojas (ROMEOVILLE YOUTH WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trace Carello (MT. VERNON LIONS) won by fall over Luke Brozovich (INDIANS ELITE) Fall 2:41</li>\n<li>Cons. Round 1 - Cole Witzig (TRIAD LITTLE KNIGHTS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Madrigal (SOUTHSIDE STALLIONS) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Samuel Lack (CHAMPAIGN KIDS WRESTLING) won by decision over Chase Vosburgh (MT. VERNON LIONS) Dec 6-4</li>\n<li>Cons. Round 1 - Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Riley Demoss (SCN YOUTH WC) won in overtime over Robert Fox (MAD DOG WRESTLING ACADEMY) OT 5-3</li>\n<li>Cons. Round 1 - Scott Oglanian (WEST CHICAGO JUNIOR WILDCATS) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Dawson Ford (SPRINGFIELD CAPITAL KIDS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cody Tournear (CHAMPAIGN KIDS WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Clayton Ledbetter (FORCE WRESTLING) won by injury default over Gage Overton (UNITED SOUTHERN ALLSTARS) Inj. 0:00</li>\n<li>Cons. Round 1 - Jacob Morgan (MT. ZION WC) won by fall over Beau Gabel (BRAWLERS WC) Fall 3:40</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Bonomo (BRONCO WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Mackessy (FORCE WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Marsden (CRYSTAL LAKE WIZARDS) won by decision over Jim Brennan (LEMONT BEARS WC) Dec 4-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Austin Armstrong (SYCAMORE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Romero (DUNDEE HIGHLANDERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bradley Herzberg (BULLS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon Klein (CHAMPAIGN KIDS WRESTLING) received a bye   () Bye</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Dustin Pindel (ORLAND PARK PIONEERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Prinz (FORCE WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Hedrick (SJO SPARTAN YOUTH WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Whitehead (ZEE BEE STINGERS) won by fall over Patrick Kristin (TINLEY PARK BULLDOGS) Fall 1:18</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Alex Dobson (SYCAMORE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Louis Giovannetti (NAPERVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matt Brozovich (INDIANS ELITE) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Spacek (LIONS WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Tad Cravens (HERRIN JUNIOR WC) won by fall over Brooke Hughes (DANVILLE BRONCOS YOUTH WC) Fall 0:33</li>\n<li>Cons. Round 1 - Brian Pence (CRYSTAL LAKE WIZARDS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyquan Jones (HARVEY PARK DIST TWISTERS) won by fall over Kaler Deakin (GENESEO SPIDER WC) Fall 0:36</li>\n<li>Cons. Round 1 - Niko Portokalis (NOTRE DAME WRESTLING) received a bye   () Bye</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Cody Barnes (CRYSTAL LAKE WIZARDS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Bouie (INDIANS ELITE) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeffrey Simmons (LIL` STORM) received a bye   () Bye</li>\n<li>Cons. Round 1 - Justin Heavilon (GRANITE CITY WC) won by fall over Tristun Reeves (EL PASO GRIDLEY YOUTH WC) Fall 0:45</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Mackenzie Noel (BISMARCK HENNING WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Marc Gomez (BELVIDERE BANDITS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mark Miller (ZEE BEE STINGERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Barton (SYCAMORE WC) won by fall over Wayne Sobotka (SHAMROCK WC) Fall 2:50</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Bryan Ditchman (TINLEY PARK BULLDOGS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Berman (LITTLE CELTIC WC) won by fall over Tristan Miller (PANTHER CUB WC) Fall 2:36</li>\n<li>Cons. Round 1 - Zachary Simpson (RICH RATTLERS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Iwinski (ROMEOVILLE YOUTH WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Christopher Bartels (DUNDEE HIGHLANDERS) received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n<li>Cons. Round 1 - Connor Willis (HOOPESTON AREA WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jordan Taylor (SPRINGFIELD CAPITAL KIDS WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Jeffery Morrow (CRYSTAL LAKE WIZARDS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Shane Mart (INDIANS ELITE) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jesus Vasquez (SOUTHSIDE STALLIONS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Johnathan Gahagan (SOUTHSIDE STALLIONS) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Devin Tortorice (WOLVES WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Collin Druck (SYCAMORE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Keith Mcdonough (BULLS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Brooks (SCN YOUTH WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Martin Martinez (WAUKEGAN YOUTH WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jordan Scalice (GOMEZ WRESTLING ACADEMY) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Wever (L-P CRUNCHING CAVS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austen Schott (CHAMPAIGN KIDS WRESTLING) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Esai Ponce (KNIGHTS WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jimmy Regan (VITTUM CATS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trayvon Zabala (FORCE WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Sears (LITTLE CELTIC WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Rob Mikenis (LINCOLN-WAY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Messink (HARLEM COUGARS) won by decision over Ben Clifford (GOMEZ WRESTLING ACADEMY) Dec 6-4</li>\n<li>Cons. Round 1 - Mitchell Dite (LITTLE REDSKINS WC) won by decision over Derrick Curry (GLADIATORS) Dec 11-10</li>\n<li>Cons. Round 1 - Trent Atkins (CARY MATMEN WC) won by decision over Brady Pierce (GRANITE CITY WC) Dec 9-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Cotey Mccallister (GMO EAGLES KIDS WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mark Henriksen (BATAVIA PINNERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Steven Galiardo (SHAMROCK WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Erik Nord (BELVIDERE BANDITS) won by decision over Mark Breedlove (GENESEO SPIDER WC) Dec 3-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Dan Goress (KNIGHTS WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Denny (HARLEM COUGARS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Xavier Sneed (PEORIA HEIGHTS MINUTEMEN JR WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon Lizer (DAKOTA WC) won by decision over Chase Wiggins (ROCK ISLAND WC) Dec 5-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Mitchel Kennington (HARLEM RENEGADES) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Mcpeek (RENEGADES (STOCKTON)) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ethan Pullum (HERRIN JUNIOR WC) won by major decision over Jack Norwood (MAINE EAGLES) Maj 13-1</li>\n<li>Cons. Round 1 - Joshua Foster (HARVEY PARK DIST TWISTERS) received a bye   () Bye</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Damon Cloe (MARENGO YOUTH WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Darren Wynn (CHAMPAIGN KIDS WRESTLING) won by fall over Kolbie Schilson (WEST HANCOCK TITAN WC) Fall 1:14</li>\n<li>Cons. Round 1 - Nick Fanella (LAKELAND PREDATORS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Eric Lovill (GOMEZ WRESTLING ACADEMY) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Patrick Vitek (VITTUM CATS) won by fall over Miguel Flores (WEST CHICAGO JUNIOR WILDCATS) Fall 2:58</li>\n<li>Cons. Round 1 - Quincy Kalkbrenner (PANTHER CUB WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tim Gillooley (LINCOLN-WAY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mitch Miller (GENESEO SPIDER WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Michael Stepuszek (LITTLE CELTIC WC) won by decision over Mark Shealy (BARRINGTON BRONCOS) Dec 6-4</li>\n<li>Cons. Round 1 - Alex Anaya (DOWNERS GROVE COUGARS) won by fall over Corben Campuzano (SYCAMORE WC) Fall 2:54</li>\n<li>Cons. Round 1 - James Baggett (HIGHLAND BULLDOG JR WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zach Abney (SAUKEE YOUTH WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Brad Evangelista (PALATINE PANTHERS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tony Cashmore (LAKELAND PREDATORS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Toby Rivera (CHAMPAIGN KIDS WRESTLING) won by decision over Nathan Vaughn (HERRIN JUNIOR WC) Dec 8-6</li>\n<li>Cons. Round 1 - Joseph Dedick (GOMEZ WRESTLING ACADEMY) won by decision over Joe Urso (LITTLE HUSKIE WC) Dec 8-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Joey Welsh (HONONEGAH KIDS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Favale (LITTLE FALCONS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon Cooper (ACES WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ben West (JUNIOR PIONEER WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Luke Roth (NAPERVILLE WC) won by decision over Samuel Wampler (ACES WC) Dec 9-4</li>\n<li>Cons. Round 1 - Mickey Watson (BATAVIA PINNERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Howell (VITTUM CATS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Josh Masters (GRANITE CITY WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Cole Whitford (GRANITE CITY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Hare (STILLMAN VALLEY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Derek Schultz (MT. ZION WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Owen Abarca (CARBONDALE WC) won by fall over Kevin Allen (BISMARCK HENNING WC) Fall 3:10</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Carl Witt, Iii (TOMCAT WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joel Cooper (EDWARDSVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Fikes (HARVEY PARK DIST TWISTERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - David Sarkan (LANCER WC) won by decision over Simon Montez (BELVIDERE BANDITS) Dec 6-4</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Matthew Villalobos (WAUKEGAN YOUTH WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tazvier Sanders (WAUKEGAN YOUTH WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mustafa Odeh (TIGER WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Miguel Moreno (TOMCAT WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Souza- (CRYSTAL LAKE WIZARDS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jonathan Pollock (MOLINE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Robinson (OAK LAWN SPARTAN YOUTH WC NFP) won by fall over Joshua Pratt (TIGER WC) Fall 0:31</li>\n<li>Cons. Round 1 - Michael Denyes (L-P CRUNCHING CAVS) won by decision over Zach Burdick (DURAND WC) Dec 6-0</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Anthony Cheloni (SCN YOUTH WC) won by major decision over Brady Wilsie (XTREME WRESTLING) Maj 11-0</li>\n<li>Cons. Round 2 - Joe Antonelle (SCN YOUTH WC) won by decision over Dack Punke (CENTRAL ELITE REBELS) Dec 2-1</li>\n<li>Cons. Round 2 - Mark Ferguson (VITTUM CATS) won by major decision over Tyler Myers (PLAINFIELD WC) Maj 9-0</li>\n<li>Cons. Round 2 - Logan Voss (E/P JUNIOR PANTHERS) won by decision over Travis Piotrowski (WOLVES WC) Dec 3-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Rudy Yates (VITTUM CATS) won by decision over Cameron Roat (LITTLE CELTIC WC) Dec 7-1</li>\n<li>Cons. Round 2 - Andrew Mcfall (FORCE WRESTLING) won by tech fall over Tristan Birt (FALCON YOUTH WC) TF 17-2</li>\n<li>Cons. Round 2 - Riley Beard (PEORIA RAZORBACKS YOUTH WC) won by decision over Raul Marrero (SPRINGFIELD CAPITAL KIDS WC) Dec 8-3</li>\n<li>Cons. Round 2 - Brady Powers (HONONEGAH KIDS WC) won by decision over Kyle Peisker (GOMEZ WRESTLING ACADEMY) Dec 6-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Gunner Wenger (PANTHER CUB WC) won by decision over Cameron Schwing (FISHER WC) Dec 8-6</li>\n<li>Cons. Round 2 - Jacob Silzer (TINLEY PARK BULLDOGS) won by decision over Braxten Ary (MIDWEST CENTRAL YOUTH) Dec 10-3</li>\n<li>Cons. Round 2 - Michael Cullen (WRESTLING FACTORY) won by major decision over Marquez Roberson (BELLEVILLE LITTLE DEVILS) Maj 11-2</li>\n<li>Cons. Round 2 - Garrett Dziedzic (CRYSTAL LAKE WIZARDS) won by decision over Ian Meagher (LITTLE CELTIC WC) Dec 1-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Brian Krasowski (ORLAND PARK PIONEERS) won by decision over Zachary Akers (INDIANS ELITE) Dec 3-0</li>\n<li>Cons. Round 2 - Brandon Briggs (MARENGO YOUTH WRESTLING) won by decision over Matt Rowland (SCN YOUTH WC) Dec 6-0</li>\n<li>Cons. Round 2 - Michael Callahan (SCN YOUTH WC) won by forfeit over Antonio Alvarez (OAKWOOD WC) FF</li>\n<li>Cons. Round 2 - Shaun Wasso (LITTLE CELTIC WC) won by forfeit over David Kasper (SOUTHSIDE STALLIONS) FF</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Michael Hrdlicka (GOMEZ WRESTLING ACADEMY) won by decision over Brandon Ahlgrim (SAUK VALLEY WC) Dec 4-0</li>\n<li>Cons. Round 2 - Jake Eckenrod (MT. ZION WC) won by decision over Peyton Smith (BENTON JR WC) Dec 6-0</li>\n<li>Cons. Round 2 - Vaughn Hobart (PONTIAC WC) won by decision over Gunnar Hjorth (MARTINEZ FOX VALLEY ELITE) Dec 5-4</li>\n<li>Cons. Round 2 - Joshua Fuqua (CROSSTOWN WC) won by decision over Jake Drew (GOMEZ WRESTLING ACADEMY) Dec 6-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Fred Johnson (HARVEY PARK DIST TWISTERS) won by decision over David Riojas (ROMEOVILLE YOUTH WC) Dec 5-2</li>\n<li>Cons. Round 2 - Trace Carello (MT. VERNON LIONS) won by decision over Matthew Ferraro (SCN YOUTH WC) Dec 7-3</li>\n<li>Cons. Round 2 - Dillion Chase (RIVERBEND WC) won by major decision over Cole Witzig (TRIAD LITTLE KNIGHTS) Maj 9-0</li>\n<li>Cons. Round 2 - Kyle Akins (SYCAMORE WC) won by tech fall over Alex Madrigal (SOUTHSIDE STALLIONS) TF 17-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Alante Walker (ORLAND PARK PIONEERS) won by decision over Samuel Lack (CHAMPAIGN KIDS WRESTLING) Dec 10-4</li>\n<li>Cons. Round 2 - Mario Leveille (OAK FOREST WARRIORS) won by tech fall over Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) TF 19-3</li>\n<li>Cons. Round 2 - Cole Wysocki (TRIAD LITTLE KNIGHTS) won by decision over Riley Demoss (SCN YOUTH WC) Dec 6-1</li>\n<li>Cons. Round 2 - Scott Oglanian (WEST CHICAGO JUNIOR WILDCATS) won by fall over Kamal Bey (HARVEY PARK DIST TWISTERS) Fall 1:04</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Flynn Nagel (VITTUM CATS) won by decision over Dawson Ford (SPRINGFIELD CAPITAL KIDS WC) Dec 6-1</li>\n<li>Cons. Round 2 - Andrew Collins (ROMEOVILLE YOUTH WC) won by decision over Cody Tournear (CHAMPAIGN KIDS WRESTLING) Dec 10-4</li>\n<li>Cons. Round 2 - Nick Schultz (MARTINEZ FOX VALLEY ELITE) won by fall over Clayton Ledbetter (FORCE WRESTLING) Fall 2:09</li>\n<li>Cons. Round 2 - John Blanke (BARRINGTON BRONCOS) won by fall over Jacob Morgan (MT. ZION WC) Fall 4:57</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Ryan Fish (LITTLE HUSKIE WC) won by decision over Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) Dec 6-4</li>\n<li>Cons. Round 2 - Tyler Demoss (HONONEGAH KIDS WC) won by decision over Nicholas Bonomo (BRONCO WRESTLING) Dec 3-0</li>\n<li>Cons. Round 2 - Harrison Williams (SPRINGFIELD CAPITAL KIDS WC) won by decision over Tyler Mackessy (FORCE WRESTLING) Dec 13-12</li>\n<li>Cons. Round 2 - Andrew Marsden (CRYSTAL LAKE WIZARDS) won by decision over Brent Hakeman (BRAWLERS WC) Dec 5-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Austin Armstrong (SYCAMORE WC) won by fall over Jake Storck (MUSTANG WC) Fall 3:40</li>\n<li>Cons. Round 2 - Nathan Romero (DUNDEE HIGHLANDERS) won by decision over Lucas Duckett (SHELBYVILLE JR RAMS WRESTLING) Dec 7-0</li>\n<li>Cons. Round 2 - Bradley Herzberg (BULLS WC) won by decision over Christopher Hiscock (INDIANS ELITE) Dec 7-5</li>\n<li>Cons. Round 2 - Jeffrey Casey (WEST CARROLL WC) won by fall over Brandon Klein (CHAMPAIGN KIDS WRESTLING) Fall 2:54</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Dustin Pindel (ORLAND PARK PIONEERS) won by decision over Vincent Anderson (HONONEGAH KIDS WC) Dec 8-6</li>\n<li>Cons. Round 2 - Jeffery Klank (INDIANS ELITE) won by decision over Zachary Prinz (FORCE WRESTLING) Dec 2-1</li>\n<li>Cons. Round 2 - Anthony Palacios (JOLIET JUNIOR STEELMEN) won by major decision over Austin Hedrick (SJO SPARTAN YOUTH WC) Maj 21-8</li>\n<li>Cons. Round 2 - Nicholas Whitehead (ZEE BEE STINGERS) won by decision over Charley Popp (CARY MATMEN WC) Dec 7-6</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Zac Keller (LAKELAND PREDATORS) won by decision over Alex Dobson (SYCAMORE WC) Dec 7-2</li>\n<li>Cons. Round 2 - Emery Parker (GRAPPLIN` DEVILS WC) won by fall over Louis Giovannetti (NAPERVILLE WC) Fall 0:23</li>\n<li>Cons. Round 2 - Michael Johnson (EDWARDSVILLE WC) won by fall over Matt Brozovich (INDIANS ELITE) Fall 0:52</li>\n<li>Cons. Round 2 - Xian Jerez (VILLA PARK YOUNG WARRIORS) won by fall over Nicholas Spacek (LIONS WC) Fall 2:31</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Keegan Mugerditchian (HOFFMAN ESTATES WC) won by decision over Tad Cravens (HERRIN JUNIOR WC) Dec 4-2</li>\n<li>Cons. Round 2 - Brian Pence (CRYSTAL LAKE WIZARDS) won by decision over Kenny Condon (VITTUM CATS) Dec 5-1</li>\n<li>Cons. Round 2 - Tyquan Jones (HARVEY PARK DIST TWISTERS) won by decision over Lucas Greenberg (VILLA LOMBARD COUGARS) Dec 6-3</li>\n<li>Cons. Round 2 - Mark Dinardo (FORCE WRESTLING) won by major decision over Niko Portokalis (NOTRE DAME WRESTLING) Maj 14-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Cain Bialas (WW TIGER WC) won by decision over Cody Barnes (CRYSTAL LAKE WIZARDS) Dec 6-0</li>\n<li>Cons. Round 2 - Mykel Gary (CARBONDALE WC) won by decision over Joshua Bouie (INDIANS ELITE) Dec 9-3</li>\n<li>Cons. Round 2 - Keyshawn Bulls (GLADIATORS) won by fall over Jeffrey Simmons (LIL` STORM) Fall 4:00</li>\n<li>Cons. Round 2 - Justin Heavilon (GRANITE CITY WC) won by fall over Austin Treichel (CROSSTOWN WC) Fall 1:28</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Jimique Davis (VILLA LOMBARD COUGARS) won by fall over Mackenzie Noel (BISMARCK HENNING WC) Fall 2:21</li>\n<li>Cons. Round 2 - Sam Erickson (DOWNERS GROVE COUGARS) won by fall over Marc Gomez (BELVIDERE BANDITS) Fall 2:41</li>\n<li>Cons. Round 2 - Mark Miller (ZEE BEE STINGERS) won by fall over Stu Landin (TINLEY PARK BULLDOGS) Fall 3:30</li>\n<li>Cons. Round 2 - Tyler Barton (SYCAMORE WC) won by fall over Corey Harrell (CHAMPBUILDERS) Fall 2:46</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Dalton Kettering (ROCK ISLAND WC) won by decision over Bryan Ditchman (TINLEY PARK BULLDOGS) Dec 7-0</li>\n<li>Cons. Round 2 - Ryan Berman (LITTLE CELTIC WC) won by fall over Tyler Rohrer (LIL` STORM) Fall 1:15</li>\n<li>Cons. Round 2 - D`andre Johnson (VILLA LOMBARD COUGARS) won by fall over Zachary Simpson (RICH RATTLERS WC) Fall 0:54</li>\n<li>Cons. Round 2 - Matthew Iwinski (ROMEOVILLE YOUTH WC) won by fall over Zach Reed (DAKOTA WC) Fall 1:01</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Christopher Bartels (DUNDEE HIGHLANDERS) won by fall over Frank Pavlik (PALATINE PANTHERS WC) Fall 4:29</li>\n<li>Cons. Round 2 - Nicky Allegretti (VITTUM CATS) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jake Ford (MUSTANG WC) won by fall over Connor Willis (HOOPESTON AREA WC) Fall 0:14</li>\n<li>Cons. Round 2 - Jacob Heavlin (WARRIOR MONKS) won by fall over Jordan Taylor (SPRINGFIELD CAPITAL KIDS WC) Fall 1:23</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Jeffery Morrow (CRYSTAL LAKE WIZARDS) won by major decision over Justin Nelson (UNITED SOUTHERN ALLSTARS) Maj 10-2</li>\n<li>Cons. Round 2 - Dylan Cramer (FORCE WRESTLING) won by major decision over Shane Mart (INDIANS ELITE) Maj 10-2</li>\n<li>Cons. Round 2 - Sean Sibley (FALCON WC) won by decision over Jesus Vasquez (SOUTHSIDE STALLIONS) Dec 11-5</li>\n<li>Cons. Round 2 - Johnathan Gahagan (SOUTHSIDE STALLIONS) won by major decision over Christian Poupard (EDWARDSVILLE WC) Maj 13-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Devin Tortorice (WOLVES WC) Dec 9-2</li>\n<li>Cons. Round 2 - Stephen Richardson (PONTIAC WC) won by fall over Collin Druck (SYCAMORE WC) Fall 4:00</li>\n<li>Cons. Round 2 - Jacob Field (SCN YOUTH WC) won by decision over Keith Mcdonough (BULLS WC) Dec 4-1</li>\n<li>Cons. Round 2 - Sam Martino (GOMEZ WRESTLING ACADEMY) won by decision over Andrew Brooks (SCN YOUTH WC) Dec 8-6</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Martin Martinez (WAUKEGAN YOUTH WC) won by decision over Jordan Lind (PONTIAC WC) Dec 2-1</li>\n<li>Cons. Round 2 - Jordan Scalice (GOMEZ WRESTLING ACADEMY) won by decision over Jim Pellegrino (ORLAND PARK PIONEERS) Dec 2-1</li>\n<li>Cons. Round 2 - Joey Shump (BATAVIA PINNERS) won by fall over Jacob Wever (L-P CRUNCHING CAVS) Fall 3:59</li>\n<li>Cons. Round 2 - Austen Schott (CHAMPAIGN KIDS WRESTLING) won by decision over Sean Mcmahon (TINLEY PARK BULLDOGS) Dec 6-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Esai Ponce (KNIGHTS WRESTLING) won by decision over Jake Snow (SAUK VALLEY WC) Dec 3-1</li>\n<li>Cons. Round 2 - Jimmy Regan (VITTUM CATS) won by decision over Frank Yattoni (MARTINEZ FOX VALLEY ELITE) Dec 8-6</li>\n<li>Cons. Round 2 - Trayvon Zabala (FORCE WRESTLING) won by fall over Alex Cowan (IRON MAN) Fall 4:39</li>\n<li>Cons. Round 2 - Robert Svestka (MARTINEZ FOX VALLEY ELITE) won by major decision over Matthew Sears (LITTLE CELTIC WC) Maj 10-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Michael Sepke (BRONCO WRESTLING) won by major decision over Rob Mikenis (LINCOLN-WAY WC) Maj 12-2</li>\n<li>Cons. Round 2 - Jake Messink (HARLEM COUGARS) won by fall over Christian Smith (MOLINE WC) Fall 4:20</li>\n<li>Cons. Round 2 - Chet Mcclure (FALCON YOUTH WC) won by decision over Mitchell Dite (LITTLE REDSKINS WC) Dec 4-2</li>\n<li>Cons. Round 2 - Trent Atkins (CARY MATMEN WC) won by decision over John Pellegrino (ORLAND PARK PIONEERS) Dec 4-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Corbett Oughton (INDIANS ELITE) won by major decision over Cotey Mccallister (GMO EAGLES KIDS WRESTLING) Maj 13-1</li>\n<li>Cons. Round 2 - Nicholas Peters (CRYSTAL LAKE WIZARDS) won by decision over Mark Henriksen (BATAVIA PINNERS) Dec 4-2</li>\n<li>Cons. Round 2 - Steven Galiardo (SHAMROCK WC) won by fall over Daniel Ruettiger (INDIANS ELITE) Fall 1:17</li>\n<li>Cons. Round 2 - Ryan Holzrichter (FORCE WRESTLING) won by decision over Erik Nord (BELVIDERE BANDITS) Dec 3-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Dan Goress (KNIGHTS WRESTLING) won by major decision over Barlow Mcghee (ROCK ISLAND WC) Maj 13-0</li>\n<li>Cons. Round 2 - George Fisher (SCN YOUTH WC) won by decision over Zachary Denny (HARLEM COUGARS) Dec 9-8</li>\n<li>Cons. Round 2 - Abel Rios (ZEE BEE STINGERS) won by decision over Xavier Sneed (PEORIA HEIGHTS MINUTEMEN JR WRESTLING) Dec 7-2</li>\n<li>Cons. Round 2 - Brandon Lizer (DAKOTA WC) won by major decision over Nate Higgins (UNITED SOUTHERN ALLSTARS) Maj 8-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Connor Bandy (TINLEY PARK BULLDOGS) won by decision over Mitchel Kennington (HARLEM RENEGADES) Dec 2-0</li>\n<li>Cons. Round 2 - Austin Mcpeek (RENEGADES (STOCKTON)) won by major decision over Dustin Beswick (RIVERBEND WC) Maj 9-1</li>\n<li>Cons. Round 2 - Ethan Pullum (HERRIN JUNIOR WC) won by fall over Alberto Herrera (ROCK ISLAND WC) Fall 3:46</li>\n<li>Cons. Round 2 - Alex Friedman (PONTIAC WC) won by major decision over Joshua Foster (HARVEY PARK DIST TWISTERS) Maj 11-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Damon Cloe (MARENGO YOUTH WRESTLING) won by decision over Peter Andreotti (ORLAND PARK PIONEERS) Dec 4-2</li>\n<li>Cons. Round 2 - Hadin Restivo (WEST FRANKFORT JR WRESTLING) won by decision over Darren Wynn (CHAMPAIGN KIDS WRESTLING) Dec 5-3</li>\n<li>Cons. Round 2 - Fabian Lara (MARTINEZ FOX VALLEY ELITE) won by decision over Nick Fanella (LAKELAND PREDATORS) Dec 5-2</li>\n<li>Cons. Round 2 - Colton Gladwell (CENTRAL ELITE REBELS) won by major decision over Eric Lovill (GOMEZ WRESTLING ACADEMY) Maj 8-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Patrick Vitek (VITTUM CATS) won by decision over Alec Jarnagin (SHELBYVILLE JR RAMS WRESTLING) Dec 14-12</li>\n<li>Cons. Round 2 - Mitchell Murphy (ORLAND PARK PIONEERS) won by decision over Quincy Kalkbrenner (PANTHER CUB WC) Dec 8-4</li>\n<li>Cons. Round 2 - Brett Meyer (CENTRAL ELITE REBELS) won by major decision over Tim Gillooley (LINCOLN-WAY WC) Maj 12-4</li>\n<li>Cons. Round 2 - Hunter Rollins (ARLINGTON CARDINALS) won by major decision over Mitch Miller (GENESEO SPIDER WC) Maj 8-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Patrick O`malley (CARY MATMEN WC) won by decision over Michael Stepuszek (LITTLE CELTIC WC) Dec 7-6</li>\n<li>Cons. Round 2 - Alex Anaya (DOWNERS GROVE COUGARS) won by fall over Mark Coleman (REDHAWK WC) Fall 1:01</li>\n<li>Cons. Round 2 - Brandon Sklavanitis (SAUK VALLEY WC) won by major decision over James Baggett (HIGHLAND BULLDOG JR WC) Maj 10-1</li>\n<li>Cons. Round 2 - Breon Hoosier (MARTINEZ FOX VALLEY ELITE) won by fall over Zach Abney (SAUKEE YOUTH WC) Fall 2:11</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Connor Swier (FOX VALLEY WC) won by major decision over Brad Evangelista (PALATINE PANTHERS WC) Maj 16-2</li>\n<li>Cons. Round 2 - Tony Cashmore (LAKELAND PREDATORS) won by decision over Jamonni Anderson (VITTUM CATS) Dec 3-2</li>\n<li>Cons. Round 2 - Toby Rivera (CHAMPAIGN KIDS WRESTLING) won by fall over Brian Allen (HINSDALE WC) Fall 0:20</li>\n<li>Cons. Round 2 - Sam Klenske (MARENGO YOUTH WRESTLING) won by decision over Joseph Dedick (GOMEZ WRESTLING ACADEMY) Dec 8-4</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Joey Welsh (HONONEGAH KIDS WC) won by fall over Gavin Kitson (CLINTON WC) Fall 0:57</li>\n<li>Cons. Round 2 - Corry Williams (GRANITE CITY WC) won by decision over Nicholas Favale (LITTLE FALCONS WC) Dec 5-1</li>\n<li>Cons. Round 2 - Dalton Major (BRAWLERS WC) won by fall over Brandon Cooper (ACES WC) Fall 2:00</li>\n<li>Cons. Round 2 - Ben West (JUNIOR PIONEER WC) won by fall over Colt Brummer (CUMBERLAND YOUTH WC) Fall 2:04</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Luke Roth (NAPERVILLE WC) won by decision over Zach Cilella (MENDOTA MAT MASTERS) Dec 7-2</li>\n<li>Cons. Round 2 - Mickey Watson (BATAVIA PINNERS) won by decision over Ren Swick (SYCAMORE WC) Dec 1-0</li>\n<li>Cons. Round 2 - Thomas Howell (VITTUM CATS) won by fall over Natereace Strong (JJK WRESTLING) Fall 2:41</li>\n<li>Cons. Round 2 - Ben Threloff (REDHAWK WC) won by major decision over Josh Masters (GRANITE CITY WC) Maj 12-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Cole Whitford (GRANITE CITY WC) won by fall over Adrien Payne (MT. ZION WC) Fall 3:36</li>\n<li>Cons. Round 2 - Ben Calamari (BARRINGTON BRONCOS) won by fall over Zachary Hare (STILLMAN VALLEY WC) Fall 1:02</li>\n<li>Cons. Round 2 - Derek Schultz (MT. ZION WC) won by fall over Dan Drew (VITTUM CATS) Fall 2:53</li>\n<li>Cons. Round 2 - Sean Jones (HARLEM COUGARS) won by major decision over Owen Abarca (CARBONDALE WC) Maj 15-6</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Connor Jones (HARLEM COUGARS) won by fall over Carl Witt, Iii (TOMCAT WC) Fall 1:58</li>\n<li>Cons. Round 2 - Angelo Cervantes (FORCE WRESTLING) won by major decision over Joel Cooper (EDWARDSVILLE WC) Maj 13-1</li>\n<li>Cons. Round 2 - Vaughn Monreal-berner (TEAM WEST WOLVES) won by fall over Joshua Fikes (HARVEY PARK DIST TWISTERS) Fall 2:26</li>\n<li>Cons. Round 2 - Blake Blair (EDWARDSVILLE WC) won by fall over David Sarkan (LANCER WC) Fall 1:47</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Raymond Griggel (DUNDEE HIGHLANDERS) won by fall over Matthew Villalobos (WAUKEGAN YOUTH WC) Fall 2:15</li>\n<li>Cons. Round 2 - Alec Gordon (TINLEY PARK BULLDOGS) won by fall over Tazvier Sanders (WAUKEGAN YOUTH WC) Fall 1:52</li>\n<li>Cons. Round 2 - Andrew Geers (FOX VALLEY WC) won by fall over Mustafa Odeh (TIGER WC) Fall 30:00</li>\n<li>Cons. Round 2 - Miguel Moreno (TOMCAT WC) won by fall over Jacob Weltzin (RENEGADES (STOCKTON)) Fall 0:31</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Souza- (CRYSTAL LAKE WIZARDS) won by decision over Michael Sheets (PALATINE JUNIOR PIRATES) Dec 4-2</li>\n<li>Cons. Round 2 - Jonathan Pollock (MOLINE WC) won by fall over Joshua Jones (GLADIATORS) Fall 4:01</li>\n<li>Cons. Round 2 - Jacob Robinson (OAK LAWN SPARTAN YOUTH WC NFP) won by fall over Michael Behrends (WARRENSBURG WC) Fall 2:30</li>\n<li>Cons. Round 2 - Michael Denyes (L-P CRUNCHING CAVS) won by fall over Jake Cochrane (CRYSTAL LAKE WIZARDS) Fall 3:40</li>\n</ul>\n</section>",
  "Champ Semis & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semis &amp; Con Quarterfinal</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Austin Gomez (GOMEZ WRESTLING ACADEMY) won by decision over Louie Hayes (TINLEY PARK BULLDOGS) Dec 8-4</li>\n<li>Semifinal - Dylan Duncan (SCN YOUTH WC) won by major decision over Pat Walker (GOMEZ WRESTLING ACADEMY) Maj 9-0</li>\n<li>Cons. Round 3 - Anthony Cheloni (SCN YOUTH WC) won by decision over Joe Antonelle (SCN YOUTH WC) Dec 6-2</li>\n<li>Cons. Round 3 - Mark Ferguson (VITTUM CATS) won by decision over Logan Voss (E/P JUNIOR PANTHERS) Dec 3-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Anthony Bosco (SCN YOUTH WC) won by decision over Francis Edelen (TINLEY PARK BULLDOGS) Dec 4-2</li>\n<li>Semifinal - Austin O`connor (TINLEY PARK BULLDOGS) won by decision over Brian Rossi (FALCON WC) Dec 7-5</li>\n<li>Cons. Round 3 - Rudy Yates (VITTUM CATS) won by decision over Andrew Mcfall (FORCE WRESTLING) Dec 4-1</li>\n<li>Cons. Round 3 - Brady Powers (HONONEGAH KIDS WC) won by major decision over Riley Beard (PEORIA RAZORBACKS YOUTH WC) Maj 8-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won by decision over Christian Robertson (VITTUM CATS) Dec 6-3</li>\n<li>Semifinal - Elijah Oliver (HARVEY PARK DIST TWISTERS) won by decision over Aj Jaffe (SCN YOUTH WC) Dec 1-0</li>\n<li>Cons. Round 3 - Jacob Silzer (TINLEY PARK BULLDOGS) won by decision over Gunner Wenger (PANTHER CUB WC) Dec 2-0</li>\n<li>Cons. Round 3 - Michael Cullen (WRESTLING FACTORY) won by decision over Garrett Dziedzic (CRYSTAL LAKE WIZARDS) Dec 9-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - James Wolfe (HARLEM COUGARS) won in double overtime over Israel Santiago (GRAPPLIN` DEVILS WC) 2-OT 2-1</li>\n<li>Semifinal - Vincent Turk (CRYSTAL LAKE WIZARDS) won by decision over Titus Taylor (BELLEVILLE LITTLE DEVILS) Dec 4-0</li>\n<li>Cons. Round 3 - Brandon Briggs (MARENGO YOUTH WRESTLING) won by fall over Brian Krasowski (ORLAND PARK PIONEERS) Fall 5:02</li>\n<li>Cons. Round 3 - Michael Callahan (SCN YOUTH WC) won by decision over Shaun Wasso (LITTLE CELTIC WC) Dec 4-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Isaih White (HARVEY PARK DIST TWISTERS) won by decision over Josh Alber (DAKOTA WC) Dec 4-2</li>\n<li>Semifinal - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by major decision over Jack Diana (MUSTANG WC) Maj 10-0</li>\n<li>Cons. Round 3 - Michael Hrdlicka (GOMEZ WRESTLING ACADEMY) won by decision over Jake Eckenrod (MT. ZION WC) Dec 4-3</li>\n<li>Cons. Round 3 - Joshua Fuqua (CROSSTOWN WC) won by major decision over Vaughn Hobart (PONTIAC WC) Maj 9-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Larry Early (ROMEOVILLE YOUTH WC) won by decision over Randle Taborn (SPRINGFIELD CAPITAL KIDS WC) Dec 6-3</li>\n<li>Semifinal - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won by decision over Nick Nasenbeny (FORCE WRESTLING) Dec 3-0</li>\n<li>Cons. Round 3 - Fred Johnson (HARVEY PARK DIST TWISTERS) won by decision over Trace Carello (MT. VERNON LIONS) Dec 5-3</li>\n<li>Cons. Round 3 - Dillion Chase (RIVERBEND WC) won by decision over Kyle Akins (SYCAMORE WC) Dec 3-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - John Jimenez (SCN YOUTH WC) won by decision over Carver James (DAKOTA WC) Dec 7-2</li>\n<li>Semifinal - Juwan Edmond (BROADVIEW PARK DISTRICT) won by major decision over Michael Zelasco (CRYSTAL LAKE WIZARDS) Maj 8-0</li>\n<li>Cons. Round 3 - Alante Walker (ORLAND PARK PIONEERS) won by decision over Mario Leveille (OAK FOREST WARRIORS) Dec 9-7</li>\n<li>Cons. Round 3 - Cole Wysocki (TRIAD LITTLE KNIGHTS) won by decision over Scott Oglanian (WEST CHICAGO JUNIOR WILDCATS) Dec 7-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Brandon Arteaga (GOMEZ WRESTLING ACADEMY) won by decision over Nicholas Ferraro (SCN YOUTH WC) Dec 2-1</li>\n<li>Semifinal - Matthew Rundell (ARLINGTON CARDINALS) won by decision over Josh Martin (GLENBARD EAST JR RAMS) Dec 8-5</li>\n<li>Cons. Round 3 - Flynn Nagel (VITTUM CATS) won by decision over Andrew Collins (ROMEOVILLE YOUTH WC) Dec 3-1</li>\n<li>Cons. Round 3 - Nick Schultz (MARTINEZ FOX VALLEY ELITE) won by fall over John Blanke (BARRINGTON BRONCOS) Fall 2:20</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Joseph Fulco (FORCE WRESTLING) won by major decision over Brady Rude (SAUK VALLEY WC) Maj 10-1</li>\n<li>Semifinal - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won by major decision over Randy Meneweather (KNOX COUNTY KRUSHERS) Maj 12-0</li>\n<li>Cons. Round 3 - Ryan Fish (LITTLE HUSKIE WC) won by decision over Tyler Demoss (HONONEGAH KIDS WC) Dec 2-1</li>\n<li>Cons. Round 3 - Harrison Williams (SPRINGFIELD CAPITAL KIDS WC) won by decision over Andrew Marsden (CRYSTAL LAKE WIZARDS) Dec 7-6</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Michael Pixley (GRANITE CITY WC) won by fall over Thomas O`brien (SCN YOUTH WC) Fall 2:30</li>\n<li>Semifinal - Dru Worker (TINLEY PARK BULLDOGS) won by decision over Xavier Montalvo (ANIMAL WC) Dec 10-5</li>\n<li>Cons. Round 3 - Austin Armstrong (SYCAMORE WC) won by fall over Nathan Romero (DUNDEE HIGHLANDERS) Fall 2:26</li>\n<li>Cons. Round 3 - Jeffrey Casey (WEST CARROLL WC) won by fall over Bradley Herzberg (BULLS WC) Fall 1:05</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Tyre Lee (RENEGADE WC (NFP)) won by major decision over Jack Rossi (CHAMPAIGN KIDS WRESTLING) Maj 10-0</li>\n<li>Semifinal - Cameron Throneberry (EDWARDSVILLE WC) won by fall over Mitchel Humphrey (MENDOTA MAT MASTERS) Fall 4:06</li>\n<li>Cons. Round 3 - Jeffery Klank (INDIANS ELITE) won by decision over Dustin Pindel (ORLAND PARK PIONEERS) Dec 5-1</li>\n<li>Cons. Round 3 - Anthony Palacios (JOLIET JUNIOR STEELMEN) won by major decision over Nicholas Whitehead (ZEE BEE STINGERS) Maj 12-2</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Connor Doak (JUNIOR PIONEER WC) won by fall over Jim Geier (FORCE WRESTLING) Fall 0:50</li>\n<li>Semifinal - Ian Harwick (HARLEM RENEGADES) won in overtime over Edmond Hogan (LANCER WC) OT 4-3</li>\n<li>Cons. Round 3 - Emery Parker (GRAPPLIN` DEVILS WC) won by decision over Zac Keller (LAKELAND PREDATORS) Dec 6-2</li>\n<li>Cons. Round 3 - Michael Johnson (EDWARDSVILLE WC) won in overtime over Xian Jerez (VILLA PARK YOUNG WARRIORS) OT 10-9</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Bryce Gorman (LITTLE CELTIC WC) won by major decision over Kailor Hecox (HECOX TEAM BENAIAH) Maj 12-1</li>\n<li>Semifinal - Bradley Dunn (CRYSTAL LAKE WIZARDS) won by decision over Collin Cronberg (LITTLE CELTIC WC) Dec 5-3</li>\n<li>Cons. Round 3 - Keegan Mugerditchian (HOFFMAN ESTATES WC) won by decision over Brian Pence (CRYSTAL LAKE WIZARDS) Dec 6-3</li>\n<li>Cons. Round 3 - Mark Dinardo (FORCE WRESTLING) won by fall over Tyquan Jones (HARVEY PARK DIST TWISTERS) Fall 3:30</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Alex Benoit (REDHAWK WC) won by fall over Sean Kelly (LITTLE CELTIC WC) Fall 1:07</li>\n<li>Semifinal - Tyler Johnson (LEMONT BEARS WC) won by fall over Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) Fall 1:08</li>\n<li>Cons. Round 3 - Mykel Gary (CARBONDALE WC) won by decision over Cain Bialas (WW TIGER WC) Dec 10-4</li>\n<li>Cons. Round 3 - Justin Heavilon (GRANITE CITY WC) won by major decision over Keyshawn Bulls (GLADIATORS) Maj 12-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Andre Mickens (TINLEY PARK BULLDOGS) won by fall over Aj Friedrich (METAMORA KIDS WC) Fall 3:23</li>\n<li>Semifinal - Moises Pina (MORTON LITTLE MUSTANGS) won by decision over Mason Jett (HOOPESTON AREA WC) Dec 5-3</li>\n<li>Cons. Round 3 - Jimique Davis (VILLA LOMBARD COUGARS) won by fall over Sam Erickson (DOWNERS GROVE COUGARS) Fall 0:45</li>\n<li>Cons. Round 3 - Tyler Barton (SYCAMORE WC) won by tech fall over Mark Miller (ZEE BEE STINGERS) TF 18-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Noah Fleckenstein (LIONS WC) won by tech fall over Lucas Warren (BLACKHAWK WC) TF 18-2</li>\n<li>Semifinal - Deontae Brown (HARVEY PARK DIST TWISTERS) won by decision over Tanner Farmer (HIGHLAND BULLDOG JR WC) Dec 4-1</li>\n<li>Cons. Round 3 - Ryan Berman (LITTLE CELTIC WC) won by fall over Dalton Kettering (ROCK ISLAND WC) Fall 2:22</li>\n<li>Cons. Round 3 - Matthew Iwinski (ROMEOVILLE YOUTH WC) won by decision over D`andre Johnson (VILLA LOMBARD COUGARS) Dec 7-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Tyler Dicken (WESTVILLE YOUTH WC) won by fall over Jordan Ladd (CHILLI DAWGS WC) Fall 1:17</li>\n<li>Semifinal - Nicholas Wolf (FORCE WRESTLING) won by decision over Charles Fisher (BENTON JR WC) Dec 8-5</li>\n<li>Cons. Round 3 - Nicky Allegretti (VITTUM CATS) won by fall over Christopher Bartels (DUNDEE HIGHLANDERS) Fall 2:30</li>\n<li>Cons. Round 3 - Jacob Heavlin (WARRIOR MONKS) won by fall over Jake Ford (MUSTANG WC) Fall 0:58</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Tommy Pawelski (MAINE EAGLES) won by fall over Jabari Moody (HARVEY PARK DIST TWISTERS) Fall 0:43</li>\n<li>Semifinal - Aj Villarreal (DOWNERS GROVE COUGARS) won by decision over Austin Ryan (CRYSTAL LAKE WIZARDS) Dec 6-5</li>\n<li>Cons. Round 3 - Jeffery Morrow (CRYSTAL LAKE WIZARDS) won by major decision over Dylan Cramer (FORCE WRESTLING) Maj 11-0</li>\n<li>Cons. Round 3 - Johnathan Gahagan (SOUTHSIDE STALLIONS) won by decision over Sean Sibley (FALCON WC) Dec 2-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Cameron Kennedy (GOMEZ WRESTLING ACADEMY) won by major decision over Haydon Grammer (EDWARDSVILLE WC) Maj 15-2</li>\n<li>Semifinal - Dominic Naso (FORCE WRESTLING) won by decision over Nelson Baker (XTREME WRESTLING) Dec 3-2</li>\n<li>Cons. Round 3 - Tyler Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Stephen Richardson (PONTIAC WC) Dec 7-1</li>\n<li>Cons. Round 3 - Jacob Field (SCN YOUTH WC) won by fall over Sam Martino (GOMEZ WRESTLING ACADEMY) Fall 2:00</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Anthony Devriese (JUNIOR PIONEER WC) won by decision over Briar King (UNITED SOUTHERN ALLSTARS) Dec 1-0</li>\n<li>Semifinal - Jordan Northrup (HARLEM COUGARS) won by decision over Richard Browne (GOMEZ WRESTLING ACADEMY) Dec 3-0</li>\n<li>Cons. Round 3 - Jordan Scalice (GOMEZ WRESTLING ACADEMY) won by decision over Martin Martinez (WAUKEGAN YOUTH WC) Dec 1-0</li>\n<li>Cons. Round 3 - Joey Shump (BATAVIA PINNERS) won by fall over Austen Schott (CHAMPAIGN KIDS WRESTLING) Fall 4:27</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Garrett Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Mark Duda (CROSSTOWN WC) Dec 3-2</li>\n<li>Semifinal - Gacob Lenox (HARLEM COUGARS) won by decision over Steve Turner (O`FALLON LITTLE PANTHERS) Dec 7-1</li>\n<li>Cons. Round 3 - Esai Ponce (KNIGHTS WRESTLING) won by major decision over Jimmy Regan (VITTUM CATS) Maj 12-1</li>\n<li>Cons. Round 3 - Trayvon Zabala (FORCE WRESTLING) won by decision over Robert Svestka (MARTINEZ FOX VALLEY ELITE) Dec 9-6</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Demechico Spraggins (UNITED SOUTHERN ALLSTARS) won by fall over Blake Tisza (CROSSTOWN WC) Fall 2:06</li>\n<li>Semifinal - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by decision over Austin Graham (MARTINEZ FOX VALLEY ELITE) Dec 8-2</li>\n<li>Cons. Round 3 - Michael Sepke (BRONCO WRESTLING) won by decision over Jake Messink (HARLEM COUGARS) Dec 6-1</li>\n<li>Cons. Round 3 - Trent Atkins (CARY MATMEN WC) won by decision over Chet Mcclure (FALCON YOUTH WC) Dec 5-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Nuntreae Jackson (HARVEY PARK DIST TWISTERS) won by decision over Joshua Boggess (ARLINGTON CARDINALS) Dec 7-3</li>\n<li>Semifinal - Bryce Brill (FOX VALLEY WC) won by fall over Sal Annoreno (GOMEZ WRESTLING ACADEMY) Fall 3:31</li>\n<li>Cons. Round 3 - Nicholas Peters (CRYSTAL LAKE WIZARDS) won by decision over Corbett Oughton (INDIANS ELITE) Dec 2-1</li>\n<li>Cons. Round 3 - Steven Galiardo (SHAMROCK WC) won by fall over Ryan Holzrichter (FORCE WRESTLING) Fall 5:00</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Notay Jackson (HARVEY PARK DIST TWISTERS) won by decision over Cain Salas (GRANITE CITY WC) Dec 8-6</li>\n<li>Semifinal - Kyle Langenderfer (ORLAND PARK PIONEERS) won by decision over Ernest Battaglia (FOX VALLEY WC) Dec 3-2</li>\n<li>Cons. Round 3 - George Fisher (SCN YOUTH WC) won by tech fall over Dan Goress (KNIGHTS WRESTLING) TF 17-2</li>\n<li>Cons. Round 3 - Abel Rios (ZEE BEE STINGERS) won by decision over Brandon Lizer (DAKOTA WC) Dec 3-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Colin Holler (EAGLE ONE) won by major decision over Eddie Gonzalez (FOX VALLEY WC) Maj 10-0</li>\n<li>Semifinal - Jj Whaley (XTREME WRESTLING) won by decision over Mitchell Cook (ORLAND PARK PIONEERS) Dec 7-0</li>\n<li>Cons. Round 3 - Connor Bandy (TINLEY PARK BULLDOGS) won by decision over Austin Mcpeek (RENEGADES (STOCKTON)) Dec 5-2</li>\n<li>Cons. Round 3 - Ethan Pullum (HERRIN JUNIOR WC) won by decision over Alex Friedman (PONTIAC WC) Dec 6-4</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Brian Murphy (VILLA LOMBARD COUGARS) won by fall over Jameer Thurman (GLADIATORS) Fall 2:50</li>\n<li>Semifinal - Richard Robertson (VITTUM CATS) won by decision over Manny Silva (HONONEGAH KIDS WC) Dec 4-3</li>\n<li>Cons. Round 3 - Damon Cloe (MARENGO YOUTH WRESTLING) won by major decision over Hadin Restivo (WEST FRANKFORT JR WRESTLING) Maj 12-3</li>\n<li>Cons. Round 3 - Colton Gladwell (CENTRAL ELITE REBELS) won by decision over Fabian Lara (MARTINEZ FOX VALLEY ELITE) Dec 5-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Lonnie Cleveland Iii (UNITED SOUTHERN ALLSTARS) won by decision over Jake Turk (CRYSTAL LAKE WIZARDS) Dec 4-0</li>\n<li>Semifinal - Austin Culton (SYCAMORE WC) won by decision over Dan Rowland (SCN YOUTH WC) Dec 3-2</li>\n<li>Cons. Round 3 - Patrick Vitek (VITTUM CATS) won by decision over Mitchell Murphy (ORLAND PARK PIONEERS) Dec 3-2</li>\n<li>Cons. Round 3 - Hunter Rollins (ARLINGTON CARDINALS) won by decision over Brett Meyer (CENTRAL ELITE REBELS) Dec 10-6</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Kenard Washington (GLADIATORS) won by decision over Mario Rodriguez (VILLA LOMBARD COUGARS) Dec 7-6</li>\n<li>Semifinal - Jack Sears (VITTUM CATS) won by fall over Logan Staver (PANTHER CUB WC) Fall 2:04</li>\n<li>Cons. Round 3 - Alex Anaya (DOWNERS GROVE COUGARS) won by major decision over Patrick O`malley (CARY MATMEN WC) Maj 15-3</li>\n<li>Cons. Round 3 - Breon Hoosier (MARTINEZ FOX VALLEY ELITE) won by decision over Brandon Sklavanitis (SAUK VALLEY WC) Dec 7-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Cameron Mammen (TIGER WC) won by decision over Brian Bahrs (SAUK VALLEY WC) Dec 5-2</li>\n<li>Semifinal - Max Brozovich (INDIANS ELITE) won by major decision over Bailey Appleman (CLIPPER WC) Maj 8-0</li>\n<li>Cons. Round 3 - Connor Swier (FOX VALLEY WC) won by decision over Tony Cashmore (LAKELAND PREDATORS) Dec 4-3</li>\n<li>Cons. Round 3 - Sam Klenske (MARENGO YOUTH WRESTLING) won by fall over Toby Rivera (CHAMPAIGN KIDS WRESTLING) Fall 1:07</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Jordan Ellingwood (GOMEZ WRESTLING ACADEMY) won by decision over Tj Lowe (RIVERDALE JR RAMS WC) Dec 9-2</li>\n<li>Semifinal - Mitchell Jordan (SYCAMORE WC) won by decision over Chris Giatras (LEMONT BEARS WC) Dec 8-2</li>\n<li>Cons. Round 3 - Joey Welsh (HONONEGAH KIDS WC) won by disqualification over Corry Williams (GRANITE CITY WC) DQ</li>\n<li>Cons. Round 3 - Dalton Major (BRAWLERS WC) won by fall over Ben West (JUNIOR PIONEER WC) Fall 4:28</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Alec Brown (OAK FOREST WARRIORS) won by decision over Sage Hecox (HECOX TEAM BENAIAH) Dec 5-0</li>\n<li>Semifinal - Cody Snodgrass (MARTINEZ FOX VALLEY ELITE) won by fall over Robert Schillinger (YORKVILLE WRESTLING CLUB) Fall 4:10</li>\n<li>Cons. Round 3 - Mickey Watson (BATAVIA PINNERS) won by decision over Luke Roth (NAPERVILLE WC) Dec 4-3</li>\n<li>Cons. Round 3 - Ben Threloff (REDHAWK WC) won by decision over Thomas Howell (VITTUM CATS) Dec 4-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Josh Pruitt (OAK FOREST WARRIORS) won by decision over Adrian Bolognani (LITTLE CELTIC WC) Dec 6-1</li>\n<li>Semifinal - Antony Touchstone (MARTINEZ FOX VALLEY ELITE) won by fall over Nickolas Kowalczuk (LITTLE HUSKIE WC) Fall 4:08</li>\n<li>Cons. Round 3 - Cole Whitford (GRANITE CITY WC) won by fall over Ben Calamari (BARRINGTON BRONCOS) Fall 2:11</li>\n<li>Cons. Round 3 - Sean Jones (HARLEM COUGARS) won by decision over Derek Schultz (MT. ZION WC) Dec 8-3</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - David Denne (CALUMET MEM. P.D. WOLVERINES) won by fall over Blake Angusich (ROCK ISLAND WC) Fall 1:27</li>\n<li>Semifinal - Edgar Ruano (ROMEOVILLE YOUTH WC) won by decision over Deonte Eiland (GLADIATORS) Dec 6-3</li>\n<li>Cons. Round 3 - Connor Jones (HARLEM COUGARS) won by fall over Angelo Cervantes (FORCE WRESTLING) Fall 3:52</li>\n<li>Cons. Round 3 - Blake Blair (EDWARDSVILLE WC) won by fall over Vaughn Monreal-berner (TEAM WEST WOLVES) Fall 1:00</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Michael Johnson Jr (DOWNERS GROVE COUGARS) won by major decision over Joshua Wallick (FISHER WC) Maj 10-2</li>\n<li>Semifinal - Josh Hickey (VITTUM CATS) won by decision over Timothy Burch (JJK WRESTLING) Dec 7-4</li>\n<li>Cons. Round 3 - Raymond Griggel (DUNDEE HIGHLANDERS) won by major decision over Alec Gordon (TINLEY PARK BULLDOGS) Maj 8-0</li>\n<li>Cons. Round 3 - Andrew Geers (FOX VALLEY WC) won by decision over Miguel Moreno (TOMCAT WC) Dec 5-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Alex Fritz (ACADEMY GRAPPLERS) won by decision over Morgan Supergan (BISMARCK HENNING WC) Dec 7-1</li>\n<li>Semifinal - Federico Diaz (TOMCAT WC) won by fall over Ethan Linder (HOOPESTON AREA WC) Fall 4:12</li>\n<li>Cons. Round 3 - Jacob Souza- (CRYSTAL LAKE WIZARDS) won by fall over Jonathan Pollock (MOLINE WC) Fall 5:23</li>\n<li>Cons. Round 3 - Jacob Robinson (OAK LAWN SPARTAN YOUTH WC NFP) won by fall over Michael Denyes (L-P CRUNCHING CAVS) Fall 4:14</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Louie Hayes (TINLEY PARK BULLDOGS) won by decision over Anthony Cheloni (SCN YOUTH WC) Dec 8-3</li>\n<li>Cons. Semi - Pat Walker (GOMEZ WRESTLING ACADEMY) won by major decision over Mark Ferguson (VITTUM CATS) Maj 13-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Rudy Yates (VITTUM CATS) won by decision over Francis Edelen (TINLEY PARK BULLDOGS) Dec 8-3</li>\n<li>Cons. Semi - Brian Rossi (FALCON WC) won by decision over Brady Powers (HONONEGAH KIDS WC) Dec 5-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Christian Robertson (VITTUM CATS) won by decision over Jacob Silzer (TINLEY PARK BULLDOGS) Dec 4-2</li>\n<li>Cons. Semi - Aj Jaffe (SCN YOUTH WC) won by decision over Michael Cullen (WRESTLING FACTORY) Dec 4-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Israel Santiago (GRAPPLIN` DEVILS WC) won by decision over Brandon Briggs (MARENGO YOUTH WRESTLING) Dec 7-4</li>\n<li>Cons. Semi - Titus Taylor (BELLEVILLE LITTLE DEVILS) won by decision over Michael Callahan (SCN YOUTH WC) Dec 6-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Josh Alber (DAKOTA WC) won by decision over Michael Hrdlicka (GOMEZ WRESTLING ACADEMY) Dec 6-0</li>\n<li>Cons. Semi - Joshua Fuqua (CROSSTOWN WC) won by major decision over Jack Diana (MUSTANG WC) Maj 10-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Randle Taborn (SPRINGFIELD CAPITAL KIDS WC) won by decision over Fred Johnson (HARVEY PARK DIST TWISTERS) Dec 4-2</li>\n<li>Cons. Semi - Nick Nasenbeny (FORCE WRESTLING) won by decision over Dillion Chase (RIVERBEND WC) Dec 2-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Carver James (DAKOTA WC) won by decision over Alante Walker (ORLAND PARK PIONEERS) Dec 8-3</li>\n<li>Cons. Semi - Michael Zelasco (CRYSTAL LAKE WIZARDS) won by fall over Cole Wysocki (TRIAD LITTLE KNIGHTS) Fall 1:28</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Nicholas Ferraro (SCN YOUTH WC) won by fall over Flynn Nagel (VITTUM CATS) Fall 3:59</li>\n<li>Cons. Semi - Nick Schultz (MARTINEZ FOX VALLEY ELITE) won by decision over Josh Martin (GLENBARD EAST JR RAMS) Dec 2-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Brady Rude (SAUK VALLEY WC) won by decision over Ryan Fish (LITTLE HUSKIE WC) Dec 4-3</li>\n<li>Cons. Semi - Randy Meneweather (KNOX COUNTY KRUSHERS) won by decision over Harrison Williams (SPRINGFIELD CAPITAL KIDS WC) Dec 6-4</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Thomas O`brien (SCN YOUTH WC) won by decision over Austin Armstrong (SYCAMORE WC) Dec 4-2</li>\n<li>Cons. Semi - Xavier Montalvo (ANIMAL WC) won in overtime over Jeffrey Casey (WEST CARROLL WC) OT 2-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Jeffery Klank (INDIANS ELITE) won by decision over Jack Rossi (CHAMPAIGN KIDS WRESTLING) Dec 2-1</li>\n<li>Cons. Semi - Anthony Palacios (JOLIET JUNIOR STEELMEN) won by decision over Mitchel Humphrey (MENDOTA MAT MASTERS) Dec 10-4</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Jim Geier (FORCE WRESTLING) won by major decision over Emery Parker (GRAPPLIN` DEVILS WC) Maj 12-2</li>\n<li>Cons. Semi - Edmond Hogan (LANCER WC) won by major decision over Michael Johnson (EDWARDSVILLE WC) Maj 12-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Kailor Hecox (HECOX TEAM BENAIAH) won by decision over Keegan Mugerditchian (HOFFMAN ESTATES WC) Dec 9-2</li>\n<li>Cons. Semi - Mark Dinardo (FORCE WRESTLING) won by decision over Collin Cronberg (LITTLE CELTIC WC) Dec 2-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Mykel Gary (CARBONDALE WC) won by decision over Sean Kelly (LITTLE CELTIC WC) Dec 6-4</li>\n<li>Cons. Semi - Justin Heavilon (GRANITE CITY WC) won by fall over Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) Fall 2:45</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Jimique Davis (VILLA LOMBARD COUGARS) won by fall over Aj Friedrich (METAMORA KIDS WC) Fall 1:05</li>\n<li>Cons. Semi - Mason Jett (HOOPESTON AREA WC) won by decision over Tyler Barton (SYCAMORE WC) Dec 8-3</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Lucas Warren (BLACKHAWK WC) won by fall over Ryan Berman (LITTLE CELTIC WC) Fall 3:34</li>\n<li>Cons. Semi - Tanner Farmer (HIGHLAND BULLDOG JR WC) won by fall over Matthew Iwinski (ROMEOVILLE YOUTH WC) Fall 0:29</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Nicky Allegretti (VITTUM CATS) won by fall over Jordan Ladd (CHILLI DAWGS WC) Fall 3:33</li>\n<li>Cons. Semi - Charles Fisher (BENTON JR WC) won by fall over Jacob Heavlin (WARRIOR MONKS) Fall 2:50</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Jabari Moody (HARVEY PARK DIST TWISTERS) won by decision over Jeffery Morrow (CRYSTAL LAKE WIZARDS) Dec 6-1</li>\n<li>Cons. Semi - Austin Ryan (CRYSTAL LAKE WIZARDS) won by decision over Johnathan Gahagan (SOUTHSIDE STALLIONS) Dec 4-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Tyler Svestka (MARTINEZ FOX VALLEY ELITE) won by fall over Haydon Grammer (EDWARDSVILLE WC) Fall 0:56</li>\n<li>Cons. Semi - Jacob Field (SCN YOUTH WC) won by decision over Nelson Baker (XTREME WRESTLING) Dec 2-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Briar King (UNITED SOUTHERN ALLSTARS) won by decision over Jordan Scalice (GOMEZ WRESTLING ACADEMY) Dec 6-0</li>\n<li>Cons. Semi - Richard Browne (GOMEZ WRESTLING ACADEMY) won by decision over Joey Shump (BATAVIA PINNERS) Dec 3-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Mark Duda (CROSSTOWN WC) won by decision over Esai Ponce (KNIGHTS WRESTLING) Dec 5-3</li>\n<li>Cons. Semi - Steve Turner (O`FALLON LITTLE PANTHERS) won by fall over Trayvon Zabala (FORCE WRESTLING) Fall 2:32</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Michael Sepke (BRONCO WRESTLING) won by major decision over Blake Tisza (CROSSTOWN WC) Maj 14-2</li>\n<li>Cons. Semi - Trent Atkins (CARY MATMEN WC) won by decision over Austin Graham (MARTINEZ FOX VALLEY ELITE) Dec 4-3</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Joshua Boggess (ARLINGTON CARDINALS) won by decision over Nicholas Peters (CRYSTAL LAKE WIZARDS) Dec 3-2</li>\n<li>Cons. Semi - Steven Galiardo (SHAMROCK WC) won by decision over Sal Annoreno (GOMEZ WRESTLING ACADEMY) Dec 8-6</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - George Fisher (SCN YOUTH WC) won by decision over Cain Salas (GRANITE CITY WC) Dec 4-3</li>\n<li>Cons. Semi - Ernest Battaglia (FOX VALLEY WC) won by decision over Abel Rios (ZEE BEE STINGERS) Dec 5-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Eddie Gonzalez (FOX VALLEY WC) won by fall over Connor Bandy (TINLEY PARK BULLDOGS) Fall 0:26</li>\n<li>Cons. Semi - Mitchell Cook (ORLAND PARK PIONEERS) won by decision over Ethan Pullum (HERRIN JUNIOR WC) Dec 1-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Jameer Thurman (GLADIATORS) won by fall over Damon Cloe (MARENGO YOUTH WRESTLING) Fall 0:37</li>\n<li>Cons. Semi - Manny Silva (HONONEGAH KIDS WC) won by decision over Colton Gladwell (CENTRAL ELITE REBELS) Dec 4-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Jake Turk (CRYSTAL LAKE WIZARDS) won by decision over Patrick Vitek (VITTUM CATS) Dec 5-1</li>\n<li>Cons. Semi - Dan Rowland (SCN YOUTH WC) won by decision over Hunter Rollins (ARLINGTON CARDINALS) Dec 5-3</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Mario Rodriguez (VILLA LOMBARD COUGARS) won by decision over Alex Anaya (DOWNERS GROVE COUGARS) Dec 10-8</li>\n<li>Cons. Semi - Logan Staver (PANTHER CUB WC) won by decision over Breon Hoosier (MARTINEZ FOX VALLEY ELITE) Dec 7-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Brian Bahrs (SAUK VALLEY WC) won by injury default over Connor Swier (FOX VALLEY WC) Inj. 0:00</li>\n<li>Cons. Semi - Sam Klenske (MARENGO YOUTH WRESTLING) won by tech fall over Bailey Appleman (CLIPPER WC) TF 16-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Tj Lowe (RIVERDALE JR RAMS WC) won by fall over Joey Welsh (HONONEGAH KIDS WC) Fall 3:25</li>\n<li>Cons. Semi - Chris Giatras (LEMONT BEARS WC) won by decision over Dalton Major (BRAWLERS WC) Dec 7-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Mickey Watson (BATAVIA PINNERS) won by fall over Sage Hecox (HECOX TEAM BENAIAH) Fall 2:05</li>\n<li>Cons. Semi - Robert Schillinger (YORKVILLE WRESTLING CLUB) won by decision over Ben Threloff (REDHAWK WC) Dec 9-7</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Adrian Bolognani (LITTLE CELTIC WC) won by fall over Cole Whitford (GRANITE CITY WC) Fall 2:11</li>\n<li>Cons. Semi - Nickolas Kowalczuk (LITTLE HUSKIE WC) won by decision over Sean Jones (HARLEM COUGARS) Dec 3-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Blake Angusich (ROCK ISLAND WC) won by fall over Connor Jones (HARLEM COUGARS) Fall 3:43</li>\n<li>Cons. Semi - Deonte Eiland (GLADIATORS) won by decision over Blake Blair (EDWARDSVILLE WC) Dec 2-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Joshua Wallick (FISHER WC) won by fall over Raymond Griggel (DUNDEE HIGHLANDERS) Fall 4:15</li>\n<li>Cons. Semi - Andrew Geers (FOX VALLEY WC) won by disqualification over Timothy Burch (JJK WRESTLING) DQ</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Morgan Supergan (BISMARCK HENNING WC) won by fall over Jacob Souza- (CRYSTAL LAKE WIZARDS) Fall 0:43</li>\n<li>Cons. Semi - Jacob Robinson (OAK LAWN SPARTAN YOUTH WC NFP) won by fall over Ethan Linder (HOOPESTON AREA WC) Fall 1:59</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Louie Hayes (TINLEY PARK BULLDOGS) won by decision over Pat Walker (GOMEZ WRESTLING ACADEMY) Dec 6-0</li>\n<li>5th Place Match - Anthony Cheloni (SCN YOUTH WC) won by major decision over Mark Ferguson (VITTUM CATS) Maj 17-4</li>\n<li>7th Place Match - Joe Antonelle (SCN YOUTH WC) won by decision over Logan Voss (E/P JUNIOR PANTHERS) Dec 6-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Brian Rossi (FALCON WC) won by major decision over Rudy Yates (VITTUM CATS) Maj 9-0</li>\n<li>5th Place Match - Francis Edelen (TINLEY PARK BULLDOGS) won by decision over Brady Powers (HONONEGAH KIDS WC) Dec 8-6</li>\n<li>7th Place Match - Andrew Mcfall (FORCE WRESTLING) won by decision over Riley Beard (PEORIA RAZORBACKS YOUTH WC) Dec 4-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Aj Jaffe (SCN YOUTH WC) won by decision over Christian Robertson (VITTUM CATS) Dec 4-0</li>\n<li>5th Place Match - Michael Cullen (WRESTLING FACTORY) won by decision over Jacob Silzer (TINLEY PARK BULLDOGS) Dec 5-0</li>\n<li>7th Place Match - Garrett Dziedzic (CRYSTAL LAKE WIZARDS) won by decision over Gunner Wenger (PANTHER CUB WC) Dec 5-4</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Israel Santiago (GRAPPLIN` DEVILS WC) won by decision over Titus Taylor (BELLEVILLE LITTLE DEVILS) Dec 5-2</li>\n<li>5th Place Match - Michael Callahan (SCN YOUTH WC) won by decision over Brandon Briggs (MARENGO YOUTH WRESTLING) Dec 7-0</li>\n<li>7th Place Match - Brian Krasowski (ORLAND PARK PIONEERS) won by decision over Shaun Wasso (LITTLE CELTIC WC) Dec 5-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Josh Alber (DAKOTA WC) won by major decision over Joshua Fuqua (CROSSTOWN WC) Maj 11-3</li>\n<li>5th Place Match - Michael Hrdlicka (GOMEZ WRESTLING ACADEMY) won by decision over Jack Diana (MUSTANG WC) Dec 5-3</li>\n<li>7th Place Match - Vaughn Hobart (PONTIAC WC) won by forfeit over Jake Eckenrod (MT. ZION WC) FF</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Nick Nasenbeny (FORCE WRESTLING) won by major decision over Randle Taborn (SPRINGFIELD CAPITAL KIDS WC) Maj 13-0</li>\n<li>5th Place Match - Dillion Chase (RIVERBEND WC) won by fall over Fred Johnson (HARVEY PARK DIST TWISTERS) Fall 3:45</li>\n<li>7th Place Match - Kyle Akins (SYCAMORE WC) won by decision over Trace Carello (MT. VERNON LIONS) Dec 4-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Carver James (DAKOTA WC) won by decision over Michael Zelasco (CRYSTAL LAKE WIZARDS) Dec 2-0</li>\n<li>5th Place Match - Cole Wysocki (TRIAD LITTLE KNIGHTS) won by decision over Alante Walker (ORLAND PARK PIONEERS) Dec 6-2</li>\n<li>7th Place Match - Scott Oglanian (WEST CHICAGO JUNIOR WILDCATS) won by injury default over Mario Leveille (OAK FOREST WARRIORS) Inj. 0:00</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Nicholas Ferraro (SCN YOUTH WC) won by decision over Nick Schultz (MARTINEZ FOX VALLEY ELITE) Dec 4-1</li>\n<li>5th Place Match - Flynn Nagel (VITTUM CATS) won by decision over Josh Martin (GLENBARD EAST JR RAMS) Dec 9-3</li>\n<li>7th Place Match - Andrew Collins (ROMEOVILLE YOUTH WC) won by decision over John Blanke (BARRINGTON BRONCOS) Dec 6-5</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Brady Rude (SAUK VALLEY WC) won by decision over Randy Meneweather (KNOX COUNTY KRUSHERS) Dec 4-1</li>\n<li>5th Place Match - Ryan Fish (LITTLE HUSKIE WC) won by decision over Harrison Williams (SPRINGFIELD CAPITAL KIDS WC) Dec 2-1</li>\n<li>7th Place Match - Tyler Demoss (HONONEGAH KIDS WC) won by decision over Andrew Marsden (CRYSTAL LAKE WIZARDS) Dec 4-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Thomas O`brien (SCN YOUTH WC) won by decision over Xavier Montalvo (ANIMAL WC) Dec 6-0</li>\n<li>5th Place Match - Jeffrey Casey (WEST CARROLL WC) won by decision over Austin Armstrong (SYCAMORE WC) Dec 6-2</li>\n<li>7th Place Match - Nathan Romero (DUNDEE HIGHLANDERS) won by decision over Bradley Herzberg (BULLS WC) Dec 9-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Anthony Palacios (JOLIET JUNIOR STEELMEN) won by decision over Jeffery Klank (INDIANS ELITE) Dec 5-0</li>\n<li>5th Place Match - Jack Rossi (CHAMPAIGN KIDS WRESTLING) won by decision over Mitchel Humphrey (MENDOTA MAT MASTERS) Dec 6-0</li>\n<li>7th Place Match - Nicholas Whitehead (ZEE BEE STINGERS) won by decision over Dustin Pindel (ORLAND PARK PIONEERS) Dec 13-8</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Edmond Hogan (LANCER WC) won by decision over Jim Geier (FORCE WRESTLING) Dec 7-0</li>\n<li>5th Place Match - Michael Johnson (EDWARDSVILLE WC) won by decision over Emery Parker (GRAPPLIN` DEVILS WC) Dec 3-1</li>\n<li>7th Place Match - Zac Keller (LAKELAND PREDATORS) won by fall over Xian Jerez (VILLA PARK YOUNG WARRIORS) Fall 2:49</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Kailor Hecox (HECOX TEAM BENAIAH) won by decision over Mark Dinardo (FORCE WRESTLING) Dec 2-1</li>\n<li>5th Place Match - Collin Cronberg (LITTLE CELTIC WC) won by major decision over Keegan Mugerditchian (HOFFMAN ESTATES WC) Maj 12-4</li>\n<li>7th Place Match - Brian Pence (CRYSTAL LAKE WIZARDS) won by decision over Tyquan Jones (HARVEY PARK DIST TWISTERS) Dec 9-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Justin Heavilon (GRANITE CITY WC) won by fall over Mykel Gary (CARBONDALE WC) Fall 3:36</li>\n<li>5th Place Match - Sean Kelly (LITTLE CELTIC WC) won by fall over Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) Fall 4:04</li>\n<li>7th Place Match - Cain Bialas (WW TIGER WC) won by decision over Keyshawn Bulls (GLADIATORS) Dec 10-8</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Jimique Davis (VILLA LOMBARD COUGARS) won by fall over Mason Jett (HOOPESTON AREA WC) Fall 0:53</li>\n<li>5th Place Match - Aj Friedrich (METAMORA KIDS WC) won by decision over Tyler Barton (SYCAMORE WC) Dec 4-2</li>\n<li>7th Place Match - Sam Erickson (DOWNERS GROVE COUGARS) won by major decision over Mark Miller (ZEE BEE STINGERS) Maj 18-8</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Lucas Warren (BLACKHAWK WC) won by fall over Tanner Farmer (HIGHLAND BULLDOG JR WC) Fall 1:59</li>\n<li>5th Place Match - Ryan Berman (LITTLE CELTIC WC) won by fall over Matthew Iwinski (ROMEOVILLE YOUTH WC) Fall 4:24</li>\n<li>7th Place Match - D`andre Johnson (VILLA LOMBARD COUGARS) won by decision over Dalton Kettering (ROCK ISLAND WC) Dec 4-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Nicky Allegretti (VITTUM CATS) won by fall over Charles Fisher (BENTON JR WC) Fall 4:27</li>\n<li>5th Place Match - Jordan Ladd (CHILLI DAWGS WC) won by fall over Jacob Heavlin (WARRIOR MONKS) Fall 1:40</li>\n<li>7th Place Match - Jake Ford (MUSTANG WC) won by fall over Christopher Bartels (DUNDEE HIGHLANDERS) Fall 1:15</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Austin Ryan (CRYSTAL LAKE WIZARDS) won by major decision over Jabari Moody (HARVEY PARK DIST TWISTERS) Maj 13-2</li>\n<li>5th Place Match - Jeffery Morrow (CRYSTAL LAKE WIZARDS) won by major decision over Johnathan Gahagan (SOUTHSIDE STALLIONS) Maj 11-2</li>\n<li>7th Place Match - Sean Sibley (FALCON WC) won by decision over Dylan Cramer (FORCE WRESTLING) Dec 7-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Tyler Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Jacob Field (SCN YOUTH WC) Dec 8-3</li>\n<li>5th Place Match - Nelson Baker (XTREME WRESTLING) won by decision over Haydon Grammer (EDWARDSVILLE WC) Dec 5-0</li>\n<li>7th Place Match - Stephen Richardson (PONTIAC WC) won by fall over Sam Martino (GOMEZ WRESTLING ACADEMY) Fall 1:11</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Briar King (UNITED SOUTHERN ALLSTARS) won by decision over Richard Browne (GOMEZ WRESTLING ACADEMY) Dec 4-0</li>\n<li>5th Place Match - Joey Shump (BATAVIA PINNERS) won by decision over Jordan Scalice (GOMEZ WRESTLING ACADEMY) Dec 6-4</li>\n<li>7th Place Match - Austen Schott (CHAMPAIGN KIDS WRESTLING) won by decision over Martin Martinez (WAUKEGAN YOUTH WC) Dec 7-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Mark Duda (CROSSTOWN WC) won by decision over Steve Turner (O`FALLON LITTLE PANTHERS) Dec 4-1</li>\n<li>5th Place Match - Esai Ponce (KNIGHTS WRESTLING) won by decision over Trayvon Zabala (FORCE WRESTLING) Dec 4-1</li>\n<li>7th Place Match - Jimmy Regan (VITTUM CATS) won by decision over Robert Svestka (MARTINEZ FOX VALLEY ELITE) Dec 7-5</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Michael Sepke (BRONCO WRESTLING) won by fall over Trent Atkins (CARY MATMEN WC) Fall 1:06</li>\n<li>5th Place Match - Austin Graham (MARTINEZ FOX VALLEY ELITE) won by decision over Blake Tisza (CROSSTOWN WC) Dec 5-2</li>\n<li>7th Place Match - Chet Mcclure (FALCON YOUTH WC) won by decision over Jake Messink (HARLEM COUGARS) Dec 4-3</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Steven Galiardo (SHAMROCK WC) won by fall over Joshua Boggess (ARLINGTON CARDINALS) Fall 1:06</li>\n<li>5th Place Match - Sal Annoreno (GOMEZ WRESTLING ACADEMY) won by decision over Nicholas Peters (CRYSTAL LAKE WIZARDS) Dec 3-2</li>\n<li>7th Place Match - Corbett Oughton (INDIANS ELITE) won by major decision over Ryan Holzrichter (FORCE WRESTLING) Maj 14-6</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Ernest Battaglia (FOX VALLEY WC) won by decision over George Fisher (SCN YOUTH WC) Dec 6-5</li>\n<li>5th Place Match - Cain Salas (GRANITE CITY WC) won by decision over Abel Rios (ZEE BEE STINGERS) Dec 5-2</li>\n<li>7th Place Match - Brandon Lizer (DAKOTA WC) won by decision over Dan Goress (KNIGHTS WRESTLING) Dec 7-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Eddie Gonzalez (FOX VALLEY WC) won by major decision over Mitchell Cook (ORLAND PARK PIONEERS) Maj 10-0</li>\n<li>5th Place Match - Connor Bandy (TINLEY PARK BULLDOGS) won by decision over Ethan Pullum (HERRIN JUNIOR WC) Dec 11-9</li>\n<li>7th Place Match - Austin Mcpeek (RENEGADES (STOCKTON)) won by decision over Alex Friedman (PONTIAC WC) Dec 6-5</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Manny Silva (HONONEGAH KIDS WC) won by decision over Jameer Thurman (GLADIATORS) Dec 6-0</li>\n<li>5th Place Match - Colton Gladwell (CENTRAL ELITE REBELS) won by decision over Damon Cloe (MARENGO YOUTH WRESTLING) Dec 8-5</li>\n<li>7th Place Match - Fabian Lara (MARTINEZ FOX VALLEY ELITE) won by decision over Hadin Restivo (WEST FRANKFORT JR WRESTLING) Dec 9-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Dan Rowland (SCN YOUTH WC) won by decision over Jake Turk (CRYSTAL LAKE WIZARDS) Dec 3-1</li>\n<li>5th Place Match - Hunter Rollins (ARLINGTON CARDINALS) won by fall over Patrick Vitek (VITTUM CATS) Fall 0:24</li>\n<li>7th Place Match - Brett Meyer (CENTRAL ELITE REBELS) won by decision over Mitchell Murphy (ORLAND PARK PIONEERS) Dec 7-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Logan Staver (PANTHER CUB WC) won by fall over Mario Rodriguez (VILLA LOMBARD COUGARS) Fall 2:27</li>\n<li>5th Place Match - Breon Hoosier (MARTINEZ FOX VALLEY ELITE) won by decision over Alex Anaya (DOWNERS GROVE COUGARS) Dec 7-4</li>\n<li>7th Place Match - Brandon Sklavanitis (SAUK VALLEY WC) won by fall over Patrick O`malley (CARY MATMEN WC) Fall 1:18</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Brian Bahrs (SAUK VALLEY WC) won by decision over Sam Klenske (MARENGO YOUTH WRESTLING) Dec 2-0</li>\n<li>5th Place Match - Bailey Appleman (CLIPPER WC) won by injury default over Connor Swier (FOX VALLEY WC) Inj. 0:00</li>\n<li>7th Place Match - Tony Cashmore (LAKELAND PREDATORS) won by decision over Toby Rivera (CHAMPAIGN KIDS WRESTLING) Dec 5-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Tj Lowe (RIVERDALE JR RAMS WC) won by decision over Chris Giatras (LEMONT BEARS WC) Dec 10-7</li>\n<li>5th Place Match - Dalton Major (BRAWLERS WC) won by decision over Joey Welsh (HONONEGAH KIDS WC) Dec 12-5</li>\n<li>7th Place Match - Ben West (JUNIOR PIONEER WC) won by forfeit over Corry Williams (GRANITE CITY WC) FF</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Robert Schillinger (YORKVILLE WRESTLING CLUB) won by major decision over Mickey Watson (BATAVIA PINNERS) Maj 13-3</li>\n<li>5th Place Match - Ben Threloff (REDHAWK WC) won by decision over Sage Hecox (HECOX TEAM BENAIAH) Dec 6-2</li>\n<li>7th Place Match - Luke Roth (NAPERVILLE WC) won by decision over Thomas Howell (VITTUM CATS) Dec 5-2</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Nickolas Kowalczuk (LITTLE HUSKIE WC) won by decision over Adrian Bolognani (LITTLE CELTIC WC) Dec 8-1</li>\n<li>5th Place Match - Cole Whitford (GRANITE CITY WC) won by fall over Sean Jones (HARLEM COUGARS) Fall 3:29</li>\n<li>7th Place Match - Ben Calamari (BARRINGTON BRONCOS) won by decision over Derek Schultz (MT. ZION WC) Dec 7-4</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Deonte Eiland (GLADIATORS) won by fall over Blake Angusich (ROCK ISLAND WC) Fall 2:56</li>\n<li>5th Place Match - Blake Blair (EDWARDSVILLE WC) won by fall over Connor Jones (HARLEM COUGARS) Fall 0:21</li>\n<li>7th Place Match - Angelo Cervantes (FORCE WRESTLING) won by decision over Vaughn Monreal-berner (TEAM WEST WOLVES) Dec 5-2</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Andrew Geers (FOX VALLEY WC) won by decision over Joshua Wallick (FISHER WC) Dec 5-4</li>\n<li>5th Place Match - Raymond Griggel (DUNDEE HIGHLANDERS) won by decision over Timothy Burch (JJK WRESTLING) Dec 2-1</li>\n<li>7th Place Match - Alec Gordon (TINLEY PARK BULLDOGS) won by decision over Miguel Moreno (TOMCAT WC) Dec 3-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Morgan Supergan (BISMARCK HENNING WC) won by fall over Jacob Robinson (OAK LAWN SPARTAN YOUTH WC NFP) Fall 2:37</li>\n<li>5th Place Match - Ethan Linder (HOOPESTON AREA WC) won by fall over Jacob Souza- (CRYSTAL LAKE WIZARDS) Fall 0:38</li>\n<li>7th Place Match - Jonathan Pollock (MOLINE WC) won by decision over Michael Denyes (L-P CRUNCHING CAVS) Dec 2-1</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Austin Gomez (GOMEZ WRESTLING ACADEMY) won by fall over Dylan Duncan (SCN YOUTH WC) Fall 3:13</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Austin O`connor (TINLEY PARK BULLDOGS) won by major decision over Anthony Bosco (SCN YOUTH WC) Maj 8-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Elijah Oliver (HARVEY PARK DIST TWISTERS) won by decision over Johnathon Doyle (GOMEZ WRESTLING ACADEMY) Dec 3-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Vincent Turk (CRYSTAL LAKE WIZARDS) won by decision over James Wolfe (HARLEM COUGARS) Dec 5-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Isaih White (HARVEY PARK DIST TWISTERS) won by decision over Kyle Fugiel (CRYSTAL LAKE WIZARDS) Dec 2-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won by decision over Larry Early (ROMEOVILLE YOUTH WC) Dec 4-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - John Jimenez (SCN YOUTH WC) won by major decision over Juwan Edmond (BROADVIEW PARK DISTRICT) Maj 8-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Brandon Arteaga (GOMEZ WRESTLING ACADEMY) won by decision over Matthew Rundell (ARLINGTON CARDINALS) Dec 7-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won by decision over Joseph Fulco (FORCE WRESTLING) Dec 6-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Michael Pixley (GRANITE CITY WC) won by fall over Dru Worker (TINLEY PARK BULLDOGS) Fall 3:29</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Tyre Lee (RENEGADE WC (NFP)) won by fall over Cameron Throneberry (EDWARDSVILLE WC) Fall 1:17</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Connor Doak (JUNIOR PIONEER WC) won by fall over Ian Harwick (HARLEM RENEGADES) Fall 0:41</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Bradley Dunn (CRYSTAL LAKE WIZARDS) won by decision over Bryce Gorman (LITTLE CELTIC WC) Dec 3-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Alex Benoit (REDHAWK WC) won by decision over Tyler Johnson (LEMONT BEARS WC) Dec 6-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Andre Mickens (TINLEY PARK BULLDOGS) won by tech fall over Moises Pina (MORTON LITTLE MUSTANGS) TF 21-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Deontae Brown (HARVEY PARK DIST TWISTERS) won by decision over Noah Fleckenstein (LIONS WC) Dec 7-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Nicholas Wolf (FORCE WRESTLING) won by fall over Tyler Dicken (WESTVILLE YOUTH WC) Fall 1:15</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Tommy Pawelski (MAINE EAGLES) won by decision over Aj Villarreal (DOWNERS GROVE COUGARS) Dec 4-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Cameron Kennedy (GOMEZ WRESTLING ACADEMY) won by major decision over Dominic Naso (FORCE WRESTLING) Maj 14-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Anthony Devriese (JUNIOR PIONEER WC) won by decision over Jordan Northrup (HARLEM COUGARS) Dec 5-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Garrett Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Gacob Lenox (HARLEM COUGARS) Dec 2-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Demechico Spraggins (UNITED SOUTHERN ALLSTARS) won by decision over Isaiah Vela (MARTINEZ FOX VALLEY ELITE) Dec 9-3</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Bryce Brill (FOX VALLEY WC) won by decision over Nuntreae Jackson (HARVEY PARK DIST TWISTERS) Dec 3-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Kyle Langenderfer (ORLAND PARK PIONEERS) won by decision over Notay Jackson (HARVEY PARK DIST TWISTERS) Dec 9-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Colin Holler (EAGLE ONE) won by decision over Jj Whaley (XTREME WRESTLING) Dec 6-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Brian Murphy (VILLA LOMBARD COUGARS) won by decision over Richard Robertson (VITTUM CATS) Dec 5-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Austin Culton (SYCAMORE WC) won by major decision over Lonnie Cleveland Iii (UNITED SOUTHERN ALLSTARS) Maj 11-3</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Jack Sears (VITTUM CATS) won by fall over Kenard Washington (GLADIATORS) Fall 1:06</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Cameron Mammen (TIGER WC) won by major decision over Max Brozovich (INDIANS ELITE) Maj 16-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Jordan Ellingwood (GOMEZ WRESTLING ACADEMY) won by decision over Mitchell Jordan (SYCAMORE WC) Dec 10-3</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Alec Brown (OAK FOREST WARRIORS) won by decision over Cody Snodgrass (MARTINEZ FOX VALLEY ELITE) Dec 8-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Antony Touchstone (MARTINEZ FOX VALLEY ELITE) won by fall over Josh Pruitt (OAK FOREST WARRIORS) Fall 3:44</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Edgar Ruano (ROMEOVILLE YOUTH WC) won by decision over David Denne (CALUMET MEM. P.D. WOLVERINES) Dec 2-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Michael Johnson Jr (DOWNERS GROVE COUGARS) won by fall over Josh Hickey (VITTUM CATS) Fall 2:00</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Alex Fritz (ACADEMY GRAPPLERS) won by decision over Federico Diaz (TOMCAT WC) Dec 1-0</li>\n</ul>\n</section>"
}
