{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Kyle Szlenk (CRYSTAL LAKE WIZARDS) won by major decision over Brandon Tennyson (HERRIN JUNIOR WC) Maj 14-2</li>\n<li>Champ. Round 1 - Joey Melendez (BRONCO WRESTLING) won by major decision over Trevor Edwards (MATTOON YOUTH WC) Maj 15-4</li>\n<li>Champ. Round 1 - Chrishon Tucker (JJK WRESTLING) won by fall over Justin Appelman (TITAN YOUTH WRESTLING) Fall 1:23</li>\n<li>Champ. Round 1 - Anthony Madrigal (BRONCO WRESTLING) won by fall over Michael Tortorice (WOLVES WC) Fall 2:58</li>\n<li>Champ. Round 1 - Kevin Radcliff (GOMEZ WRESTLING ACADEMY) won by decision over Cody Baldridge (LITTLE REDSKINS WC) Dec 4-3</li>\n<li>Champ. Round 1 - Jason Stokes (LITTLE CELTIC WC) won by fall over Shawn Sparacino (SOUTHSIDE COMETS) Fall 2:16</li>\n<li>Champ. Round 1 - Brent Ochoa (VITTUM CATS) won by major decision over Stephanie Sommers (ARLINGTON CARDINALS) Maj 9-0</li>\n<li>Champ. Round 1 - Trentin Rilea (FULTON COUNTY STINGERS) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Logan Voss (SAUK VALLEY WC) won by decision over Brice Casey (SPRINGFIELD CAPITAL KIDS WC) Dec 9-3</li>\n<li>Champ. Round 1 - James Higdon (COLLINSVILLE RAIDERS) won by decision over Tyler Myers (PLAINFIELD WC) Dec 6-3</li>\n<li>Champ. Round 1 - Jarod Foiles (ROXANA KIDS WC) won by decision over Devin Lasanska (SPRINGFIELD CAPITAL KIDS WC) Dec 8-2</li>\n<li>Champ. Round 1 - Liam Meagher (LITTLE CELTIC WC) won by fall over Ethan Phillips (L-P CRUNCHING CAVS) Fall 2:31</li>\n<li>Champ. Round 1 - Jason Renteria (BRONCO WRESTLING) won by decision over Sean Cullen (WRESTLING FACTORY) Dec 8-1</li>\n<li>Champ. Round 1 - Jaleel Hollingsworth (LITTLE HUSKIE WC) won by major decision over Wylie Allen (CRYSTAL LAKE WIZARDS) Maj 12-3</li>\n<li>Champ. Round 1 - Anthony Cheloni (SCN YOUTH WC) won by tech fall over Jake Szlenk (CRYSTAL LAKE WIZARDS) TF 15-0</li>\n<li>Champ. Round 1 - Zachary Lorek (TINLEY PARK BULLDOGS) won by major decision over Adam Nixon (GOMEZ WRESTLING ACADEMY) Maj 9-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Blaize Punke (CENTRAL ELITE REBELS) won by decision over Devin Michicich (SOUTHSIDE STALLIONS) Dec 2-1</li>\n<li>Champ. Round 1 - Jacob Dudeck (TINLEY PARK BULLDOGS) won by major decision over Bryce Reader (ROXANA KIDS WC) Maj 16-3</li>\n<li>Champ. Round 1 - Peter Ogunsanya (HARVEY TWISTERS) won by major decision over Raul Marrero Jr (SPRINGFIELD CAPITAL KIDS WC) Maj 12-3</li>\n<li>Champ. Round 1 - Jarrid Braunagel (O`FALLON LITTLE PANTHERS) won by major decision over Blake Begner (PEORIA HEIGHTS MINUTEMEN) Maj 17-3</li>\n<li>Champ. Round 1 - Kyle Bernat (SCN YOUTH WC) won by decision over Jared Ellingwood (FORCE WRESTLING) Dec 2-0</li>\n<li>Champ. Round 1 - Gavin Sutton (GOMEZ WRESTLING ACADEMY) won by fall over Ian Mullen (WOLVES WC) Fall 3:39</li>\n<li>Champ. Round 1 - Hazen Rice (MAD DOG WRESTLING ACADEMY) won by tech fall over Zach Grosch (WAUBONSIE WC) TF 15-0</li>\n<li>Champ. Round 1 - Dustin Swanson (ROCKFORD WC) won by decision over Tyler Wood (CROSSTOWN WC) Dec 3-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Cameron White (HARVEY TWISTERS) won by major decision over Raekwon Williams (CROSSTOWN WC) Maj 15-2</li>\n<li>Champ. Round 1 - Christian Fausel (HONONEGAH KIDS WC) won by decision over Gage Adams (FISHER WC) Dec 10-3</li>\n<li>Champ. Round 1 - Demarius Terhune (CHAMPAIGN KIDS WRESTLING) won in overtime over Mohammed Taylor (HARVEY TWISTERS) OT 5-4</li>\n<li>Champ. Round 1 - Zachary Krause (FORCE WRESTLING) won by decision over Chase Engelbrecht (DAKOTA WC) Dec 2-1</li>\n<li>Champ. Round 1 - Brandon Critchfield (UNITED SOUTHERN ALLSTARS) won by major decision over Aj Rechenmacher (BATAVIA PINNERS) Maj 8-0</li>\n<li>Champ. Round 1 - Patrick Augustyn (GOMEZ WRESTLING ACADEMY) won by major decision over Kobe Watts (MIDWEST CENTRAL YOUTH) Maj 13-2</li>\n<li>Champ. Round 1 - Hunter Webb (SAUK VALLEY WC) won by decision over Merik Fulton (TRIAD LITTLE KNIGHTS) Dec 4-3</li>\n<li>Champ. Round 1 - Jake Barzowski (BRONCO WRESTLING) won by decision over Jakob Cysewski (BARRINGTON BRONCOS) Dec 8-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Javeontae Crider (LIONHEART INTENSE WRESTLING) won by fall over Drake Davis (TIGERTOWN TANGLERS) Fall 2:31</li>\n<li>Champ. Round 1 - Jacob Silzer (TINLEY PARK BULLDOGS) won by major decision over Andrew Verr (VILLA PARK YOUNG WARRIORS) Maj 9-0</li>\n<li>Champ. Round 1 - Nicholas Burke (LIONS WC) won by fall over Joey Nauman (YORKVILLE WRESTLING CLUB) Fall 4:13</li>\n<li>Champ. Round 1 - Devin Kane (MARTINEZ FOX VALLEY ELITE) won by fall over Ethan Reel (CENTRAL ELITE REBELS) Fall 3:52</li>\n<li>Champ. Round 1 - Jacob Orth (CRYSTAL LAKE WIZARDS) won by major decision over Jacob Mitchell (HIGHLAND BULLDOG JR WC) Maj 8-0</li>\n<li>Champ. Round 1 - Mitchell Stathakis (BARRINGTON BRONCOS) won by decision over Sheldon Snapp (WILL COUNTY WARRIORS) Dec 7-4</li>\n<li>Champ. Round 1 - Kyle Ruettiger (LINCOLN-WAY WC) won by major decision over Gage Skelton (BULLS WC) Maj 10-2</li>\n<li>Champ. Round 1 - Garrett Dziedzic (CRYSTAL LAKE WIZARDS) won in overtime over Eric Carter (WRESTLING FACTORY) OT 2-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Carter Pillen (GENESEO SPIDER WC) won by major decision over Seth Honkala (SPRINGFIELD CAPITAL KIDS WC) Maj 8-0</li>\n<li>Champ. Round 1 - Roberto Campos (BOLINGBROOK JUNIOR RAIDERS) won by decision over Bobby Alexander (JUNIOR COUGARS WC) Dec 4-2</li>\n<li>Champ. Round 1 - Camiran Sadeghi (WEST HANCOCK TITAN WC) won by major decision over Tyree Johnson (VILLA LOMBARD COUGARS) Maj 11-3</li>\n<li>Champ. Round 1 - Zachary Akers (INDIANS ELITE) won by decision over Garrett Brachbill (SHELBYVILLE JR RAMS WRESTLING) Dec 8-1</li>\n<li>Champ. Round 1 - David Kasper (SOUTHSIDE STALLIONS) won by decision over Logan Gruszka (MARTINEZ FOX VALLEY ELITE) Dec 4-0</li>\n<li>Champ. Round 1 - Drake Boverie (BULLS WC) won by decision over Aaron Sennholtz (CARY MATMEN WC) Dec 4-3</li>\n<li>Champ. Round 1 - Jacob Hawkins (SHOOTERS ELITE WC) won by decision over Shayne Oster (LEMONT BEARS WC) Dec 6-4</li>\n<li>Champ. Round 1 - Gabe Johnson (CLUB ATTACK) won by decision over Brenden Reader (ROXANA KIDS WC) Dec 4-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Vaughn Hobart (PONTIAC WC) won by fall over Jonathan Warner (JUNIOR PIONEER WC) Fall 1:13</li>\n<li>Champ. Round 1 - Nathan Olsen (DAKOTA WC) won by fall over Greg Eldridge (TRIAD LITTLE KNIGHTS) Fall 2:28</li>\n<li>Champ. Round 1 - James Wolfe (SHOOTERS ELITE WC) won by major decision over Colin Sullivan (PAXTON YOUTH WC) Maj 16-5</li>\n<li>Champ. Round 1 - Ryon Richardson (CLIPPER WC) won by fall over Justin Bartholomew (ROXANA KIDS WC) Fall 0:51</li>\n<li>Champ. Round 1 - Nicky Gasbarro (JUNIOR SPARTANS WC) won by decision over Juan Reyes Iv (REBELS WC) Dec 3-2</li>\n<li>Champ. Round 1 - Alex Madrigal (BRONCO WRESTLING) won by major decision over Kyle Marshall (VITTUM CATS) Maj 18-7</li>\n<li>Champ. Round 1 - Jake Tisza (JUNIOR SPARTANS WC) won by fall over Tyler Laux (HARVEY TWISTERS) Fall 0:59</li>\n<li>Champ. Round 1 - Jack Jessen (VILLA PARK YOUNG WARRIORS) won by decision over Joshua Turnquest (BARRINGTON BRONCOS) Dec 9-4</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Derek Wilke (NAPERVILLE WC) won by fall over Ethan Cain (SAUK VALLEY WC) Fall 0:39</li>\n<li>Champ. Round 1 - Andrew Wenger (DAKOTA WC) won by decision over Jake Lanning (PONTIAC WC) Dec 6-3</li>\n<li>Champ. Round 1 - Sean Ryan (LITTLE FALCONS WC) won by fall over Joey Schott Jr (CHAMPAIGN KIDS WRESTLING) Fall 3:29</li>\n<li>Champ. Round 1 - Eric Barone (WOLVES WC) won by fall over Robert Walters (GENESEO SPIDER WC) Fall 2:40</li>\n<li>Champ. Round 1 - Kameron Irvin (GLADIATORS) won by major decision over Nick Liebich (LANCER WC) Maj 15-1</li>\n<li>Champ. Round 1 - David Riojas (FORCE WRESTLING) won by decision over James Ziegler (EDWARDSVILLE WC) Dec 8-4</li>\n<li>Champ. Round 1 - Jakada Hull (HARVEY TWISTERS) won by fall over Roman Johnson (WILL COUNTY WARRIORS) Fall 2:44</li>\n<li>Champ. Round 1 - Jacob Persman (MT. VERNON LIONS) won by decision over Zachery Nemec (MAD DOG WRESTLING ACADEMY) Dec 5-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Danny Hiemenz (FORCE WRESTLING) won by decision over Ethan Haines (CHAMPAIGN KIDS WRESTLING) Dec 7-3</li>\n<li>Champ. Round 1 - Juwan Edmond (GLADIATORS) won by fall over Cameron Barnhart (WAUBONSIE WC) Fall 2:30</li>\n<li>Champ. Round 1 - Ben Zbinden (FALCON YOUTH WC) won by fall over Elijah Rochel (VILLA PARK YOUNG WARRIORS) Fall 2:29</li>\n<li>Champ. Round 1 - Tom Slattery (TINLEY PARK BULLDOGS) won by decision over Jacob Schleicher (FALCON WC) Dec 8-3</li>\n<li>Champ. Round 1 - Alexander Mckenna (TREVIAN WC) won by decision over Dalton Lawver (ROCK ISLAND WC) Dec 4-2</li>\n<li>Champ. Round 1 - Nicholas Remke (MARENGO YOUTH WRESTLING) won by decision over Nicholas Foster (BELLEVILLE JUNIOR HIT SQUAD) Dec 4-2</li>\n<li>Champ. Round 1 - Troy Ott (MAD DOG WRESTLING ACADEMY) won by major decision over Chris Prosser (EDWARDSVILLE WC) Maj 15-4</li>\n<li>Champ. Round 1 - Mason Tomash (STILLMAN VALLEY WC) won by fall over Jacob Orth (JUNIOR PIONEER WC) Fall 0:41</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Keone Derain (ST. CHARLES EAST WC) won by decision over Colton West (XTREME WRESTLING) Dec 6-4</li>\n<li>Champ. Round 1 - Thomas Brennan (ORLAND PARK PIONEERS) won by decision over Tristan Smith (FALCON YOUTH WC) Dec 5-0</li>\n<li>Champ. Round 1 - Andrew Marsden (CRYSTAL LAKE WIZARDS) won by tech fall over Jared Finley (SHELBYVILLE JR RAMS WRESTLING) TF 16-0</li>\n<li>Champ. Round 1 - Kyle Betourne (BRAWLERS WC) won by fall over Riley Guttosch (NAPERVILLE WC) Fall 0:49</li>\n<li>Champ. Round 1 - Josiah Cropp (GENESEO SPIDER WC) won by fall over Josh Cowley (MURPHYSBORO WRESTLING) Fall 3:38</li>\n<li>Champ. Round 1 - Billy Sheehy (OAK FOREST WARRIORS) won by decision over George Bessette (LAKELAND PREDATORS) Dec 5-0</li>\n<li>Champ. Round 1 - Johnny Davidson (BARRINGTON BRONCOS) won by fall over Mike Kurtz (YORKVILLE WRESTLING CLUB) Fall 4:47</li>\n<li>Champ. Round 1 - Matt Kleinkopf (LITTLE HUSKIE WC) won by fall over Brock Barnes (PANTHER POWERHOUSE WC) Fall 2:55</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Brandon Elliott (HARLEM WRESTLING CLUB) won by fall over Wesley Kibler (SJO SPARTAN YOUTH WC) Fall 2:57</li>\n<li>Champ. Round 1 - Anfernee Hale (HARVEY TWISTERS) won by fall over Samuel Cleveland (BELLEVILLE LITTLE DEVILS) Fall 0:51</li>\n<li>Champ. Round 1 - Cole Deming (HILLSBORO JR TOPPERS) won by decision over Ethan Zinchuk (CHAMPAIGN KIDS WRESTLING) Dec 11-5</li>\n<li>Champ. Round 1 - Nathan Romero (DUNDEE HIGHLANDERS) won by decision over Juan Blanco Iv (MORTON LITTLE MUSTANGS) Dec 9-7</li>\n<li>Champ. Round 1 - Eric Bey (JUNIOR SPARTANS WC) won by tech fall over Grant Saldivar (KANE COUNTY GRAPPLERS) TF 20-4</li>\n<li>Champ. Round 1 - Jordan Sullivan (YORKVILLE WRESTLING CLUB) won by decision over Georgie Sosa (RAMS WRESTLING CLUB) Dec 8-4</li>\n<li>Champ. Round 1 - Ryan Pitra (GENESEO SPIDER WC) won by decision over Danny Saracco (BOLINGBROOK JUNIOR RAIDERS) Dec 6-0</li>\n<li>Champ. Round 1 - Michael Shaw (ST. CHARLES EAST WC) won by decision over Brandon Andino (GOMEZ WRESTLING ACADEMY) Dec 3-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Romeo Mcknight (CRYSTAL LAKE WIZARDS) won by tech fall over Key-sawn Girkin (FALCON YOUTH WC) TF 15-0</li>\n<li>Champ. Round 1 - Sanchir Avirmed (SHARKS WC) won by decision over Gavin Mitchell (METAMORA KIDS WC) Dec 9-5</li>\n<li>Champ. Round 1 - Jenner Hecox (HECOX TEAM BENAIAH) won by fall over Savannah Greenwall (SENECA IRISH CADETS) Fall 4:03</li>\n<li>Champ. Round 1 - Samuel Torrence (BARRINGTON BRONCOS) won by fall over Gant Wheeler (ROCHESTER WC) Fall 0:21</li>\n<li>Champ. Round 1 - Gavin Mcbride (EDWARDSVILLE WC) won by decision over Andrew Borgdorff (LITTLE HUSKIE WC) Dec 7-0</li>\n<li>Champ. Round 1 - Wesley Villarreal (KANE COUNTY GRAPPLERS) won by fall over Dylan Schultz (LINCOLN-WAY WC) Fall 1:22</li>\n<li>Champ. Round 1 - Bryce Gabel (BRAWLERS WC) won by fall over Evan Broniarczyk (TINLEY PARK BULLDOGS) Fall 1:15</li>\n<li>Champ. Round 1 - Dalton Blankenship (ROXANA KIDS WC) won by fall over Stefan Ivanisevic (HINSDALE WC) Fall 3:00</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Christian Embrey (LITTLE REDSKINS WC) won by fall over Jacob Walsh (FALCON WC) Fall 2:04</li>\n<li>Champ. Round 1 - Aaron Carter (FISHER WC) won by decision over Jamari Mcdonald (HARVEY TWISTERS) Dec 9-6</li>\n<li>Champ. Round 1 - Mikalan Evans (MT. ZION WC) won by fall over Chris Murino (ORLAND PARK PIONEERS) Fall 4:00</li>\n<li>Champ. Round 1 - Joseph Medina (GENESEO SPIDER WC) won by decision over Al`lon Carter (GLADIATORS) Dec 15-8</li>\n<li>Champ. Round 1 - Spencer Ellison (RED RAIDERS) won by fall over Shawn Hileman (GRANITE CITY WC) Fall 0:33</li>\n<li>Champ. Round 1 - Ryan Taylor (DOWNERS GROVE COUGARS) won by fall over Miles Rice (TREVIAN WC) Fall 4:03</li>\n<li>Champ. Round 1 - De`gyon Macklin (ROCKFORD WC) won by tech fall over Andrea Sennett (BISON WC) TF 15-0</li>\n<li>Champ. Round 1 - Sean Corey (GLENBARD EAST JR RAMS) won by decision over Nathan Crone (EDWARDSVILLE WC) Dec 1-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Kacy Jent (CHARLESTON WC) won by fall over Douglas Barkauski (LINCOLN-WAY WC) Fall 1:06</li>\n<li>Champ. Round 1 - Steven Raymond (EDWARDSVILLE WC) won by fall over Thomas Helton (ELMHURST JR. DUKES) Fall 4:03</li>\n<li>Champ. Round 1 - Blake Cripe (VANDALIA JR WRESTLING) won by fall over Anthony Watson (TITAN YOUTH WRESTLING) Fall 2:17</li>\n<li>Champ. Round 1 - Roger Thigpen (PLAINFIELD WC) won by fall over Kyle Eighner (MARTINEZ FOX VALLEY ELITE) Fall 1:10</li>\n<li>Champ. Round 1 - Patrick Kristin (TINLEY PARK BULLDOGS) won by fall over Arlandria Mcgowan (PEORIA RAZORBACKS YOUTH WC) Fall 2:11</li>\n<li>Champ. Round 1 - Daniel Andress (JUNIOR COUGARS WC) won by fall over Jack Golnick (GOLDEN EAGLES WC) Fall 2:46</li>\n<li>Champ. Round 1 - Allen Stallings (GLADIATORS) won by fall over Blake Zalapi (HONONEGAH KIDS WC) Fall 1:01</li>\n<li>Champ. Round 1 - Josh Bernius (METAMORA KIDS WC) won by decision over Kevin Smith (JUNIOR COUGARS WC) Dec 6-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Austin Ellery (LIL` STORM) won by fall over Rodrigo Castaneda (WOLFPAK WC) Fall 3:57</li>\n<li>Champ. Round 1 - Isaac Flores (CARBONDALE WC) won by fall over David Newman (INDIANS ELITE) Fall 4:12</li>\n<li>Champ. Round 1 - Onycai Lawson (RANTOUL JUNIOR EAGLES) won by fall over Luke Curtis (ROXANA KIDS WC) Fall 0:54</li>\n<li>Champ. Round 1 - Alexander Girona (LAKELAND PREDATORS) won by major decision over Travis Surprenant (BRAWLERS WC) Maj 16-2</li>\n<li>Champ. Round 1 - Frank Tomaskovic (VITTUM CATS) won by major decision over Chancey Fitch (LITTLE ROCKETS) Maj 15-2</li>\n<li>Champ. Round 1 - Nick Hayes (NAPERVILLE WC) won by fall over Maxwell Oswalt (SAUK VALLEY WC) Fall 2:28</li>\n<li>Champ. Round 1 - Ian Harwick (HARLEM WRESTLING CLUB) won by fall over Jacob Van Doren (GENESEO SPIDER WC) Fall 0:23</li>\n<li>Champ. Round 1 - Joshua King (PROVISO POWERHOUSE WC) won by decision over Joe Spivak (DOWNERS GROVE COUGARS) Dec 14-7</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Ibrahim Nasir (MAINE EAGLES) won by fall over Jordan Reed (BELLEVILLE JUNIOR HIT SQUAD) Fall 0:19</li>\n<li>Champ. Round 1 - Bryan Andrews (GLENBARD EAST JR RAMS) won by fall over Tyler Caldwell (YORKVILLE WRESTLING CLUB) Fall 2:14</li>\n<li>Champ. Round 1 - Alexander Zentner (BARRINGTON BRONCOS) won by fall over Curtis Hardy (ROCKET FUEL WC) Fall 0:11</li>\n<li>Champ. Round 1 - Jason Benhoff (CLIPPER WC) won by fall over Roberto Quintero (SOUTHSIDE STALLIONS) Fall 0:55</li>\n<li>Champ. Round 1 - Devon Sieveking (BENTON JR WC) won by fall over Joshua Stark (BRAWLERS WC) Fall 2:06</li>\n<li>Champ. Round 1 - Derek Caskey (MARENGO YOUTH WRESTLING) won by fall over Jamezz Kimbrough (HARVEY TWISTERS) Fall 2:47</li>\n<li>Champ. Round 1 - Andrew Wise (ACES WC) won by decision over Kodi Lock (BELVIDERE BANDITS) Dec 4-2</li>\n<li>Champ. Round 1 - Robert Stark (ORLAND PARK PIONEERS) won by decision over Johnny Reed (RENEGADE WC (NFP)) Dec 6-4</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Joshua Mitchell (LITTLE HUSKIE WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Devin Knight (SYCAMORE WC) won by fall over Karim Fuentes (GLADIATORS) Fall 1:58</li>\n<li>Champ. Round 1 - Jake Ford (MUSTANG WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Tristan Miller (THE LAW) won by fall over Raul Espana (RAMS WRESTLING CLUB) Fall 0:23</li>\n<li>Champ. Round 1 - Ryan Ramirez (LITTLE FALCONS WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - James Davis (ROCHELLE WC) won by fall over Austin Fritzgerald (JUNIOR SPARTANS WC) Fall 0:44</li>\n<li>Champ. Round 1 - Sammy Perez (DUNDEE HIGHLANDERS) received a bye   () Bye</li>\n<li>Champ. Round 1 - Trever Prather (JACKSONVILLE AREA YOUTH WRESTLING) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Brady Powers (HONONEGAH KIDS WC) won by fall over Valentino Ortiz (SOUTHSIDE STALLIONS) Fall 4:27</li>\n<li>Champ. Round 1 - Charlie Roth (DOWNERS GROVE COUGARS) won by decision over Dennis Wright (BLACKHAWK WC) Dec 8-2</li>\n<li>Champ. Round 1 - Greylin Powers (GRANITE CITY WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Zachery Mccullough (DUNDEE HIGHLANDERS) won by fall over Joe Antonelli (SCN YOUTH WC) Fall 2:17</li>\n<li>Champ. Round 1 - Jordan Reich (WRESTLING FACTORY) won by decision over Kirk Johansen (VILLA LOMBARD COUGARS) Dec 5-3</li>\n<li>Champ. Round 1 - Sean Augello (FORCE WRESTLING) won by decision over Nick Lukanich (VITTUM CATS) Dec 4-1</li>\n<li>Champ. Round 1 - Rudy Yates (VITTUM CATS) won by decision over Carlos Fuentez (VILLA LOMBARD COUGARS) Dec 5-3</li>\n<li>Champ. Round 1 - Matthew Crnich (LINCOLN-WAY WC) won by major decision over Alex Moyer (RIVERDALE JR RAMS WC) Maj 14-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Dakota Paris (HARLEM WRESTLING CLUB) won by major decision over Jacob Depauw (GENESEO SPIDER WC) Maj 13-2</li>\n<li>Champ. Round 1 - Rick Nashkoff (LITTLE CELTIC WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Quinn Doherty (ST. CHARLES EAST WC) won by tech fall over Dominic Mcclimens (EDWARDSVILLE WC) TF 18-1</li>\n<li>Champ. Round 1 - Brody Vester (YORKVILLE WRESTLING CLUB) won by major decision over Brian Sweeney (NAPERVILLE WC) Maj 12-0</li>\n<li>Champ. Round 1 - Noell Carrillo (WRESTLING FACTORY) won by fall over Omar Delatorre (MARTINEZ FOX VALLEY ELITE) Fall 2:48</li>\n<li>Champ. Round 1 - Gunner Wenger (THE LAW) won by fall over Ralph Hernandez (SOUTHSIDE COMETS) Fall 2:17</li>\n<li>Champ. Round 1 - Miguel Silva Jr (MARTINEZ FOX VALLEY ELITE) won by fall over Michael Altendorf (CARY MATMEN WC) Fall 0:40</li>\n<li>Champ. Round 1 - Steven Fessler (VITTUM CATS) won by fall over James Von Meding (ST. TARCISSUS) Fall 2:50</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Jakob Worms (ILLINI BLUFFS WC) won by decision over Matthew Watson (LIL` STORM) Dec 10-4</li>\n<li>Champ. Round 1 - Mike Falco (SOUTHSIDE STALLIONS) won by decision over Chase Worthey (BENTON JR WC) Dec 7-0</li>\n<li>Champ. Round 1 - Dan Davis (TINLEY PARK BULLDOGS) won by fall over Peter Campo (RIVERTON HAWKS WRESTLING) Fall 1:11</li>\n<li>Champ. Round 1 - Jeremy O`gara (ROXANA KIDS WC) won by fall over Tyler Allen (MOLINE WC) Fall 2:05</li>\n<li>Champ. Round 1 - Dominic Naso (FORCE WRESTLING) won by fall over Graham Novak (NAPERVILLE WC) Fall 3:00</li>\n<li>Champ. Round 1 - Jake Holian (CRYSTAL LAKE WIZARDS) won by decision over Grayson Kaspar (GOMEZ WRESTLING ACADEMY) Dec 9-2</li>\n<li>Champ. Round 1 - Nicholas Deprima (VILLA LOMBARD COUGARS) won by major decision over Kegan Calkins (LITTLE FALCONS WC) Maj 13-2</li>\n<li>Champ. Round 1 - Austin Ryan (CRYSTAL LAKE WIZARDS) won by fall over Shane Mart (INDIANS ELITE) Fall 3:51</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Kyle Simpkins (BRAWLERS WC) won by fall over Michael Burke (TINLEY PARK BULLDOGS) Fall 4:11</li>\n<li>Champ. Round 1 - Adam Mcconnell (BELVIDERE BANDITS) won by decision over Sevonte Mcgrown (LIONHEART INTENSE WRESTLING) Dec 4-0</li>\n<li>Champ. Round 1 - Mario Leveille (OAK FOREST WARRIORS) won by fall over Kaleb Cheung (SPRINGFIELD CAPITAL KIDS WC) Fall 2:42</li>\n<li>Champ. Round 1 - Daniel Valenzio (FORCE WRESTLING) won by decision over Logan Lundelius (CRYSTAL LAKE WIZARDS) Dec 7-5</li>\n<li>Champ. Round 1 - Colin Parsons (BATAVIA PINNERS) won by decision over Trey Westbrook (CENTRALIA) Dec 7-2</li>\n<li>Champ. Round 1 - Kasey Jauch (ARLINGTON CARDINALS) won by decision over Jake Wilson (PEORIA HEIGHTS MINUTEMEN) Dec 5-4</li>\n<li>Champ. Round 1 - Tyler Dehaven (ROCK ISLAND WC) won by fall over Norman Robinson (JJK WRESTLING) Fall 2:21</li>\n<li>Champ. Round 1 - Ellis Diveney (FOX VALLEY WC) won by decision over Zach Wolf (JUNIOR COUGARS WC) Dec 5-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Pj Riley (SHELBYVILLE JR RAMS WRESTLING) won by decision over Fred Johnson (HARVEY TWISTERS) Dec 6-2</li>\n<li>Champ. Round 1 - Jacob Plekavic (JR. BLAZER WC) won by fall over Jordan Scalice (GOMEZ WRESTLING ACADEMY) Fall 2:51</li>\n<li>Champ. Round 1 - Jimmy Davis (WAUBONSIE WC) won by fall over Brockman Immke (SJO SPARTAN YOUTH WC) Fall 2:09</li>\n<li>Champ. Round 1 - Hasan Muhammad (RENEGADE WC (NFP)) won by decision over Levi Smith (LAKELAND PREDATORS) Dec 10-9</li>\n<li>Champ. Round 1 - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by fall over Jake Domke (FALCON WC) Fall 2:52</li>\n<li>Champ. Round 1 - Sean Mulligan (EDWARDSVILLE WC) won by decision over Riley Sweetland (L-P CRUNCHING CAVS) Dec 1-0</li>\n<li>Champ. Round 1 - Jason Moerlien (GRANITE CITY WC) won by decision over Nelson Baker (XTREME WRESTLING) Dec 3-2</li>\n<li>Champ. Round 1 - Cory Winchell (LITTLE CELTIC WC) won by decision over Brandon Ahlgrim (SAUK VALLEY WC) Dec 2-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Kyle White (METAMORA KIDS WC) won by fall over Nicholas Flannell (TAYLORVILLE WC) Fall 2:05</li>\n<li>Champ. Round 1 - Anthony Berta (LEMONT BEARS WC) won by decision over Kyle Rodriguez (MARTINEZ FOX VALLEY ELITE) Dec 10-4</li>\n<li>Champ. Round 1 - Christopher Golden (VITTUM CATS) won by fall over Tyler Bordner (LITTLE REDSKINS WC) Fall 4:02</li>\n<li>Champ. Round 1 - Nicholas Ferraro (SCN YOUTH WC) won by fall over Zach Mittman (CHAMPAIGN KIDS WRESTLING) Fall 3:34</li>\n<li>Champ. Round 1 - Xavier Buchanan (ROCKFORD WC) won by decision over Mason Lee (EDWARDSVILLE WC) Dec 6-1</li>\n<li>Champ. Round 1 - Danny Carlson (REBELS WC) won by injury default over Sean Sibley (FALCON WC) Inj. 0:00</li>\n<li>Champ. Round 1 - Clayton Derousse (GRANITE CITY WC) won by fall over Cedric Chambers (RICH RATTLERS WC) Fall 2:48</li>\n<li>Champ. Round 1 - Israel Santiago (GRAPPLIN` DEVILS WC) won by major decision over Tanner Anthony (HARLEM WRESTLING CLUB) Maj 12-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Brady Best (CHILLI DAWGS WC) won by fall over Nick Poff (SJO SPARTAN YOUTH WC) Fall 0:58</li>\n<li>Champ. Round 1 - Andrew Abitua (SHOOTERS ELITE WC) won by decision over Luke Schlueter (EDWARDSVILLE WC) Dec 7-0</li>\n<li>Champ. Round 1 - Nicholas Gil (CRYSTAL LAKE WIZARDS) won by fall over Haratio Austin (SPRINGFIELD CAPITAL KIDS WC) Fall 2:25</li>\n<li>Champ. Round 1 - Ethan Jones (RIVERBEND WC) won by decision over Nicholas Notestine (O`FALLON LITTLE PANTHERS) Dec 5-0</li>\n<li>Champ. Round 1 - John Blanke (BARRINGTON BRONCOS) won by decision over Alante Walker (ORLAND PARK PIONEERS) Dec 8-1</li>\n<li>Champ. Round 1 - Kyle Hayes (VITTUM CATS) won by decision over Abel Gonzalez (MARTINEZ FOX VALLEY ELITE) Dec 9-2</li>\n<li>Champ. Round 1 - Johnny Pellegrino (ORLAND PARK PIONEERS) won by fall over Taj Marks (GLADIATORS) Fall 1:05</li>\n<li>Champ. Round 1 - Josh Martin (GLENBARD EAST JR RAMS) won by decision over Alex Cowan (JR. BLAZER WC) Dec 9-4</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Nicholas Bonomo (BRONCO WRESTLING) won by fall over Jacob Figge (MIDWEST CENTRAL YOUTH) Fall 3:00</li>\n<li>Champ. Round 1 - Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) won by fall over Peter Bonvillain (THE LAW) Fall 2:39</li>\n<li>Champ. Round 1 - Thomas O`brien (SCN YOUTH WC) won by major decision over Isaiah Stedwill (CENTRAL ELITE REBELS) Maj 12-2</li>\n<li>Champ. Round 1 - James Kaht (RICHMOND WC) won by fall over Austin Ventris (MOLINE WC) Fall 2:04</li>\n<li>Champ. Round 1 - Morgan Drew (WRESTLING FACTORY) won by fall over Andrew Tesch (VITTUM CATS) Fall 1:56</li>\n<li>Champ. Round 1 - John Kriha (CROSSTOWN WC) won by fall over Garrett Gresham (PANTHER POWERHOUSE WC) Fall 1:04</li>\n<li>Champ. Round 1 - Brent Hakeman (BRAWLERS WC) won by decision over Jacob Caulfield (MUSTANG WC) Dec 3-0</li>\n<li>Champ. Round 1 - Xavier Montalvo (GOMEZ WRESTLING ACADEMY) won by decision over Dequarius Millett (GRANITE CITY WC) Dec 6-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Mack Anderson (SPRINGFIELD CAPITAL KIDS WC) won by decision over Zach Wehde (GOMEZ WRESTLING ACADEMY) Dec 9-6</li>\n<li>Champ. Round 1 - Luke Gruszka (MARTINEZ FOX VALLEY ELITE) won by fall over Daniel Krug (BENTON JR WC) Fall 0:40</li>\n<li>Champ. Round 1 - Anthony Scaccia (SCN YOUTH WC) won by fall over Michael Cler (FALCON YOUTH WC) Fall 0:51</li>\n<li>Champ. Round 1 - Tommy Brewster (MAINE EAGLES) won by major decision over Alec Foutch (EDWARDSVILLE WC) Maj 14-0</li>\n<li>Champ. Round 1 - Timothy Schanmier (DUNDEE HIGHLANDERS) won by fall over Bradlee Crnich (OAK FOREST WARRIORS) Fall 2:33</li>\n<li>Champ. Round 1 - Collin Grant (RIVERBEND WC) won by fall over Kevin Mcnally (CROSSTOWN WC) Fall 2:56</li>\n<li>Champ. Round 1 - Austin Shoup (SAUK VALLEY WC) won by decision over Dylan Foster (SYCAMORE WC) Dec 3-1</li>\n<li>Champ. Round 1 - Jim Brennan (LEMONT BEARS WC) won by fall over David Conway (FALCON WC) Fall 2:26</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Javier Montalvo (LINCOLN-WAY WC) won by fall over Nick Root (LITTLE CYCLONE WC) Fall 0:44</li>\n<li>Champ. Round 1 - Tyre Lee (RENEGADE WC (NFP)) won by fall over Andrew Conrad (LITTLE FALCONS WC) Fall 1:15</li>\n<li>Champ. Round 1 - Laren Eustace (BATAVIA PINNERS) won by fall over Wyatt Kinderman (BISMARCK HENNING WC) Fall 1:00</li>\n<li>Champ. Round 1 - Michael Shanahan (CHICAGO WOLVES DEN) won by decision over Jeff Klank (INDIANS ELITE) Dec 6-5</li>\n<li>Champ. Round 1 - Tommy Calkins (MAINE EAGLES) won by fall over Scott Schulte (GENESEO SPIDER WC) Fall 2:38</li>\n<li>Champ. Round 1 - Cameron Throneberry (EDWARDSVILLE WC) won by fall over Trevor Jones (WEST CARROLL WC) Fall 2:29</li>\n<li>Champ. Round 1 - Keegan Gardner (WEST FRANKFORT JR WRESTLING) won by major decision over Nicholas Whitehead (ZEE BEE STINGERS) Maj 10-2</li>\n<li>Champ. Round 1 - Zachary Benkovich (HONONEGAH KIDS WC) won by fall over Malcolm Levy (YORKVILLE WRESTLING CLUB) Fall 1:20</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Brandon Dean (BATAVIA PINNERS) won by fall over Zachary Mooney (HONONEGAH KIDS WC) Fall 1:26</li>\n<li>Champ. Round 1 - Toby Lee (CROSSTOWN WC) won by fall over Tate Manka (RIVERTON HAWKS WRESTLING) Fall 3:57</li>\n<li>Champ. Round 1 - Maxwell Kuhrt (HARLEM WRESTLING CLUB) won by fall over Antonio Francis IV (CHAMPAIGN KIDS WRESTLING) Fall 1:13</li>\n<li>Champ. Round 1 - Dominic Garza (LITTLE FALCONS WC) won by injury default over Mark Dinardo (FORCE WRESTLING) Inj. 0:00</li>\n<li>Champ. Round 1 - Blaine Wilson (QUINCY WC) won by decision over Davonte Ackins (JJK WRESTLING) Dec 8-7</li>\n<li>Champ. Round 1 - Michael Carbajal (WAUKEGAN YOUTH WC) won by decision over Adam Pilota (VITTUM CATS) Dec 9-2</li>\n<li>Champ. Round 1 - Zac Keller (LAKELAND PREDATORS) won by major decision over Mitchel Humphrey (MENDOTA MAT MASTERS) Maj 12-4</li>\n<li>Champ. Round 1 - Kane Garcia (ACES WC) won by decision over Pedro Mata (LEMONT BEARS WC) Dec 4-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Kailor Hecox (HECOX TEAM BENAIAH) won by decision over Dallas Messmore (BISMARCK HENNING WC) Dec 5-1</li>\n<li>Champ. Round 1 - Max Andersen (LAWRENCE COUNTY WC) won by fall over Joshua Smith (OAK LAWN SPARTAN YOUTH WC NFP) Fall 2:55</li>\n<li>Champ. Round 1 - Bo Taylor (ACES WC) won by tech fall over Latrey Reed (TITAN YOUTH WRESTLING) TF 17-0</li>\n<li>Champ. Round 1 - Brian Pence (CRYSTAL LAKE WIZARDS) won by fall over Mike Reeze (MORTON LITTLE MUSTANGS) Fall 2:40</li>\n<li>Champ. Round 1 - Cain Bialas (WW TIGER WC) won by major decision over Masen Matesevic (FORCE WRESTLING) Maj 16-3</li>\n<li>Champ. Round 1 - Alec Basso (MAINE EAGLES) won by decision over Aaron Baughman (KNOX COUNTY KRUSHERS) Dec 10-3</li>\n<li>Champ. Round 1 - August Tholl (ORLAND PARK PIONEERS) won by fall over Francis Caparula (JUNIOR PIONEER WC) Fall 3:29</li>\n<li>Champ. Round 1 - Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) won by fall over David Witczak (HOFFMAN ESTATES WC) Fall 2:29</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Bryce Gorman (LITTLE CELTIC WC) won by decision over Jeremy Rivers (WESTVILLE YOUTH WC) Dec 9-3</li>\n<li>Champ. Round 1 - Anthony Ferraro (GOMEZ WRESTLING ACADEMY) won by decision over Bradley Dunn (CRYSTAL LAKE WIZARDS) Dec 4-1</li>\n<li>Champ. Round 1 - Matthew Stopka (MAD DOG WRESTLING ACADEMY) won by major decision over Austin Rosenbaum (FALCON YOUTH WC) Maj 9-0</li>\n<li>Champ. Round 1 - Sean Kelly (LITTLE CELTIC WC) won by fall over Victor Devora (DUNDEE HIGHLANDERS) Fall 3:46</li>\n<li>Champ. Round 1 - Nathan Cooper (ACES WC) won by tech fall over Iovanny Campos (BATAVIA PINNERS) TF 17-2</li>\n<li>Champ. Round 1 - Frank Battaglia (REDHAWK WC) won by fall over Aiden Ford (JUNIOR PIONEER WC) Fall 0:48</li>\n<li>Champ. Round 1 - Bruce Henley (JJK WRESTLING) won by fall over Ryan Darby (KNOX COUNTY KRUSHERS) Fall 0:22</li>\n<li>Champ. Round 1 - Billy Fett (TINLEY PARK BULLDOGS) won by decision over Joseph Helton (ELMHURST JR. DUKES) Dec 4-3</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - AJ Friedrich (METAMORA KIDS WC) won by major decision over Nickolas Ruepke (CENTRALIA) Maj 9-1</li>\n<li>Champ. Round 1 - Tom Schofield (MUSTANG WC) won by decision over Mackenzie Noel (BISMARCK HENNING WC) Dec 7-0</li>\n<li>Champ. Round 1 - Rich Scheib (SPRINGFIELD CAPITAL KIDS WC) won by fall over Dj Schmidt (FALCON WC) Fall 1:26</li>\n<li>Champ. Round 1 - Deuce Rachal (HARVEY TWISTERS) won by fall over Christian Miles (PEORIA RAZORBACKS YOUTH WC) Fall 0:44</li>\n<li>Champ. Round 1 - Nathaniel Magiera (WOLVES WC) won by fall over Devonta Herndon (JJK WRESTLING) Fall 0:50</li>\n<li>Champ. Round 1 - Paul Pennington (VILLA LOMBARD COUGARS) won by decision over Michael Maduko (BRONCO WRESTLING) Dec 7-2</li>\n<li>Champ. Round 1 - Tyler Barton (SYCAMORE WC) won by fall over David Baureis (HOFFMAN ESTATES WC) Fall 2:37</li>\n<li>Champ. Round 1 - Anthony Napolitano (WAUBONSIE WC) won by fall over Tanon Leonard (PANTHER POWERHOUSE WC) Fall 1:58</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Collin Hopkins (ARGENTA-OREANA KIDS CLUB) won by decision over Chris Yaros (ORLAND PARK PIONEERS) Dec 5-0</li>\n<li>Champ. Round 1 - Dee Alexander (LITTLE FALCONS WC) won by major decision over Andrew Einspahr (BENTON JR WC) Maj 11-3</li>\n<li>Champ. Round 1 - Terrion Jones (JJK WRESTLING) won by fall over Donald Coffey (HONONEGAH KIDS WC) Fall 0:45</li>\n<li>Champ. Round 1 - Keagan Griffin (FORCE WRESTLING) won by fall over Brent Lindenman (FOX VALLEY WC) Fall 1:05</li>\n<li>Champ. Round 1 - Jascent Harvey (LITTLE FALCONS WC) won by fall over Diandre Smith (CALUMET M.P.D. WOLVERINES) Fall 3:34</li>\n<li>Champ. Round 1 - Ty Harmston (RENEGADES (STOCKTON)) won by fall over Alex Rader (MAD DOG WRESTLING ACADEMY) Fall 1:39</li>\n<li>Champ. Round 1 - Andres Heredia (VITTUM CATS) won by fall over Daniel Mccaslin (DAKOTA WC) Fall 0:42</li>\n<li>Champ. Round 1 - Dandre Johnson (VILLA LOMBARD COUGARS) won by major decision over Timothy Maddox (GRAPPLIN` DEVILS WC) Maj 13-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Kyle Tex (TAYLORVILLE WC) won by fall over Kyle Roe (MURPHYSBORO WRESTLING) Fall 2:20</li>\n<li>Champ. Round 1 - Nicholas Czar (HIGHLAND BULLDOG JR WC) won by fall over Jeffrey Tyler (FALCON WC) Fall 3:38</li>\n<li>Champ. Round 1 - Shane Favier (MURPHYSBORO WRESTLING) won by fall over Bryan Medler (FALCON YOUTH WC) Fall 1:52</li>\n<li>Champ. Round 1 - Jordan Harrison (RICH RATTLERS WC) won by fall over Anthony Sayre (JUNIOR SPARTANS WC) Fall 4:24</li>\n<li>Champ. Round 1 - Noah Fleckenstein (LIONS WC) won by fall over Zachary Hare (STILLMAN VALLEY WC) Fall 2:10</li>\n<li>Champ. Round 1 - Josh Davis (ROCK ISLAND WC) won by decision over Anthony Yanan (LITTLE FALCONS WC) Dec 11-7</li>\n<li>Champ. Round 1 - Simon Montez (BELVIDERE BANDITS) won by fall over Anthony Marmion (GENESEO SPIDER WC) Fall 0:53</li>\n<li>Champ. Round 1 - Nicky Allegretti (VITTUM CATS) won by major decision over Connor Mckeehan (BATAVIA PINNERS) Maj 12-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Ortmann (ARGENTA-OREANA KIDS CLUB) won by decision over Joseph Disanti (BARTLETT JR HAWKS) Dec 5-2</li>\n<li>Champ. Round 1 - Harry Potts (KANE COUNTY GRAPPLERS) won by fall over William Canales (SAUK VALLEY WC) Fall 3:18</li>\n<li>Champ. Round 1 - Erik Aguirre (TOMCAT WC) won by decision over Frank Pavlik (PALATINE PANTHERS WC) Dec 3-0</li>\n<li>Champ. Round 1 - Jake Pruitt (WESTVILLE YOUTH WC) won by decision over Ben Miller (QUINCY WC) Dec 4-2</li>\n<li>Champ. Round 1 - Matthew Kent (EDWARDSVILLE WC) won by fall over Brandon Minniti (PLAINFIELD WC) Fall 2:40</li>\n<li>Champ. Round 1 - Blake Hooper (TAYLORVILLE WC) won by fall over Brandon Anderson (WEST CARROLL WC) Fall 2:48</li>\n<li>Champ. Round 1 - Daniel Garcia (MURPHYSBORO WRESTLING) won by fall over Kyle Wallace (HONONEGAH KIDS WC) Fall 2:34</li>\n<li>Champ. Round 1 - Jabari Jones (RENEGADE WC (NFP)) won in double overtime over Olajuwon Bowen (EVANSTON SCHOOL OF WRESTLING) 2-OT 7-6</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Jacob Crounk (GLENBARD EAST JR RAMS) received a bye   () Bye</li>\n<li>Champ. Round 1 - Pat Bieber (MC BULLDOGS) received a bye   () Bye</li>\n<li>Champ. Round 1 - Bobby Carson (ELMHURST JR. DUKES) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Nicholas Wolf (FORCE WRESTLING) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jeremiah Binion (GLENBARD EAST JR RAMS) received a bye   () Bye</li>\n<li>Champ. Round 1 - Rodolfo Antuna (FALCON WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Kyle Szlenk (CRYSTAL LAKE WIZARDS) won by decision over Nicholas Norris (CHILLI DAWGS WC) Dec 1-0</li>\n<li>Champ. Round 2 - Marcus Povlick (FORCE WRESTLING) won by fall over Joey Melendez (BRONCO WRESTLING) Fall 2:48</li>\n<li>Champ. Round 2 - Chrishon Tucker (JJK WRESTLING) won by fall over Jonathon Moran (HARVEY TWISTERS) Fall 3:38</li>\n<li>Champ. Round 2 - Pat Walker (GOMEZ WRESTLING ACADEMY) won by decision over Anthony Madrigal (BRONCO WRESTLING) Dec 5-2</li>\n<li>Champ. Round 2 - Louie Hayes (MARTINEZ FOX VALLEY ELITE) won by tech fall over Kevin Radcliff (GOMEZ WRESTLING ACADEMY) TF 17-0</li>\n<li>Champ. Round 2 - Travis Piotrowski (WOLVES WC) won by decision over Jason Stokes (LITTLE CELTIC WC) Dec 4-0</li>\n<li>Champ. Round 2 - Cooper Secker (UNITED SOUTHERN ALLSTARS) won by major decision over Brent Ochoa (VITTUM CATS) Maj 8-0</li>\n<li>Champ. Round 2 - Dack Punke (CENTRAL ELITE REBELS) won by major decision over Trentin Rilea (FULTON COUNTY STINGERS) Maj 17-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Logan Voss (SAUK VALLEY WC) won by fall over We Rachel (HARVEY TWISTERS) Fall 0:54</li>\n<li>Champ. Round 2 - Christian Kanzler (WRESTLING FACTORY) won by decision over James Higdon (COLLINSVILLE RAIDERS) Dec 8-2</li>\n<li>Champ. Round 2 - Dylan Duncan (SCN YOUTH WC) won by tech fall over Jarod Foiles (ROXANA KIDS WC) TF 16-1</li>\n<li>Champ. Round 2 - Brady Wilsie (XTREME WRESTLING) won by decision over Liam Meagher (LITTLE CELTIC WC) Dec 4-1</li>\n<li>Champ. Round 2 - Jason Renteria (BRONCO WRESTLING) won by major decision over Alec Meronk (METAMORA KIDS WC) Maj 15-7</li>\n<li>Champ. Round 2 - Michael Mcgee (FORCE WRESTLING) won by fall over Jaleel Hollingsworth (LITTLE HUSKIE WC) Fall 2:40</li>\n<li>Champ. Round 2 - Anthony Cheloni (SCN YOUTH WC) won by fall over Tyler Moon (UNITED SOUTHERN ALLSTARS) Fall 2:45</li>\n<li>Champ. Round 2 - Zachary Lorek (TINLEY PARK BULLDOGS) won by decision over John Paul Stedwill (CENTRAL ELITE REBELS) Dec 7-5</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Christopher Dranka (CRYSTAL LAKE WIZARDS) won by decision over Blaize Punke (CENTRAL ELITE REBELS) Dec 6-0</li>\n<li>Champ. Round 2 - Cameron Roat (LITTLE CELTIC WC) won by decision over Jacob Dudeck (TINLEY PARK BULLDOGS) Dec 6-4</li>\n<li>Champ. Round 2 - Peter Ogunsanya (HARVEY TWISTERS) won by fall over Kolbe O`brien (SCN YOUTH WC) Fall 2:14</li>\n<li>Champ. Round 2 - Austin Gomez (GOMEZ WRESTLING ACADEMY) won by major decision over Jarrid Braunagel (O`FALLON LITTLE PANTHERS) Maj 14-2</li>\n<li>Champ. Round 2 - Hunter Vester (YORKVILLE WRESTLING CLUB) won by fall over Kyle Bernat (SCN YOUTH WC) Fall 2:40</li>\n<li>Champ. Round 2 - Gavin Sutton (GOMEZ WRESTLING ACADEMY) won by fall over Jevon Hey (BELLEVILLE LITTLE DEVILS) Fall 3:21</li>\n<li>Champ. Round 2 - Christian Robertson (VITTUM CATS) won by decision over Hazen Rice (MAD DOG WRESTLING ACADEMY) Dec 2-1</li>\n<li>Champ. Round 2 - Tristan Birt (FALCON YOUTH WC) won by decision over Dustin Swanson (ROCKFORD WC) Dec 6-5</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Thomas Svestka (MARTINEZ FOX VALLEY ELITE) won by fall over Cameron White (HARVEY TWISTERS) Fall 3:49</li>\n<li>Champ. Round 2 - Kyle Peisker (GOMEZ WRESTLING ACADEMY) won by tech fall over Christian Fausel (HONONEGAH KIDS WC) TF 16-0</li>\n<li>Champ. Round 2 - Braxten Ary (MIDWEST CENTRAL YOUTH) won by decision over Demarius Terhune (CHAMPAIGN KIDS WRESTLING) Dec 7-3</li>\n<li>Champ. Round 2 - Dalton Brito (EDWARDSVILLE WC) won by decision over Zachary Krause (FORCE WRESTLING) Dec 7-1</li>\n<li>Champ. Round 2 - Brandon Critchfield (UNITED SOUTHERN ALLSTARS) won by decision over Nolan Baker (XTREME WRESTLING) Dec 9-6</li>\n<li>Champ. Round 2 - Andrew Mcfall (FORCE WRESTLING) won in overtime over Patrick Augustyn (GOMEZ WRESTLING ACADEMY) OT 6-5</li>\n<li>Champ. Round 2 - Austin O`connor (TINLEY PARK BULLDOGS) won by tech fall over Hunter Webb (SAUK VALLEY WC) TF 21-3</li>\n<li>Champ. Round 2 - Jake Barzowski (BRONCO WRESTLING) won by decision over Dalton Kinison (SPRINGFIELD CAPITAL KIDS WC) Dec 12-6</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Shaun Wasso (LITTLE CELTIC WC) won by fall over Javeontae Crider (LIONHEART INTENSE WRESTLING) Fall 5:49</li>\n<li>Champ. Round 2 - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won by decision over Jacob Silzer (TINLEY PARK BULLDOGS) Dec 6-1</li>\n<li>Champ. Round 2 - Keegan Powers (HONONEGAH KIDS WC) won by fall over Nicholas Burke (LIONS WC) Fall 1:17</li>\n<li>Champ. Round 2 - Devin Kane (MARTINEZ FOX VALLEY ELITE) won by fall over Marquez Roberson (BELLEVILLE LITTLE DEVILS) Fall 3:55</li>\n<li>Champ. Round 2 - Aj Jaffe (SCN YOUTH WC) won by tech fall over Jacob Orth (CRYSTAL LAKE WIZARDS) TF 17-2</li>\n<li>Champ. Round 2 - Mitchell Stathakis (BARRINGTON BRONCOS) won by decision over Brandon Hanik (VITTUM CATS) Dec 1-0</li>\n<li>Champ. Round 2 - Will Lucie (WEST HANCOCK TITAN WC) won by decision over Kyle Ruettiger (LINCOLN-WAY WC) Dec 7-2</li>\n<li>Champ. Round 2 - Garrett Dziedzic (CRYSTAL LAKE WIZARDS) won by decision over Johnathan Turner (SPRINGFIELD CAPITAL KIDS WC) Dec 2-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Dylan Elmore (HARLEM WRESTLING CLUB) won by fall over Carter Pillen (GENESEO SPIDER WC) Fall 4:01</li>\n<li>Champ. Round 2 - Trent Rakers (HIGHLAND BULLDOG JR WC) won by decision over Roberto Campos (BOLINGBROOK JUNIOR RAIDERS) Dec 5-4</li>\n<li>Champ. Round 2 - Matt Rowland (SCN YOUTH WC) won by decision over Camiran Sadeghi (WEST HANCOCK TITAN WC) Dec 10-4</li>\n<li>Champ. Round 2 - Kordell Norfleet (HARVEY TWISTERS) won by major decision over Zachary Akers (INDIANS ELITE) Maj 13-3</li>\n<li>Champ. Round 2 - David Kasper (SOUTHSIDE STALLIONS) won by decision over Ben Schneider (ORLAND PARK PIONEERS) Dec 7-2</li>\n<li>Champ. Round 2 - Jake Drew (GOMEZ WRESTLING ACADEMY) won by major decision over Drake Boverie (BULLS WC) Maj 9-0</li>\n<li>Champ. Round 2 - Riley Beard (PEORIA RAZORBACKS YOUTH WC) won by decision over Jacob Hawkins (SHOOTERS ELITE WC) Dec 7-2</li>\n<li>Champ. Round 2 - Antonio Alvarez (OAKWOOD WC) won by decision over Gabe Johnson (CLUB ATTACK) Dec 4-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Michael Callahan (SCN YOUTH WC) won by major decision over Vaughn Hobart (PONTIAC WC) Maj 10-2</li>\n<li>Champ. Round 2 - Gabriel Townsell (GLADIATORS) won by decision over Nathan Olsen (DAKOTA WC) Dec 4-3</li>\n<li>Champ. Round 2 - James Wolfe (SHOOTERS ELITE WC) won by decision over Peter Perich (FORCE WRESTLING) Dec 4-0</li>\n<li>Champ. Round 2 - Jimmy Gallardo (GOMEZ WRESTLING ACADEMY) won by fall over Ryon Richardson (CLIPPER WC) Fall 1:52</li>\n<li>Champ. Round 2 - Vincent Turk (CRYSTAL LAKE WIZARDS) won by decision over Nicky Gasbarro (JUNIOR SPARTANS WC) Dec 3-2</li>\n<li>Champ. Round 2 - Alex Madrigal (BRONCO WRESTLING) won by decision over Logan Mcclellan (BELLEVILLE LITTLE DEVILS) Dec 8-1</li>\n<li>Champ. Round 2 - Jake Tisza (JUNIOR SPARTANS WC) won by decision over Tanner Coleman (PEORIA HEIGHTS MINUTEMEN) Dec 8-3</li>\n<li>Champ. Round 2 - Ryder Punke (CENTRAL ELITE REBELS) won by major decision over Jack Jessen (VILLA PARK YOUNG WARRIORS) Maj 10-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Noah Drabek (LAKELAND PREDATORS) won by major decision over Derek Wilke (NAPERVILLE WC) Maj 13-1</li>\n<li>Champ. Round 2 - Andrew Wenger (DAKOTA WC) won in overtime over Cole Witzig (TRIAD LITTLE KNIGHTS) OT 9-7</li>\n<li>Champ. Round 2 - Gavin Rathbun (FORCE WRESTLING) won by decision over Sean Ryan (LITTLE FALCONS WC) Dec 7-4</li>\n<li>Champ. Round 2 - Eric Barone (WOLVES WC) won by fall over Kamal Bey (HARVEY TWISTERS) Fall 2:34</li>\n<li>Champ. Round 2 - Carver James (DAKOTA WC) won by decision over Kameron Irvin (GLADIATORS) Dec 6-0</li>\n<li>Champ. Round 2 - David Riojas (FORCE WRESTLING) won by fall over Michael Peters (CHAMPIONS WC) Fall 4:11</li>\n<li>Champ. Round 2 - Jakada Hull (HARVEY TWISTERS) won by fall over Carlos Jacquez (MARTINEZ FOX VALLEY ELITE) Fall 4:28</li>\n<li>Champ. Round 2 - Tyler Bergstralh (PRAIRIE CENTRAL-CHENOA HAWKS) won by fall over Jacob Persman (MT. VERNON LIONS) Fall 2:00</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Michael Petersen (WOLVES WC) won by major decision over Danny Hiemenz (FORCE WRESTLING) Maj 11-0</li>\n<li>Champ. Round 2 - Juwan Edmond (GLADIATORS) won by fall over Daniel Terronez (MOLINE WC) Fall 1:58</li>\n<li>Champ. Round 2 - Mathew Wroblewski (ARLINGTON CARDINALS) won by decision over Ben Zbinden (FALCON YOUTH WC) Dec 7-2</li>\n<li>Champ. Round 2 - Tom Slattery (TINLEY PARK BULLDOGS) won by decision over Brayton Williams (EDWARDSVILLE WC) Dec 4-1</li>\n<li>Champ. Round 2 - Carson Oughton (INDIANS ELITE) won by major decision over Alexander Mckenna (TREVIAN WC) Maj 14-0</li>\n<li>Champ. Round 2 - Isaih White (HARVEY TWISTERS) won by fall over Nicholas Remke (MARENGO YOUTH WRESTLING) Fall 1:16</li>\n<li>Champ. Round 2 - Troy Ott (MAD DOG WRESTLING ACADEMY) won by fall over Spencer Feerer (KANE COUNTY GRAPPLERS) Fall 4:29</li>\n<li>Champ. Round 2 - Mason Tomash (STILLMAN VALLEY WC) won by decision over Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) Dec 10-5</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Trace Carello (MT. VERNON LIONS) won by decision over Keone Derain (ST. CHARLES EAST WC) Dec 7-2</li>\n<li>Champ. Round 2 - Ryan Willett (RENEGADE WC (NFP)) won by tech fall over Thomas Brennan (ORLAND PARK PIONEERS) TF 17-1</li>\n<li>Champ. Round 2 - Andrew Marsden (CRYSTAL LAKE WIZARDS) won by decision over Joey Gunther (FOX LAKE WRESTLING CLUB) Dec 3-0</li>\n<li>Champ. Round 2 - Randy Meneweather (KNOX COUNTY KRUSHERS) won by fall over Kyle Betourne (BRAWLERS WC) Fall 3:15</li>\n<li>Champ. Round 2 - Larry Early (FORCE WRESTLING) won by fall over Josiah Cropp (GENESEO SPIDER WC) Fall 2:29</li>\n<li>Champ. Round 2 - Riley Demoss (SCN YOUTH WC) won by major decision over Billy Sheehy (OAK FOREST WARRIORS) Maj 13-2</li>\n<li>Champ. Round 2 - Fernie Silva (HONONEGAH KIDS WC) won by major decision over Johnny Davidson (BARRINGTON BRONCOS) Maj 13-1</li>\n<li>Champ. Round 2 - Matt Kleinkopf (LITTLE HUSKIE WC) won by fall over Tyson Digby (LIL` STORM) Fall 1:30</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Brandon Elliott (HARLEM WRESTLING CLUB) won by decision over Jared Smith (LAKELAND PREDATORS) Dec 7-2</li>\n<li>Champ. Round 2 - Gabe Pleasants (MORTON YOUTH WRESTLING) won by decision over Anfernee Hale (HARVEY TWISTERS) Dec 19-14</li>\n<li>Champ. Round 2 - Mason Delong (BRAWLERS WC) won by decision over Cole Deming (HILLSBORO JR TOPPERS) Dec 11-8</li>\n<li>Champ. Round 2 - Nathan Romero (DUNDEE HIGHLANDERS) won by fall over Nathan Traxler (SCN YOUTH WC) Fall 1:02</li>\n<li>Champ. Round 2 - Eric Bey (JUNIOR SPARTANS WC) won in overtime over Bryan Patterson (JJK WRESTLING) OT 3-2</li>\n<li>Champ. Round 2 - Dru Worker (TINLEY PARK BULLDOGS) won by fall over Jordan Sullivan (YORKVILLE WRESTLING CLUB) Fall 4:15</li>\n<li>Champ. Round 2 - Tyler Demoss (HONONEGAH KIDS WC) won in overtime over Ryan Pitra (GENESEO SPIDER WC) OT 5-4</li>\n<li>Champ. Round 2 - Lucas Duckett (SHELBYVILLE JR RAMS WRESTLING) won by major decision over Michael Shaw (ST. CHARLES EAST WC) Maj 8-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Matt Brozovich (INDIANS ELITE) won by major decision over Romeo Mcknight (CRYSTAL LAKE WIZARDS) Maj 10-2</li>\n<li>Champ. Round 2 - Timothy Young (TOMCAT WC) won by tech fall over Sanchir Avirmed (SHARKS WC) TF 17-0</li>\n<li>Champ. Round 2 - Matthew Striegel (O`FALLON LITTLE PANTHERS) won by fall over Jenner Hecox (HECOX TEAM BENAIAH) Fall 3:50</li>\n<li>Champ. Round 2 - John Mclaughlin (VITTUM CATS) won by decision over Samuel Torrence (BARRINGTON BRONCOS) Dec 8-2</li>\n<li>Champ. Round 2 - Franco Greco (JUNIOR COUGARS WC) won by decision over Gavin Mcbride (EDWARDSVILLE WC) Dec 7-2</li>\n<li>Champ. Round 2 - Brady Rude (SAUK VALLEY WC) won by fall over Wesley Villarreal (KANE COUNTY GRAPPLERS) Fall 2:28</li>\n<li>Champ. Round 2 - Kenneth Abitua (SHOOTERS ELITE WC) won in overtime over Bryce Gabel (BRAWLERS WC) OT 7-5</li>\n<li>Champ. Round 2 - Dalton Blankenship (ROXANA KIDS WC) won by fall over Colton Reed (MAHOMET-SEYMOUR YOUTH WC) Fall 1:53</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Christian Embrey (LITTLE REDSKINS WC) won by fall over Jacob Stewart (VANDALIA JR WRESTLING) Fall 0:53</li>\n<li>Champ. Round 2 - Jacob Villarreal (KANE COUNTY GRAPPLERS) won by fall over Aaron Carter (FISHER WC) Fall 2:54</li>\n<li>Champ. Round 2 - Mikalan Evans (MT. ZION WC) won by fall over Nicolas Villarreal (GRAPPLIN` DEVILS WC) Fall 2:00</li>\n<li>Champ. Round 2 - Joseph Medina (GENESEO SPIDER WC) won by decision over Justin Dauphin (CRYSTAL LAKE WIZARDS) Dec 10-6</li>\n<li>Champ. Round 2 - Kenny Condon (VITTUM CATS) won by fall over Spencer Ellison (RED RAIDERS) Fall 1:18</li>\n<li>Champ. Round 2 - Jacob Spanier (MENDOTA MAT MASTERS) won in overtime over Ryan Taylor (DOWNERS GROVE COUGARS) OT 5-3</li>\n<li>Champ. Round 2 - Christopher Hiscock (INDIANS ELITE) won by fall over De`gyon Macklin (ROCKFORD WC) Fall 0:40</li>\n<li>Champ. Round 2 - Hunter Crowley (MAHOMET-SEYMOUR YOUTH WC) won by fall over Sean Corey (GLENBARD EAST JR RAMS) Fall 2:35</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Lucas Greenberg (VILLA LOMBARD COUGARS) won by decision over Kacy Jent (CHARLESTON WC) Dec 7-5</li>\n<li>Champ. Round 2 - Anton Krocko (DUNDEE HIGHLANDERS) won by fall over Steven Raymond (EDWARDSVILLE WC) Fall 4:22</li>\n<li>Champ. Round 2 - Blake Cripe (VANDALIA JR WRESTLING) won by decision over Nicholas Spacek (LIONS WC) Dec 12-6</li>\n<li>Champ. Round 2 - Alex Timmons (KNOX COUNTY KRUSHERS) won by fall over Roger Thigpen (PLAINFIELD WC) Fall 3:40</li>\n<li>Champ. Round 2 - Patrick Kristin (TINLEY PARK BULLDOGS) won by fall over Claude Shelby (UNITED SOUTHERN ALLSTARS) Fall 2:26</li>\n<li>Champ. Round 2 - Matt Allen (HINSDALE WC) won by fall over Daniel Andress (JUNIOR COUGARS WC) Fall 1:15</li>\n<li>Champ. Round 2 - Allen Stallings (GLADIATORS) won by decision over Justin Esposito (LITTLE CELTIC WC) Dec 10-4</li>\n<li>Champ. Round 2 - Jarod Noel (BISMARCK HENNING WC) won by decision over Josh Bernius (METAMORA KIDS WC) Dec 10-6</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Jeremy Daum (YORKVILLE WRESTLING CLUB) won by fall over Austin Ellery (LIL` STORM) Fall 1:26</li>\n<li>Champ. Round 2 - Isaac Flores (CARBONDALE WC) won by fall over Christian Brown (WAUBONSIE WC) Fall 3:03</li>\n<li>Champ. Round 2 - Tyler Johnson (LEMONT BEARS WC) won by fall over Onycai Lawson (RANTOUL JUNIOR EAGLES) Fall 1:12</li>\n<li>Champ. Round 2 - Christian Thompson (WOLVES WC) won by fall over Alexander Girona (LAKELAND PREDATORS) Fall 1:08</li>\n<li>Champ. Round 2 - Tad Cravens (HERRIN JUNIOR WC) won by fall over Frank Tomaskovic (VITTUM CATS) Fall 0:57</li>\n<li>Champ. Round 2 - Joshua Bouie (INDIANS ELITE) won by fall over Nick Hayes (NAPERVILLE WC) Fall 1:11</li>\n<li>Champ. Round 2 - Ian Harwick (HARLEM WRESTLING CLUB) won by tech fall over Anthony Jarvis (SHAMROCK WC) TF 20-2</li>\n<li>Champ. Round 2 - Alex Gelber (SPRINGFIELD CAPITAL KIDS WC) won by fall over Joshua King (PROVISO POWERHOUSE WC) Fall 1:08</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Nick Becker (TINLEY PARK BULLDOGS) won by decision over Ibrahim Nasir (MAINE EAGLES) Dec 3-1</li>\n<li>Champ. Round 2 - Cody Barnes (CRYSTAL LAKE WIZARDS) won by fall over Bryan Andrews (GLENBARD EAST JR RAMS) Fall 2:50</li>\n<li>Champ. Round 2 - Tristan Penrod (MT. VERNON LIONS) won by decision over Alexander Zentner (BARRINGTON BRONCOS) Dec 6-1</li>\n<li>Champ. Round 2 - Keith Mcgee (JUNIOR SPARTANS WC) won by fall over Jason Benhoff (CLIPPER WC) Fall 2:28</li>\n<li>Champ. Round 2 - Dalton Kettering (ROCK ISLAND WC) won by fall over Devon Sieveking (BENTON JR WC) Fall 0:23</li>\n<li>Champ. Round 2 - Lucas Warren (BLACKHAWK WC) won by fall over Derek Caskey (MARENGO YOUTH WRESTLING) Fall 0:28</li>\n<li>Champ. Round 2 - Adrian Salinas (SHAMROCK WC) won by fall over Andrew Wise (ACES WC) Fall 0:38</li>\n<li>Champ. Round 2 - Keiffer Johnston (SHELBYVILLE JR RAMS WRESTLING) won by fall over Robert Stark (ORLAND PARK PIONEERS) Fall 1:24</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Antonio James (JJK WRESTLING) won by fall over Joshua Mitchell (LITTLE HUSKIE WC) Fall 2:33</li>\n<li>Champ. Round 2 - Matthew Iwinski (FORCE WRESTLING) won by fall over Devin Knight (SYCAMORE WC) Fall 1:29</li>\n<li>Champ. Round 2 - Jake Ford (MUSTANG WC) won by fall over David Baze (QUINCY WC) Fall 0:13</li>\n<li>Champ. Round 2 - Tristan Miller (THE LAW) won by fall over Mitchell Krusz (BATAVIA PINNERS) Fall 2:22</li>\n<li>Champ. Round 2 - Bryan Ditchman (TINLEY PARK BULLDOGS) won by fall over Ryan Ramirez (LITTLE FALCONS WC) Fall 1:00</li>\n<li>Champ. Round 2 - Jacob Heavlin (WARRIOR MONKS) won by fall over James Davis (ROCHELLE WC) Fall 0:46</li>\n<li>Champ. Round 2 - Matthew Bernal (REBELS WC) won by fall over Sammy Perez (DUNDEE HIGHLANDERS) Fall 0:56</li>\n<li>Champ. Round 2 - Martell Beasley (HARVEY TWISTERS) won by injury default over Trever Prather (JACKSONVILLE AREA YOUTH WRESTLING) Inj. 0:00</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Brady Powers (HONONEGAH KIDS WC) won by fall over Tyler Burlington (YORKVILLE WRESTLING CLUB) Fall 2:46</li>\n<li>Champ. Round 2 - Ian Meagher (LITTLE CELTIC WC) won by fall over Charlie Roth (DOWNERS GROVE COUGARS) Fall 0:54</li>\n<li>Champ. Round 2 - Jabari Moody (HARVEY TWISTERS) won by tech fall over Greylin Powers (GRANITE CITY WC) TF 20-3</li>\n<li>Champ. Round 2 - Nicholas Koch (LAKELAND PREDATORS) won by decision over Zachery Mccullough (DUNDEE HIGHLANDERS) Dec 3-2</li>\n<li>Champ. Round 2 - Vinnie Piunti (MARTINEZ FOX VALLEY ELITE) won by decision over Jordan Reich (WRESTLING FACTORY) Dec 8-5</li>\n<li>Champ. Round 2 - Sean Augello (FORCE WRESTLING) won by decision over Alex Rader (HONONEGAH KIDS WC) Dec 3-2</li>\n<li>Champ. Round 2 - Rudy Yates (VITTUM CATS) won by major decision over Derek Heil (EDWARDSVILLE WC) Maj 13-3</li>\n<li>Champ. Round 2 - Hunter Lowry (FISHER WC) won by decision over Matthew Crnich (LINCOLN-WAY WC) Dec 6-5</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Jack Diana (MUSTANG WC) won by fall over Dakota Paris (HARLEM WRESTLING CLUB) Fall 1:04</li>\n<li>Champ. Round 2 - Grant Sutton (GOMEZ WRESTLING ACADEMY) won by fall over Rick Nashkoff (LITTLE CELTIC WC) Fall 0:52</li>\n<li>Champ. Round 2 - Anthony Bosco (SCN YOUTH WC) won by fall over Quinn Doherty (ST. CHARLES EAST WC) Fall 2:39</li>\n<li>Champ. Round 2 - Jeffery Morrow (CRYSTAL LAKE WIZARDS) won by fall over Brody Vester (YORKVILLE WRESTLING CLUB) Fall 1:21</li>\n<li>Champ. Round 2 - Noell Carrillo (WRESTLING FACTORY) won by fall over Justin Kinney (WARREN COUNTY WC) Fall 2:58</li>\n<li>Champ. Round 2 - Gunner Wenger (THE LAW) won by major decision over Dylan Cramer (FORCE WRESTLING) Maj 9-0</li>\n<li>Champ. Round 2 - Miguel Silva Jr (MARTINEZ FOX VALLEY ELITE) won by decision over Justin Nelson (UNITED SOUTHERN ALLSTARS) Dec 3-2</li>\n<li>Champ. Round 2 - Steven Fessler (VITTUM CATS) won by decision over Keon Mayo (RENEGADE WC (NFP)) Dec 8-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Brandon Briggs (SHOOTERS ELITE WC) won by fall over Jakob Worms (ILLINI BLUFFS WC) Fall 1:12</li>\n<li>Champ. Round 2 - Brian Rossi (FALCON WC) won by major decision over Mike Falco (SOUTHSIDE STALLIONS) Maj 9-0</li>\n<li>Champ. Round 2 - Dan Davis (TINLEY PARK BULLDOGS) won by decision over Gunnar Hjorth (MARTINEZ FOX VALLEY ELITE) Dec 1-0</li>\n<li>Champ. Round 2 - Michael Cullen (WRESTLING FACTORY) won by fall over Jeremy O`gara (ROXANA KIDS WC) Fall 1:11</li>\n<li>Champ. Round 2 - Dominic Naso (FORCE WRESTLING) won by decision over Christian Milliron (YORKVILLE WRESTLING CLUB) Dec 6-3</li>\n<li>Champ. Round 2 - Titus Taylor (BELLEVILLE LITTLE DEVILS) won by decision over Jake Holian (CRYSTAL LAKE WIZARDS) Dec 10-4</li>\n<li>Champ. Round 2 - Kris Williams (HARVEY TWISTERS) won by major decision over Nicholas Deprima (VILLA LOMBARD COUGARS) Maj 12-1</li>\n<li>Champ. Round 2 - Austin Ryan (CRYSTAL LAKE WIZARDS) won by decision over Cameron Schwing (FISHER WC) Dec 6-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Tyler Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Kyle Simpkins (BRAWLERS WC) Dec 8-4</li>\n<li>Champ. Round 2 - Matthew Rundell (ARLINGTON CARDINALS) won by fall over Adam Mcconnell (BELVIDERE BANDITS) Fall 3:35</li>\n<li>Champ. Round 2 - Mario Leveille (OAK FOREST WARRIORS) won by decision over Jacob Wever (L-P CRUNCHING CAVS) Dec 5-4</li>\n<li>Champ. Round 2 - Sam Andresen (EDWARDSVILLE WC) won by major decision over Daniel Valenzio (FORCE WRESTLING) Maj 8-0</li>\n<li>Champ. Round 2 - Josh Alber (DAKOTA WC) won by fall over Colin Parsons (BATAVIA PINNERS) Fall 1:06</li>\n<li>Champ. Round 2 - Joshua Fuqua (CROSSTOWN WC) won by decision over Kasey Jauch (ARLINGTON CARDINALS) Dec 7-2</li>\n<li>Champ. Round 2 - Elijah Oliver (HARVEY TWISTERS) won by fall over Tyler Dehaven (ROCK ISLAND WC) Fall 2:21</li>\n<li>Champ. Round 2 - Stephen Richardson (PONTIAC WC) won by decision over Ellis Diveney (FOX VALLEY WC) Dec 6-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Jack Lucie (WEST HANCOCK TITAN WC) won by major decision over Pj Riley (SHELBYVILLE JR RAMS WRESTLING) Maj 9-0</li>\n<li>Champ. Round 2 - Jacob Plekavic (JR. BLAZER WC) won by decision over Cole Wysocki (TRIAD LITTLE KNIGHTS) Dec 3-2</li>\n<li>Champ. Round 2 - Gacob Lenox (DAKOTA WC) won by major decision over Jimmy Davis (WAUBONSIE WC) Maj 9-1</li>\n<li>Champ. Round 2 - Nick Nasenbeny (FORCE WRESTLING) won by tech fall over Hasan Muhammad (RENEGADE WC (NFP)) TF 20-4</li>\n<li>Champ. Round 2 - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by decision over Aj Villarreal (DOWNERS GROVE COUGARS) Dec 1-0</li>\n<li>Champ. Round 2 - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won by major decision over Sean Mulligan (EDWARDSVILLE WC) Maj 9-1</li>\n<li>Champ. Round 2 - Jason Moerlien (GRANITE CITY WC) won by fall over Brendan Gaynor (TINLEY PARK BULLDOGS) Fall 1:28</li>\n<li>Champ. Round 2 - Nathan Jozsa (SPRINGFIELD CAPITAL KIDS WC) won by decision over Cory Winchell (LITTLE CELTIC WC) Dec 4-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Mark Duda (CROSSTOWN WC) won by fall over Kyle White (METAMORA KIDS WC) Fall 3:39</li>\n<li>Champ. Round 2 - Garrett Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Anthony Berta (LEMONT BEARS WC) Dec 7-0</li>\n<li>Champ. Round 2 - Kyle Akins (SYCAMORE WC) won by tech fall over Christopher Golden (VITTUM CATS) TF 15-0</li>\n<li>Champ. Round 2 - Nicholas Ferraro (SCN YOUTH WC) won by fall over Alex Hopkins (MT. VERNON LIONS) Fall 3:38</li>\n<li>Champ. Round 2 - John Jimenez (SCN YOUTH WC) won by fall over Xavier Buchanan (ROCKFORD WC) Fall 2:43</li>\n<li>Champ. Round 2 - Danny Carlson (REBELS WC) won in overtime over Robert Modiest (GLADIATORS) OT 4-2</li>\n<li>Champ. Round 2 - Bryce Ivey (SAUK VALLEY WC) won by fall over Clayton Derousse (GRANITE CITY WC) Fall 0:52</li>\n<li>Champ. Round 2 - Israel Santiago (GRAPPLIN` DEVILS WC) won by major decision over Cody Tournear (CHAMPAIGN KIDS WRESTLING) Maj 9-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by fall over Brady Best (CHILLI DAWGS WC) Fall 1:58</li>\n<li>Champ. Round 2 - Flynn Nagel (VITTUM CATS) won by fall over Andrew Abitua (SHOOTERS ELITE WC) Fall 1:25</li>\n<li>Champ. Round 2 - Nicholas Gil (CRYSTAL LAKE WIZARDS) won by decision over Joseph Fulco (FORCE WRESTLING) Dec 2-0</li>\n<li>Champ. Round 2 - Ethan Jones (RIVERBEND WC) won by decision over Brandon Arteaga (GOMEZ WRESTLING ACADEMY) Dec 8-7</li>\n<li>Champ. Round 2 - Michael Zelasco (CRYSTAL LAKE WIZARDS) won by decision over John Blanke (BARRINGTON BRONCOS) Dec 6-0</li>\n<li>Champ. Round 2 - Chase Vosburgh (MT. VERNON LIONS) won by decision over Kyle Hayes (VITTUM CATS) Dec 7-0</li>\n<li>Champ. Round 2 - Jake Snow (SAUK VALLEY WC) won by decision over Johnny Pellegrino (ORLAND PARK PIONEERS) Dec 8-4</li>\n<li>Champ. Round 2 - Josh Martin (GLENBARD EAST JR RAMS) won by tech fall over Jonathon Martin (DANVILLE BRONCOS YOUTH WC) TF 15-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Sean Lynch (WRESTLING FACTORY) won by fall over Nicholas Bonomo (BRONCO WRESTLING) Fall 4:26</li>\n<li>Champ. Round 2 - Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) won by fall over Cody Notestine (O`FALLON LITTLE PANTHERS) Fall 3:36</li>\n<li>Champ. Round 2 - Thomas O`brien (SCN YOUTH WC) won by decision over Brad Wood (ORLAND PARK PIONEERS) Dec 5-2</li>\n<li>Champ. Round 2 - Derrick Curry (GLADIATORS) won by major decision over James Kaht (RICHMOND WC) Maj 14-2</li>\n<li>Champ. Round 2 - Austin Armstrong (SYCAMORE WC) won by decision over Morgan Drew (WRESTLING FACTORY) Dec 7-2</li>\n<li>Champ. Round 2 - John Kriha (CROSSTOWN WC) won by fall over Sage Friese (SENECA IRISH CADETS) Fall 4:08</li>\n<li>Champ. Round 2 - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won by fall over Brent Hakeman (BRAWLERS WC) Fall 0:41</li>\n<li>Champ. Round 2 - Xavier Montalvo (GOMEZ WRESTLING ACADEMY) won by decision over Harrison Williams (SPRINGFIELD CAPITAL KIDS WC) Dec 4-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - James Geier (FORCE WRESTLING) won by fall over Mack Anderson (SPRINGFIELD CAPITAL KIDS WC) Fall 1:14</li>\n<li>Champ. Round 2 - Ryan Fish (GLADIATORS) won by decision over Luke Gruszka (MARTINEZ FOX VALLEY ELITE) Dec 6-2</li>\n<li>Champ. Round 2 - Anthony Scaccia (SCN YOUTH WC) won by fall over Charley Popp (DUNDEE HIGHLANDERS) Fall 1:55</li>\n<li>Champ. Round 2 - Tommy Brewster (MAINE EAGLES) won by decision over Richard Swistara (YORKVILLE WRESTLING CLUB) Dec 4-0</li>\n<li>Champ. Round 2 - Geno Quaid (WRESTLING FACTORY) won by decision over Timothy Schanmier (DUNDEE HIGHLANDERS) Dec 6-3</li>\n<li>Champ. Round 2 - Michael Pixley (GRANITE CITY WC) won by fall over Collin Grant (RIVERBEND WC) Fall 0:45</li>\n<li>Champ. Round 2 - Bryce Brill (FOX VALLEY WC) won by fall over Austin Shoup (SAUK VALLEY WC) Fall 0:58</li>\n<li>Champ. Round 2 - Austin Hedrick (MAHOMET-SEYMOUR YOUTH WC) won by major decision over Jim Brennan (LEMONT BEARS WC) Maj 15-6</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Tommy Klinger (CRYSTAL LAKE WIZARDS) won by decision over Javier Montalvo (LINCOLN-WAY WC) Dec 3-1</li>\n<li>Champ. Round 2 - Tyre Lee (RENEGADE WC (NFP)) won by decision over Killian Murphy (YORKVILLE WRESTLING CLUB) Dec 8-2</li>\n<li>Champ. Round 2 - Eddie Gonzalez (GOMEZ WRESTLING ACADEMY) won by fall over Laren Eustace (BATAVIA PINNERS) Fall 0:48</li>\n<li>Champ. Round 2 - Nate Higgins (UNITED SOUTHERN ALLSTARS) won by fall over Michael Shanahan (CHICAGO WOLVES DEN) Fall 2:41</li>\n<li>Champ. Round 2 - Anthony Palacios (WILL COUNTY WARRIORS) won by fall over Tommy Calkins (MAINE EAGLES) Fall 1:19</li>\n<li>Champ. Round 2 - Connor Bandy (TINLEY PARK BULLDOGS) won by decision over Cameron Throneberry (EDWARDSVILLE WC) Dec 2-0</li>\n<li>Champ. Round 2 - Andres Gonzalez (MARTINEZ FOX VALLEY ELITE) won by decision over Keegan Gardner (WEST FRANKFORT JR WRESTLING) Dec 12-7</li>\n<li>Champ. Round 2 - Zachary Benkovich (HONONEGAH KIDS WC) won by decision over Jack Rossi (CHAMPAIGN KIDS WRESTLING) Dec 7-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Lonnie Cleveland Iii (BULLS WC) won by major decision over Brandon Dean (BATAVIA PINNERS) Maj 11-1</li>\n<li>Champ. Round 2 - Peter Andreotti (VITTUM CATS) won by tech fall over Toby Lee (CROSSTOWN WC) TF 18-1</li>\n<li>Champ. Round 2 - Edmond Hogan (LANCER WC) won by major decision over Maxwell Kuhrt (HARLEM WRESTLING CLUB) Maj 18-7</li>\n<li>Champ. Round 2 - Jean Louis Sawadogo (ROCK ISLAND WC) won by fall over Dominic Garza (LITTLE FALCONS WC) Fall 2:51</li>\n<li>Champ. Round 2 - Davonte Mahomes (WILL COUNTY WARRIORS) won by major decision over Blaine Wilson (QUINCY WC) Maj 15-4</li>\n<li>Champ. Round 2 - Jacob Kroeger (VILLA PARK YOUNG WARRIORS) won by major decision over Michael Carbajal (WAUKEGAN YOUTH WC) Maj 10-0</li>\n<li>Champ. Round 2 - Zac Keller (LAKELAND PREDATORS) won by decision over Matthew Hughes (CARY MATMEN WC) Dec 2-1</li>\n<li>Champ. Round 2 - Kane Garcia (ACES WC) won by decision over Richard Rinehart (FALCON YOUTH WC) Dec 3-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Kailor Hecox (HECOX TEAM BENAIAH) won by fall over Isaac Reyes (GRAPPLIN` DEVILS WC) Fall 4:24</li>\n<li>Champ. Round 2 - Connor Doak (JUNIOR PIONEER WC) won by fall over Max Andersen (LAWRENCE COUNTY WC) Fall 3:44</li>\n<li>Champ. Round 2 - Collin Cronberg (LITTLE CELTIC WC) won by decision over Bo Taylor (ACES WC) Dec 8-7</li>\n<li>Champ. Round 2 - Michael Gastaldello (DOWNERS GROVE COUGARS) won by decision over Brian Pence (CRYSTAL LAKE WIZARDS) Dec 6-5</li>\n<li>Champ. Round 2 - Torrie Williams (GRANITE CITY WC) won by fall over Cain Bialas (WW TIGER WC) Fall 3:18</li>\n<li>Champ. Round 2 - Cosmo Halwix (BADGER WC) won by decision over Alec Basso (MAINE EAGLES) Dec 10-6</li>\n<li>Champ. Round 2 - Quincy Kalkbrenner (THE LAW) won by fall over August Tholl (ORLAND PARK PIONEERS) Fall 2:25</li>\n<li>Champ. Round 2 - Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) won by decision over Dominic Harris (CENTRAL ELITE REBELS) Dec 2-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Bryce Gorman (LITTLE CELTIC WC) won by fall over Terry Martin (GLADIATORS) Fall 2:40</li>\n<li>Champ. Round 2 - Anthony Ferraro (GOMEZ WRESTLING ACADEMY) won by decision over Brandon Mizlo (RIVERDALE JR RAMS WC) Dec 6-5</li>\n<li>Champ. Round 2 - Justin Heavilon (GRANITE CITY WC) won by major decision over Matthew Stopka (MAD DOG WRESTLING ACADEMY) Maj 10-2</li>\n<li>Champ. Round 2 - Benjamin Brancaleon (NAPERVILLE HUSKY WC) won by fall over Sean Kelly (LITTLE CELTIC WC) Fall 0:52</li>\n<li>Champ. Round 2 - Jimique Davis (VILLA LOMBARD COUGARS) won by fall over Nathan Cooper (ACES WC) Fall 1:23</li>\n<li>Champ. Round 2 - Daniel Zimmerman (DAKOTA WC) won by major decision over Frank Battaglia (REDHAWK WC) Maj 13-0</li>\n<li>Champ. Round 2 - Connor Swier (FORCE WRESTLING) won by fall over Bruce Henley (JJK WRESTLING) Fall 3:57</li>\n<li>Champ. Round 2 - Mason Jett (HOOPESTON AREA WC) won by decision over Billy Fett (TINLEY PARK BULLDOGS) Dec 3-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - AJ Friedrich (METAMORA KIDS WC) won in overtime over John Zeidler (EDWARDSVILLE WC) OT 5-4</li>\n<li>Champ. Round 2 - Nicholas Favale (LITTLE FALCONS WC) won by fall over Tom Schofield (MUSTANG WC) Fall 2:59</li>\n<li>Champ. Round 2 - Rich Scheib (SPRINGFIELD CAPITAL KIDS WC) won by decision over Colton Wegner (VILLA LOMBARD COUGARS) Dec 6-1</li>\n<li>Champ. Round 2 - Deuce Rachal (HARVEY TWISTERS) won by fall over Dylan Lydon (DAKOTA WC) Fall 1:03</li>\n<li>Champ. Round 2 - Alex Benoit (REDHAWK WC) won by decision over Nathaniel Magiera (WOLVES WC) Dec 9-2</li>\n<li>Champ. Round 2 - Eric Gomez (YORKVILLE WRESTLING CLUB) won by fall over Paul Pennington (VILLA LOMBARD COUGARS) Fall 3:31</li>\n<li>Champ. Round 2 - Tyler Barton (SYCAMORE WC) won by decision over Matthew Glenn (JUNIOR SPARTANS WC) Dec 5-1</li>\n<li>Champ. Round 2 - Toby Rivera (CHAMPAIGN KIDS WRESTLING) won by fall over Anthony Napolitano (WAUBONSIE WC) Fall 0:40</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Escobar (SHAMROCK WC) won by fall over Collin Hopkins (ARGENTA-OREANA KIDS CLUB) Fall 0:25</li>\n<li>Champ. Round 2 - Sage Hecox (HECOX TEAM BENAIAH) won by fall over Dee Alexander (LITTLE FALCONS WC) Fall 0:23</li>\n<li>Champ. Round 2 - Stu Landin (TINLEY PARK BULLDOGS) won by fall over Terrion Jones (JJK WRESTLING) Fall 2:09</li>\n<li>Champ. Round 2 - Keagan Griffin (FORCE WRESTLING) won by fall over Zachary Simpson (RICH RATTLERS WC) Fall 0:33</li>\n<li>Champ. Round 2 - Ryan Brown (JJK WRESTLING) won by fall over Jascent Harvey (LITTLE FALCONS WC) Fall 0:45</li>\n<li>Champ. Round 2 - Brian Allen (HINSDALE WC) won by decision over Ty Harmston (RENEGADES (STOCKTON)) Dec 8-5</li>\n<li>Champ. Round 2 - Andre Mickens (JUNIOR SPARTANS WC) won by fall over Andres Heredia (VITTUM CATS) Fall 0:32</li>\n<li>Champ. Round 2 - Dalton Stokes (TAYLORVILLE WC) won by major decision over Dandre Johnson (VILLA LOMBARD COUGARS) Maj 12-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Jordan Ladd (CHILLI DAWGS WC) won by fall over Kyle Tex (TAYLORVILLE WC) Fall 0:57</li>\n<li>Champ. Round 2 - Nicholas Czar (HIGHLAND BULLDOG JR WC) won by decision over Carl Witt Iii (TOMCAT WC) Dec 6-2</li>\n<li>Champ. Round 2 - Moises Pina (MORTON LITTLE MUSTANGS) won by fall over Shane Favier (MURPHYSBORO WRESTLING) Fall 0:34</li>\n<li>Champ. Round 2 - Cameron Baxter (HARLEM WRESTLING CLUB) won by fall over Jordan Harrison (RICH RATTLERS WC) Fall 1:01</li>\n<li>Champ. Round 2 - Noah Fleckenstein (LIONS WC) won by major decision over Zach Ufert (EDWARDSVILLE WC) Maj 12-0</li>\n<li>Champ. Round 2 - Ryan Berman (LITTLE CELTIC WC) won by major decision over Josh Davis (ROCK ISLAND WC) Maj 13-1</li>\n<li>Champ. Round 2 - Simon Montez (BELVIDERE BANDITS) won by fall over Kyle Roberson (ROXANA KIDS WC) Fall 2:13</li>\n<li>Champ. Round 2 - Nicky Allegretti (VITTUM CATS) won by fall over Tyler Dicken (WESTVILLE YOUTH WC) Fall 2:50</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Tyler Ortmann (ARGENTA-OREANA KIDS CLUB) won by decision over Jimmy Dinardo (MORTON LITTLE MUSTANGS) Dec 6-3</li>\n<li>Champ. Round 2 - Harry Potts (KANE COUNTY GRAPPLERS) won by fall over Kevin Mcintyre (GENOA-KINGSTON WC) Fall 2:59</li>\n<li>Champ. Round 2 - Tanner Farmer (HIGHLAND BULLDOG JR WC) won by decision over Erik Aguirre (TOMCAT WC) Dec 6-0</li>\n<li>Champ. Round 2 - Timothy O`sullivan (FORCE WRESTLING) won by fall over Jake Pruitt (WESTVILLE YOUTH WC) Fall 2:26</li>\n<li>Champ. Round 2 - Matthew Kent (EDWARDSVILLE WC) won by decision over Jameson Roby (MOLINE WC) Dec 10-4</li>\n<li>Champ. Round 2 - Edgar Ruano (BRONCO WRESTLING) won by fall over Blake Hooper (TAYLORVILLE WC) Fall 0:30</li>\n<li>Champ. Round 2 - Daniel Garcia (MURPHYSBORO WRESTLING) won by fall over Jason Chavez (TEAM WEST WOLVES) Fall 2:56</li>\n<li>Champ. Round 2 - Joshua Wallick (FISHER WC) won by fall over Jabari Jones (RENEGADE WC (NFP)) Fall 3:49</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Adarios Jones (MOLINE WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Devion May (JUNIOR SPARTANS WC) won by fall over Jacob Crounk (GLENBARD EAST JR RAMS) Fall 0:58</li>\n<li>Champ. Round 2 - Pat Bieber (MC BULLDOGS) won by fall over Christopher Lewis (JJK WRESTLING) Fall 1:03</li>\n<li>Champ. Round 2 - Jack Bornhofen (BARRINGTON BRONCOS) won by fall over Bobby Carson (ELMHURST JR. DUKES) Fall 2:51</li>\n<li>Champ. Round 2 - Michael Johnson Jr (DOWNERS GROVE COUGARS) received a bye   () Bye</li>\n<li>Champ. Round 2 - Nicholas Wolf (FORCE WRESTLING) won by fall over Manuel Rivera (ROCHELLE WC) Fall 1:21</li>\n<li>Champ. Round 2 - Kyle Haegele (HIGHLAND BULLDOG JR WC) won by fall over Jeremiah Binion (GLENBARD EAST JR RAMS) Fall 0:40</li>\n<li>Champ. Round 2 - Rodolfo Antuna (FALCON WC) won by fall over Wyatt Witty (BISMARCK HENNING WC) Fall 1:18</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Marcus Povlick (FORCE WRESTLING) won by major decision over Kyle Szlenk (CRYSTAL LAKE WIZARDS) Maj 8-0</li>\n<li>Quarterfinal - Pat Walker (GOMEZ WRESTLING ACADEMY) won by fall over Chrishon Tucker (JJK WRESTLING) Fall 0:50</li>\n<li>Quarterfinal - Louie Hayes (MARTINEZ FOX VALLEY ELITE) won by major decision over Travis Piotrowski (WOLVES WC) Maj 10-0</li>\n<li>Quarterfinal - Dack Punke (CENTRAL ELITE REBELS) won by fall over Cooper Secker (UNITED SOUTHERN ALLSTARS) Fall 1:08</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Christian Kanzler (WRESTLING FACTORY) won by major decision over Logan Voss (SAUK VALLEY WC) Maj 11-1</li>\n<li>Quarterfinal - Dylan Duncan (SCN YOUTH WC) won by major decision over Brady Wilsie (XTREME WRESTLING) Maj 9-1</li>\n<li>Quarterfinal - Jason Renteria (BRONCO WRESTLING) won by major decision over Michael Mcgee (FORCE WRESTLING) Maj 10-0</li>\n<li>Quarterfinal - Anthony Cheloni (SCN YOUTH WC) won by major decision over Zachary Lorek (TINLEY PARK BULLDOGS) Maj 11-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Cameron Roat (LITTLE CELTIC WC) won by decision over Christopher Dranka (CRYSTAL LAKE WIZARDS) Dec 9-3</li>\n<li>Quarterfinal - Austin Gomez (GOMEZ WRESTLING ACADEMY) won by decision over Peter Ogunsanya (HARVEY TWISTERS) Dec 9-2</li>\n<li>Quarterfinal - Gavin Sutton (GOMEZ WRESTLING ACADEMY) won by fall over Hunter Vester (YORKVILLE WRESTLING CLUB) Fall 2:26</li>\n<li>Quarterfinal - Christian Robertson (VITTUM CATS) won by decision over Tristan Birt (FALCON YOUTH WC) Dec 8-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Kyle Peisker (GOMEZ WRESTLING ACADEMY) won by decision over Thomas Svestka (MARTINEZ FOX VALLEY ELITE) Dec 4-2</li>\n<li>Quarterfinal - Braxten Ary (MIDWEST CENTRAL YOUTH) won by decision over Dalton Brito (EDWARDSVILLE WC) Dec 5-1</li>\n<li>Quarterfinal - Andrew Mcfall (FORCE WRESTLING) won by major decision over Brandon Critchfield (UNITED SOUTHERN ALLSTARS) Maj 13-1</li>\n<li>Quarterfinal - Austin O`connor (TINLEY PARK BULLDOGS) won by tech fall over Jake Barzowski (BRONCO WRESTLING) TF 16-1</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won by decision over Shaun Wasso (LITTLE CELTIC WC) Dec 10-3</li>\n<li>Quarterfinal - Devin Kane (MARTINEZ FOX VALLEY ELITE) won in overtime over Keegan Powers (HONONEGAH KIDS WC) OT 8-6</li>\n<li>Quarterfinal - Aj Jaffe (SCN YOUTH WC) won by major decision over Mitchell Stathakis (BARRINGTON BRONCOS) Maj 10-2</li>\n<li>Quarterfinal - Garrett Dziedzic (CRYSTAL LAKE WIZARDS) won by fall over Will Lucie (WEST HANCOCK TITAN WC) Fall 1:23</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Dylan Elmore (HARLEM WRESTLING CLUB) won by major decision over Trent Rakers (HIGHLAND BULLDOG JR WC) Maj 14-3</li>\n<li>Quarterfinal - Matt Rowland (SCN YOUTH WC) won by decision over Kordell Norfleet (HARVEY TWISTERS) Dec 6-4</li>\n<li>Quarterfinal - Jake Drew (GOMEZ WRESTLING ACADEMY) won by decision over David Kasper (SOUTHSIDE STALLIONS) Dec 2-0</li>\n<li>Quarterfinal - Riley Beard (PEORIA RAZORBACKS YOUTH WC) won by decision over Antonio Alvarez (OAKWOOD WC) Dec 9-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Michael Callahan (SCN YOUTH WC) won by major decision over Gabriel Townsell (GLADIATORS) Maj 15-1</li>\n<li>Quarterfinal - James Wolfe (SHOOTERS ELITE WC) won by decision over Jimmy Gallardo (GOMEZ WRESTLING ACADEMY) Dec 6-0</li>\n<li>Quarterfinal - Vincent Turk (CRYSTAL LAKE WIZARDS) won by decision over Alex Madrigal (BRONCO WRESTLING) Dec 9-2</li>\n<li>Quarterfinal - Ryder Punke (CENTRAL ELITE REBELS) won by decision over Jake Tisza (JUNIOR SPARTANS WC) Dec 7-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Noah Drabek (LAKELAND PREDATORS) won by decision over Andrew Wenger (DAKOTA WC) Dec 7-1</li>\n<li>Quarterfinal - Eric Barone (WOLVES WC) won by decision over Gavin Rathbun (FORCE WRESTLING) Dec 4-0</li>\n<li>Quarterfinal - Carver James (DAKOTA WC) won by major decision over David Riojas (FORCE WRESTLING) Maj 9-0</li>\n<li>Quarterfinal - Jakada Hull (HARVEY TWISTERS) won by decision over Tyler Bergstralh (PRAIRIE CENTRAL-CHENOA HAWKS) Dec 10-8</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Juwan Edmond (GLADIATORS) won by decision over Michael Petersen (WOLVES WC) Dec 7-3</li>\n<li>Quarterfinal - Tom Slattery (TINLEY PARK BULLDOGS) won by decision over Mathew Wroblewski (ARLINGTON CARDINALS) Dec 3-2</li>\n<li>Quarterfinal - Isaih White (HARVEY TWISTERS) won by decision over Carson Oughton (INDIANS ELITE) Dec 7-2</li>\n<li>Quarterfinal - Mason Tomash (STILLMAN VALLEY WC) won by fall over Troy Ott (MAD DOG WRESTLING ACADEMY) Fall 0:30</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Ryan Willett (RENEGADE WC (NFP)) won by decision over Trace Carello (MT. VERNON LIONS) Dec 4-2</li>\n<li>Quarterfinal - Randy Meneweather (KNOX COUNTY KRUSHERS) won by decision over Andrew Marsden (CRYSTAL LAKE WIZARDS) Dec 2-1</li>\n<li>Quarterfinal - Larry Early (FORCE WRESTLING) won by major decision over Riley Demoss (SCN YOUTH WC) Maj 11-2</li>\n<li>Quarterfinal - Fernie Silva (HONONEGAH KIDS WC) won by major decision over Matt Kleinkopf (LITTLE HUSKIE WC) Maj 13-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Gabe Pleasants (MORTON YOUTH WRESTLING) won by fall over Brandon Elliott (HARLEM WRESTLING CLUB) Fall 0:59</li>\n<li>Quarterfinal - Nathan Romero (DUNDEE HIGHLANDERS) won by decision over Mason Delong (BRAWLERS WC) Dec 1-0</li>\n<li>Quarterfinal - Dru Worker (TINLEY PARK BULLDOGS) won by fall over Eric Bey (JUNIOR SPARTANS WC) Fall 3:29</li>\n<li>Quarterfinal - Tyler Demoss (HONONEGAH KIDS WC) won by decision over Lucas Duckett (SHELBYVILLE JR RAMS WRESTLING) Dec 4-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Timothy Young (TOMCAT WC) won by fall over Matt Brozovich (INDIANS ELITE) Fall 1:53</li>\n<li>Quarterfinal - Matthew Striegel (O`FALLON LITTLE PANTHERS) won in overtime over John Mclaughlin (VITTUM CATS) OT 4-2</li>\n<li>Quarterfinal - Brady Rude (SAUK VALLEY WC) won by fall over Franco Greco (JUNIOR COUGARS WC) Fall 1:18</li>\n<li>Quarterfinal - Dalton Blankenship (ROXANA KIDS WC) won by fall over Kenneth Abitua (SHOOTERS ELITE WC) Fall 3:31</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Jacob Villarreal (KANE COUNTY GRAPPLERS) won by fall over Christian Embrey (LITTLE REDSKINS WC) Fall 2:02</li>\n<li>Quarterfinal - Joseph Medina (GENESEO SPIDER WC) won by tech fall over Mikalan Evans (MT. ZION WC) TF 16-0</li>\n<li>Quarterfinal - Kenny Condon (VITTUM CATS) won by fall over Jacob Spanier (MENDOTA MAT MASTERS) Fall 1:07</li>\n<li>Quarterfinal - Christopher Hiscock (INDIANS ELITE) won by fall over Hunter Crowley (MAHOMET-SEYMOUR YOUTH WC) Fall 4:00</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Lucas Greenberg (VILLA LOMBARD COUGARS) won by decision over Anton Krocko (DUNDEE HIGHLANDERS) Dec 10-6</li>\n<li>Quarterfinal - Blake Cripe (VANDALIA JR WRESTLING) won by major decision over Alex Timmons (KNOX COUNTY KRUSHERS) Maj 14-4</li>\n<li>Quarterfinal - Patrick Kristin (TINLEY PARK BULLDOGS) won by fall over Matt Allen (HINSDALE WC) Fall 0:41</li>\n<li>Quarterfinal - Allen Stallings (GLADIATORS) won by major decision over Jarod Noel (BISMARCK HENNING WC) Maj 9-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Isaac Flores (CARBONDALE WC) won by fall over Jeremy Daum (YORKVILLE WRESTLING CLUB) Fall 2:27</li>\n<li>Quarterfinal - Tyler Johnson (LEMONT BEARS WC) won by fall over Christian Thompson (WOLVES WC) Fall 2:22</li>\n<li>Quarterfinal - Joshua Bouie (INDIANS ELITE) won by decision over Tad Cravens (HERRIN JUNIOR WC) Dec 4-3</li>\n<li>Quarterfinal - Ian Harwick (HARLEM WRESTLING CLUB) won by fall over Alex Gelber (SPRINGFIELD CAPITAL KIDS WC) Fall 3:50</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Cody Barnes (CRYSTAL LAKE WIZARDS) won by decision over Nick Becker (TINLEY PARK BULLDOGS) Dec 7-4</li>\n<li>Quarterfinal - Keith Mcgee (JUNIOR SPARTANS WC) won by decision over Tristan Penrod (MT. VERNON LIONS) Dec 4-3</li>\n<li>Quarterfinal - Lucas Warren (BLACKHAWK WC) won by fall over Dalton Kettering (ROCK ISLAND WC) Fall 2:21</li>\n<li>Quarterfinal - Adrian Salinas (SHAMROCK WC) won by fall over Keiffer Johnston (SHELBYVILLE JR RAMS WRESTLING) Fall 0:42</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Matthew Iwinski (FORCE WRESTLING) won by fall over Antonio James (JJK WRESTLING) Fall 1:01</li>\n<li>Quarterfinal - Jake Ford (MUSTANG WC) won by fall over Tristan Miller (THE LAW) Fall 1:21</li>\n<li>Quarterfinal - Jacob Heavlin (WARRIOR MONKS) won by fall over Bryan Ditchman (TINLEY PARK BULLDOGS) Fall 4:16</li>\n<li>Quarterfinal - Matthew Bernal (REBELS WC) won by fall over Martell Beasley (HARVEY TWISTERS) Fall 1:06</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Ian Meagher (LITTLE CELTIC WC) won by fall over Brady Powers (HONONEGAH KIDS WC) Fall 3:45</li>\n<li>Quarterfinal - Jabari Moody (HARVEY TWISTERS) won by tech fall over Nicholas Koch (LAKELAND PREDATORS) TF 20-4</li>\n<li>Quarterfinal - Sean Augello (FORCE WRESTLING) won by decision over Vinnie Piunti (MARTINEZ FOX VALLEY ELITE) Dec 6-1</li>\n<li>Quarterfinal - Rudy Yates (VITTUM CATS) won by major decision over Hunter Lowry (FISHER WC) Maj 15-4</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Grant Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Jack Diana (MUSTANG WC) Dec 2-1</li>\n<li>Quarterfinal - Anthony Bosco (SCN YOUTH WC) won by decision over Jeffery Morrow (CRYSTAL LAKE WIZARDS) Dec 6-4</li>\n<li>Quarterfinal - Noell Carrillo (WRESTLING FACTORY) won by fall over Gunner Wenger (THE LAW) Fall 3:00</li>\n<li>Quarterfinal - Miguel Silva Jr (MARTINEZ FOX VALLEY ELITE) won by decision over Steven Fessler (VITTUM CATS) Dec 6-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Brian Rossi (FALCON WC) won by decision over Brandon Briggs (SHOOTERS ELITE WC) Dec 3-1</li>\n<li>Quarterfinal - Michael Cullen (WRESTLING FACTORY) won by decision over Dan Davis (TINLEY PARK BULLDOGS) Dec 7-3</li>\n<li>Quarterfinal - Titus Taylor (BELLEVILLE LITTLE DEVILS) won by decision over Dominic Naso (FORCE WRESTLING) Dec 7-6</li>\n<li>Quarterfinal - Austin Ryan (CRYSTAL LAKE WIZARDS) won by decision over Kris Williams (HARVEY TWISTERS) Dec 1-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Matthew Rundell (ARLINGTON CARDINALS) won by fall over Tyler Svestka (MARTINEZ FOX VALLEY ELITE) Fall 4:26</li>\n<li>Quarterfinal - Mario Leveille (OAK FOREST WARRIORS) won by decision over Sam Andresen (EDWARDSVILLE WC) Dec 7-2</li>\n<li>Quarterfinal - Josh Alber (DAKOTA WC) won by decision over Joshua Fuqua (CROSSTOWN WC) Dec 5-1</li>\n<li>Quarterfinal - Elijah Oliver (HARVEY TWISTERS) won by major decision over Stephen Richardson (PONTIAC WC) Maj 12-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Jack Lucie (WEST HANCOCK TITAN WC) won by decision over Jacob Plekavic (JR. BLAZER WC) Dec 5-2</li>\n<li>Quarterfinal - Nick Nasenbeny (FORCE WRESTLING) won by decision over Gacob Lenox (DAKOTA WC) Dec 2-1</li>\n<li>Quarterfinal - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won by decision over Kyle Fugiel (CRYSTAL LAKE WIZARDS) Dec 3-0</li>\n<li>Quarterfinal - Nathan Jozsa (SPRINGFIELD CAPITAL KIDS WC) won by decision over Jason Moerlien (GRANITE CITY WC) Dec 7-5</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Garrett Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Mark Duda (CROSSTOWN WC) Dec 3-1</li>\n<li>Quarterfinal - Kyle Akins (SYCAMORE WC) won by fall over Nicholas Ferraro (SCN YOUTH WC) Fall 1:05</li>\n<li>Quarterfinal - John Jimenez (SCN YOUTH WC) won by major decision over Danny Carlson (REBELS WC) Maj 16-5</li>\n<li>Quarterfinal - Israel Santiago (GRAPPLIN` DEVILS WC) won by decision over Bryce Ivey (SAUK VALLEY WC) Dec 5-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by fall over Flynn Nagel (VITTUM CATS) Fall 0:38</li>\n<li>Quarterfinal - Nicholas Gil (CRYSTAL LAKE WIZARDS) won by major decision over Ethan Jones (RIVERBEND WC) Maj 9-1</li>\n<li>Quarterfinal - Michael Zelasco (CRYSTAL LAKE WIZARDS) won by decision over Chase Vosburgh (MT. VERNON LIONS) Dec 5-0</li>\n<li>Quarterfinal - Jake Snow (SAUK VALLEY WC) won by decision over Josh Martin (GLENBARD EAST JR RAMS) Dec 9-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Sean Lynch (WRESTLING FACTORY) won by fall over Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) Fall 2:08</li>\n<li>Quarterfinal - Thomas O`brien (SCN YOUTH WC) won by decision over Derrick Curry (GLADIATORS) Dec 10-4</li>\n<li>Quarterfinal - John Kriha (CROSSTOWN WC) won by decision over Austin Armstrong (SYCAMORE WC) Dec 3-0</li>\n<li>Quarterfinal - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won by major decision over Xavier Montalvo (GOMEZ WRESTLING ACADEMY) Maj 11-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Ryan Fish (GLADIATORS) won by decision over James Geier (FORCE WRESTLING) Dec 8-4</li>\n<li>Quarterfinal - Anthony Scaccia (SCN YOUTH WC) won by decision over Tommy Brewster (MAINE EAGLES) Dec 2-0</li>\n<li>Quarterfinal - Michael Pixley (GRANITE CITY WC) won by fall over Geno Quaid (WRESTLING FACTORY) Fall 2:53</li>\n<li>Quarterfinal - Bryce Brill (FOX VALLEY WC) won by tech fall over Austin Hedrick (MAHOMET-SEYMOUR YOUTH WC) TF 18-3</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Tommy Klinger (CRYSTAL LAKE WIZARDS) won in overtime over Tyre Lee (RENEGADE WC (NFP)) OT 6-4</li>\n<li>Quarterfinal - Eddie Gonzalez (GOMEZ WRESTLING ACADEMY) won by major decision over Nate Higgins (UNITED SOUTHERN ALLSTARS) Maj 10-0</li>\n<li>Quarterfinal - Connor Bandy (TINLEY PARK BULLDOGS) won by decision over Anthony Palacios (WILL COUNTY WARRIORS) Dec 5-0</li>\n<li>Quarterfinal - Andres Gonzalez (MARTINEZ FOX VALLEY ELITE) won by tech fall over Zachary Benkovich (HONONEGAH KIDS WC) TF 21-5</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Peter Andreotti (VITTUM CATS) won by decision over Lonnie Cleveland Iii (BULLS WC) Dec 2-1</li>\n<li>Quarterfinal - Edmond Hogan (LANCER WC) won by fall over Jean Louis Sawadogo (ROCK ISLAND WC) Fall 4:09</li>\n<li>Quarterfinal - Davonte Mahomes (WILL COUNTY WARRIORS) won by fall over Jacob Kroeger (VILLA PARK YOUNG WARRIORS) Fall 4:04</li>\n<li>Quarterfinal - Zac Keller (LAKELAND PREDATORS) won by major decision over Kane Garcia (ACES WC) Maj 15-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Connor Doak (JUNIOR PIONEER WC) won by fall over Kailor Hecox (HECOX TEAM BENAIAH) Fall 1:04</li>\n<li>Quarterfinal - Michael Gastaldello (DOWNERS GROVE COUGARS) won by decision over Collin Cronberg (LITTLE CELTIC WC) Dec 2-1</li>\n<li>Quarterfinal - Torrie Williams (GRANITE CITY WC) won by fall over Cosmo Halwix (BADGER WC) Fall 3:15</li>\n<li>Quarterfinal - Quincy Kalkbrenner (THE LAW) won by fall over Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) Fall 1:49</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Bryce Gorman (LITTLE CELTIC WC) won by decision over Anthony Ferraro (GOMEZ WRESTLING ACADEMY) Dec 5-4</li>\n<li>Quarterfinal - Justin Heavilon (GRANITE CITY WC) won by fall over Benjamin Brancaleon (NAPERVILLE HUSKY WC) Fall 3:51</li>\n<li>Quarterfinal - Jimique Davis (VILLA LOMBARD COUGARS) won by decision over Daniel Zimmerman (DAKOTA WC) Dec 5-2</li>\n<li>Quarterfinal - Connor Swier (FORCE WRESTLING) won by major decision over Mason Jett (HOOPESTON AREA WC) Maj 12-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Nicholas Favale (LITTLE FALCONS WC) won by decision over AJ Friedrich (METAMORA KIDS WC) Dec 11-5</li>\n<li>Quarterfinal - Deuce Rachal (HARVEY TWISTERS) won by fall over Rich Scheib (SPRINGFIELD CAPITAL KIDS WC) Fall 1:52</li>\n<li>Quarterfinal - Alex Benoit (REDHAWK WC) won by fall over Eric Gomez (YORKVILLE WRESTLING CLUB) Fall 2:33</li>\n<li>Quarterfinal - Tyler Barton (SYCAMORE WC) won by decision over Toby Rivera (CHAMPAIGN KIDS WRESTLING) Dec 8-5</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Sage Hecox (HECOX TEAM BENAIAH) won by tech fall over Anthony Escobar (SHAMROCK WC) TF 16-1</li>\n<li>Quarterfinal - Keagan Griffin (FORCE WRESTLING) won by fall over Stu Landin (TINLEY PARK BULLDOGS) Fall 1:17</li>\n<li>Quarterfinal - Brian Allen (HINSDALE WC) won by fall over Ryan Brown (JJK WRESTLING) Fall 0:25</li>\n<li>Quarterfinal - Andre Mickens (JUNIOR SPARTANS WC) won by decision over Dalton Stokes (TAYLORVILLE WC) Dec 6-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Jordan Ladd (CHILLI DAWGS WC) won by major decision over Nicholas Czar (HIGHLAND BULLDOG JR WC) Maj 9-0</li>\n<li>Quarterfinal - Moises Pina (MORTON LITTLE MUSTANGS) won by fall over Cameron Baxter (HARLEM WRESTLING CLUB) Fall 4:12</li>\n<li>Quarterfinal - Noah Fleckenstein (LIONS WC) won by decision over Ryan Berman (LITTLE CELTIC WC) Dec 3-1</li>\n<li>Quarterfinal - Nicky Allegretti (VITTUM CATS) won in double overtime over Simon Montez (BELVIDERE BANDITS) 2-OT 2-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Tyler Ortmann (ARGENTA-OREANA KIDS CLUB) won by decision over Harry Potts (KANE COUNTY GRAPPLERS) Dec 7-2</li>\n<li>Quarterfinal - Tanner Farmer (HIGHLAND BULLDOG JR WC) won by decision over Timothy O`sullivan (FORCE WRESTLING) Dec 1-0</li>\n<li>Quarterfinal - Edgar Ruano (BRONCO WRESTLING) won by fall over Matthew Kent (EDWARDSVILLE WC) Fall 0:37</li>\n<li>Quarterfinal - Joshua Wallick (FISHER WC) won by fall over Daniel Garcia (MURPHYSBORO WRESTLING) Fall 0:25</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Adarios Jones (MOLINE WC) won by decision over Devion May (JUNIOR SPARTANS WC) Dec 4-3</li>\n<li>Quarterfinal - Jack Bornhofen (BARRINGTON BRONCOS) won by fall over Pat Bieber (MC BULLDOGS) Fall 4:01</li>\n<li>Quarterfinal - Michael Johnson Jr (DOWNERS GROVE COUGARS) won by fall over Nicholas Wolf (FORCE WRESTLING) Fall 0:33</li>\n<li>Quarterfinal - Kyle Haegele (HIGHLAND BULLDOG JR WC) won by decision over Rodolfo Antuna (FALCON WC) Dec 6-2</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Joey Melendez (BRONCO WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Madrigal (BRONCO WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kevin Radcliff (GOMEZ WRESTLING ACADEMY) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trentin Rilea (FULTON COUNTY STINGERS) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - James Higdon (COLLINSVILLE RAIDERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jarod Foiles (ROXANA KIDS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean Cullen (WRESTLING FACTORY) won by fall over Alec Meronk (METAMORA KIDS WC) Fall 2:35</li>\n<li>Cons. Round 1 - Tyler Moon (UNITED SOUTHERN ALLSTARS) won by decision over Jake Szlenk (CRYSTAL LAKE WIZARDS) Dec 2-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Dudeck (TINLEY PARK BULLDOGS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jarrid Braunagel (O`FALLON LITTLE PANTHERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ian Mullen (WOLVES WC) won by major decision over Jevon Hey (BELLEVILLE LITTLE DEVILS) Maj 11-1</li>\n<li>Cons. Round 1 -   () received a bye Hazen Rice (MAD DOG WRESTLING ACADEMY) Bye</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Christian Fausel (HONONEGAH KIDS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Demarius Terhune (CHAMPAIGN KIDS WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Patrick Augustyn (GOMEZ WRESTLING ACADEMY) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hunter Webb (SAUK VALLEY WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Silzer (TINLEY PARK BULLDOGS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Marquez Roberson (BELLEVILLE LITTLE DEVILS) won by tech fall over Ethan Reel (CENTRAL ELITE REBELS) TF 17-2</li>\n<li>Cons. Round 1 - Jacob Orth (CRYSTAL LAKE WIZARDS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Eric Carter (WRESTLING FACTORY) won by decision over Johnathan Turner (SPRINGFIELD CAPITAL KIDS WC) Dec 9-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Carter Pillen (GENESEO SPIDER WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Camiran Sadeghi (WEST HANCOCK TITAN WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drake Boverie (BULLS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Hawkins (SHOOTERS ELITE WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Vaughn Hobart (PONTIAC WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Peter Perich (FORCE WRESTLING) won by decision over Colin Sullivan (PAXTON YOUTH WC) Dec 4-0</li>\n<li>Cons. Round 1 - Nicky Gasbarro (JUNIOR SPARTANS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Jessen (VILLA PARK YOUNG WARRIORS) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Derek Wilke (NAPERVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kamal Bey (HARVEY TWISTERS) won by fall over Robert Walters (GENESEO SPIDER WC) Fall 3:26</li>\n<li>Cons. Round 1 - Kameron Irvin (GLADIATORS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Carlos Jacquez (MARTINEZ FOX VALLEY ELITE) won by fall over Roman Johnson (WILL COUNTY WARRIORS) Fall 2:43</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Daniel Terronez (MOLINE WC) won by major decision over Cameron Barnhart (WAUBONSIE WC) Maj 8-0</li>\n<li>Cons. Round 1 - Brayton Williams (EDWARDSVILLE WC) won by fall over Jacob Schleicher (FALCON WC) Fall 3:11</li>\n<li>Cons. Round 1 - Nicholas Remke (MARENGO YOUTH WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) won by major decision over Jacob Orth (JUNIOR PIONEER WC) Maj 13-4</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Thomas Brennan (ORLAND PARK PIONEERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Betourne (BRAWLERS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Josiah Cropp (GENESEO SPIDER WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Johnny Davidson (BARRINGTON BRONCOS) received a bye   () Bye</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Anfernee Hale (HARVEY TWISTERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Traxler (SCN YOUTH WC) won by decision over Juan Blanco Iv (MORTON LITTLE MUSTANGS) Dec 9-2</li>\n<li>Cons. Round 1 - Jordan Sullivan (YORKVILLE WRESTLING CLUB) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Pitra (GENESEO SPIDER WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Sanchir Avirmed (SHARKS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jenner Hecox (HECOX TEAM BENAIAH) received a bye   () Bye</li>\n<li>Cons. Round 1 - Wesley Villarreal (KANE COUNTY GRAPPLERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colton Reed (MAHOMET-SEYMOUR YOUTH WC) won by fall over Stefan Ivanisevic (HINSDALE WC) Fall 1:09</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Aaron Carter (FISHER WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Al`lon Carter (GLADIATORS) won by fall over Justin Dauphin (CRYSTAL LAKE WIZARDS) Fall 1:08</li>\n<li>Cons. Round 1 - Spencer Ellison (RED RAIDERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - De`gyon Macklin (ROCKFORD WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Kacy Jent (CHARLESTON WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Spacek (LIONS WC) won by fall over Anthony Watson (TITAN YOUTH WRESTLING) Fall 0:35</li>\n<li>Cons. Round 1 - Claude Shelby (UNITED SOUTHERN ALLSTARS) won by major decision over Arlandria Mcgowan (PEORIA RAZORBACKS YOUTH WC) Maj 12-3</li>\n<li>Cons. Round 1 - Justin Esposito (LITTLE CELTIC WC) won by fall over Blake Zalapi (HONONEGAH KIDS WC) Fall 2:44</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - David Newman (INDIANS ELITE) won by fall over Christian Brown (WAUBONSIE WC) Fall 2:02</li>\n<li>Cons. Round 1 - Onycai Lawson (RANTOUL JUNIOR EAGLES) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nick Hayes (NAPERVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Jarvis (SHAMROCK WC) won by fall over Jacob Van Doren (GENESEO SPIDER WC) Fall 0:38</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Bryan Andrews (GLENBARD EAST JR RAMS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jason Benhoff (CLIPPER WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Derek Caskey (MARENGO YOUTH WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Wise (ACES WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Devin Knight (SYCAMORE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - David Baze (QUINCY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - James Davis (ROCHELLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sammy Perez (DUNDEE HIGHLANDERS) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Charlie Roth (DOWNERS GROVE COUGARS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Greylin Powers (GRANITE CITY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nick Lukanich (VITTUM CATS) won by decision over Alex Rader (HONONEGAH KIDS WC) Dec 6-4</li>\n<li>Cons. Round 1 - Carlos Fuentez (VILLA LOMBARD COUGARS) won by decision over Derek Heil (EDWARDSVILLE WC) Dec 10-6</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Rick Nashkoff (LITTLE CELTIC WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Quinn Doherty (ST. CHARLES EAST WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Omar Delatorre (MARTINEZ FOX VALLEY ELITE) won by decision over Justin Kinney (WARREN COUNTY WC) Dec 7-2</li>\n<li>Cons. Round 1 - Justin Nelson (UNITED SOUTHERN ALLSTARS) won by fall over Michael Altendorf (CARY MATMEN WC) Fall 0:22</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Mike Falco (SOUTHSIDE STALLIONS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeremy O`gara (ROXANA KIDS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Holian (CRYSTAL LAKE WIZARDS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cameron Schwing (FISHER WC) won by decision over Shane Mart (INDIANS ELITE) Dec 1-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Adam Mcconnell (BELVIDERE BANDITS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Wever (L-P CRUNCHING CAVS) won by fall over Kaleb Cheung (SPRINGFIELD CAPITAL KIDS WC) Fall 2:16</li>\n<li>Cons. Round 1 - Colin Parsons (BATAVIA PINNERS) received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye Tyler Dehaven (ROCK ISLAND WC) Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Pj Riley (SHELBYVILLE JR RAMS WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hasan Muhammad (RENEGADE WC (NFP)) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean Mulligan (EDWARDSVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cory Winchell (LITTLE CELTIC WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Anthony Berta (LEMONT BEARS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christopher Golden (VITTUM CATS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Xavier Buchanan (ROCKFORD WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tanner Anthony (HARLEM WRESTLING CLUB) won by decision over Cody Tournear (CHAMPAIGN KIDS WRESTLING) Dec 6-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Brady Best (CHILLI DAWGS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joseph Fulco (FORCE WRESTLING) won by fall over Haratio Austin (SPRINGFIELD CAPITAL KIDS WC) Fall 0:16</li>\n<li>Cons. Round 1 - John Blanke (BARRINGTON BRONCOS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Johnny Pellegrino (ORLAND PARK PIONEERS) received a bye   () Bye</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Nicholas Bonomo (BRONCO WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brad Wood (ORLAND PARK PIONEERS) won by major decision over Isaiah Stedwill (CENTRAL ELITE REBELS) Maj 15-1</li>\n<li>Cons. Round 1 - Sage Friese (SENECA IRISH CADETS) won by fall over Garrett Gresham (PANTHER POWERHOUSE WC) Fall 1:06</li>\n<li>Cons. Round 1 - Brent Hakeman (BRAWLERS WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Luke Gruszka (MARTINEZ FOX VALLEY ELITE) received a bye   () Bye</li>\n<li>Cons. Round 1 - Charley Popp (DUNDEE HIGHLANDERS) won by fall over Michael Cler (FALCON YOUTH WC) Fall 1:56</li>\n<li>Cons. Round 1 - Collin Grant (RIVERBEND WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Shoup (SAUK VALLEY WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Javier Montalvo (LINCOLN-WAY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Laren Eustace (BATAVIA PINNERS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cameron Throneberry (EDWARDSVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Keegan Gardner (WEST FRANKFORT JR WRESTLING) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Toby Lee (CROSSTOWN WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Maxwell Kuhrt (HARLEM WRESTLING CLUB) received a bye   () Bye</li>\n<li>Cons. Round 1 - Blaine Wilson (QUINCY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Hughes (CARY MATMEN WC) won by decision over Mitchel Humphrey (MENDOTA MAT MASTERS) Dec 8-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Max Andersen (LAWRENCE COUNTY WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brian Pence (CRYSTAL LAKE WIZARDS) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cain Bialas (WW TIGER WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - August Tholl (ORLAND PARK PIONEERS) received a bye   () Bye</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Jeremy Rivers (WESTVILLE YOUTH WC) won by decision over Terry Martin (GLADIATORS) Dec 9-5</li>\n<li>Cons. Round 1 - Matthew Stopka (MAD DOG WRESTLING ACADEMY) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Cooper (ACES WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bruce Henley (JJK WRESTLING) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Tom Schofield (MUSTANG WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dylan Lydon (DAKOTA WC) won by major decision over Christian Miles (PEORIA RAZORBACKS YOUTH WC) Maj 11-3</li>\n<li>Cons. Round 1 - Nathaniel Magiera (WOLVES WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Glenn (JUNIOR SPARTANS WC) won by fall over David Baureis (HOFFMAN ESTATES WC) Fall 1:51</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Dee Alexander (LITTLE FALCONS WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brent Lindenman (FOX VALLEY WC) won by decision over Zachary Simpson (RICH RATTLERS WC) Dec 7-4</li>\n<li>Cons. Round 1 - Ty Harmston (RENEGADES (STOCKTON)) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andres Heredia (VITTUM CATS) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Kyle Tex (TAYLORVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Shane Favier (MURPHYSBORO WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Hare (STILLMAN VALLEY WC) won by fall over Zach Ufert (EDWARDSVILLE WC) Fall 0:38</li>\n<li>Cons. Round 1 - Tyler Dicken (WESTVILLE YOUTH WC) won by fall over Connor Mckeehan (BATAVIA PINNERS) Fall 2:24</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Jimmy Dinardo (MORTON LITTLE MUSTANGS) won by fall over Joseph Disanti (BARTLETT JR HAWKS) Fall 4:22</li>\n<li>Cons. Round 1 - Erik Aguirre (TOMCAT WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Blake Hooper (TAYLORVILLE WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jabari Jones (RENEGADE WC (NFP)) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n<li>Cons. Round 1 - Bobby Carson (ELMHURST JR. DUKES) received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeremiah Binion (GLENBARD EAST JR RAMS) received a bye   () Bye</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Kyle Szlenk (CRYSTAL LAKE WIZARDS) won by decision over Joey Melendez (BRONCO WRESTLING) Dec 2-0</li>\n<li>Cons. Round 2 - Anthony Madrigal (BRONCO WRESTLING) won by fall over Chrishon Tucker (JJK WRESTLING) Fall 2:39</li>\n<li>Cons. Round 2 - Travis Piotrowski (WOLVES WC) won by fall over Kevin Radcliff (GOMEZ WRESTLING ACADEMY) Fall 1:27</li>\n<li>Cons. Round 2 - Cooper Secker (UNITED SOUTHERN ALLSTARS) won by fall over Trentin Rilea (FULTON COUNTY STINGERS) Fall 3:58</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - James Higdon (COLLINSVILLE RAIDERS) won by decision over Logan Voss (SAUK VALLEY WC) Dec 6-0</li>\n<li>Cons. Round 2 - Jarod Foiles (ROXANA KIDS WC) won in overtime over Brady Wilsie (XTREME WRESTLING) OT 5-4</li>\n<li>Cons. Round 2 - Michael Mcgee (FORCE WRESTLING) won by decision over Sean Cullen (WRESTLING FACTORY) Dec 6-0</li>\n<li>Cons. Round 2 - Zachary Lorek (TINLEY PARK BULLDOGS) won by decision over Tyler Moon (UNITED SOUTHERN ALLSTARS) Dec 5-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Dudeck (TINLEY PARK BULLDOGS) won by major decision over Christopher Dranka (CRYSTAL LAKE WIZARDS) Maj 12-4</li>\n<li>Cons. Round 2 - Peter Ogunsanya (HARVEY TWISTERS) won by major decision over Jarrid Braunagel (O`FALLON LITTLE PANTHERS) Maj 17-7</li>\n<li>Cons. Round 2 - Ian Mullen (WOLVES WC) won by fall over Hunter Vester (YORKVILLE WRESTLING CLUB) Fall 0:30</li>\n<li>Cons. Round 2 - Tristan Birt (FALCON YOUTH WC) won by decision over Hazen Rice (MAD DOG WRESTLING ACADEMY) Dec 5-4</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Thomas Svestka (MARTINEZ FOX VALLEY ELITE) won by fall over Christian Fausel (HONONEGAH KIDS WC) Fall 3:18</li>\n<li>Cons. Round 2 - Dalton Brito (EDWARDSVILLE WC) won by decision over Demarius Terhune (CHAMPAIGN KIDS WRESTLING) Dec 5-1</li>\n<li>Cons. Round 2 - Patrick Augustyn (GOMEZ WRESTLING ACADEMY) won by fall over Brandon Critchfield (UNITED SOUTHERN ALLSTARS) Fall 4:22</li>\n<li>Cons. Round 2 - Hunter Webb (SAUK VALLEY WC) won by decision over Jake Barzowski (BRONCO WRESTLING) Dec 6-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Silzer (TINLEY PARK BULLDOGS) won in overtime over Shaun Wasso (LITTLE CELTIC WC) OT 5-3</li>\n<li>Cons. Round 2 - Keegan Powers (HONONEGAH KIDS WC) won by tech fall over Marquez Roberson (BELLEVILLE LITTLE DEVILS) TF 18-2</li>\n<li>Cons. Round 2 - Mitchell Stathakis (BARRINGTON BRONCOS) won by decision over Jacob Orth (CRYSTAL LAKE WIZARDS) Dec 7-2</li>\n<li>Cons. Round 2 - Eric Carter (WRESTLING FACTORY) won in overtime over Will Lucie (WEST HANCOCK TITAN WC) OT 4-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Trent Rakers (HIGHLAND BULLDOG JR WC) won by decision over Carter Pillen (GENESEO SPIDER WC) Dec 7-5</li>\n<li>Cons. Round 2 - Kordell Norfleet (HARVEY TWISTERS) won by fall over Camiran Sadeghi (WEST HANCOCK TITAN WC) Fall 1:29</li>\n<li>Cons. Round 2 - David Kasper (SOUTHSIDE STALLIONS) won by fall over Drake Boverie (BULLS WC) Fall 2:59</li>\n<li>Cons. Round 2 - Jacob Hawkins (SHOOTERS ELITE WC) won by decision over Antonio Alvarez (OAKWOOD WC) Dec 5-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Vaughn Hobart (PONTIAC WC) won by decision over Gabriel Townsell (GLADIATORS) Dec 7-6</li>\n<li>Cons. Round 2 - Peter Perich (FORCE WRESTLING) won by major decision over Jimmy Gallardo (GOMEZ WRESTLING ACADEMY) Maj 10-0</li>\n<li>Cons. Round 2 - Nicky Gasbarro (JUNIOR SPARTANS WC) won by decision over Alex Madrigal (BRONCO WRESTLING) Dec 5-0</li>\n<li>Cons. Round 2 - Jake Tisza (JUNIOR SPARTANS WC) won by injury default over Jack Jessen (VILLA PARK YOUNG WARRIORS) Inj. 0:00</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Andrew Wenger (DAKOTA WC) won by decision over Derek Wilke (NAPERVILLE WC) Dec 8-2</li>\n<li>Cons. Round 2 - Kamal Bey (HARVEY TWISTERS) won by tech fall over Gavin Rathbun (FORCE WRESTLING) TF 15-0</li>\n<li>Cons. Round 2 - Kameron Irvin (GLADIATORS) won by decision over David Riojas (FORCE WRESTLING) Dec 10-8</li>\n<li>Cons. Round 2 - Carlos Jacquez (MARTINEZ FOX VALLEY ELITE) won by tech fall over Tyler Bergstralh (PRAIRIE CENTRAL-CHENOA HAWKS) TF 21-4</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Michael Petersen (WOLVES WC) won by fall over Daniel Terronez (MOLINE WC) Fall 4:13</li>\n<li>Cons. Round 2 - Brayton Williams (EDWARDSVILLE WC) won by decision over Mathew Wroblewski (ARLINGTON CARDINALS) Dec 6-4</li>\n<li>Cons. Round 2 - Carson Oughton (INDIANS ELITE) won by fall over Nicholas Remke (MARENGO YOUTH WRESTLING) Fall 4:01</li>\n<li>Cons. Round 2 - Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) won by fall over Troy Ott (MAD DOG WRESTLING ACADEMY) Fall 2:31</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Trace Carello (MT. VERNON LIONS) won by decision over Thomas Brennan (ORLAND PARK PIONEERS) Dec 3-1</li>\n<li>Cons. Round 2 - Andrew Marsden (CRYSTAL LAKE WIZARDS) won by decision over Kyle Betourne (BRAWLERS WC) Dec 1-0</li>\n<li>Cons. Round 2 - Josiah Cropp (GENESEO SPIDER WC) won by decision over Riley Demoss (SCN YOUTH WC) Dec 8-4</li>\n<li>Cons. Round 2 - Matt Kleinkopf (LITTLE HUSKIE WC) won by fall over Johnny Davidson (BARRINGTON BRONCOS) Fall 0:37</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Anfernee Hale (HARVEY TWISTERS) won by fall over Brandon Elliott (HARLEM WRESTLING CLUB) Fall 2:22</li>\n<li>Cons. Round 2 - Nathan Traxler (SCN YOUTH WC) won by decision over Mason Delong (BRAWLERS WC) Dec 5-2</li>\n<li>Cons. Round 2 - Jordan Sullivan (YORKVILLE WRESTLING CLUB) won by fall over Eric Bey (JUNIOR SPARTANS WC) Fall 4:01</li>\n<li>Cons. Round 2 - Ryan Pitra (GENESEO SPIDER WC) won by decision over Lucas Duckett (SHELBYVILLE JR RAMS WRESTLING) Dec 4-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Sanchir Avirmed (SHARKS WC) won by fall over Matt Brozovich (INDIANS ELITE) Fall 2:28</li>\n<li>Cons. Round 2 - John Mclaughlin (VITTUM CATS) won by decision over Jenner Hecox (HECOX TEAM BENAIAH) Dec 4-1</li>\n<li>Cons. Round 2 - Wesley Villarreal (KANE COUNTY GRAPPLERS) won by decision over Franco Greco (JUNIOR COUGARS WC) Dec 8-2</li>\n<li>Cons. Round 2 - Colton Reed (MAHOMET-SEYMOUR YOUTH WC) won by fall over Kenneth Abitua (SHOOTERS ELITE WC) Fall 0:36</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Christian Embrey (LITTLE REDSKINS WC) won by fall over Aaron Carter (FISHER WC) Fall 2:37</li>\n<li>Cons. Round 2 - Al`lon Carter (GLADIATORS) won by fall over Mikalan Evans (MT. ZION WC) Fall 1:25</li>\n<li>Cons. Round 2 - Jacob Spanier (MENDOTA MAT MASTERS) won by tech fall over Spencer Ellison (RED RAIDERS) TF 16-1</li>\n<li>Cons. Round 2 - De`gyon Macklin (ROCKFORD WC) won by fall over Hunter Crowley (MAHOMET-SEYMOUR YOUTH WC) Fall 3:00</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Kacy Jent (CHARLESTON WC) won by decision over Anton Krocko (DUNDEE HIGHLANDERS) Dec 12-9</li>\n<li>Cons. Round 2 - Alex Timmons (KNOX COUNTY KRUSHERS) won by decision over Nicholas Spacek (LIONS WC) Dec 5-3</li>\n<li>Cons. Round 2 - Claude Shelby (UNITED SOUTHERN ALLSTARS) won by decision over Matt Allen (HINSDALE WC) Dec 10-8</li>\n<li>Cons. Round 2 - Justin Esposito (LITTLE CELTIC WC) won by decision over Jarod Noel (BISMARCK HENNING WC) Dec 8-2</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - David Newman (INDIANS ELITE) won by decision over Jeremy Daum (YORKVILLE WRESTLING CLUB) Dec 8-3</li>\n<li>Cons. Round 2 - Christian Thompson (WOLVES WC) won by fall over Onycai Lawson (RANTOUL JUNIOR EAGLES) Fall 1:03</li>\n<li>Cons. Round 2 - Tad Cravens (HERRIN JUNIOR WC) won by fall over Nick Hayes (NAPERVILLE WC) Fall 0:56</li>\n<li>Cons. Round 2 - Alex Gelber (SPRINGFIELD CAPITAL KIDS WC) won by fall over Anthony Jarvis (SHAMROCK WC) Fall 2:46</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Nick Becker (TINLEY PARK BULLDOGS) won by fall over Bryan Andrews (GLENBARD EAST JR RAMS) Fall 0:57</li>\n<li>Cons. Round 2 - Tristan Penrod (MT. VERNON LIONS) won by fall over Jason Benhoff (CLIPPER WC) Fall 2:34</li>\n<li>Cons. Round 2 - Dalton Kettering (ROCK ISLAND WC) won by fall over Derek Caskey (MARENGO YOUTH WRESTLING) Fall 1:11</li>\n<li>Cons. Round 2 - Keiffer Johnston (SHELBYVILLE JR RAMS WRESTLING) won by decision over Andrew Wise (ACES WC) Dec 3-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Antonio James (JJK WRESTLING) won by decision over Devin Knight (SYCAMORE WC) Dec 2-0</li>\n<li>Cons. Round 2 - Tristan Miller (THE LAW) won by fall over David Baze (QUINCY WC) Fall 0:54</li>\n<li>Cons. Round 2 - Bryan Ditchman (TINLEY PARK BULLDOGS) won by fall over James Davis (ROCHELLE WC) Fall 0:06</li>\n<li>Cons. Round 2 - Sammy Perez (DUNDEE HIGHLANDERS) won by fall over Martell Beasley (HARVEY TWISTERS) Fall 3:30</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Brady Powers (HONONEGAH KIDS WC) won by decision over Charlie Roth (DOWNERS GROVE COUGARS) Dec 6-3</li>\n<li>Cons. Round 2 - Nicholas Koch (LAKELAND PREDATORS) won by tech fall over Greylin Powers (GRANITE CITY WC) TF 16-0</li>\n<li>Cons. Round 2 - Vinnie Piunti (MARTINEZ FOX VALLEY ELITE) won by decision over Nick Lukanich (VITTUM CATS) Dec 6-4</li>\n<li>Cons. Round 2 - Carlos Fuentez (VILLA LOMBARD COUGARS) won by decision over Hunter Lowry (FISHER WC) Dec 7-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Jack Diana (MUSTANG WC) won by fall over Rick Nashkoff (LITTLE CELTIC WC) Fall 2:58</li>\n<li>Cons. Round 2 - Jeffery Morrow (CRYSTAL LAKE WIZARDS) won by major decision over Quinn Doherty (ST. CHARLES EAST WC) Maj 11-1</li>\n<li>Cons. Round 2 - Gunner Wenger (THE LAW) won by tech fall over Omar Delatorre (MARTINEZ FOX VALLEY ELITE) TF 17-0</li>\n<li>Cons. Round 2 - Justin Nelson (UNITED SOUTHERN ALLSTARS) won by decision over Steven Fessler (VITTUM CATS) Dec 8-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Brandon Briggs (SHOOTERS ELITE WC) won by fall over Mike Falco (SOUTHSIDE STALLIONS) Fall 1:24</li>\n<li>Cons. Round 2 - Dan Davis (TINLEY PARK BULLDOGS) won by tech fall over Jeremy O`gara (ROXANA KIDS WC) TF 15-0</li>\n<li>Cons. Round 2 - Dominic Naso (FORCE WRESTLING) won by decision over Jake Holian (CRYSTAL LAKE WIZARDS) Dec 5-0</li>\n<li>Cons. Round 2 - Kris Williams (HARVEY TWISTERS) won by major decision over Cameron Schwing (FISHER WC) Maj 9-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Adam Mcconnell (BELVIDERE BANDITS) won by forfeit over Tyler Svestka (MARTINEZ FOX VALLEY ELITE) FF</li>\n<li>Cons. Round 2 - Jacob Wever (L-P CRUNCHING CAVS) won by decision over Sam Andresen (EDWARDSVILLE WC) Dec 11-8</li>\n<li>Cons. Round 2 - Joshua Fuqua (CROSSTOWN WC) won by fall over Colin Parsons (BATAVIA PINNERS) Fall 2:22</li>\n<li>Cons. Round 2 - Stephen Richardson (PONTIAC WC) won by fall over Tyler Dehaven (ROCK ISLAND WC) Fall 4:00</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Jacob Plekavic (JR. BLAZER WC) won by major decision over Pj Riley (SHELBYVILLE JR RAMS WRESTLING) Maj 14-0</li>\n<li>Cons. Round 2 - Gacob Lenox (DAKOTA WC) won by major decision over Hasan Muhammad (RENEGADE WC (NFP)) Maj 14-0</li>\n<li>Cons. Round 2 - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by decision over Sean Mulligan (EDWARDSVILLE WC) Dec 3-2</li>\n<li>Cons. Round 2 - Cory Winchell (LITTLE CELTIC WC) won by forfeit over Jason Moerlien (GRANITE CITY WC) FF</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Mark Duda (CROSSTOWN WC) won by decision over Anthony Berta (LEMONT BEARS WC) Dec 6-1</li>\n<li>Cons. Round 2 - Nicholas Ferraro (SCN YOUTH WC) won by tech fall over Christopher Golden (VITTUM CATS) TF 17-2</li>\n<li>Cons. Round 2 - Danny Carlson (REBELS WC) won by decision over Xavier Buchanan (ROCKFORD WC) Dec 5-2</li>\n<li>Cons. Round 2 - Bryce Ivey (SAUK VALLEY WC) won by decision over Tanner Anthony (HARLEM WRESTLING CLUB) Dec 6-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Flynn Nagel (VITTUM CATS) won by fall over Brady Best (CHILLI DAWGS WC) Fall 3:45</li>\n<li>Cons. Round 2 - Joseph Fulco (FORCE WRESTLING) won by major decision over Ethan Jones (RIVERBEND WC) Maj 14-0</li>\n<li>Cons. Round 2 - Chase Vosburgh (MT. VERNON LIONS) won by decision over John Blanke (BARRINGTON BRONCOS) Dec 5-1</li>\n<li>Cons. Round 2 - Johnny Pellegrino (ORLAND PARK PIONEERS) won by decision over Josh Martin (GLENBARD EAST JR RAMS) Dec 6-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Nicholas Bonomo (BRONCO WRESTLING) won by decision over Chase Dickerson (SPRINGFIELD CAPITAL KIDS WC) Dec 6-0</li>\n<li>Cons. Round 2 - Brad Wood (ORLAND PARK PIONEERS) won by decision over Derrick Curry (GLADIATORS) Dec 2-0</li>\n<li>Cons. Round 2 - Sage Friese (SENECA IRISH CADETS) won by fall over Austin Armstrong (SYCAMORE WC) Fall 3:00</li>\n<li>Cons. Round 2 - Xavier Montalvo (GOMEZ WRESTLING ACADEMY) won by fall over Brent Hakeman (BRAWLERS WC) Fall 0:18</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - James Geier (FORCE WRESTLING) won by fall over Luke Gruszka (MARTINEZ FOX VALLEY ELITE) Fall 1:08</li>\n<li>Cons. Round 2 - Tommy Brewster (MAINE EAGLES) won by decision over Charley Popp (DUNDEE HIGHLANDERS) Dec 6-0</li>\n<li>Cons. Round 2 - Geno Quaid (WRESTLING FACTORY) won by major decision over Collin Grant (RIVERBEND WC) Maj 12-1</li>\n<li>Cons. Round 2 - Austin Hedrick (MAHOMET-SEYMOUR YOUTH WC) won by fall over Austin Shoup (SAUK VALLEY WC) Fall 0:23</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Tyre Lee (RENEGADE WC (NFP)) won by decision over Javier Montalvo (LINCOLN-WAY WC) Dec 6-0</li>\n<li>Cons. Round 2 - Nate Higgins (UNITED SOUTHERN ALLSTARS) won by fall over Laren Eustace (BATAVIA PINNERS) Fall 2:01</li>\n<li>Cons. Round 2 - Anthony Palacios (WILL COUNTY WARRIORS) won by major decision over Cameron Throneberry (EDWARDSVILLE WC) Maj 12-2</li>\n<li>Cons. Round 2 - Keegan Gardner (WEST FRANKFORT JR WRESTLING) won by major decision over Zachary Benkovich (HONONEGAH KIDS WC) Maj 17-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Lonnie Cleveland Iii (BULLS WC) won by major decision over Toby Lee (CROSSTOWN WC) Maj 9-0</li>\n<li>Cons. Round 2 - Jean Louis Sawadogo (ROCK ISLAND WC) won by major decision over Maxwell Kuhrt (HARLEM WRESTLING CLUB) Maj 17-8</li>\n<li>Cons. Round 2 - Jacob Kroeger (VILLA PARK YOUNG WARRIORS) won by fall over Blaine Wilson (QUINCY WC) Fall 0:27</li>\n<li>Cons. Round 2 - Kane Garcia (ACES WC) won by decision over Matthew Hughes (CARY MATMEN WC) Dec 3-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Max Andersen (LAWRENCE COUNTY WC) won by decision over Kailor Hecox (HECOX TEAM BENAIAH) Dec 7-0</li>\n<li>Cons. Round 2 - Brian Pence (CRYSTAL LAKE WIZARDS) won by decision over Collin Cronberg (LITTLE CELTIC WC) Dec 7-4</li>\n<li>Cons. Round 2 - Cain Bialas (WW TIGER WC) won by decision over Cosmo Halwix (BADGER WC) Dec 10-6</li>\n<li>Cons. Round 2 - Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) won by decision over August Tholl (ORLAND PARK PIONEERS) Dec 4-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Anthony Ferraro (GOMEZ WRESTLING ACADEMY) won by major decision over Jeremy Rivers (WESTVILLE YOUTH WC) Maj 13-5</li>\n<li>Cons. Round 2 - Benjamin Brancaleon (NAPERVILLE HUSKY WC) won by major decision over Matthew Stopka (MAD DOG WRESTLING ACADEMY) Maj 13-3</li>\n<li>Cons. Round 2 - Daniel Zimmerman (DAKOTA WC) won by fall over Nathan Cooper (ACES WC) Fall 3:54</li>\n<li>Cons. Round 2 - Bruce Henley (JJK WRESTLING) won by fall over Mason Jett (HOOPESTON AREA WC) Fall 1:58</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - AJ Friedrich (METAMORA KIDS WC) won by fall over Tom Schofield (MUSTANG WC) Fall 2:12</li>\n<li>Cons. Round 2 - Dylan Lydon (DAKOTA WC) won by decision over Rich Scheib (SPRINGFIELD CAPITAL KIDS WC) Dec 5-3</li>\n<li>Cons. Round 2 - Nathaniel Magiera (WOLVES WC) won by fall over Eric Gomez (YORKVILLE WRESTLING CLUB) Fall 2:31</li>\n<li>Cons. Round 2 - Toby Rivera (CHAMPAIGN KIDS WRESTLING) won by fall over Matthew Glenn (JUNIOR SPARTANS WC) Fall 3:56</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Dee Alexander (LITTLE FALCONS WC) won by fall over Anthony Escobar (SHAMROCK WC) Fall 3:23</li>\n<li>Cons. Round 2 - Stu Landin (TINLEY PARK BULLDOGS) won by major decision over Brent Lindenman (FOX VALLEY WC) Maj 12-0</li>\n<li>Cons. Round 2 - Ty Harmston (RENEGADES (STOCKTON)) won by fall over Ryan Brown (JJK WRESTLING) Fall 1:23</li>\n<li>Cons. Round 2 - Dalton Stokes (TAYLORVILLE WC) won by fall over Andres Heredia (VITTUM CATS) Fall 0:49</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Kyle Tex (TAYLORVILLE WC) won by decision over Nicholas Czar (HIGHLAND BULLDOG JR WC) Dec 4-2</li>\n<li>Cons. Round 2 - Cameron Baxter (HARLEM WRESTLING CLUB) won by fall over Shane Favier (MURPHYSBORO WRESTLING) Fall 1:03</li>\n<li>Cons. Round 2 - Zachary Hare (STILLMAN VALLEY WC) won by major decision over Ryan Berman (LITTLE CELTIC WC) Maj 12-2</li>\n<li>Cons. Round 2 - Tyler Dicken (WESTVILLE YOUTH WC) won by fall over Simon Montez (BELVIDERE BANDITS) Fall 2:33</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Jimmy Dinardo (MORTON LITTLE MUSTANGS) won by decision over Harry Potts (KANE COUNTY GRAPPLERS) Dec 4-3</li>\n<li>Cons. Round 2 - Timothy O`sullivan (FORCE WRESTLING) won by decision over Erik Aguirre (TOMCAT WC) Dec 3-0</li>\n<li>Cons. Round 2 - Matthew Kent (EDWARDSVILLE WC) won by fall over Blake Hooper (TAYLORVILLE WC) Fall 0:59</li>\n<li>Cons. Round 2 - Jabari Jones (RENEGADE WC (NFP)) won by fall over Daniel Garcia (MURPHYSBORO WRESTLING) Fall 1:13</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Devion May (JUNIOR SPARTANS WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Pat Bieber (MC BULLDOGS) won by decision over Bobby Carson (ELMHURST JR. DUKES) Dec 6-1</li>\n<li>Cons. Round 2 - Nicholas Wolf (FORCE WRESTLING) received a bye   () Bye</li>\n<li>Cons. Round 2 - Rodolfo Antuna (FALCON WC) won by fall over Jeremiah Binion (GLENBARD EAST JR RAMS) Fall 0:42</li>\n</ul>\n</section>",
  "Champ Semis & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semis &amp; Con Quarterfinal</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Pat Walker (GOMEZ WRESTLING ACADEMY) won by decision over Marcus Povlick (FORCE WRESTLING) Dec 6-0</li>\n<li>Semifinal - Louie Hayes (MARTINEZ FOX VALLEY ELITE) won by decision over Dack Punke (CENTRAL ELITE REBELS) Dec 5-1</li>\n<li>Cons. Round 3 - Anthony Madrigal (BRONCO WRESTLING) won by major decision over Kyle Szlenk (CRYSTAL LAKE WIZARDS) Maj 9-0</li>\n<li>Cons. Round 3 - Travis Piotrowski (WOLVES WC) won by fall over Cooper Secker (UNITED SOUTHERN ALLSTARS) Fall 0:45</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Dylan Duncan (SCN YOUTH WC) won by major decision over Christian Kanzler (WRESTLING FACTORY) Maj 11-1</li>\n<li>Semifinal - Jason Renteria (BRONCO WRESTLING) won by decision over Anthony Cheloni (SCN YOUTH WC) Dec 7-6</li>\n<li>Cons. Round 3 - Jarod Foiles (ROXANA KIDS WC) won by decision over James Higdon (COLLINSVILLE RAIDERS) Dec 5-2</li>\n<li>Cons. Round 3 - Michael Mcgee (FORCE WRESTLING) won by decision over Zachary Lorek (TINLEY PARK BULLDOGS) Dec 5-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Austin Gomez (GOMEZ WRESTLING ACADEMY) won by decision over Cameron Roat (LITTLE CELTIC WC) Dec 6-5</li>\n<li>Semifinal - Christian Robertson (VITTUM CATS) won by decision over Gavin Sutton (GOMEZ WRESTLING ACADEMY) Dec 8-4</li>\n<li>Cons. Round 3 - Jacob Dudeck (TINLEY PARK BULLDOGS) won by decision over Peter Ogunsanya (HARVEY TWISTERS) Dec 6-2</li>\n<li>Cons. Round 3 - Tristan Birt (FALCON YOUTH WC) won by fall over Ian Mullen (WOLVES WC) Fall 2:52</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Kyle Peisker (GOMEZ WRESTLING ACADEMY) won by major decision over Braxten Ary (MIDWEST CENTRAL YOUTH) Maj 8-0</li>\n<li>Semifinal - Austin O`connor (TINLEY PARK BULLDOGS) won by major decision over Andrew Mcfall (FORCE WRESTLING) Maj 16-5</li>\n<li>Cons. Round 3 - Thomas Svestka (MARTINEZ FOX VALLEY ELITE) won by decision over Dalton Brito (EDWARDSVILLE WC) Dec 7-6</li>\n<li>Cons. Round 3 - Patrick Augustyn (GOMEZ WRESTLING ACADEMY) won by fall over Hunter Webb (SAUK VALLEY WC) Fall 1:54</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won by decision over Devin Kane (MARTINEZ FOX VALLEY ELITE) Dec 7-1</li>\n<li>Semifinal - Aj Jaffe (SCN YOUTH WC) won by tech fall over Garrett Dziedzic (CRYSTAL LAKE WIZARDS) TF 18-0</li>\n<li>Cons. Round 3 - Jacob Silzer (TINLEY PARK BULLDOGS) won in overtime over Keegan Powers (HONONEGAH KIDS WC) OT 7-5</li>\n<li>Cons. Round 3 - Mitchell Stathakis (BARRINGTON BRONCOS) won by decision over Eric Carter (WRESTLING FACTORY) Dec 6-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Matt Rowland (SCN YOUTH WC) won by major decision over Dylan Elmore (HARLEM WRESTLING CLUB) Maj 13-1</li>\n<li>Semifinal - Jake Drew (GOMEZ WRESTLING ACADEMY) won by decision over Riley Beard (PEORIA RAZORBACKS YOUTH WC) Dec 4-0</li>\n<li>Cons. Round 3 - Kordell Norfleet (HARVEY TWISTERS) won by major decision over Trent Rakers (HIGHLAND BULLDOG JR WC) Maj 17-4</li>\n<li>Cons. Round 3 - David Kasper (SOUTHSIDE STALLIONS) won by tech fall over Jacob Hawkins (SHOOTERS ELITE WC) TF 15-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Michael Callahan (SCN YOUTH WC) won by decision over James Wolfe (SHOOTERS ELITE WC) Dec 6-3</li>\n<li>Semifinal - Ryder Punke (CENTRAL ELITE REBELS) won by decision over Vincent Turk (CRYSTAL LAKE WIZARDS) Dec 10-4</li>\n<li>Cons. Round 3 - Vaughn Hobart (PONTIAC WC) won by decision over Peter Perich (FORCE WRESTLING) Dec 5-2</li>\n<li>Cons. Round 3 - Nicky Gasbarro (JUNIOR SPARTANS WC) won by fall over Jake Tisza (JUNIOR SPARTANS WC) Fall 4:02</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Eric Barone (WOLVES WC) won by decision over Noah Drabek (LAKELAND PREDATORS) Dec 4-0</li>\n<li>Semifinal - Carver James (DAKOTA WC) won by decision over Jakada Hull (HARVEY TWISTERS) Dec 7-2</li>\n<li>Cons. Round 3 - Kamal Bey (HARVEY TWISTERS) won by fall over Andrew Wenger (DAKOTA WC) Fall 4:04</li>\n<li>Cons. Round 3 - Carlos Jacquez (MARTINEZ FOX VALLEY ELITE) won by injury default over Kameron Irvin (GLADIATORS) Inj. 0:00</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Juwan Edmond (GLADIATORS) won by fall over Tom Slattery (TINLEY PARK BULLDOGS) Fall 0:41</li>\n<li>Semifinal - Isaih White (HARVEY TWISTERS) won by tech fall over Mason Tomash (STILLMAN VALLEY WC) TF 18-3</li>\n<li>Cons. Round 3 - Michael Petersen (WOLVES WC) won by decision over Brayton Williams (EDWARDSVILLE WC) Dec 1-0</li>\n<li>Cons. Round 3 - Carson Oughton (INDIANS ELITE) won by fall over Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) Fall 3:34</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Randy Meneweather (KNOX COUNTY KRUSHERS) won by decision over Ryan Willett (RENEGADE WC (NFP)) Dec 5-2</li>\n<li>Semifinal - Larry Early (FORCE WRESTLING) won by decision over Fernie Silva (HONONEGAH KIDS WC) Dec 8-3</li>\n<li>Cons. Round 3 - Andrew Marsden (CRYSTAL LAKE WIZARDS) won by decision over Trace Carello (MT. VERNON LIONS) Dec 4-2</li>\n<li>Cons. Round 3 - Josiah Cropp (GENESEO SPIDER WC) won by decision over Matt Kleinkopf (LITTLE HUSKIE WC) Dec 4-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Gabe Pleasants (MORTON YOUTH WRESTLING) won by fall over Nathan Romero (DUNDEE HIGHLANDERS) Fall 2:01</li>\n<li>Semifinal - Tyler Demoss (HONONEGAH KIDS WC) won by decision over Dru Worker (TINLEY PARK BULLDOGS) Dec 5-3</li>\n<li>Cons. Round 3 - Anfernee Hale (HARVEY TWISTERS) won by major decision over Nathan Traxler (SCN YOUTH WC) Maj 14-0</li>\n<li>Cons. Round 3 - Ryan Pitra (GENESEO SPIDER WC) won by major decision over Jordan Sullivan (YORKVILLE WRESTLING CLUB) Maj 9-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Timothy Young (TOMCAT WC) won in overtime over Matthew Striegel (O`FALLON LITTLE PANTHERS) OT 10-8</li>\n<li>Semifinal - Brady Rude (SAUK VALLEY WC) won by tech fall over Dalton Blankenship (ROXANA KIDS WC) TF 16-0</li>\n<li>Cons. Round 3 - John Mclaughlin (VITTUM CATS) won by decision over Sanchir Avirmed (SHARKS WC) Dec 5-0</li>\n<li>Cons. Round 3 - Wesley Villarreal (KANE COUNTY GRAPPLERS) won by fall over Colton Reed (MAHOMET-SEYMOUR YOUTH WC) Fall 1:02</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Jacob Villarreal (KANE COUNTY GRAPPLERS) won by decision over Joseph Medina (GENESEO SPIDER WC) Dec 8-3</li>\n<li>Semifinal - Christopher Hiscock (INDIANS ELITE) won by decision over Kenny Condon (VITTUM CATS) Dec 6-4</li>\n<li>Cons. Round 3 - Christian Embrey (LITTLE REDSKINS WC) won by fall over Al`lon Carter (GLADIATORS) Fall 4:15</li>\n<li>Cons. Round 3 - De`gyon Macklin (ROCKFORD WC) won by decision over Jacob Spanier (MENDOTA MAT MASTERS) Dec 6-3</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Blake Cripe (VANDALIA JR WRESTLING) won by major decision over Lucas Greenberg (VILLA LOMBARD COUGARS) Maj 14-2</li>\n<li>Semifinal - Allen Stallings (GLADIATORS) won by fall over Patrick Kristin (TINLEY PARK BULLDOGS) Fall 4:05</li>\n<li>Cons. Round 3 - Alex Timmons (KNOX COUNTY KRUSHERS) won by major decision over Kacy Jent (CHARLESTON WC) Maj 15-3</li>\n<li>Cons. Round 3 - Justin Esposito (LITTLE CELTIC WC) won by decision over Claude Shelby (UNITED SOUTHERN ALLSTARS) Dec 5-2</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Tyler Johnson (LEMONT BEARS WC) won by fall over Isaac Flores (CARBONDALE WC) Fall 0:56</li>\n<li>Semifinal - Ian Harwick (HARLEM WRESTLING CLUB) won by decision over Joshua Bouie (INDIANS ELITE) Dec 9-3</li>\n<li>Cons. Round 3 - Christian Thompson (WOLVES WC) won by decision over David Newman (INDIANS ELITE) Dec 3-0</li>\n<li>Cons. Round 3 - Tad Cravens (HERRIN JUNIOR WC) won by decision over Alex Gelber (SPRINGFIELD CAPITAL KIDS WC) Dec 6-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Keith Mcgee (JUNIOR SPARTANS WC) won by major decision over Cody Barnes (CRYSTAL LAKE WIZARDS) Maj 10-1</li>\n<li>Semifinal - Lucas Warren (BLACKHAWK WC) won by fall over Adrian Salinas (SHAMROCK WC) Fall 1:27</li>\n<li>Cons. Round 3 - Tristan Penrod (MT. VERNON LIONS) won by decision over Nick Becker (TINLEY PARK BULLDOGS) Dec 7-0</li>\n<li>Cons. Round 3 - Dalton Kettering (ROCK ISLAND WC) won by fall over Keiffer Johnston (SHELBYVILLE JR RAMS WRESTLING) Fall 0:30</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Matthew Iwinski (FORCE WRESTLING) won by fall over Jake Ford (MUSTANG WC) Fall 2:13</li>\n<li>Semifinal - Jacob Heavlin (WARRIOR MONKS) won by fall over Matthew Bernal (REBELS WC) Fall 2:26</li>\n<li>Cons. Round 3 - Antonio James (JJK WRESTLING) won by fall over Tristan Miller (THE LAW) Fall 2:08</li>\n<li>Cons. Round 3 - Bryan Ditchman (TINLEY PARK BULLDOGS) won by fall over Sammy Perez (DUNDEE HIGHLANDERS) Fall 0:13</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Jabari Moody (HARVEY TWISTERS) won by decision over Ian Meagher (LITTLE CELTIC WC) Dec 10-4</li>\n<li>Semifinal - Rudy Yates (VITTUM CATS) won by decision over Sean Augello (FORCE WRESTLING) Dec 3-0</li>\n<li>Cons. Round 3 - Brady Powers (HONONEGAH KIDS WC) won in overtime over Nicholas Koch (LAKELAND PREDATORS) OT 8-6</li>\n<li>Cons. Round 3 - Carlos Fuentez (VILLA LOMBARD COUGARS) won by decision over Vinnie Piunti (MARTINEZ FOX VALLEY ELITE) Dec 8-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Anthony Bosco (SCN YOUTH WC) won by decision over Grant Sutton (GOMEZ WRESTLING ACADEMY) Dec 5-2</li>\n<li>Semifinal - Miguel Silva Jr (MARTINEZ FOX VALLEY ELITE) won by decision over Noell Carrillo (WRESTLING FACTORY) Dec 2-1</li>\n<li>Cons. Round 3 - Jack Diana (MUSTANG WC) won by decision over Jeffery Morrow (CRYSTAL LAKE WIZARDS) Dec 6-3</li>\n<li>Cons. Round 3 - Gunner Wenger (THE LAW) won by decision over Justin Nelson (UNITED SOUTHERN ALLSTARS) Dec 5-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Michael Cullen (WRESTLING FACTORY) won by decision over Brian Rossi (FALCON WC) Dec 8-5</li>\n<li>Semifinal - Austin Ryan (CRYSTAL LAKE WIZARDS) won by decision over Titus Taylor (BELLEVILLE LITTLE DEVILS) Dec 4-3</li>\n<li>Cons. Round 3 - Brandon Briggs (SHOOTERS ELITE WC) won by decision over Dan Davis (TINLEY PARK BULLDOGS) Dec 7-1</li>\n<li>Cons. Round 3 - Dominic Naso (FORCE WRESTLING) won by decision over Kris Williams (HARVEY TWISTERS) Dec 5-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Matthew Rundell (ARLINGTON CARDINALS) won by decision over Mario Leveille (OAK FOREST WARRIORS) Dec 7-2</li>\n<li>Semifinal - Josh Alber (DAKOTA WC) won by decision over Elijah Oliver (HARVEY TWISTERS) Dec 5-0</li>\n<li>Cons. Round 3 - Jacob Wever (L-P CRUNCHING CAVS) won by fall over Adam Mcconnell (BELVIDERE BANDITS) Fall 1:09</li>\n<li>Cons. Round 3 - Joshua Fuqua (CROSSTOWN WC) won by decision over Stephen Richardson (PONTIAC WC) Dec 6-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Nick Nasenbeny (FORCE WRESTLING) won by fall over Jack Lucie (WEST HANCOCK TITAN WC) Fall 1:17</li>\n<li>Semifinal - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won by major decision over Nathan Jozsa (SPRINGFIELD CAPITAL KIDS WC) Maj 13-1</li>\n<li>Cons. Round 3 - Gacob Lenox (DAKOTA WC) won by major decision over Jacob Plekavic (JR. BLAZER WC) Maj 8-0</li>\n<li>Cons. Round 3 - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by decision over Cory Winchell (LITTLE CELTIC WC) Dec 2-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Garrett Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Kyle Akins (SYCAMORE WC) Dec 3-1</li>\n<li>Semifinal - John Jimenez (SCN YOUTH WC) won by fall over Israel Santiago (GRAPPLIN` DEVILS WC) Fall 4:10</li>\n<li>Cons. Round 3 - Mark Duda (CROSSTOWN WC) won by major decision over Nicholas Ferraro (SCN YOUTH WC) Maj 12-4</li>\n<li>Cons. Round 3 - Danny Carlson (REBELS WC) won by decision over Bryce Ivey (SAUK VALLEY WC) Dec 8-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by decision over Nicholas Gil (CRYSTAL LAKE WIZARDS) Dec 2-0</li>\n<li>Semifinal - Michael Zelasco (CRYSTAL LAKE WIZARDS) won by decision over Jake Snow (SAUK VALLEY WC) Dec 3-0</li>\n<li>Cons. Round 3 - Joseph Fulco (FORCE WRESTLING) won by fall over Flynn Nagel (VITTUM CATS) Fall 4:04</li>\n<li>Cons. Round 3 - Johnny Pellegrino (ORLAND PARK PIONEERS) won by decision over Chase Vosburgh (MT. VERNON LIONS) Dec 8-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Sean Lynch (WRESTLING FACTORY) won by decision over Thomas O`brien (SCN YOUTH WC) Dec 6-2</li>\n<li>Semifinal - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won by fall over John Kriha (CROSSTOWN WC) Fall 2:03</li>\n<li>Cons. Round 3 - Brad Wood (ORLAND PARK PIONEERS) won by fall over Nicholas Bonomo (BRONCO WRESTLING) Fall 2:54</li>\n<li>Cons. Round 3 - Sage Friese (SENECA IRISH CADETS) won by decision over Xavier Montalvo (GOMEZ WRESTLING ACADEMY) Dec 7-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Anthony Scaccia (SCN YOUTH WC) won by fall over Ryan Fish (GLADIATORS) Fall 0:40</li>\n<li>Semifinal - Bryce Brill (FOX VALLEY WC) won by decision over Michael Pixley (GRANITE CITY WC) Dec 8-1</li>\n<li>Cons. Round 3 - Tommy Brewster (MAINE EAGLES) won by decision over James Geier (FORCE WRESTLING) Dec 2-0</li>\n<li>Cons. Round 3 - Geno Quaid (WRESTLING FACTORY) won by major decision over Austin Hedrick (MAHOMET-SEYMOUR YOUTH WC) Maj 15-7</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Eddie Gonzalez (GOMEZ WRESTLING ACADEMY) won by fall over Tommy Klinger (CRYSTAL LAKE WIZARDS) Fall 0:55</li>\n<li>Semifinal - Andres Gonzalez (MARTINEZ FOX VALLEY ELITE) won in double overtime over Connor Bandy (TINLEY PARK BULLDOGS) 2-OT 5-4</li>\n<li>Cons. Round 3 - Nate Higgins (UNITED SOUTHERN ALLSTARS) won by major decision over Tyre Lee (RENEGADE WC (NFP)) Maj 10-1</li>\n<li>Cons. Round 3 - Anthony Palacios (WILL COUNTY WARRIORS) won by tech fall over Keegan Gardner (WEST FRANKFORT JR WRESTLING) TF 15-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Peter Andreotti (VITTUM CATS) won by decision over Edmond Hogan (LANCER WC) Dec 8-2</li>\n<li>Semifinal - Davonte Mahomes (WILL COUNTY WARRIORS) won by decision over Zac Keller (LAKELAND PREDATORS) Dec 13-6</li>\n<li>Cons. Round 3 - Lonnie Cleveland Iii (BULLS WC) won by decision over Jean Louis Sawadogo (ROCK ISLAND WC) Dec 8-3</li>\n<li>Cons. Round 3 - Jacob Kroeger (VILLA PARK YOUNG WARRIORS) won by fall over Kane Garcia (ACES WC) Fall 2:06</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Connor Doak (JUNIOR PIONEER WC) won by fall over Michael Gastaldello (DOWNERS GROVE COUGARS) Fall 3:00</li>\n<li>Semifinal - Torrie Williams (GRANITE CITY WC) won by decision over Quincy Kalkbrenner (THE LAW) Dec 8-3</li>\n<li>Cons. Round 3 - Brian Pence (CRYSTAL LAKE WIZARDS) won in overtime over Max Andersen (LAWRENCE COUNTY WC) OT 4-2</li>\n<li>Cons. Round 3 - Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) won by decision over Cain Bialas (WW TIGER WC) Dec 4-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Bryce Gorman (LITTLE CELTIC WC) won by decision over Justin Heavilon (GRANITE CITY WC) Dec 1-0</li>\n<li>Semifinal - Connor Swier (FORCE WRESTLING) won by major decision over Jimique Davis (VILLA LOMBARD COUGARS) Maj 14-3</li>\n<li>Cons. Round 3 - Anthony Ferraro (GOMEZ WRESTLING ACADEMY) won by fall over Benjamin Brancaleon (NAPERVILLE HUSKY WC) Fall 2:24</li>\n<li>Cons. Round 3 - Daniel Zimmerman (DAKOTA WC) won by decision over Bruce Henley (JJK WRESTLING) Dec 4-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Nicholas Favale (LITTLE FALCONS WC) won by fall over Deuce Rachal (HARVEY TWISTERS) Fall 2:39</li>\n<li>Semifinal - Alex Benoit (REDHAWK WC) won by decision over Tyler Barton (SYCAMORE WC) Dec 6-3</li>\n<li>Cons. Round 3 - AJ Friedrich (METAMORA KIDS WC) won by decision over Dylan Lydon (DAKOTA WC) Dec 4-0</li>\n<li>Cons. Round 3 - Nathaniel Magiera (WOLVES WC) won by fall over Toby Rivera (CHAMPAIGN KIDS WRESTLING) Fall 3:36</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Sage Hecox (HECOX TEAM BENAIAH) won by fall over Keagan Griffin (FORCE WRESTLING) Fall 0:45</li>\n<li>Semifinal - Andre Mickens (JUNIOR SPARTANS WC) won by decision over Brian Allen (HINSDALE WC) Dec 5-2</li>\n<li>Cons. Round 3 - Dee Alexander (LITTLE FALCONS WC) won by fall over Stu Landin (TINLEY PARK BULLDOGS) Fall 1:11</li>\n<li>Cons. Round 3 - Ty Harmston (RENEGADES (STOCKTON)) won by fall over Dalton Stokes (TAYLORVILLE WC) Fall 3:18</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Moises Pina (MORTON LITTLE MUSTANGS) won by fall over Jordan Ladd (CHILLI DAWGS WC) Fall 2:50</li>\n<li>Semifinal - Noah Fleckenstein (LIONS WC) won by decision over Nicky Allegretti (VITTUM CATS) Dec 1-0</li>\n<li>Cons. Round 3 - Cameron Baxter (HARLEM WRESTLING CLUB) won by fall over Kyle Tex (TAYLORVILLE WC) Fall 1:46</li>\n<li>Cons. Round 3 - Tyler Dicken (WESTVILLE YOUTH WC) won by fall over Zachary Hare (STILLMAN VALLEY WC) Fall 1:23</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Tanner Farmer (HIGHLAND BULLDOG JR WC) won by fall over Tyler Ortmann (ARGENTA-OREANA KIDS CLUB) Fall 1:20</li>\n<li>Semifinal - Edgar Ruano (BRONCO WRESTLING) won by decision over Joshua Wallick (FISHER WC) Dec 2-1</li>\n<li>Cons. Round 3 - Jimmy Dinardo (MORTON LITTLE MUSTANGS) won by decision over Timothy O`sullivan (FORCE WRESTLING) Dec 3-2</li>\n<li>Cons. Round 3 - Matthew Kent (EDWARDSVILLE WC) won by fall over Jabari Jones (RENEGADE WC (NFP)) Fall 1:28</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Adarios Jones (MOLINE WC) won by decision over Jack Bornhofen (BARRINGTON BRONCOS) Dec 6-1</li>\n<li>Semifinal - Michael Johnson Jr (DOWNERS GROVE COUGARS) won by fall over Kyle Haegele (HIGHLAND BULLDOG JR WC) Fall 0:30</li>\n<li>Cons. Round 3 - Devion May (JUNIOR SPARTANS WC) won by decision over Pat Bieber (MC BULLDOGS) Dec 9-2</li>\n<li>Cons. Round 3 - Nicholas Wolf (FORCE WRESTLING) won by fall over Rodolfo Antuna (FALCON WC) Fall 3:45</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Anthony Madrigal (BRONCO WRESTLING) won by decision over Marcus Povlick (FORCE WRESTLING) Dec 2-1</li>\n<li>Cons. Semi - Travis Piotrowski (WOLVES WC) won by decision over Dack Punke (CENTRAL ELITE REBELS) Dec 1-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Christian Kanzler (WRESTLING FACTORY) won by major decision over Jarod Foiles (ROXANA KIDS WC) Maj 11-1</li>\n<li>Cons. Semi - Anthony Cheloni (SCN YOUTH WC) won by major decision over Michael Mcgee (FORCE WRESTLING) Maj 12-4</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Cameron Roat (LITTLE CELTIC WC) won by decision over Jacob Dudeck (TINLEY PARK BULLDOGS) Dec 6-4</li>\n<li>Cons. Semi - Gavin Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Tristan Birt (FALCON YOUTH WC) Dec 8-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Thomas Svestka (MARTINEZ FOX VALLEY ELITE) won by fall over Braxten Ary (MIDWEST CENTRAL YOUTH) Fall 2:09</li>\n<li>Cons. Semi - Andrew Mcfall (FORCE WRESTLING) won in overtime over Patrick Augustyn (GOMEZ WRESTLING ACADEMY) OT 6-5</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Devin Kane (MARTINEZ FOX VALLEY ELITE) won in overtime over Jacob Silzer (TINLEY PARK BULLDOGS) OT 3-2</li>\n<li>Cons. Semi - Mitchell Stathakis (BARRINGTON BRONCOS) won by decision over Garrett Dziedzic (CRYSTAL LAKE WIZARDS) Dec 3-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Kordell Norfleet (HARVEY TWISTERS) won by decision over Dylan Elmore (HARLEM WRESTLING CLUB) Dec 8-1</li>\n<li>Cons. Semi - David Kasper (SOUTHSIDE STALLIONS) won by decision over Riley Beard (PEORIA RAZORBACKS YOUTH WC) Dec 7-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - James Wolfe (SHOOTERS ELITE WC) won by decision over Vaughn Hobart (PONTIAC WC) Dec 7-2</li>\n<li>Cons. Semi - Vincent Turk (CRYSTAL LAKE WIZARDS) won by decision over Nicky Gasbarro (JUNIOR SPARTANS WC) Dec 3-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Kamal Bey (HARVEY TWISTERS) won by decision over Noah Drabek (LAKELAND PREDATORS) Dec 8-3</li>\n<li>Cons. Semi - Jakada Hull (HARVEY TWISTERS) won by fall over Carlos Jacquez (MARTINEZ FOX VALLEY ELITE) Fall 4:28</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Michael Petersen (WOLVES WC) won by disqualification over Tom Slattery (TINLEY PARK BULLDOGS) DQ</li>\n<li>Cons. Semi - Carson Oughton (INDIANS ELITE) won in overtime over Mason Tomash (STILLMAN VALLEY WC) OT 8-6</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Ryan Willett (RENEGADE WC (NFP)) won by decision over Andrew Marsden (CRYSTAL LAKE WIZARDS) Dec 3-1</li>\n<li>Cons. Semi - Josiah Cropp (GENESEO SPIDER WC) won by decision over Fernie Silva (HONONEGAH KIDS WC) Dec 5-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Anfernee Hale (HARVEY TWISTERS) won by fall over Nathan Romero (DUNDEE HIGHLANDERS) Fall 1:23</li>\n<li>Cons. Semi - Dru Worker (TINLEY PARK BULLDOGS) won by decision over Ryan Pitra (GENESEO SPIDER WC) Dec 6-3</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Matthew Striegel (O`FALLON LITTLE PANTHERS) won in overtime over John Mclaughlin (VITTUM CATS) OT 4-2</li>\n<li>Cons. Semi - Wesley Villarreal (KANE COUNTY GRAPPLERS) won by decision over Dalton Blankenship (ROXANA KIDS WC) Dec 11-9</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Joseph Medina (GENESEO SPIDER WC) won by decision over Christian Embrey (LITTLE REDSKINS WC) Dec 8-4</li>\n<li>Cons. Semi - Kenny Condon (VITTUM CATS) won by fall over De`gyon Macklin (ROCKFORD WC) Fall 0:10</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Lucas Greenberg (VILLA LOMBARD COUGARS) won by decision over Alex Timmons (KNOX COUNTY KRUSHERS) Dec 9-7</li>\n<li>Cons. Semi - Justin Esposito (LITTLE CELTIC WC) won by fall over Patrick Kristin (TINLEY PARK BULLDOGS) Fall 3:59</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Christian Thompson (WOLVES WC) won by fall over Isaac Flores (CARBONDALE WC) Fall 2:41</li>\n<li>Cons. Semi - Joshua Bouie (INDIANS ELITE) won by decision over Tad Cravens (HERRIN JUNIOR WC) Dec 4-3</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Tristan Penrod (MT. VERNON LIONS) won by decision over Cody Barnes (CRYSTAL LAKE WIZARDS) Dec 3-1</li>\n<li>Cons. Semi - Dalton Kettering (ROCK ISLAND WC) won by fall over Adrian Salinas (SHAMROCK WC) Fall 1:53</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Jake Ford (MUSTANG WC) won by fall over Antonio James (JJK WRESTLING) Fall 1:18</li>\n<li>Cons. Semi - Bryan Ditchman (TINLEY PARK BULLDOGS) won by fall over Matthew Bernal (REBELS WC) Fall 0:46</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Ian Meagher (LITTLE CELTIC WC) won by fall over Brady Powers (HONONEGAH KIDS WC) Fall 3:45</li>\n<li>Cons. Semi - Carlos Fuentez (VILLA LOMBARD COUGARS) won by decision over Sean Augello (FORCE WRESTLING) Dec 9-3</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Grant Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Jack Diana (MUSTANG WC) Dec 2-1</li>\n<li>Cons. Semi - Noell Carrillo (WRESTLING FACTORY) won by fall over Gunner Wenger (THE LAW) Fall 3:00</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Brian Rossi (FALCON WC) won by decision over Brandon Briggs (SHOOTERS ELITE WC) Dec 3-1</li>\n<li>Cons. Semi - Titus Taylor (BELLEVILLE LITTLE DEVILS) won by decision over Dominic Naso (FORCE WRESTLING) Dec 7-6</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Mario Leveille (OAK FOREST WARRIORS) won by decision over Jacob Wever (L-P CRUNCHING CAVS) Dec 5-4</li>\n<li>Cons. Semi - Joshua Fuqua (CROSSTOWN WC) won by decision over Elijah Oliver (HARVEY TWISTERS) Dec 6-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Gacob Lenox (DAKOTA WC) won by decision over Jack Lucie (WEST HANCOCK TITAN WC) Dec 2-0</li>\n<li>Cons. Semi - Nathan Jozsa (SPRINGFIELD CAPITAL KIDS WC) won by decision over Kyle Fugiel (CRYSTAL LAKE WIZARDS) Dec 2-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Mark Duda (CROSSTOWN WC) won by decision over Kyle Akins (SYCAMORE WC) Dec 2-1</li>\n<li>Cons. Semi - Israel Santiago (GRAPPLIN` DEVILS WC) won by decision over Danny Carlson (REBELS WC) Dec 8-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Nicholas Gil (CRYSTAL LAKE WIZARDS) won by decision over Joseph Fulco (FORCE WRESTLING) Dec 2-0</li>\n<li>Cons. Semi - Jake Snow (SAUK VALLEY WC) won by decision over Johnny Pellegrino (ORLAND PARK PIONEERS) Dec 8-4</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Thomas O`brien (SCN YOUTH WC) won by decision over Brad Wood (ORLAND PARK PIONEERS) Dec 5-2</li>\n<li>Cons. Semi - John Kriha (CROSSTOWN WC) won by fall over Sage Friese (SENECA IRISH CADETS) Fall 4:08</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Tommy Brewster (MAINE EAGLES) won by decision over Ryan Fish (GLADIATORS) Dec 7-2</li>\n<li>Cons. Semi - Michael Pixley (GRANITE CITY WC) won by fall over Geno Quaid (WRESTLING FACTORY) Fall 2:53</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Nate Higgins (UNITED SOUTHERN ALLSTARS) won by fall over Tommy Klinger (CRYSTAL LAKE WIZARDS) Fall 2:15</li>\n<li>Cons. Semi - Connor Bandy (TINLEY PARK BULLDOGS) won by decision over Anthony Palacios (WILL COUNTY WARRIORS) Dec 5-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Lonnie Cleveland Iii (BULLS WC) won by decision over Edmond Hogan (LANCER WC) Dec 8-2</li>\n<li>Cons. Semi - Zac Keller (LAKELAND PREDATORS) won by fall over Jacob Kroeger (VILLA PARK YOUNG WARRIORS) Fall 4:16</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Michael Gastaldello (DOWNERS GROVE COUGARS) won by decision over Brian Pence (CRYSTAL LAKE WIZARDS) Dec 6-5</li>\n<li>Cons. Semi - Quincy Kalkbrenner (THE LAW) won by fall over Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) Fall 1:49</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Justin Heavilon (GRANITE CITY WC) won by decision over Anthony Ferraro (GOMEZ WRESTLING ACADEMY) Dec 5-3</li>\n<li>Cons. Semi - Jimique Davis (VILLA LOMBARD COUGARS) won by decision over Daniel Zimmerman (DAKOTA WC) Dec 5-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Deuce Rachal (HARVEY TWISTERS) won by major decision over AJ Friedrich (METAMORA KIDS WC) Maj 11-1</li>\n<li>Cons. Semi - Nathaniel Magiera (WOLVES WC) won by decision over Tyler Barton (SYCAMORE WC) Dec 2-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Keagan Griffin (FORCE WRESTLING) won by decision over Dee Alexander (LITTLE FALCONS WC) Dec 9-6</li>\n<li>Cons. Semi - Brian Allen (HINSDALE WC) won by decision over Ty Harmston (RENEGADES (STOCKTON)) Dec 8-5</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Cameron Baxter (HARLEM WRESTLING CLUB) won by injury default over Jordan Ladd (CHILLI DAWGS WC) Inj. 0:00</li>\n<li>Cons. Semi - Nicky Allegretti (VITTUM CATS) won by fall over Tyler Dicken (WESTVILLE YOUTH WC) Fall 2:50</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Tyler Ortmann (ARGENTA-OREANA KIDS CLUB) won by decision over Jimmy Dinardo (MORTON LITTLE MUSTANGS) Dec 6-3</li>\n<li>Cons. Semi - Joshua Wallick (FISHER WC) won by fall over Matthew Kent (EDWARDSVILLE WC) Fall 0:48</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Devion May (JUNIOR SPARTANS WC) won by major decision over Jack Bornhofen (BARRINGTON BRONCOS) Maj 15-7</li>\n<li>Cons. Semi - Kyle Haegele (HIGHLAND BULLDOG JR WC) won by decision over Nicholas Wolf (FORCE WRESTLING) Dec 8-4</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Anthony Madrigal (BRONCO WRESTLING) won by decision over Travis Piotrowski (WOLVES WC) Dec 6-2</li>\n<li>5th Place Match - Dack Punke (CENTRAL ELITE REBELS) won by decision over Marcus Povlick (FORCE WRESTLING) Dec 10-4</li>\n<li>7th Place Match - Kyle Szlenk (CRYSTAL LAKE WIZARDS) won by fall over Cooper Secker (UNITED SOUTHERN ALLSTARS) Fall 0:56</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Anthony Cheloni (SCN YOUTH WC) won by fall over Christian Kanzler (WRESTLING FACTORY) Fall 0:42</li>\n<li>5th Place Match - Jarod Foiles (ROXANA KIDS WC) won by decision over Michael Mcgee (FORCE WRESTLING) Dec 11-5</li>\n<li>7th Place Match - Zachary Lorek (TINLEY PARK BULLDOGS) won by fall over James Higdon (COLLINSVILLE RAIDERS) Fall 4:00</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Gavin Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Cameron Roat (LITTLE CELTIC WC) Dec 6-4</li>\n<li>5th Place Match - Tristan Birt (FALCON YOUTH WC) won by decision over Jacob Dudeck (TINLEY PARK BULLDOGS) Dec 2-1</li>\n<li>7th Place Match - Ian Mullen (WOLVES WC) won by fall over Peter Ogunsanya (HARVEY TWISTERS) Fall 2:28</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Andrew Mcfall (FORCE WRESTLING) won by decision over Thomas Svestka (MARTINEZ FOX VALLEY ELITE) Dec 8-5</li>\n<li>5th Place Match - Patrick Augustyn (GOMEZ WRESTLING ACADEMY) won by decision over Braxten Ary (MIDWEST CENTRAL YOUTH) Dec 6-4</li>\n<li>7th Place Match - Dalton Brito (EDWARDSVILLE WC) won by major decision over Hunter Webb (SAUK VALLEY WC) Maj 8-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Devin Kane (MARTINEZ FOX VALLEY ELITE) won by major decision over Mitchell Stathakis (BARRINGTON BRONCOS) Maj 12-4</li>\n<li>5th Place Match - Jacob Silzer (TINLEY PARK BULLDOGS) won by decision over Garrett Dziedzic (CRYSTAL LAKE WIZARDS) Dec 4-0</li>\n<li>7th Place Match - Keegan Powers (HONONEGAH KIDS WC) won by decision over Eric Carter (WRESTLING FACTORY) Dec 4-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Kordell Norfleet (HARVEY TWISTERS) won by major decision over David Kasper (SOUTHSIDE STALLIONS) Maj 13-2</li>\n<li>5th Place Match - Riley Beard (PEORIA RAZORBACKS YOUTH WC) won by decision over Dylan Elmore (HARLEM WRESTLING CLUB) Dec 14-8</li>\n<li>7th Place Match - Trent Rakers (HIGHLAND BULLDOG JR WC) won by decision over Jacob Hawkins (SHOOTERS ELITE WC) Dec 7-5</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - James Wolfe (SHOOTERS ELITE WC) won by decision over Vincent Turk (CRYSTAL LAKE WIZARDS) Dec 4-2</li>\n<li>5th Place Match - Vaughn Hobart (PONTIAC WC) won by decision over Nicky Gasbarro (JUNIOR SPARTANS WC) Dec 3-0</li>\n<li>7th Place Match - Peter Perich (FORCE WRESTLING) won by decision over Jake Tisza (JUNIOR SPARTANS WC) Dec 7-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Kamal Bey (HARVEY TWISTERS) won by decision over Jakada Hull (HARVEY TWISTERS) Dec 6-5</li>\n<li>5th Place Match - Carlos Jacquez (MARTINEZ FOX VALLEY ELITE) won by major decision over Noah Drabek (LAKELAND PREDATORS) Maj 13-4</li>\n<li>7th Place Match - Andrew Wenger (DAKOTA WC) won by injury default over Kameron Irvin (GLADIATORS) Inj. 0:00</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Carson Oughton (INDIANS ELITE) won in overtime over Michael Petersen (WOLVES WC) OT 6-2</li>\n<li>5th Place Match - Tom Slattery (TINLEY PARK BULLDOGS) won by decision over Mason Tomash (STILLMAN VALLEY WC) Dec 6-3</li>\n<li>7th Place Match - Adam Hudson (SHELBYVILLE JR RAMS WRESTLING) won by decision over Brayton Williams (EDWARDSVILLE WC) Dec 7-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Ryan Willett (RENEGADE WC (NFP)) won by decision over Josiah Cropp (GENESEO SPIDER WC) Dec 8-2</li>\n<li>5th Place Match - Fernie Silva (HONONEGAH KIDS WC) won by decision over Andrew Marsden (CRYSTAL LAKE WIZARDS) Dec 7-1</li>\n<li>7th Place Match - Trace Carello (MT. VERNON LIONS) won by major decision over Matt Kleinkopf (LITTLE HUSKIE WC) Maj 17-5</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Dru Worker (TINLEY PARK BULLDOGS) won by decision over Anfernee Hale (HARVEY TWISTERS) Dec 6-5</li>\n<li>5th Place Match - Nathan Romero (DUNDEE HIGHLANDERS) won by decision over Ryan Pitra (GENESEO SPIDER WC) Dec 7-4</li>\n<li>7th Place Match - Jordan Sullivan (YORKVILLE WRESTLING CLUB) won by decision over Nathan Traxler (SCN YOUTH WC) Dec 4-2</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Matthew Striegel (O`FALLON LITTLE PANTHERS) won by decision over Wesley Villarreal (KANE COUNTY GRAPPLERS) Dec 9-5</li>\n<li>5th Place Match - John Mclaughlin (VITTUM CATS) won by major decision over Dalton Blankenship (ROXANA KIDS WC) Maj 12-0</li>\n<li>7th Place Match - Colton Reed (MAHOMET-SEYMOUR YOUTH WC) won by injury default over Sanchir Avirmed (SHARKS WC) Inj. 0:00</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Kenny Condon (VITTUM CATS) won by decision over Joseph Medina (GENESEO SPIDER WC) Dec 10-8</li>\n<li>5th Place Match - De`gyon Macklin (ROCKFORD WC) won by fall over Christian Embrey (LITTLE REDSKINS WC) Fall 0:24</li>\n<li>7th Place Match - Al`lon Carter (GLADIATORS) won by major decision over Jacob Spanier (MENDOTA MAT MASTERS) Maj 20-8</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Justin Esposito (LITTLE CELTIC WC) won by fall over Lucas Greenberg (VILLA LOMBARD COUGARS) Fall 4:18</li>\n<li>5th Place Match - Alex Timmons (KNOX COUNTY KRUSHERS) won by fall over Patrick Kristin (TINLEY PARK BULLDOGS) Fall 3:36</li>\n<li>7th Place Match - Claude Shelby (UNITED SOUTHERN ALLSTARS) won by fall over Kacy Jent (CHARLESTON WC) Fall 3:51</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Joshua Bouie (INDIANS ELITE) won by tech fall over Christian Thompson (WOLVES WC) TF 16-1</li>\n<li>5th Place Match - Tad Cravens (HERRIN JUNIOR WC) won by fall over Isaac Flores (CARBONDALE WC) Fall 2:46</li>\n<li>7th Place Match - Alex Gelber (SPRINGFIELD CAPITAL KIDS WC) won by decision over David Newman (INDIANS ELITE) Dec 7-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Tristan Penrod (MT. VERNON LIONS) won in overtime over Dalton Kettering (ROCK ISLAND WC) OT 8-6</li>\n<li>5th Place Match - Adrian Salinas (SHAMROCK WC) won by fall over Cody Barnes (CRYSTAL LAKE WIZARDS) Fall 1:18</li>\n<li>7th Place Match - Nick Becker (TINLEY PARK BULLDOGS) won by decision over Keiffer Johnston (SHELBYVILLE JR RAMS WRESTLING) Dec 4-3</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Jake Ford (MUSTANG WC) won by fall over Bryan Ditchman (TINLEY PARK BULLDOGS) Fall 0:28</li>\n<li>5th Place Match - Matthew Bernal (REBELS WC) won by major decision over Antonio James (JJK WRESTLING) Maj 13-2</li>\n<li>7th Place Match - Tristan Miller (THE LAW) won by fall over Sammy Perez (DUNDEE HIGHLANDERS) Fall 1:24</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Ian Meagher (LITTLE CELTIC WC) won by decision over Carlos Fuentez (VILLA LOMBARD COUGARS) Dec 6-0</li>\n<li>5th Place Match - Sean Augello (FORCE WRESTLING) won by decision over Brady Powers (HONONEGAH KIDS WC) Dec 8-2</li>\n<li>7th Place Match - Nicholas Koch (LAKELAND PREDATORS) won by major decision over Vinnie Piunti (MARTINEZ FOX VALLEY ELITE) Maj 13-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Grant Sutton (GOMEZ WRESTLING ACADEMY) won by decision over Noell Carrillo (WRESTLING FACTORY) Dec 4-0</li>\n<li>5th Place Match - Jack Diana (MUSTANG WC) won by major decision over Gunner Wenger (THE LAW) Maj 11-2</li>\n<li>7th Place Match - Justin Nelson (UNITED SOUTHERN ALLSTARS) won in overtime over Jeffery Morrow (CRYSTAL LAKE WIZARDS) OT 5-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Brian Rossi (FALCON WC) won by major decision over Titus Taylor (BELLEVILLE LITTLE DEVILS) Maj 13-2</li>\n<li>5th Place Match - Brandon Briggs (SHOOTERS ELITE WC) won in overtime over Dominic Naso (FORCE WRESTLING) OT 5-3</li>\n<li>7th Place Match - Kris Williams (HARVEY TWISTERS) won by decision over Dan Davis (TINLEY PARK BULLDOGS) Dec 6-5</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Joshua Fuqua (CROSSTOWN WC) won by decision over Mario Leveille (OAK FOREST WARRIORS) Dec 8-1</li>\n<li>5th Place Match - Elijah Oliver (HARVEY TWISTERS) won by decision over Jacob Wever (L-P CRUNCHING CAVS) Dec 8-1</li>\n<li>7th Place Match - Stephen Richardson (PONTIAC WC) won by major decision over Adam Mcconnell (BELVIDERE BANDITS) Maj 10-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Nathan Jozsa (SPRINGFIELD CAPITAL KIDS WC) won by decision over Gacob Lenox (DAKOTA WC) Dec 4-3</li>\n<li>5th Place Match - Kyle Fugiel (CRYSTAL LAKE WIZARDS) won by fall over Jack Lucie (WEST HANCOCK TITAN WC) Fall 0:36</li>\n<li>7th Place Match - Jacob Plekavic (JR. BLAZER WC) won in overtime over Cory Winchell (LITTLE CELTIC WC) OT 3-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Mark Duda (CROSSTOWN WC) won by fall over Israel Santiago (GRAPPLIN` DEVILS WC) Fall 0:17</li>\n<li>5th Place Match - Kyle Akins (SYCAMORE WC) won by decision over Danny Carlson (REBELS WC) Dec 3-0</li>\n<li>7th Place Match - Nicholas Ferraro (SCN YOUTH WC) won by fall over Bryce Ivey (SAUK VALLEY WC) Fall 4:02</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Nicholas Gil (CRYSTAL LAKE WIZARDS) won by decision over Jake Snow (SAUK VALLEY WC) Dec 5-3</li>\n<li>5th Place Match - Joseph Fulco (FORCE WRESTLING) won by decision over Johnny Pellegrino (ORLAND PARK PIONEERS) Dec 3-0</li>\n<li>7th Place Match - Flynn Nagel (VITTUM CATS) won by decision over Chase Vosburgh (MT. VERNON LIONS) Dec 10-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Thomas O`brien (SCN YOUTH WC) won by major decision over John Kriha (CROSSTOWN WC) Maj 11-2</li>\n<li>5th Place Match - Brad Wood (ORLAND PARK PIONEERS) won by fall over Sage Friese (SENECA IRISH CADETS) Fall 1:11</li>\n<li>7th Place Match - Xavier Montalvo (GOMEZ WRESTLING ACADEMY) won by fall over Nicholas Bonomo (BRONCO WRESTLING) Fall 1:29</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Michael Pixley (GRANITE CITY WC) won by fall over Tommy Brewster (MAINE EAGLES) Fall 1:55</li>\n<li>5th Place Match - Geno Quaid (WRESTLING FACTORY) won by decision over Ryan Fish (GLADIATORS) Dec 4-3</li>\n<li>7th Place Match - James Geier (FORCE WRESTLING) won by decision over Austin Hedrick (MAHOMET-SEYMOUR YOUTH WC) Dec 10-8</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Nate Higgins (UNITED SOUTHERN ALLSTARS) won by decision over Connor Bandy (TINLEY PARK BULLDOGS) Dec 6-4</li>\n<li>5th Place Match - Anthony Palacios (WILL COUNTY WARRIORS) won by decision over Tommy Klinger (CRYSTAL LAKE WIZARDS) Dec 5-2</li>\n<li>7th Place Match - Tyre Lee (RENEGADE WC (NFP)) won by major decision over Keegan Gardner (WEST FRANKFORT JR WRESTLING) Maj 18-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Lonnie Cleveland Iii (BULLS WC) won by fall over Zac Keller (LAKELAND PREDATORS) Fall 2:53</li>\n<li>5th Place Match - Edmond Hogan (LANCER WC) won in overtime over Jacob Kroeger (VILLA PARK YOUNG WARRIORS) OT 5-3</li>\n<li>7th Place Match - Jean Louis Sawadogo (ROCK ISLAND WC) won by decision over Kane Garcia (ACES WC) Dec 9-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Quincy Kalkbrenner (THE LAW) won by major decision over Michael Gastaldello (DOWNERS GROVE COUGARS) Maj 11-2</li>\n<li>5th Place Match - Nicholas Aguirre (OSWEGO EAST TEAM NO EGO) won by decision over Brian Pence (CRYSTAL LAKE WIZARDS) Dec 4-1</li>\n<li>7th Place Match - Max Andersen (LAWRENCE COUNTY WC) won by decision over Cain Bialas (WW TIGER WC) Dec 3-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Jimique Davis (VILLA LOMBARD COUGARS) won by decision over Justin Heavilon (GRANITE CITY WC) Dec 3-0</li>\n<li>5th Place Match - Daniel Zimmerman (DAKOTA WC) won by decision over Anthony Ferraro (GOMEZ WRESTLING ACADEMY) Dec 1-0</li>\n<li>7th Place Match - Bruce Henley (JJK WRESTLING) won by decision over Benjamin Brancaleon (NAPERVILLE HUSKY WC) Dec 10-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Deuce Rachal (HARVEY TWISTERS) won by decision over Nathaniel Magiera (WOLVES WC) Dec 5-3</li>\n<li>5th Place Match - Tyler Barton (SYCAMORE WC) won by major decision over AJ Friedrich (METAMORA KIDS WC) Maj 12-0</li>\n<li>7th Place Match - Toby Rivera (CHAMPAIGN KIDS WRESTLING) won by decision over Dylan Lydon (DAKOTA WC) Dec 13-8</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Keagan Griffin (FORCE WRESTLING) won by decision over Brian Allen (HINSDALE WC) Dec 6-4</li>\n<li>5th Place Match - Ty Harmston (RENEGADES (STOCKTON)) won by fall over Dee Alexander (LITTLE FALCONS WC) Fall 2:36</li>\n<li>7th Place Match - Dalton Stokes (TAYLORVILLE WC) won by fall over Stu Landin (TINLEY PARK BULLDOGS) Fall 2:50</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Cameron Baxter (HARLEM WRESTLING CLUB) won by fall over Nicky Allegretti (VITTUM CATS) Fall 2:47</li>\n<li>5th Place Match - Tyler Dicken (WESTVILLE YOUTH WC) won by fall over Jordan Ladd (CHILLI DAWGS WC) Fall 1:30</li>\n<li>7th Place Match - Zachary Hare (STILLMAN VALLEY WC) won by fall over Kyle Tex (TAYLORVILLE WC) Fall 0:53</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Joshua Wallick (FISHER WC) won by fall over Tyler Ortmann (ARGENTA-OREANA KIDS CLUB) Fall 0:42</li>\n<li>5th Place Match - Matthew Kent (EDWARDSVILLE WC) won by fall over Jimmy Dinardo (MORTON LITTLE MUSTANGS) Fall 4:15</li>\n<li>7th Place Match - Timothy O`sullivan (FORCE WRESTLING) won by decision over Jabari Jones (RENEGADE WC (NFP)) Dec 7-1</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Devion May (JUNIOR SPARTANS WC) won by fall over Kyle Haegele (HIGHLAND BULLDOG JR WC) Fall 4:29</li>\n<li>5th Place Match - Nicholas Wolf (FORCE WRESTLING) won by decision over Jack Bornhofen (BARRINGTON BRONCOS) Dec 11-4</li>\n<li>7th Place Match - Rodolfo Antuna (FALCON WC) won by fall over Pat Bieber (MC BULLDOGS) Fall 1:27</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Pat Walker (GOMEZ WRESTLING ACADEMY) won by decision over Louie Hayes (MARTINEZ FOX VALLEY ELITE) Dec 6-5</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Dylan Duncan (SCN YOUTH WC) won by decision over Jason Renteria (BRONCO WRESTLING) Dec 4-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Christian Robertson (VITTUM CATS) won by major decision over Austin Gomez (GOMEZ WRESTLING ACADEMY) Maj 16-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Austin O`connor (TINLEY PARK BULLDOGS) won by fall over Kyle Peisker (GOMEZ WRESTLING ACADEMY) Fall 2:57</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Johnathon Doyle (GOMEZ WRESTLING ACADEMY) won in overtime over Aj Jaffe (SCN YOUTH WC) OT 3-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Jake Drew (GOMEZ WRESTLING ACADEMY) won by decision over Matt Rowland (SCN YOUTH WC) Dec 7-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Michael Callahan (SCN YOUTH WC) won by decision over Ryder Punke (CENTRAL ELITE REBELS) Dec 5-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Carver James (DAKOTA WC) won by major decision over Eric Barone (WOLVES WC) Maj 11-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Isaih White (HARVEY TWISTERS) won by decision over Juwan Edmond (GLADIATORS) Dec 8-4</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Larry Early (FORCE WRESTLING) won by decision over Randy Meneweather (KNOX COUNTY KRUSHERS) Dec 3-1</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Tyler Demoss (HONONEGAH KIDS WC) won by major decision over Gabe Pleasants (MORTON YOUTH WRESTLING) Maj 14-6</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Brady Rude (SAUK VALLEY WC) won by decision over Timothy Young (TOMCAT WC) Dec 8-4</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Christopher Hiscock (INDIANS ELITE) won by fall over Jacob Villarreal (KANE COUNTY GRAPPLERS) Fall 2:33</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Allen Stallings (GLADIATORS) won by decision over Blake Cripe (VANDALIA JR WRESTLING) Dec 7-2</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Tyler Johnson (LEMONT BEARS WC) won by decision over Ian Harwick (HARLEM WRESTLING CLUB) Dec 5-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Lucas Warren (BLACKHAWK WC) won by fall over Keith Mcgee (JUNIOR SPARTANS WC) Fall 3:54</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Jacob Heavlin (WARRIOR MONKS) won by decision over Matthew Iwinski (FORCE WRESTLING) Dec 3-1</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Jabari Moody (HARVEY TWISTERS) won by decision over Rudy Yates (VITTUM CATS) Dec 2-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Anthony Bosco (SCN YOUTH WC) won by decision over Miguel Silva Jr (MARTINEZ FOX VALLEY ELITE) Dec 2-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Austin Ryan (CRYSTAL LAKE WIZARDS) won in overtime over Michael Cullen (WRESTLING FACTORY) OT 7-5</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Josh Alber (DAKOTA WC) won by fall over Matthew Rundell (ARLINGTON CARDINALS) Fall 4:15</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Jon Marmolejo (GOMEZ WRESTLING ACADEMY) won in overtime over Nick Nasenbeny (FORCE WRESTLING) OT 1-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - John Jimenez (SCN YOUTH WC) won by decision over Garrett Sutton (GOMEZ WRESTLING ACADEMY) Dec 3-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Isaiah Vela (MARTINEZ FOX VALLEY ELITE) won by major decision over Michael Zelasco (CRYSTAL LAKE WIZARDS) Maj 11-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Chris Garcia (MARTINEZ FOX VALLEY ELITE) won in overtime over Sean Lynch (WRESTLING FACTORY) OT 3-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Bryce Brill (FOX VALLEY WC) won by fall over Anthony Scaccia (SCN YOUTH WC) Fall 2:32</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Eddie Gonzalez (GOMEZ WRESTLING ACADEMY) won by major decision over Andres Gonzalez (MARTINEZ FOX VALLEY ELITE) Maj 11-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Peter Andreotti (VITTUM CATS) won by decision over Davonte Mahomes (WILL COUNTY WARRIORS) Dec 9-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Connor Doak (JUNIOR PIONEER WC) won by decision over Torrie Williams (GRANITE CITY WC) Dec 4-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Connor Swier (FORCE WRESTLING) won by decision over Bryce Gorman (LITTLE CELTIC WC) Dec 6-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Alex Benoit (REDHAWK WC) won by fall over Nicholas Favale (LITTLE FALCONS WC) Fall 2:16</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Sage Hecox (HECOX TEAM BENAIAH) won by decision over Andre Mickens (JUNIOR SPARTANS WC) Dec 4-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Moises Pina (MORTON LITTLE MUSTANGS) won by decision over Noah Fleckenstein (LIONS WC) Dec 7-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Edgar Ruano (BRONCO WRESTLING) won by major decision over Tanner Farmer (HIGHLAND BULLDOG JR WC) Maj 8-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Michael Johnson Jr (DOWNERS GROVE COUGARS) won by fall over Adarios Jones (MOLINE WC) Fall 0:58</li>\n</ul>\n</section>"
}
