{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Harrison Miller (Stillman Valley WC) won by decision over Julian Aguayo (Epic Wrestling) Dec 8-4</li>\n<li>Champ. Round 1 - Xavian Girona (Lakeland Predators) won by decision over Hunter Griffin (Quincy Cyclones Wrestling) Dec 6-4</li>\n<li>Champ. Round 1 - Tyler Hammitt (Tigertown Tanglers) won by major decision over Michael Jones (Richmond WC) Maj 9-0</li>\n<li>Champ. Round 1 - Brandon Mckimmy (Wrestling Factory) won by fall over James Otto (Mustang WC) Fall 1:01</li>\n<li>Champ. Round 1 - Will Meador (Carbondale WC) won by decision over Tyler Cristofaro (Fox Valley WC) Dec 4-2</li>\n<li>Champ. Round 1 - Adrian Cervantes (Force WC) won by fall over Caleb Miller (Central Elite Rebels) Fall 3:29</li>\n<li>Champ. Round 1 - Jacob Luffman (MS Youth WC) won by decision over Matthew Canty (Waubonsie WC) Dec 9-6</li>\n<li>Champ. Round 1 - Cyress Ahart (Edwardsville WC) won by tech fall over Jake Hutchinson (Orland Park Pioneers) TF 16-1</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Chase Byrnes (Hononegah WC) won by major decision over Ameer Aqel (Vittum Cats) Maj 12-2</li>\n<li>Champ. Round 1 - Ryan Yohe (Martinez Fox Valley Elite) won by fall over Baylor Montgomery (Edwardsville WC) Fall 3:15</li>\n<li>Champ. Round 1 - Kyle Thompson (Granite City WC) won by fall over Elijah Rowe (Renegades (Stockton)) Fall 2:52</li>\n<li>Champ. Round 1 - Duncan Nelson (Little Falcons WC) won by fall over Chase Marshall (Tinley Park Bulldogs) Fall 0:46</li>\n<li>Champ. Round 1 - Matthew Rafe (Brawlers WC) won by fall over Dylan Reeves (El Paso Gridley Youth WC) Fall 0:33</li>\n<li>Champ. Round 1 - Andrew Gonzalez (Team West Wolves) won by fall over Kevin Vivaldo (Yorkville WC) Fall 1:25</li>\n<li>Champ. Round 1 - Conor Flaherty (Notre Dame WC) won by fall over Joshua French (Prairie Central Hawks) Fall 2:46</li>\n<li>Champ. Round 1 - Robert Goodwin (Bolingbrook Junior Raiders) won by fall over Edward Wolf (Little Redskins WC) Fall 0:10</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Chase Raap (Dundee Highlanders WC) won by decision over Noah Trollope (Limestone Blue Crew Wrestling) Dec 6-5</li>\n<li>Champ. Round 1 - Tariq Thurman (Gladiators WC) won by fall over Christopher Mccartney (Edwardsville WC) Fall 2:50</li>\n<li>Champ. Round 1 - Matthew Bleeker (Pekin Boys &amp; Girls Club) won by fall over Charles Barnett (Power House WC) Fall 2:14</li>\n<li>Champ. Round 1 - Daniel Hileman (Granite City WC) won by fall over Kaleb Etnyre (Hononegah WC) Fall 0:51</li>\n<li>Champ. Round 1 - Marcus Diaz (Rams WC) won by tech fall over Andrew McLaughlin (Riverton Youth Wrestling) TF 16-0</li>\n<li>Champ. Round 1 - Riley Vanik (Martinez Fox Valley Elite) won by tech fall over Brett Hyink (Lincoln Way WC) TF 15-0</li>\n<li>Champ. Round 1 - Trevor Schmidt (Falcons WC) won by decision over Sean McNulty (Maine Eagles) Dec 4-1</li>\n<li>Champ. Round 1 - Gavin Goddard (Champaign WC) won by decision over Nicholas Sondag (Waubonsie WC) Dec 1-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Enrique Aguirre (Martinez Fox Valley Elite) won by fall over Ryan Morris (Yorkville WC) Fall 2:17</li>\n<li>Champ. Round 1 - Ryan Doubek (Z`s Team Pena) won by fall over Jacob Ramos (Bolingbrook Junior Raiders) Fall 0:54</li>\n<li>Champ. Round 1 - Erick Cole (Moline WC) won by decision over Nathan Van Hoorn (Wolves Wrestling Club Inc.) Dec 5-2</li>\n<li>Champ. Round 1 - Ryan Pancamo (Kane County Grapplers) won by fall over Troy White (Frankfort Square Wildcats Wrestling) Fall 1:01</li>\n<li>Champ. Round 1 - Adam Colunga (Hoopeston Area WC) won by fall over Christopher Colvin (Bulldog WC) Fall 1:11</li>\n<li>Champ. Round 1 - Ryan Earney (Granite City WC) won by fall over Luke Radtke (Elk Grove Junior Grens) Fall 1:19</li>\n<li>Champ. Round 1 - Davion Talbert (Little Huskies WC) won by fall over Gavin Smith (Lawrence County WC) Fall 0:46</li>\n<li>Champ. Round 1 - Lashawn Reed (Danville Chargers Wrestling) won by fall over Ismael Castrejon (Zee-Bee Stingers) Fall 1:20</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Anthony Marchetti (Hawk WC) won by fall over Lance Jewell (Cumberland Youth WC) Fall 0:13</li>\n<li>Champ. Round 1 - Luke Reinhardt (Arlington Cardinals) won by fall over Alexander Peck (Tigertown Tanglers) Fall 2:00</li>\n<li>Champ. Round 1 - Thomas Rollette (Hononegah WC) won by fall over Dylan Souza (Yorkville WC) Fall 0:55</li>\n<li>Champ. Round 1 - Bernardo Trevino (Shamrock WC) won by fall over William Hamlin (Unity Youth WC) Fall 2:54</li>\n<li>Champ. Round 1 - Noah Bates (Golden Eagles) won by fall over Brodrick Jones (Renegade WC (NFP)) Fall 2:28</li>\n<li>Champ. Round 1 - Steven Norman (Blackhawk WC) won by fall over Kyle Beasley (Olney Cubs WC) Fall 4:17</li>\n<li>Champ. Round 1 - Lucas Korte (Little Celtic WC) won by decision over Cody Glidewell (St. Charles East WC) Dec 4-3</li>\n<li>Champ. Round 1 - Zachary Kincade (East Alton Wood River Jr. Oilers) won by fall over Vito Tito (Badger WC) Fall 0:47</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Christoper Flores (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jeff Fombelle (A-J Jr. Wildcat Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jonathon Rumple (Saukee Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Chase McDaniel (Harrisburg Jr. Bulldogs) received a bye   () Bye</li>\n<li>Champ. Round 1 - Ethan Tran (Round Lake Titans) received a bye   () Bye</li>\n<li>Champ. Round 1 - Abiel Horta (Badger WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Darrell Rodgers (East St. Louis Wrestling) won by fall over Andre Henderson (Maywood Bucs) Fall 1:06</li>\n<li>Champ. Round 1 - Aiden Montoya (Team West Wolves) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Landen Pfeiffer (Marengo Youth Wrestling) won by tech fall over Ethan Parola (Benton Jr WC) TF 18-2</li>\n<li>Champ. Round 1 - Aaron Zebrauskas (Southside Stallions) won by decision over Domenick Zaccone (Orland Park Pioneers) Dec 3-1</li>\n<li>Champ. Round 1 - Christopher Kennedy (Little Celtic WC) won by decision over Zachary Fausel (Hononegah WC) Dec 7-0</li>\n<li>Champ. Round 1 - Jacob Lindsey (Oak Forest Warriors) won by fall over Dylan Wright (Edwardsville WC) Fall 4:30</li>\n<li>Champ. Round 1 - Alex Giuliano (Maddog Wrestling Academy) won by decision over Joe Ruffino (St. Charles East WC) Dec 8-2</li>\n<li>Champ. Round 1 - Mason Mcbride (Westville Youth WC) won by fall over Juan Isaiah Tapia (Champbuilders Wrestling) Fall 1:09</li>\n<li>Champ. Round 1 - Kaleb Thompson (Martinez Fox Valley Elite) won by tech fall over Elijah Ankney (Dixon Wrestling Club) TF 16-1</li>\n<li>Champ. Round 1 - Dylan Ragusin (Arlington Cardinals) won by tech fall over Tyson Coon (Hoopeston Area WC) TF 21-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Payton Pulliam (Pontiac WC) won by decision over Presley Beasley (Lil Bucs WC) Dec 8-5</li>\n<li>Champ. Round 1 - Dylan Martin (Crusaders` Elite) won by decision over Garrett Geigner (Lincoln Way WC) Dec 7-3</li>\n<li>Champ. Round 1 - Christian Goin (Central Elite Rebels) won by decision over Christopher Harrison (East St. Louis Wrestling) Dec 8-7</li>\n<li>Champ. Round 1 - Nathan Callaway (Brawlers WC) won by decision over Justin Montani (Sycamore WC) Dec 2-0</li>\n<li>Champ. Round 1 - Hunter Edwards (WW Tigers WC) won by decision over Ryan Haynes (Pekin Boys &amp; Girls Club) Dec 9-6</li>\n<li>Champ. Round 1 - Justen Pate (Harvey Twisters) won by decision over Alexander Posada (Villa-Lombard Cougars) Dec 8-1</li>\n<li>Champ. Round 1 - Eddie Bolivar (Gomez Wrestling Academy) won by decision over Justice Valdez (Lil Reaper WC) Dec 5-0</li>\n<li>Champ. Round 1 - Thomas Russell (Badger WC) won by injury default over Trevor Chumbley (SCN Youth WC) Inj. 0:00</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Kase Myerson (Lil Bucs WC) won by decision over Christopher Whaley (Sherman-Williamsville WC) Dec 4-0</li>\n<li>Champ. Round 1 - Joshua Ogunsanya (Harvey Twisters) won by decision over Alexander Slack (Wrestling Factory) Dec 8-1</li>\n<li>Champ. Round 1 - Hugh Gorman (Redhawk WC) won by major decision over Jacquez Stewart (Springfield Capitals Kids WC) Maj 10-0</li>\n<li>Champ. Round 1 - Riley Palm (Wrestling Factory) won by major decision over Cameron Miller (Marengo Youth Wrestling) Maj 9-0</li>\n<li>Champ. Round 1 - Kameron Moss (King Select Wrestling) won by major decision over Anthony Zamora (Force WC) Maj 10-2</li>\n<li>Champ. Round 1 - John McCaffrey (Martinez Fox Valley Elite) won by decision over Preston Berry (Yorkville WC) Dec 5-0</li>\n<li>Champ. Round 1 - Austin Kedzie (Martinez Fox Valley Elite) won by fall over William Hillard (Triad Little Knights) Fall 2:36</li>\n<li>Champ. Round 1 - Dylan Burnoski (Bolingbrook Junior Raiders) won by tech fall over Isaac Martinez (Moline WC) TF 17-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Jake Szlenk (Crystal Lake Wizards) won by tech fall over Marcus Long (Pontiac WC) TF 16-1</li>\n<li>Champ. Round 1 - Jacob White (Chilli Dawgs WC) won by decision over Benjamin Anderson (SCN Youth WC) Dec 4-2</li>\n<li>Champ. Round 1 - Anthony Madrigal (Martinez Fox Valley Elite) won by tech fall over Jayton Hall (Renegades Elite) TF 18-3</li>\n<li>Champ. Round 1 - Dalton Hall (Champaign WC) won by decision over Cale Reeder (Yorkville WC) Dec 1-0</li>\n<li>Champ. Round 1 - Donnell Washington (Harvey Twisters) won by fall over Jacob Holm (Arlington Cardinals) Fall 3:29</li>\n<li>Champ. Round 1 - Alek Ziegler (King Select Wrestling) won by decision over James Pierandozzi (Bolingbrook Junior Raiders) Dec 7-2</li>\n<li>Champ. Round 1 - Jackson Lingle (Maddog Wrestling Academy) won by decision over Zach Williard (Carbondale WC) Dec 5-1</li>\n<li>Champ. Round 1 - Brandon Muselman (Tinley Park Bulldogs) won by decision over Kevin Radcliff (Junior Spartans WC) Dec 5-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Austin Macias (Z`s Team Pena) won by decision over Robert Precin (Tinley Park Bulldogs) Dec 5-2</li>\n<li>Champ. Round 1 - Alec Meronk (Metamora Kids WC) won by decision over Luke Smiley (Force WC) Dec 4-2</li>\n<li>Champ. Round 1 - Anthony Randazzo (Golden Eagles) won by fall over Mason Sauseda (Brawlers WC) Fall 3:16</li>\n<li>Champ. Round 1 - Gabriel Berta (Lemont Bears) won by decision over Tyler Delaware (Chilli Dawgs WC) Dec 6-2</li>\n<li>Champ. Round 1 - Gannon Hughes (Team No Ego WC) won by decision over Tucker Hughes (Carlinville WC) Dec 5-3</li>\n<li>Champ. Round 1 - Will Lewan (Maine Eagles) won by major decision over Nolan Roseman (Rantoul Junior Wrestling) Maj 14-2</li>\n<li>Champ. Round 1 - Sean Mckenna (Martinez Fox Valley Elite) won by fall over Joel Sarver (Champaign WC) Fall 2:14</li>\n<li>Champ. Round 1 - Jackson Kohlberg (Arlington Cardinals) won by decision over Joel Cook (Saukee Youth WC) Dec 8-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Alex Zacharuk (Harlem Cougar WC) won by fall over Zachary Roeske (Maddog Wrestling Academy) Fall 1:29</li>\n<li>Champ. Round 1 - Tim Houston (Tinley Park Bulldogs) won by decision over Justin Koderhandt (Crusaders` Elite) Dec 6-2</li>\n<li>Champ. Round 1 - Dominick Ambrose (Orland Park Pioneers) won by decision over Tyler Lane (Crystal Lake Wizards) Dec 2-1</li>\n<li>Champ. Round 1 - John Paul Smith (Bison WC) won by fall over Brendan Davis (Soldier Wrestling Allstar Training) Fall 2:20</li>\n<li>Champ. Round 1 - Jaleel Hollingsworth (Little Huskies WC) won by decision over Peter Mccusker (Rantoul Junior Wrestling) Dec 8-7</li>\n<li>Champ. Round 1 - Jackson O`reilly (Waubonsie WC) won by fall over Bradley Holmes (Peoria Heights Minutemen WC) Fall 3:46</li>\n<li>Champ. Round 1 - Bilal Bailey (Harvey Twisters) won by decision over Micah Krueger (Seneca Irish Cadets) Dec 8-2</li>\n<li>Champ. Round 1 - Charles Faber (Izzy Style School of Wrestling) won by decision over Brayton Lynch (Springfield Capitals Kids WC) Dec 6-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Niko Derain (Martinez Fox Valley Elite) won by decision over Kellyn Gerenstein (Cross Town WC) Dec 8-5</li>\n<li>Champ. Round 1 - David Ferrante (Golden Eagles) won by decision over Adam Aguilar (Notre Dame WC) Dec 8-6</li>\n<li>Champ. Round 1 - Cody Baldridge (Martinez Fox Valley Elite) won by major decision over Nicco Mazzanti (Crystal Lake Wizards) Maj 10-0</li>\n<li>Champ. Round 1 - Peter Golec (Barrington Broncos) won by major decision over Kevin Gillooley (Lincoln Way WC) Maj 14-0</li>\n<li>Champ. Round 1 - Devin Makemson (Bismarck-Henning WC) won by tech fall over Ronnie Raymond (Champbuilders Wrestling) TF 19-3</li>\n<li>Champ. Round 1 - We Rachal (Harvey Twisters) won by major decision over Ben Manibusan (Edwardsville WC) Maj 11-1</li>\n<li>Champ. Round 1 - Jack Mulay (Tinley Park Bulldogs) won by decision over Clayton Bell (MS Youth WC) Dec 6-0</li>\n<li>Champ. Round 1 - Drake Davis (Illinois Valley Elite Wrestling) won by fall over Jocelyn Murphy (Jacksonville Area Wrestling) Fall 2:08</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Nicholas Piaskowy (SCN Youth WC) won by decision over Hector Perez (Z`s Team Pena) Dec 5-3</li>\n<li>Champ. Round 1 - Kolbi Caffey (Carbondale WC) won by decision over Jordan Mcnay (Champions WC) Dec 6-2</li>\n<li>Champ. Round 1 - Luke Silva (Crystal Lake Wizards) won by fall over Zachary Haley (Quincy Cyclones Wrestling) Fall 2:11</li>\n<li>Champ. Round 1 - Joshua Barzowski (Martinez Fox Valley Elite) won by tech fall over Michael Cantrell (Herrin Jr WC) TF 16-0</li>\n<li>Champ. Round 1 - Sebastian Valentin (Junior Spartans WC) won by decision over Anthony Burburija (Headlock Wrestling Academy) Dec 7-3</li>\n<li>Champ. Round 1 - Baan Rachal (Harvey Twisters) won by fall over Jacob Frost (Unity Youth WC) Fall 0:41</li>\n<li>Champ. Round 1 - Anthony Marre (Gomez Wrestling Academy) won by major decision over Noah Foreman (Springfield Capitals Kids WC) Maj 15-5</li>\n<li>Champ. Round 1 - Joshua Jones (Renegade WC (NFP)) won by decision over Cole Smith (Little Celtic WC) Dec 6-5</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Justin Martinez (Xtreme WC) won by major decision over Angelo Poland (Bartlett Jr Hawks) Maj 9-1</li>\n<li>Champ. Round 1 - Matthew Hennessey (Villa Park Young Warriors) won by major decision over Peter Schied (Redhawk WC) Maj 8-0</li>\n<li>Champ. Round 1 - Angel Rios (Z`s Team Pena) won by fall over Daniel Caulfield (Mustang WC) Fall 1:00</li>\n<li>Champ. Round 1 - Bobby Pryhocki (Lakeland Predators) won by fall over Michael Donatelli (SCN Youth WC) Fall 1:25</li>\n<li>Champ. Round 1 - Ryan Gillooley (Lincoln Way WC) won by fall over Xavier Gutierrez (Metamora Kids WC) Fall 3:58</li>\n<li>Champ. Round 1 - Drew Hoselton (Prairie Central Hawks) won by decision over Mark Tucker (Edwardsville WC) Dec 9-5</li>\n<li>Champ. Round 1 - Jeremy Rumsey (MS Youth WC) won by fall over Alex Nieves (Peoria Razorbacks) Fall 2:42</li>\n<li>Champ. Round 1 - Gage Burroughs (Mt Vernon Lions) won by fall over Zachary Reese (Will County Warriors) Fall 2:18</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Noah Jackson (Waukegan Youth WC) won by decision over Porfirio Perez (Lionheart Intense Wrestling) Dec 7-3</li>\n<li>Champ. Round 1 - Jacob Blaha (Junior Kahoks) won by decision over Jacob Oury (Golden Eagles) Dec 6-4</li>\n<li>Champ. Round 1 - Liam O`Donnell (Crystal Lake Wizards) won by major decision over Jacob Lowell (North Shore Edge) Maj 10-2</li>\n<li>Champ. Round 1 - Peyton West (Springfield Capitals Kids WC) won by major decision over Danny Braunagel (Crusaders` Elite) Maj 9-0</li>\n<li>Champ. Round 1 - Triston Robb (Team No Ego WC) won by tech fall over Jonathan Tribbett (Illini Bluffs Kids WC) TF 15-0</li>\n<li>Champ. Round 1 - Samuel Seneker (Plainfield WC) won by decision over Patrick Doyle (Redhawk WC) Dec 5-3</li>\n<li>Champ. Round 1 - Matthew Pazienza (Mustang WC) won by tech fall over Jay-cee Gonzalez (Martinez Fox Valley Elite) TF 20-5</li>\n<li>Champ. Round 1 - Stephen Silva (Junior Spartans WC) won by fall over Evan Schaibley (Seneca Irish Cadets) Fall 1:12</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Samuel Durfey (Stillman Valley WC) won by fall over Eric Ospina (Zee-Bee Stingers) Fall 0:57</li>\n<li>Champ. Round 1 - Jordan Gumila (Force WC) won by fall over Austin Park (Pekin Boys &amp; Girls Club) Fall 0:42</li>\n<li>Champ. Round 1 - Daniel Pence (Crystal Lake Wizards) won by major decision over Tony Heinitz (Riverbend WC) Maj 13-4</li>\n<li>Champ. Round 1 - Jake Price (Little Celtic WC) won by fall over Nolan Warner (Maddog Wrestling Academy) Fall 0:29</li>\n<li>Champ. Round 1 - Jason Bowman (SJO Youth WC) won in overtime over Jesus Cancino (Lawrence County WC) OT 1-0</li>\n<li>Champ. Round 1 - Tyler Guerrero (Villa Park Young Warriors) won by decision over Malcolm Banks (Renegade WC (NFP)) Dec 8-2</li>\n<li>Champ. Round 1 - Joshua Torres (Team No Ego WC) won by decision over Andrew Holderer (Edwardsville WC) Dec 5-0</li>\n<li>Champ. Round 1 - Jackson Skube (Champaign WC) won by decision over Dominick Uzzardo (Vittum Cats) Dec 7-5</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Kenneth Abitua (Xtreme WC) won by fall over Dijour Cotton-Crockett (Little Huskies WC) Fall 2:16</li>\n<li>Champ. Round 1 - Freddy Walton (Force WC) won by tech fall over Daniel King (Champaign WC) TF 16-0</li>\n<li>Champ. Round 1 - Robert Holt (Little Huskies WC) won by fall over Addison Klausner (Junior Spartans WC) Fall 2:09</li>\n<li>Champ. Round 1 - Jarryd Cabusao (Golden Eagles) won by major decision over Austin Boyett (Springfield Capitals Kids WC) Maj 11-0</li>\n<li>Champ. Round 1 - Luis Penaloza (Villa-Lombard Cougars) won by decision over Luke Hoffman (Tigertown Tanglers) Dec 12-6</li>\n<li>Champ. Round 1 - Zachary Hammel-Brown (Junior Kahoks) won by decision over Jose Garcia (Martinez Fox Valley Elite) Dec 5-1</li>\n<li>Champ. Round 1 - Aaron Ditsworth (Moline WC) won by fall over Peter Capetillo (SCN Youth WC) Fall 0:57</li>\n<li>Champ. Round 1 - Austin Thurman (Crusaders` Elite) won by decision over Ricardo Alba (Gomez Wrestling Academy) Dec 5-4</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Romeo Mcknight (Crystal Lake Wizards) won by fall over Calvin Watkins (Harvey Twisters) Fall 0:15</li>\n<li>Champ. Round 1 - Jack Golnick (Golden Eagles) won by decision over Dillon Conrad (SCN Youth WC) Dec 6-0</li>\n<li>Champ. Round 1 - De`Gyon Macklin (Rockford WC) won by fall over Jacob Loftus (Collinsville Raider WC) Fall 1:18</li>\n<li>Champ. Round 1 - Gregorio Aparicio (Vittum Cats) received a bye   () Bye</li>\n<li>Champ. Round 1 - Matt Brozovich (Indians Elite) won by fall over Brady Tolbert (Prairie Central Hawks) Fall 1:03</li>\n<li>Champ. Round 1 - Alex Jacobs (Palatine Panthers) won by fall over Jordan Ryan (Bartlett Jr Hawks) Fall 1:08</li>\n<li>Champ. Round 1 - Joseph McIntyre (Arlington Cardinals) won by fall over Andru White (Oakwood Youth WC) Fall 1:45</li>\n<li>Champ. Round 1 - Isaac Gerard (Knox County Krushers) won by fall over Colan Ciciura (Frankfort Square Wildcats Wrestling) Fall 3:22</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Richard Gaskins (Champbuilders Wrestling) won by tech fall over Zachary Parker (Knights WC) TF 18-3</li>\n<li>Champ. Round 1 - Larry Adams (East St. Louis Wrestling) won by fall over Nathan Pospisil (Tinley Park Bulldogs) Fall 2:57</li>\n<li>Champ. Round 1 - Nathan Riney (Moline WC) won by fall over William Kuduk (Oak Forest Warriors) Fall 3:21</li>\n<li>Champ. Round 1 - Bradley Hensley (Rochelle WC) won by fall over Kyle Fahsl (Edwardsville WC) Fall 2:14</li>\n<li>Champ. Round 1 - Lucas Cherry (Villa-Lombard Cougars) won by fall over Matthew Tortorello (Arlington Cardinals) Fall 0:52</li>\n<li>Champ. Round 1 - Adam Shultz (WW Tigers WC) won by fall over Jeremy Tyler (Falcons WC) Fall 0:26</li>\n<li>Champ. Round 1 - Eric Ellefson (Junior Cougar WC) won by fall over Douglas Barkauski (Lincoln Way WC) Fall 1:51</li>\n<li>Champ. Round 1 - Evan McTaggart (Glen Ellyn Dungeon WC) won by fall over Devan Everett (Taylorville WC) Fall 1:11</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Jeremy Daum (SCN Youth WC) won by fall over Brendan Bullock (A-J Jr. Wildcat Wrestling) Fall 0:14</li>\n<li>Champ. Round 1 - Brett Nyswonger (Roxana Kids WC) won by fall over Earl Evans (East St. Louis Wrestling) Fall 1:26</li>\n<li>Champ. Round 1 - Devin Moore (Blackhawk WC) won by fall over Tyler Miller (Timber Wolves WC) Fall 1:19</li>\n<li>Champ. Round 1 - Dylan Ervin (Martinez Fox Valley Elite) won by fall over Daniel Jamieson (Elk Grove Junior Grens) Fall 2:12</li>\n<li>Champ. Round 1 - Alexander Hunter (Naperville WC) won by fall over Jamil Smith (Downers Grove Cougars WC) Fall 1:05</li>\n<li>Champ. Round 1 - Carlos Burgos (Rams WC) won by fall over Jacob Wyman (SCN Youth WC) Fall 0:35</li>\n<li>Champ. Round 1 - Thomas Helton (Junior Dukes WC) won by decision over Shawn Hileman (Granite City WC) Dec 4-0</li>\n<li>Champ. Round 1 - Michael Nelson (Taylorville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Devon Sieveking (Benton Jr WC) won by fall over Devon Searight-McNutt (Sycamore WC) Fall 2:31</li>\n<li>Champ. Round 1 - Tony Valentino (Elk Grove Junior Grens) won by fall over Shadarake Niyonkuru (Moline WC) Fall 1:17</li>\n<li>Champ. Round 1 - Nathan Hillman (Morton Youth WC) won by fall over Robert Peason (Hampshire WC) Fall 0:23</li>\n<li>Champ. Round 1 - Julio Sifuentes (Martinez Fox Valley Elite) won by decision over Jose Ortiz (Junior Cougar WC) Dec 2-1</li>\n<li>Champ. Round 1 - Quinn Polaski (Junior Porters WC) won by fall over Thomas Younker (Tinley Park Bulldogs) Fall 3:58</li>\n<li>Champ. Round 1 - Octavius McCloud (Carbondale WC) won by fall over Dylan Uzumecki (Batavia Pinners) Fall 0:40</li>\n<li>Champ. Round 1 - Stephen Kreyenbuhl (Junior Dukes WC) won by fall over Joshua Stark (Brawlers WC) Fall 3:27</li>\n<li>Champ. Round 1 - Matt Sarhage (Triad Little Knights) won by fall over Justin Bills (Renegade WC (NFP)) Fall 1:12</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Anthony Mckinney (Harlem Cougar WC) won by fall over Jeremy Mull (Granite City WC) Fall 2:45</li>\n<li>Champ. Round 1 - Brandon Reyes (Wrestling Wolverines) received a bye   () Bye</li>\n<li>Champ. Round 1 - Martell Beasley (Harvey Twisters) won by decision over Wolfgang Kemp (Crystal Lake Wizards) Dec 5-1</li>\n<li>Champ. Round 1 - Israel Griffin (King Select Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Luis Rivera (Waukegan Youth WC) won by fall over Alex Garsky (Murphysboro WC) Fall 1:06</li>\n<li>Champ. Round 1 - James Davis (Rochelle WC) won by fall over Tyler Simon (Ottawa Kids WC) Fall 4:29</li>\n<li>Champ. Round 1 - Robert Gannon (Downers Grove Cougars WC) won by fall over Adam Jung (A-J Jr. Wildcat Wrestling) Fall 2:33</li>\n<li>Champ. Round 1 - Cyress Bergeron (Little Falcons WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Michael Tortorice (Wolves Wrestling Club Inc.) won by tech fall over Ethan Mckinstry (Lawrence County WC) TF 18-2</li>\n<li>Champ. Round 1 - Kevin Stearns (Tinley Park Bulldogs) won by fall over Nicholas Peterson (Sharks WC) Fall 1:20</li>\n<li>Champ. Round 1 - Colin Barker (Xtreme WC) won by fall over Lucas Van Poucke (Naperville WC) Fall 3:53</li>\n<li>Champ. Round 1 - Benjamin Kirby (Oak Forest Warriors) won by fall over Dawson Thomas (Mt Vernon Lions) Fall 1:12</li>\n<li>Champ. Round 1 - Jake Keating (Naperville WC) won by decision over Dominic Testa (Gomez Wrestling Academy) Dec 6-3</li>\n<li>Champ. Round 1 - Tyler Wood (Tigertown Tanglers) won by fall over Garrett Woods (Cumberland Youth WC) Fall 1:58</li>\n<li>Champ. Round 1 - Dylan Doranski (Batavia Pinners) won by tech fall over Angel Granado (Badger WC) TF 15-0</li>\n<li>Champ. Round 1 - Stephanie Sommers (Arlington Cardinals) won by major decision over Justin Appelman (Danville Chargers Wrestling) Maj 14-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Hayes (Crystal Lake Wizards) won by fall over Alex Harness (Champbuilders Wrestling) Fall 1:15</li>\n<li>Champ. Round 1 - Jack Calderone (Junior Spartans WC) won by decision over Ryan Chambers (Murphysboro WC) Dec 8-5</li>\n<li>Champ. Round 1 - Andrew Sobol (East Alton Wood River Jr. Oilers) won by decision over Matthew Cinnamon (Saber Wrestling Club) Dec 6-5</li>\n<li>Champ. Round 1 - Anthony Rink (Brawlers WC) won by tech fall over Anthony Heinrich (The Law) TF 20-3</li>\n<li>Champ. Round 1 - Hunter Vester (Yorkville WC) won by fall over Carter Pelletier (Team No Ego WC) Fall 1:29</li>\n<li>Champ. Round 1 - Justin Heredia (Vittum Cats) won by decision over Jacob Gross (Lakeland Predators) Dec 4-3</li>\n<li>Champ. Round 1 - Hazen Rice (Maddog Wrestling Academy) won by fall over Devin Poole (Pekin Boys &amp; Girls Club) Fall 2:22</li>\n<li>Champ. Round 1 - Zach Grosch (Waubonsie WC) won by fall over Dakota Marrello (Vittum Cats) Fall 2:33</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Beau Harrier (Golden Eagles) won by decision over Elias Garcia (Lions WC) Dec 3-2</li>\n<li>Champ. Round 1 - Jake Dibenedetto (Vittum Cats) won by decision over Jason Giuliano (Maddog Wrestling Academy) Dec 7-2</li>\n<li>Champ. Round 1 - Demarius Terhune (Champaign WC) won by major decision over Jonathan Moran (Harvey Twisters) Maj 9-0</li>\n<li>Champ. Round 1 - Mitchell Stathakis (Barrington Broncos) won by fall over William Farbo (Stillman Valley WC) Fall 1:08</li>\n<li>Champ. Round 1 - Jacob Mitchell (Highland Bulldog Jr WC) won by fall over Antonio Menozi (Little Celtic WC) Fall 3:00</li>\n<li>Champ. Round 1 - Kyle Bernat (SCN Youth WC) won by major decision over Aryc Trotz (Naperville Husky WC) Maj 9-1</li>\n<li>Champ. Round 1 - Merik Fulton (Triad Little Knights) won in overtime over Michael Doranski (Batavia Pinners) OT 2-1</li>\n<li>Champ. Round 1 - Nicholas Drew (Plainfield WC) won by decision over Eric Ortiz (Crystal Lake Wizards) Dec 6-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Wylie Allen (Crystal Lake Wizards) won by fall over Bill Burns (Pontiac WC) Fall 0:29</li>\n<li>Champ. Round 1 - Luke Bennett (Little Falcons WC) won by fall over Shawn Mcdaniel (Limestone Blue Crew Wrestling) Fall 1:21</li>\n<li>Champ. Round 1 - Seth Wisowaty (Hononegah WC) won by fall over Vinnie Piunti (Martinez Fox Valley Elite) Fall 0:26</li>\n<li>Champ. Round 1 - Hunter Webb (Sauk Valley WC) won by decision over Zack Stirrett (Shelbyville Junior Wrestling Rams) Dec 4-0</li>\n<li>Champ. Round 1 - Adam Nixon (Gomez Wrestling Academy) won by fall over Rocco Falco (Southside Stallions) Fall 3:43</li>\n<li>Champ. Round 1 - Dylan Chambers (Murphysboro WC) won in double overtime over Raekwon Williams (Cross Town WC) 2-OT 3-2</li>\n<li>Champ. Round 1 - Sean Cullen (Wrestling Factory) won by decision over Devion Yancey (Edwardsville WC) Dec 4-1</li>\n<li>Champ. Round 1 - Nicolas Augustave (Junior Spartans WC) won by fall over Tyler Dierkes (Marengo Youth Wrestling) Fall 3:53</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Matt Breitbarth (Junior Spartans WC) won by decision over Ge`nae Sampract (Lionheart Intense Wrestling) Dec 9-5</li>\n<li>Champ. Round 1 - Anthony Rubino (SCN Youth WC) won in overtime over Sean Barelli (Crystal Lake Wizards) OT 5-3</li>\n<li>Champ. Round 1 - Hunter Voigt (Brawlers WC) won by decision over Jacob Meyers (Rochelle WC) Dec 11-5</li>\n<li>Champ. Round 1 - Jared Ellingwood (Martinez Fox Valley Elite) won by fall over Arnie Lack (Champaign WC) Fall 1:11</li>\n<li>Champ. Round 1 - Devin Michicich (Vittum Cats) won by major decision over Christopher Tucker (East St. Louis Wrestling) Maj 11-2</li>\n<li>Champ. Round 1 - Nathan Dlugopolski (Lakeland Predators) won by decision over Palidin Martinez (Moline WC) Dec 6-5</li>\n<li>Champ. Round 1 - John Cullen (Wrestling Factory) won by fall over Jarrett Allscheid (MC Bulldog WC) Fall 1:27</li>\n<li>Champ. Round 1 - Christian Robertson (Vittum Cats) won by fall over Chad Gholson (Yorkville WC) Fall 1:08</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Rahman Johnson (Harvey Twisters) won by fall over Frank Woods (Crystal Lake Wizards) Fall 3:29</li>\n<li>Champ. Round 1 - Braxten Ary (Midwest Central Youth WC) won by fall over Luke Debenedetti (Plainfield WC) Fall 2:56</li>\n<li>Champ. Round 1 - Joey Schloegel (Lincoln Way WC) won by fall over Collin Meyers (Marengo Youth Wrestling) Fall 2:24</li>\n<li>Champ. Round 1 - Andrew O`brien (Redhawk WC) won by major decision over Caleb Schnell (Moline WC) Maj 9-1</li>\n<li>Champ. Round 1 - Andrew Verr (Villa Park Young Warriors) won by major decision over Dillon Dixon (Edwardsville WC) Maj 12-2</li>\n<li>Champ. Round 1 - Zachery Ellis (Zee-Bee Stingers) won by fall over Kyle Goin (Central Elite Rebels) Fall 1:58</li>\n<li>Champ. Round 1 - Logan Gruszka (Team No Ego WC) won by tech fall over Dylan Pate (Hoopeston Area WC) TF 17-0</li>\n<li>Champ. Round 1 - Jackson Schoen (Gomez Wrestling Academy) won by fall over Braden Whitecotton (Herrin Jr WC) Fall 3:56</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Zachary Akers (Indians Elite) won by decision over Daniel Jimenez (Glenbard East Jr Rams) Dec 3-2</li>\n<li>Champ. Round 1 - Andrew Wenger (Dakota WC) won by decision over Jaylen Shaw (Arlington Cardinals) Dec 4-2</li>\n<li>Champ. Round 1 - Matt Rowland (Villa Park Young Warriors) won by major decision over Colten Cashmore (Crystal Lake Wizards) Maj 10-2</li>\n<li>Champ. Round 1 - Devin Donovan (Villa-Lombard Cougars) won by decision over Zachary Rudsinski (Lincoln Way WC) Dec 6-4</li>\n<li>Champ. Round 1 - Joey Nauman (Yorkville WC) won by fall over Gabriel Cross (Lionheart Intense Wrestling) Fall 4:21</li>\n<li>Champ. Round 1 - Patrick Larkin (Redhawk WC) won by fall over Jacob Dixon (Carlinville WC) Fall 3:38</li>\n<li>Champ. Round 1 - Egan Berta (Lemont Bears) won by fall over Draylin Turner (Champaign WC) Fall 1:19</li>\n<li>Champ. Round 1 - Jesse Ditzler (Sauk Valley WC) won by fall over Austyn Ferguson (Edwardsville WC) Fall 2:15</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Nathan Olsen (Dakota WC) won by decision over Jordan Soto (Batavia Pinners) Dec 7-1</li>\n<li>Champ. Round 1 - Carsten Brauns (Highland Bulldog Jr WC) won by fall over Zach Humphrey (Geneseo Spider WC) Fall 3:29</li>\n<li>Champ. Round 1 - Kyle Kalkbrenner (The Law) won by decision over Elliot Koster (Geneseo Spider WC) Dec 2-1</li>\n<li>Champ. Round 1 - Michael Callahan (SCN Youth WC) won by decision over Dylan McCollum (Roxana Kids WC) Dec 8-3</li>\n<li>Champ. Round 1 - Nick Kokkines (Force WC) won by decision over Alex Rodriguez (Fox Lake WC) Dec 6-3</li>\n<li>Champ. Round 1 - Patrick Mcgowan (Tinley Park Bulldogs) won by fall over Aaron Weaver (Westville Youth WC) Fall 3:39</li>\n<li>Champ. Round 1 - Dino Gutierrez (Notre Dame WC) won by major decision over Heath Fleming (Taylorville WC) Maj 10-0</li>\n<li>Champ. Round 1 - Kevin Soraghan (Force WC) won by fall over Cameron Lopez (Tinley Park Bulldogs) Fall 3:12</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Brian Johnston (Sycamore WC) won by decision over Brady Jamrozek (Izzy Style School of Wrestling) Dec 5-4</li>\n<li>Champ. Round 1 - Amir Zegar (Tinley Park Bulldogs) won by decision over Hannibal Johnson (Danville Chargers Wrestling) Dec 6-1</li>\n<li>Champ. Round 1 - Elijah Baltazar (SCN Youth WC) won by decision over Kevin Gschwendtner (Pontiac WC) Dec 5-0</li>\n<li>Champ. Round 1 - Ben Schneider (Little Huskies WC) won by decision over Kevin Zange (Crystal Lake Wizards) Dec 10-5</li>\n<li>Champ. Round 1 - Nicholas Foster (King Select Wrestling) won by fall over Daltyn Dodd (Moline WC) Fall 2:23</li>\n<li>Champ. Round 1 - David Riojas (Force WC) won by tech fall over Arturo Alfaro (Gomez Wrestling Academy) TF 17-1</li>\n<li>Champ. Round 1 - Nicholas Delporte (Arlington Cardinals) won by decision over Peyton Smith (Benton Jr WC) Dec 9-4</li>\n<li>Champ. Round 1 - Jake Tisza (Junior Spartans WC) won by decision over Elias Sanchez (Midwest Central Youth WC) Dec 10-3</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Nicholas Sundberg (Crystal Lake Wizards) won by fall over Anthony Ryan (Villa-Lombard Cougars) Fall 2:38</li>\n<li>Champ. Round 1 - Victor Keane (Vittum Cats) won by decision over Elijah Rochel (Villa Park Young Warriors) Dec 3-1</li>\n<li>Champ. Round 1 - Eric Schultz (Tinley Park Bulldogs) won by decision over Jacob Elsbury (Xtreme WC) Dec 2-0</li>\n<li>Champ. Round 1 - Austin Singer (Fox Valley WC) won by fall over Eric Chalupa (Arlington Cardinals) Fall 1:22</li>\n<li>Champ. Round 1 - Steven Schmult (Force WC) won by decision over Bryce Coyle (Seneca Irish Cadets) Dec 7-0</li>\n<li>Champ. Round 1 - Mark Deavila (East St. Louis Wrestling) won by fall over Chandler Cousins (Unity Youth WC) Fall 3:18</li>\n<li>Champ. Round 1 - Daniel Terronez (Moline WC) won in overtime over Griffin Meeker (Champaign WC) OT 8-6</li>\n<li>Champ. Round 1 - Tyler Eggemeyer (Panther Powerhouse WC) won by fall over Thomas Fazy (Orland Park Pioneers) Fall 3:54</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Kobe Lear (Fox Lake WC) won by fall over Zayne Bryant (Lil` Storm WC) Fall 1:30</li>\n<li>Champ. Round 1 - Braden Zalapi (Hononegah WC) won by major decision over Gabriel Jackson (Edwardsville WC) Maj 12-3</li>\n<li>Champ. Round 1 - Troy Ott (Maddog Wrestling Academy) won in overtime over Thomas Welch (Crystal Lake Wizards) OT 8-6</li>\n<li>Champ. Round 1 - Brock Barnes (Panther Powerhouse WC) won by fall over Tyler Gist (Taylorville WC) Fall 1:22</li>\n<li>Champ. Round 1 - Brendon Gambill (Little Falcons WC) won by decision over Collin Groleau (LP Crunching Cavs) Dec 4-3</li>\n<li>Champ. Round 1 - Cody Ralston (Junior Spartans WC) won by major decision over Amer Shalabi (Southside Stallions) Maj 15-2</li>\n<li>Champ. Round 1 - Matthew Beyer (Blackhawk WC) won in overtime over Alec Stump (Oak Forest Warriors) OT 2-0</li>\n<li>Champ. Round 1 - Zachary Tomac (Force WC) won in overtime over Dalton Lawver (Rock Island WC) OT 11-9</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Zachary Crosby (Golden Eagles) won by tech fall over Andrea Sennett (Bison WC) TF 17-2</li>\n<li>Champ. Round 1 - Aaron Zalar (Metamora Kids WC) won by decision over Eric Johnson (Force WC) Dec 8-3</li>\n<li>Champ. Round 1 - Justin Scott (Geneseo Spider WC) won by decision over Kyle Gara (Marengo Youth Wrestling) Dec 8-5</li>\n<li>Champ. Round 1 - Michael Olsen (Elk Grove Junior Grens) won by decision over Sam Feldner (Orland Park Pioneers) Dec 6-5</li>\n<li>Champ. Round 1 - Shamon Harlan (East St. Louis Wrestling) won by decision over Jackson Shearer (Springfield Capitals Kids WC) Dec 12-8</li>\n<li>Champ. Round 1 - Nathan Traxler (SCN Youth WC) won by decision over Daniel Howard (Redhawk WC) Dec 2-0</li>\n<li>Champ. Round 1 - George Roskuszka (Little Falcons WC) won by fall over Jacob Albert (A-J Jr. Wildcat Wrestling) Fall 2:03</li>\n<li>Champ. Round 1 - Nick Graziano (Oak Forest Warriors) won by fall over Jacob Massie (Prairie Central Hawks) Fall 1:01</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Jonathan Ransom (Pontiac WC) won by fall over Harrison Miller (Stillman Valley WC) Fall 0:38</li>\n<li>Champ. Round 2 - Andrew Okayama (Force WC) won by fall over Xavian Girona (Lakeland Predators) Fall 4:19</li>\n<li>Champ. Round 2 - Trent Rakers (Highland Bulldog Jr WC) won by fall over Tyler Hammitt (Tigertown Tanglers) Fall 0:51</li>\n<li>Champ. Round 2 - Nate Jimenez (SCN Youth WC) won by fall over Brandon Mckimmy (Wrestling Factory) Fall 4:02</li>\n<li>Champ. Round 2 - Jacob Crisman (Pekin Boys &amp; Girls Club) won by decision over Will Meador (Carbondale WC) Dec 7-5</li>\n<li>Champ. Round 2 - David Apple (Team West Wolves) won by decision over Adrian Cervantes (Force WC) Dec 5-3</li>\n<li>Champ. Round 2 - Scott Sierzega (Vittum Cats) won by fall over Jacob Luffman (MS Youth WC) Fall 0:50</li>\n<li>Champ. Round 2 - Cyress Ahart (Edwardsville WC) won by major decision over Anthony Cassioppi (Hononegah WC) Maj 10-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Desmond Nunez (Lil Reaper WC) won by fall over Chase Byrnes (Hononegah WC) Fall 1:00</li>\n<li>Champ. Round 2 - Jayleen Fitzpatrick (Gomez Wrestling Academy) won by fall over Ryan Yohe (Martinez Fox Valley Elite) Fall 1:06</li>\n<li>Champ. Round 2 - Jacob Warner (Champaign WC) won by fall over Kyle Thompson (Granite City WC) Fall 1:16</li>\n<li>Champ. Round 2 - Cole Bateman (Orland Park Pioneers) won by tech fall over Duncan Nelson (Little Falcons WC) TF 20-5</li>\n<li>Champ. Round 2 - Zachary Blasioli (Bulls WC) won by decision over Matthew Rafe (Brawlers WC) Dec 2-1</li>\n<li>Champ. Round 2 - Mason Kroening (Waubonsie WC) won by decision over Andrew Gonzalez (Team West Wolves) Dec 7-2</li>\n<li>Champ. Round 2 - David Cushing (Badger WC) won by decision over Conor Flaherty (Notre Dame WC) Dec 12-9</li>\n<li>Champ. Round 2 - Robert Goodwin (Bolingbrook Junior Raiders) won by fall over Cadin Koeppel (Cary Matmen) Fall 0:13</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Chase Raap (Dundee Highlanders WC) won by decision over Alexander Analytis (Force WC) Dec 4-3</li>\n<li>Champ. Round 2 - Jaime Hernandez (Martinez Fox Valley Elite) won by major decision over Tariq Thurman (Gladiators WC) Maj 8-0</li>\n<li>Champ. Round 2 - Keaton Titus (Cumberland Youth WC) won by fall over Matthew Bleeker (Pekin Boys &amp; Girls Club) Fall 0:59</li>\n<li>Champ. Round 2 - Carlos Aguilar (Notre Dame WC) won by decision over Daniel Hileman (Granite City WC) Dec 3-2</li>\n<li>Champ. Round 2 - Kobey Bosworth (O`Fallon Little Panthers) won by fall over Marcus Diaz (Rams WC) Fall 3:39</li>\n<li>Champ. Round 2 - Riley Vanik (Martinez Fox Valley Elite) won by major decision over Devin O`Rourke (Oak Forest Warriors) Maj 15-3</li>\n<li>Champ. Round 2 - Gavin Mast (Champions WC) won by decision over Trevor Schmidt (Falcons WC) Dec 6-2</li>\n<li>Champ. Round 2 - Gavin Goddard (Champaign WC) won by decision over Cade Meier (Dakota WC) Dec 5-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Enrique Aguirre (Martinez Fox Valley Elite) won by decision over Carter Bibb (Springfield Capitals Kids WC) Dec 11-7</li>\n<li>Champ. Round 2 - Ryan Doubek (Z`s Team Pena) won by decision over Ivan Rodriguez (Fenton Bison WC) Dec 7-6</li>\n<li>Champ. Round 2 - Erick Cole (Moline WC) won by fall over Jake Kauzlarich (Edwardsville WC) Fall 3:35</li>\n<li>Champ. Round 2 - William Wagner (Mustang WC) won by fall over Ryan Pancamo (Kane County Grapplers) Fall 3:52</li>\n<li>Champ. Round 2 - Daniel McNally (Cross Town WC) won by fall over Adam Colunga (Hoopeston Area WC) Fall 0:19</li>\n<li>Champ. Round 2 - Nikola Ivanisevic (Hinsdale WC) won by fall over Ryan Earney (Granite City WC) Fall 1:14</li>\n<li>Champ. Round 2 - Caleb Adams (West Hancock WC) won by fall over Davion Talbert (Little Huskies WC) Fall 2:19</li>\n<li>Champ. Round 2 - Dyllan Hess (Huntley Jr. Red Raiders) won by tech fall over Lashawn Reed (Danville Chargers Wrestling) TF 19-4</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Marchetti (Hawk WC) won by fall over Austin Sweet (Granite City WC) Fall 1:30</li>\n<li>Champ. Round 2 - Luke Reinhardt (Arlington Cardinals) won by fall over Maxwell Mcdermott (Little Huskies WC) Fall 3:34</li>\n<li>Champ. Round 2 - Thomas Rollette (Hononegah WC) won by fall over Todd O`dell (Junior Spartans WC) Fall 0:36</li>\n<li>Champ. Round 2 - Brian Foley (Hinsdale WC) won by fall over Bernardo Trevino (Shamrock WC) Fall 2:12</li>\n<li>Champ. Round 2 - Noah Bates (Golden Eagles) won by fall over Hunter Bowles (Pontiac WC) Fall 1:20</li>\n<li>Champ. Round 2 - Emmanuel Terrell (Rams WC) won by major decision over Steven Norman (Blackhawk WC) Maj 14-1</li>\n<li>Champ. Round 2 - Tommy Pickett (Champions WC) won by fall over Lucas Korte (Little Celtic WC) Fall 1:53</li>\n<li>Champ. Round 2 - Blake Zalapi (Hononegah WC) won by fall over Zachary Kincade (East Alton Wood River Jr. Oilers) Fall 1:25</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Kevin Alvarez (Team No Ego WC) won by fall over Christoper Flores (Crystal Lake Wizards) Fall 2:45</li>\n<li>Champ. Round 2 - Dominic Ferraro (Gomez Wrestling Academy) won by fall over Jeff Fombelle (A-J Jr. Wildcat Wrestling) Fall 0:39</li>\n<li>Champ. Round 2 - Shane Raber (Force WC) won by decision over Jonathon Rumple (Saukee Youth WC) Dec 4-2</li>\n<li>Champ. Round 2 - Jeremiah Glenn (Little Huskies WC) won by fall over Chase McDaniel (Harrisburg Jr. Bulldogs) Fall 3:34</li>\n<li>Champ. Round 2 - Terrance Taylor (MS Youth WC) won by fall over Ethan Tran (Round Lake Titans) Fall 1:02</li>\n<li>Champ. Round 2 - Blake McCarthy (Rocket Fuel WC) won by fall over Abiel Horta (Badger WC) Fall 2:02</li>\n<li>Champ. Round 2 - Kyle Connolly (Jacksonville Area Wrestling) won by fall over Darrell Rodgers (East St. Louis Wrestling) Fall 2:24</li>\n<li>Champ. Round 2 - John Terry (Hononegah WC) won by fall over Aiden Montoya (Team West Wolves) Fall 0:31</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Justin Cardani (MS Youth WC) won by decision over Landen Pfeiffer (Marengo Youth Wrestling) Dec 6-1</li>\n<li>Champ. Round 2 - Aaron Zebrauskas (Southside Stallions) won by fall over Ethan Holcomb (Rocket Fuel WC) Fall 0:40</li>\n<li>Champ. Round 2 - Anthony Schickel (Martinez Fox Valley Elite) won by decision over Christopher Kennedy (Little Celtic WC) Dec 6-3</li>\n<li>Champ. Round 2 - Lucas Schevikhoven (Lakeland Predators) won by fall over Jacob Lindsey (Oak Forest Warriors) Fall 2:42</li>\n<li>Champ. Round 2 - Austin Rudsinski (Force WC) won by decision over Alex Giuliano (Maddog Wrestling Academy) Dec 10-5</li>\n<li>Champ. Round 2 - Travis Ford-Melton (Harvey Twisters) won by fall over Mason Mcbride (Westville Youth WC) Fall 1:15</li>\n<li>Champ. Round 2 - Kaleb Thompson (Martinez Fox Valley Elite) won by major decision over Brendan Smith (Edwardsville WC) Maj 19-6</li>\n<li>Champ. Round 2 - Noah Paul (Xtreme WC) won by decision over Dylan Ragusin (Arlington Cardinals) Dec 11-7</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Joey Melendez (Maine Eagles) won by fall over Payton Pulliam (Pontiac WC) Fall 0:57</li>\n<li>Champ. Round 2 - Michael Leveille (Oak Forest Warriors) won by decision over Dylan Martin (Crusaders` Elite) Dec 8-5</li>\n<li>Champ. Round 2 - Ryan Roper (SCN Youth WC) won in overtime over Christian Goin (Central Elite Rebels) OT 3-2</li>\n<li>Champ. Round 2 - Nathan Callaway (Brawlers WC) won by decision over Ethan Harsted (Seneca Irish Cadets) Dec 4-3</li>\n<li>Champ. Round 2 - Ben Emery (Little Celtic WC) won by fall over Hunter Edwards (WW Tigers WC) Fall 2:31</li>\n<li>Champ. Round 2 - Chase Bittle (Crusaders` Elite) won by fall over Justen Pate (Harvey Twisters) Fall 1:59</li>\n<li>Champ. Round 2 - Anthony Turner (Lionheart Intense Wrestling) won by decision over Eddie Bolivar (Gomez Wrestling Academy) Dec 7-2</li>\n<li>Champ. Round 2 - Anthony Schaer (Wolves Wrestling Club Inc.) won by major decision over Thomas Russell (Badger WC) Maj 15-6</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Fidel Mayora (Izzy Style School of Wrestling) won by fall over Kase Myerson (Lil Bucs WC) Fall 4:07</li>\n<li>Champ. Round 2 - Joshua Ogunsanya (Harvey Twisters) won by major decision over Nico Nunez (Lil Reaper WC) Maj 11-1</li>\n<li>Champ. Round 2 - Michael Mcgee (Force WC) won by fall over Hugh Gorman (Redhawk WC) Fall 1:02</li>\n<li>Champ. Round 2 - Garrett Bass (King Select Wrestling) won by fall over Riley Palm (Wrestling Factory) Fall 2:04</li>\n<li>Champ. Round 2 - Kameron Moss (King Select Wrestling) won by decision over Dane Durlacher (Bison WC) Dec 8-1</li>\n<li>Champ. Round 2 - Hassan Johnson (Harvey Twisters) won by fall over John McCaffrey (Martinez Fox Valley Elite) Fall 4:59</li>\n<li>Champ. Round 2 - Austin Kedzie (Martinez Fox Valley Elite) won by decision over David Spencer (MS Youth WC) Dec 9-2</li>\n<li>Champ. Round 2 - Dylan Burnoski (Bolingbrook Junior Raiders) won by decision over Joshua Fiegel (Crystal Lake Wizards) Dec 9-4</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Jake Szlenk (Crystal Lake Wizards) won by decision over Nicholas Sullivan (Bolingbrook Junior Raiders) Dec 6-1</li>\n<li>Champ. Round 2 - Logan Johnson (King Select Wrestling) won by fall over Jacob White (Chilli Dawgs WC) Fall 2:21</li>\n<li>Champ. Round 2 - Anthony Madrigal (Martinez Fox Valley Elite) won by major decision over Nicholas Donovan (Villa-Lombard Cougars) Maj 12-3</li>\n<li>Champ. Round 2 - Joseph Egan (Mustang WC) won by fall over Dalton Hall (Champaign WC) Fall 2:04</li>\n<li>Champ. Round 2 - Juan Bazaldua (Martinez Fox Valley Elite) won by major decision over Donnell Washington (Harvey Twisters) Maj 14-4</li>\n<li>Champ. Round 2 - Alek Ziegler (King Select Wrestling) won by fall over Colten Bishop (Dixon Wrestling Club) Fall 1:02</li>\n<li>Champ. Round 2 - Jackson Lingle (Maddog Wrestling Academy) won by decision over Drew Mccoy (Springfield Capitals Kids WC) Dec 7-3</li>\n<li>Champ. Round 2 - Giovanni Cassioppi (Hononegah WC) won by decision over Brandon Muselman (Tinley Park Bulldogs) Dec 4-1</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Markus Hartman (Barrington Broncos) won by major decision over Austin Macias (Z`s Team Pena) Maj 11-0</li>\n<li>Champ. Round 2 - Alec Meronk (Metamora Kids WC) won by decision over James Henseler (Roxana Kids WC) Dec 10-4</li>\n<li>Champ. Round 2 - Jason Renteria (Martinez Fox Valley Elite) won by major decision over Anthony Randazzo (Golden Eagles) Maj 14-3</li>\n<li>Champ. Round 2 - Gabriel Berta (Lemont Bears) won by decision over Ren Dazey (MS Youth WC) Dec 7-0</li>\n<li>Champ. Round 2 - Peter Ogunsanya (Harvey Twisters) won by tech fall over Gannon Hughes (Team No Ego WC) TF 17-1</li>\n<li>Champ. Round 2 - Will Lewan (Maine Eagles) won by fall over Brett Hammel (West Hancock WC) Fall 2:13</li>\n<li>Champ. Round 2 - Sean Mckenna (Martinez Fox Valley Elite) won by decision over Jason Stokes (Little Celtic WC) Dec 5-2</li>\n<li>Champ. Round 2 - Joshua Stenger (Crystal Lake Wizards) won by decision over Jackson Kohlberg (Arlington Cardinals) Dec 7-5</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Peter Ferraro (SCN Youth WC) won by injury default over Alex Zacharuk (Harlem Cougar WC) Inj. 0:00</li>\n<li>Champ. Round 2 - Tim Houston (Tinley Park Bulldogs) won by decision over Bradley Emmett (Springfield Capitals Kids WC) Dec 3-0</li>\n<li>Champ. Round 2 - Yahya Thomas (Harvey Twisters) won by decision over Dominick Ambrose (Orland Park Pioneers) Dec 10-3</li>\n<li>Champ. Round 2 - John Paul Smith (Bison WC) won by decision over Stone Engle (Bear Country WC) Dec 2-1</li>\n<li>Champ. Round 2 - Jaritt Shinhoster (Arlington Cardinals) won by decision over Jaleel Hollingsworth (Little Huskies WC) Dec 8-5</li>\n<li>Champ. Round 2 - Jackson O`reilly (Waubonsie WC) won by decision over Kyle Dixon (Carlinville WC) Dec 5-2</li>\n<li>Champ. Round 2 - Bilal Bailey (Harvey Twisters) won by decision over Baylor Fernandes (Bolingbrook Junior Raiders) Dec 10-3</li>\n<li>Champ. Round 2 - Charles Faber (Izzy Style School of Wrestling) won by decision over Jared Van Vleet (Stillman Valley WC) Dec 6-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Brad Gross (Sauk Valley WC) won by fall over Niko Derain (Martinez Fox Valley Elite) Fall 1:54</li>\n<li>Champ. Round 2 - David Ferrante (Golden Eagles) won by fall over Jonathon Darran (Mt. Olive Cats Kids Wrestling) Fall 1:24</li>\n<li>Champ. Round 2 - Cameron White (Harvey Twisters) won by decision over Cody Baldridge (Martinez Fox Valley Elite) Dec 11-4</li>\n<li>Champ. Round 2 - Peter Golec (Barrington Broncos) won by decision over Shajrianna Turner (Lionheart Intense Wrestling) Dec 6-0</li>\n<li>Champ. Round 2 - Jakob Cysewski (Barrington Broncos) won by fall over Devin Makemson (Bismarck-Henning WC) Fall 2:57</li>\n<li>Champ. Round 2 - Juwan Robinson (Bolingbrook Junior Raiders) won by major decision over We Rachal (Harvey Twisters) Maj 10-2</li>\n<li>Champ. Round 2 - Zachary Villarreal (Downers Grove Cougars WC) won by decision over Jack Mulay (Tinley Park Bulldogs) Dec 7-0</li>\n<li>Champ. Round 2 - Drake Davis (Illinois Valley Elite Wrestling) won by major decision over Lucas Busse (Wolves Wrestling Club Inc.) Maj 10-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Julian Blanco (Epic Wrestling) won by major decision over Nicholas Piaskowy (SCN Youth WC) Maj 15-2</li>\n<li>Champ. Round 2 - Miklo Strader (Lionheart Intense Wrestling) won by fall over Kolbi Caffey (Carbondale WC) Fall 2:25</li>\n<li>Champ. Round 2 - Jake Meyer (Barrington Broncos) won by fall over Luke Silva (Crystal Lake Wizards) Fall 1:17</li>\n<li>Champ. Round 2 - Jake Polka (Little Celtic WC) won by decision over Joshua Barzowski (Martinez Fox Valley Elite) Dec 3-2</li>\n<li>Champ. Round 2 - Sebastian Valentin (Junior Spartans WC) won by tech fall over Austin Wetsel (Tigertown Tanglers) TF 15-0</li>\n<li>Champ. Round 2 - Emille Shannon (King Select Wrestling) won by major decision over Baan Rachal (Harvey Twisters) Maj 9-0</li>\n<li>Champ. Round 2 - Isaac Jacquez (Martinez Fox Valley Elite) won by major decision over Anthony Marre (Gomez Wrestling Academy) Maj 8-0</li>\n<li>Champ. Round 2 - Joshua Jones (Renegade WC (NFP)) won in overtime over Rahveon Valentine (The Law) OT 4-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Cameron Caffey (Carbondale WC) won by decision over Justin Martinez (Xtreme WC) Dec 8-7</li>\n<li>Champ. Round 2 - Blaize Punke (Central Elite Rebels) won by decision over Matthew Hennessey (Villa Park Young Warriors) Dec 5-0</li>\n<li>Champ. Round 2 - Terrell Hess (Peoria Razorbacks) won by decision over Angel Rios (Z`s Team Pena) Dec 11-5</li>\n<li>Champ. Round 2 - Jesse Ellis (Cross Town WC) won by decision over Bobby Pryhocki (Lakeland Predators) Dec 10-3</li>\n<li>Champ. Round 2 - Ryan Gillooley (Lincoln Way WC) won by fall over Tyler Vercher (Harvey Twisters) Fall 1:56</li>\n<li>Champ. Round 2 - Jacob Dudeck (Martinez Fox Valley Elite) won by decision over Drew Hoselton (Prairie Central Hawks) Dec 8-2</li>\n<li>Champ. Round 2 - Ethan Pardilla (Arlington Cardinals) won by major decision over Jeremy Rumsey (MS Youth WC) Maj 14-0</li>\n<li>Champ. Round 2 - Alex Harvey (Rochelle WC) won by decision over Gage Burroughs (Mt Vernon Lions) Dec 4-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Noah Jackson (Waukegan Youth WC) won by decision over Cole Grant (Riverbend WC) Dec 12-6</li>\n<li>Champ. Round 2 - Datrelle Kozeluh (Cross Town WC) won by major decision over Jacob Blaha (Junior Kahoks) Maj 12-2</li>\n<li>Champ. Round 2 - Kordell Norfleet (Harvey Twisters) won by fall over Liam O`Donnell (Crystal Lake Wizards) Fall 0:25</li>\n<li>Champ. Round 2 - Frankie Indelli (Little Falcons WC) won by decision over Peyton West (Springfield Capitals Kids WC) Dec 11-10</li>\n<li>Champ. Round 2 - Rafael Roman (Granite City WC) won by tech fall over Triston Robb (Team No Ego WC) TF 17-0</li>\n<li>Champ. Round 2 - Henry Graham (Lionheart Intense Wrestling) won by fall over Samuel Seneker (Plainfield WC) Fall 2:16</li>\n<li>Champ. Round 2 - Matthew Pazienza (Mustang WC) won by decision over Darrell Chisum (Zee-Bee Stingers) Dec 6-2</li>\n<li>Champ. Round 2 - Stephen Silva (Junior Spartans WC) won by decision over Frank Carone (Crystal Lake Wizards) Dec 5-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Dan Benoit (Redhawk WC) won by decision over Samuel Durfey (Stillman Valley WC) Dec 6-4</li>\n<li>Champ. Round 2 - Jack Jessen (Villa Park Young Warriors) won by decision over Jordan Gumila (Force WC) Dec 7-1</li>\n<li>Champ. Round 2 - Brandon Rutherford (Mt Vernon Lions) won by fall over Daniel Pence (Crystal Lake Wizards) Fall 0:41</li>\n<li>Champ. Round 2 - Jake Price (Little Celtic WC) won by decision over Cameron Nicholas (Westville Youth WC) Dec 6-4</li>\n<li>Champ. Round 2 - Jason Bowman (SJO Youth WC) won by decision over Hunter Day (Moline WC) Dec 6-0</li>\n<li>Champ. Round 2 - Dylan Conway (Junior Spartans WC) won by decision over Tyler Guerrero (Villa Park Young Warriors) Dec 9-2</li>\n<li>Champ. Round 2 - Joshua Torres (Team No Ego WC) won by decision over Andrew Demos (Fox Lake WC) Dec 4-2</li>\n<li>Champ. Round 2 - Joshua Carter (Harlem Cougar WC) won by major decision over Jackson Skube (Champaign WC) Maj 21-7</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Kenneth Abitua (Xtreme WC) won by decision over Nathaniel Phelps (King Select Wrestling) Dec 6-0</li>\n<li>Champ. Round 2 - Riley DeMoss (SCN Youth WC) won by major decision over Freddy Walton (Force WC) Maj 21-7</li>\n<li>Champ. Round 2 - Cole Hunzeker (Geneseo Spider WC) won by decision over Robert Holt (Little Huskies WC) Dec 9-6</li>\n<li>Champ. Round 2 - Tanner Strobel (Arlington Cardinals) won by fall over Jarryd Cabusao (Golden Eagles) Fall 2:37</li>\n<li>Champ. Round 2 - Luis Penaloza (Villa-Lombard Cougars) won by decision over Andrew Hofferkamp (Sherman-Williamsville WC) Dec 4-3</li>\n<li>Champ. Round 2 - Carson Oughton (Indians Elite) won by fall over Zachary Hammel-Brown (Junior Kahoks) Fall 3:24</li>\n<li>Champ. Round 2 - Dru Worker (Tinley Park Bulldogs) won by fall over Aaron Ditsworth (Moline WC) Fall 2:20</li>\n<li>Champ. Round 2 - Jenner Hecox (Hecox Team Benaiah) won by tech fall over Austin Thurman (Crusaders` Elite) TF 20-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Romeo Mcknight (Crystal Lake Wizards) won by major decision over Maxwell Oswalt (Sauk Valley WC) Maj 12-1</li>\n<li>Champ. Round 2 - Jared Smith (Lakeland Predators) won by fall over Jack Golnick (Golden Eagles) Fall 2:25</li>\n<li>Champ. Round 2 - De`Gyon Macklin (Rockford WC) won by decision over Cody Ayers (Oakwood Youth WC) Dec 6-0</li>\n<li>Champ. Round 2 - Danny Saracco (Force WC) won by decision over Gregorio Aparicio (Vittum Cats) Dec 2-0</li>\n<li>Champ. Round 2 - Matt Brozovich (Indians Elite) won by major decision over Nathan Crone (Edwardsville WC) Maj 9-0</li>\n<li>Champ. Round 2 - Joseph Landmeier (SCN Youth WC) won in overtime over Alex Jacobs (Palatine Panthers) OT 5-3</li>\n<li>Champ. Round 2 - Al`lon Carter (Gladiators WC) won by major decision over Joseph McIntyre (Arlington Cardinals) Maj 14-1</li>\n<li>Champ. Round 2 - Brandon Elliott (Harlem Cougar WC) won by major decision over Isaac Gerard (Knox County Krushers) Maj 12-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Bryce Gabel (Brawlers WC) won by decision over Richard Gaskins (Champbuilders Wrestling) Dec 1-0</li>\n<li>Champ. Round 2 - John Embrey (Martinez Fox Valley Elite) won by injury default over Larry Adams (East St. Louis Wrestling) Inj. 0:00</li>\n<li>Champ. Round 2 - Wesley Kibler (SJO Youth WC) won by fall over Nathan Riney (Moline WC) Fall 1:20</li>\n<li>Champ. Round 2 - George Bessette (Lakeland Predators) won by fall over Bradley Hensley (Rochelle WC) Fall 0:31</li>\n<li>Champ. Round 2 - Matthew Wylie (Granite City WC) won in overtime over Lucas Cherry (Villa-Lombard Cougars) OT 10-8</li>\n<li>Champ. Round 2 - Allen Stallings (Gladiators WC) won by fall over Adam Shultz (WW Tigers WC) Fall 1:18</li>\n<li>Champ. Round 2 - Reginald Ferguson (Yorkville WC) won by fall over Eric Ellefson (Junior Cougar WC) Fall 3:59</li>\n<li>Champ. Round 2 - Evan McTaggart (Glen Ellyn Dungeon WC) won by decision over Jordan Shahrikian (Hononegah WC) Dec 5-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Keiffer Johnston (Shelbyville Junior Wrestling Rams) won by decision over Jeremy Daum (SCN Youth WC) Dec 7-3</li>\n<li>Champ. Round 2 - Grant Palmer (Arlington Cardinals) won by fall over Brett Nyswonger (Roxana Kids WC) Fall 0:26</li>\n<li>Champ. Round 2 - Devin Moore (Blackhawk WC) won by fall over Dewayne Hill (King Select Wrestling) Fall 2:08</li>\n<li>Champ. Round 2 - Joshua King (Power House WC) won by decision over Dylan Ervin (Martinez Fox Valley Elite) Dec 13-6</li>\n<li>Champ. Round 2 - Alexander Hunter (Naperville WC) won by decision over Tate Rujawitz (Edwardsville WC) Dec 5-0</li>\n<li>Champ. Round 2 - Matt Allen (Hinsdale WC) won by fall over Carlos Burgos (Rams WC) Fall 1:59</li>\n<li>Champ. Round 2 - Tyler Caldwell (Yorkville WC) won by fall over Thomas Helton (Junior Dukes WC) Fall 2:49</li>\n<li>Champ. Round 2 - Reid Fleeger (Xtreme WC) won by fall over Michael Nelson (Taylorville WC) Fall 2:24</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Andrew Wise (Aces Wrestling Club) won by fall over Devon Sieveking (Benton Jr WC) Fall 4:13</li>\n<li>Champ. Round 2 - Karim Fuentes (Little Huskies WC) won by fall over Tony Valentino (Elk Grove Junior Grens) Fall 3:58</li>\n<li>Champ. Round 2 - Mitchell Taylor (Junior Spartans WC) won by fall over Nathan Hillman (Morton Youth WC) Fall 2:13</li>\n<li>Champ. Round 2 - Lucas Warren (Blackhawk WC) won by fall over Julio Sifuentes (Martinez Fox Valley Elite) Fall 0:46</li>\n<li>Champ. Round 2 - Joshua House (Danville Chargers Wrestling) won by fall over Quinn Polaski (Junior Porters WC) Fall 2:59</li>\n<li>Champ. Round 2 - Octavius McCloud (Carbondale WC) won by decision over Matthew Bernal (Notre Dame WC) Dec 5-2</li>\n<li>Champ. Round 2 - Stephen Kreyenbuhl (Junior Dukes WC) won by decision over Cipriano Lopez (Streator WC) Dec 8-6</li>\n<li>Champ. Round 2 - Matt Sarhage (Triad Little Knights) won by fall over Austin Ziriaxe (Belvidere Bandits) Fall 3:53</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Mckinney (Harlem Cougar WC) won by fall over Christian Beck (WW Tigers WC) Fall 2:35</li>\n<li>Champ. Round 2 - Brandon Reyes (Wrestling Wolverines) won by decision over Dominic Tudor (Central Illinois Wrestling Academy) Dec 7-3</li>\n<li>Champ. Round 2 - Sam Deisher (Blackhawk WC) won by fall over Martell Beasley (Harvey Twisters) Fall 1:03</li>\n<li>Champ. Round 2 - J. Antonio Vargas (Arlington Cardinals) won by decision over Israel Griffin (King Select Wrestling) Dec 11-8</li>\n<li>Champ. Round 2 - James Rowe (Junior Spartans WC) won by decision over Luis Rivera (Waukegan Youth WC) Dec 7-6</li>\n<li>Champ. Round 2 - Bryan Ditchman (Tinley Park Bulldogs) won by fall over James Davis (Rochelle WC) Fall 0:30</li>\n<li>Champ. Round 2 - Robert Burnside (Edwardsville WC) won by fall over Robert Gannon (Downers Grove Cougars WC) Fall 2:21</li>\n<li>Champ. Round 2 - Matthew Crandall (Hawk WC) won by fall over Cyress Bergeron (Little Falcons WC) Fall 1:28</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Michael Tortorice (Wolves Wrestling Club Inc.) won by decision over John Paul Stedwill (Central Elite Rebels) Dec 1-0</li>\n<li>Champ. Round 2 - Kevin Stearns (Tinley Park Bulldogs) won by major decision over Elijah Gilkerson (Timber Wolves WC) Maj 12-1</li>\n<li>Champ. Round 2 - Kolbe O`Brien (SCN Youth WC) won by decision over Colin Barker (Xtreme WC) Dec 6-0</li>\n<li>Champ. Round 2 - Benjamin Kirby (Oak Forest Warriors) won by decision over Jacob Kalicky (Notre Dame WC) Dec 9-2</li>\n<li>Champ. Round 2 - Marcus Povlick (Force WC) won by major decision over Jake Keating (Naperville WC) Maj 11-0</li>\n<li>Champ. Round 2 - Louie Hayes (Little Huskies WC) won by fall over Tyler Wood (Tigertown Tanglers) Fall 0:40</li>\n<li>Champ. Round 2 - Tyler Moon (King Select Wrestling) won by decision over Dylan Doranski (Batavia Pinners) Dec 2-1</li>\n<li>Champ. Round 2 - Kyle Szlenk (Crystal Lake Wizards) won by fall over Stephanie Sommers (Arlington Cardinals) Fall 2:59</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Pat Walker (Gomez Wrestling Academy) won by fall over Jacob Hayes (Crystal Lake Wizards) Fall 1:11</li>\n<li>Champ. Round 2 - Joshua Gentry (Vittum Cats) won by decision over Jack Calderone (Junior Spartans WC) Dec 4-2</li>\n<li>Champ. Round 2 - Anthony Cheloni (SCN Youth WC) won by fall over Andrew Sobol (East Alton Wood River Jr. Oilers) Fall 1:24</li>\n<li>Champ. Round 2 - Nicholas Norris (Chilli Dawgs WC) won by fall over Anthony Rink (Brawlers WC) Fall 2:37</li>\n<li>Champ. Round 2 - Hunter Vester (Yorkville WC) won by decision over Brandon Ramos (Bolingbrook Junior Raiders) Dec 8-6</li>\n<li>Champ. Round 2 - Cooper Secker (King Select Wrestling) won by decision over Justin Heredia (Vittum Cats) Dec 7-0</li>\n<li>Champ. Round 2 - Hazen Rice (Maddog Wrestling Academy) won by fall over Ethan Reel (Central Elite Rebels) Fall 4:28</li>\n<li>Champ. Round 2 - Brady Wilsie (Xtreme WC) won by major decision over Zach Grosch (Waubonsie WC) Maj 9-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Beau Harrier (Golden Eagles) won by decision over Aj Rechenmacher (Batavia Pinners) Dec 6-5</li>\n<li>Champ. Round 2 - Jake Dibenedetto (Vittum Cats) won by major decision over Kobe Watts (Midwest Central Youth WC) Maj 14-4</li>\n<li>Champ. Round 2 - Zachary Krause (Force WC) won by decision over Demarius Terhune (Champaign WC) Dec 4-1</li>\n<li>Champ. Round 2 - Mitchell Stathakis (Barrington Broncos) won by decision over Chrishon Tucker (East St. Louis Wrestling) Dec 4-3</li>\n<li>Champ. Round 2 - Gavin Sutton (Gomez Wrestling Academy) won by major decision over Jacob Mitchell (Highland Bulldog Jr WC) Maj 8-0</li>\n<li>Champ. Round 2 - Mohammed Taylor (Harvey Twisters) won by fall over Kyle Bernat (SCN Youth WC) Fall 2:26</li>\n<li>Champ. Round 2 - Dack Punke (Central Elite Rebels) won by decision over Merik Fulton (Triad Little Knights) Dec 12-5</li>\n<li>Champ. Round 2 - Nolan Baker (Xtreme WC) won by major decision over Nicholas Drew (Plainfield WC) Maj 12-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Colin Glascott (Orland Park Pioneers) won in overtime over Wylie Allen (Crystal Lake Wizards) OT 5-4</li>\n<li>Champ. Round 2 - Brandon Critchfield (King Select Wrestling) won by major decision over Luke Bennett (Little Falcons WC) Maj 11-1</li>\n<li>Champ. Round 2 - Austin Gomez (Gomez Wrestling Academy) won by tech fall over Seth Wisowaty (Hononegah WC) TF 17-2</li>\n<li>Champ. Round 2 - Brandon Hanik (Vittum Cats) won by decision over Hunter Webb (Sauk Valley WC) Dec 7-0</li>\n<li>Champ. Round 2 - Dylan Duncan (SCN Youth WC) won by fall over Adam Nixon (Gomez Wrestling Academy) Fall 2:27</li>\n<li>Champ. Round 2 - Tanner Coleman (Peoria Heights Minutemen WC) won by major decision over Dylan Chambers (Murphysboro WC) Maj 10-2</li>\n<li>Champ. Round 2 - Sean Cullen (Wrestling Factory) won by fall over Dalton Kinison (Springfield Capitals Kids WC) Fall 2:06</li>\n<li>Champ. Round 2 - Travis Piotrowski (Wolves Wrestling Club Inc.) won by fall over Nicolas Augustave (Junior Spartans WC) Fall 59:00</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Austin O`Connor (Tinley Park Bulldogs) won by fall over Matt Breitbarth (Junior Spartans WC) Fall 0:33</li>\n<li>Champ. Round 2 - Anthony Rubino (SCN Youth WC) won by decision over Will Lucie (West Hancock WC) Dec 3-0</li>\n<li>Champ. Round 2 - Kyle Peisker (Gomez Wrestling Academy) won by fall over Hunter Voigt (Brawlers WC) Fall 0:53</li>\n<li>Champ. Round 2 - Jarod Foiles (Roxana Kids WC) won by major decision over Jared Ellingwood (Martinez Fox Valley Elite) Maj 12-2</li>\n<li>Champ. Round 2 - Dylan Thurston (Little Falcons WC) won by decision over Devin Michicich (Vittum Cats) Dec 3-2</li>\n<li>Champ. Round 2 - Nathan Dlugopolski (Lakeland Predators) won by decision over Brice Casey (Springfield Capitals Kids WC) Dec 7-0</li>\n<li>Champ. Round 2 - Roberto Campos (Bolingbrook Junior Raiders) won by decision over John Cullen (Wrestling Factory) Dec 1-0</li>\n<li>Champ. Round 2 - Christian Robertson (Vittum Cats) won by decision over Christopher Dranka (Crystal Lake Wizards) Dec 6-5</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Rahman Johnson (Harvey Twisters) won by major decision over Danny Madonia (Gomez Wrestling Academy) Maj 11-3</li>\n<li>Champ. Round 2 - Drake Boverie (Bulls WC) won by fall over Braxten Ary (Midwest Central Youth WC) Fall 1:53</li>\n<li>Champ. Round 2 - Aj Jaffe (SCN Youth WC) won by major decision over Joey Schloegel (Lincoln Way WC) Maj 11-1</li>\n<li>Champ. Round 2 - Andrew O`brien (Redhawk WC) won by fall over Garrett Brachbill (Shelbyville Junior Wrestling Rams) Fall 0:59</li>\n<li>Champ. Round 2 - Jacob Silzer (Tinley Park Bulldogs) won by decision over Andrew Verr (Villa Park Young Warriors) Dec 6-0</li>\n<li>Champ. Round 2 - Hunter Grau (Geneseo Spider WC) won by fall over Zachery Ellis (Zee-Bee Stingers) Fall 1:02</li>\n<li>Champ. Round 2 - Logan Gruszka (Team No Ego WC) won by decision over Kyle Ruettiger (Lincoln Way WC) Dec 6-0</li>\n<li>Champ. Round 2 - Jake Fiorito (Crystal Lake Wizards) won by decision over Jackson Schoen (Gomez Wrestling Academy) Dec 9-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Jonathan Warner (Geneseo Spider WC) won by decision over Zachary Akers (Indians Elite) Dec 7-2</li>\n<li>Champ. Round 2 - Guy Brown (Edwardsville WC) won by decision over Andrew Wenger (Dakota WC) Dec 2-1</li>\n<li>Champ. Round 2 - Richard Townsell (Little Huskies WC) won by decision over Matt Rowland (Villa Park Young Warriors) Dec 4-0</li>\n<li>Champ. Round 2 - Devin Donovan (Villa-Lombard Cougars) won by decision over Johnathan Turner (Springfield Capitals Kids WC) Dec 2-0</li>\n<li>Champ. Round 2 - Johnathon Doyle (Gomez Wrestling Academy) won by tech fall over Joey Nauman (Yorkville WC) TF 21-4</li>\n<li>Champ. Round 2 - Shayne Oster (Junior Porters WC) won by tech fall over Patrick Larkin (Redhawk WC) TF 15-0</li>\n<li>Champ. Round 2 - Devin Kane (Martinez Fox Valley Elite) won by fall over Egan Berta (Lemont Bears) Fall 0:33</li>\n<li>Champ. Round 2 - Keegan Powers (Hononegah WC) won by tech fall over Jesse Ditzler (Sauk Valley WC) TF 18-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Rudy Yates (Lions WC) won by major decision over Nathan Olsen (Dakota WC) Maj 15-5</li>\n<li>Champ. Round 2 - Ryder Punke (Central Elite Rebels) won by fall over Carsten Brauns (Highland Bulldog Jr WC) Fall 2:27</li>\n<li>Champ. Round 2 - Jeremiah Recinos (Gomez Wrestling Academy) won by major decision over Kyle Kalkbrenner (The Law) Maj 17-4</li>\n<li>Champ. Round 2 - Michael Callahan (SCN Youth WC) won by major decision over Patrick Brucki (Orland Park Pioneers) Maj 8-0</li>\n<li>Champ. Round 2 - Nick Kokkines (Force WC) won by decision over Nick Mohr (Yorkville WC) Dec 8-6</li>\n<li>Champ. Round 2 - Patrick Mcgowan (Tinley Park Bulldogs) won by decision over Tyler Dunn (East St. Louis Wrestling) Dec 13-9</li>\n<li>Champ. Round 2 - Ameen Hamdan (Triumph `The Art of Wrestling`) won by decision over Dino Gutierrez (Notre Dame WC) Dec 9-3</li>\n<li>Champ. Round 2 - Dylan Elmore (Harlem Cougar WC) won by decision over Kevin Soraghan (Force WC) Dec 6-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Matt Kleinkopf (Gomez Wrestling Academy) won by decision over Brian Johnston (Sycamore WC) Dec 8-4</li>\n<li>Champ. Round 2 - Brian Krasowski (Orland Park Pioneers) won by major decision over Amir Zegar (Tinley Park Bulldogs) Maj 15-2</li>\n<li>Champ. Round 2 - Elijah Baltazar (SCN Youth WC) won by decision over Michael Peters (Champions WC) Dec 4-0</li>\n<li>Champ. Round 2 - Cole Witzig (Triad Little Knights) won by decision over Ben Schneider (Little Huskies WC) Dec 3-1</li>\n<li>Champ. Round 2 - Johnny Mologousis (Lions WC) won by decision over Nicholas Foster (King Select Wrestling) Dec 5-0</li>\n<li>Champ. Round 2 - Jake Lanning (Pontiac WC) won by fall over David Riojas (Force WC) Fall 2:33</li>\n<li>Champ. Round 2 - Matthew Ferraro (SCN Youth WC) won by fall over Nicholas Delporte (Arlington Cardinals) Fall 2:30</li>\n<li>Champ. Round 2 - Gregory Krulas (Dakota WC) won by decision over Jake Tisza (Junior Spartans WC) Dec 9-5</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Chris Prosser (Edwardsville WC) won by major decision over Nicholas Sundberg (Crystal Lake Wizards) Maj 11-0</li>\n<li>Champ. Round 2 - Vaughn Hobart (Pontiac WC) won by decision over Victor Keane (Vittum Cats) Dec 7-0</li>\n<li>Champ. Round 2 - Eric Schultz (Tinley Park Bulldogs) won by decision over Ethan Cain (Sauk Valley WC) Dec 9-6</li>\n<li>Champ. Round 2 - Thomas Brennan (Orland Park Pioneers) won by major decision over Austin Singer (Fox Valley WC) Maj 10-1</li>\n<li>Champ. Round 2 - Isaiah White (Harvey Twisters) won by major decision over Steven Schmult (Force WC) Maj 21-7</li>\n<li>Champ. Round 2 - Matthew Wroblewski (Martinez Fox Valley Elite) won by decision over Mark Deavila (East St. Louis Wrestling) Dec 8-3</li>\n<li>Champ. Round 2 - Dylan Mannes (Fox Lake WC) won by fall over Daniel Terronez (Moline WC) Fall 4:24</li>\n<li>Champ. Round 2 - Tyler Eggemeyer (Panther Powerhouse WC) won by fall over Nicolas Delgado (Marengo Youth Wrestling) Fall 1:03</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Randy Meneweather (Knox County Krushers) won by fall over Kobe Lear (Fox Lake WC) Fall 0:55</li>\n<li>Champ. Round 2 - Mason Delong (Brawlers WC) won by decision over Braden Zalapi (Hononegah WC) Dec 4-2</li>\n<li>Champ. Round 2 - Troy Ott (Maddog Wrestling Academy) won by fall over Evan Broniarczyk (Tinley Park Bulldogs) Fall 0:47</li>\n<li>Champ. Round 2 - Joseph Muscolino (Martinez Fox Valley Elite) won by fall over Brock Barnes (Panther Powerhouse WC) Fall 1:10</li>\n<li>Champ. Round 2 - Trace Carello (Mt Vernon Lions) won by major decision over Brendon Gambill (Little Falcons WC) Maj 11-0</li>\n<li>Champ. Round 2 - Cody Ralston (Junior Spartans WC) won by fall over Ryan Railey (Pontiac WC) Fall 0:40</li>\n<li>Champ. Round 2 - Johnny Davidson (Barrington Broncos) won by decision over Matthew Beyer (Blackhawk WC) Dec 6-0</li>\n<li>Champ. Round 2 - Fernie Silva (Crystal Lake Wizards) won by fall over Zachary Tomac (Force WC) Fall 0:49</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Kamal Bey (Harvey Twisters) won by fall over Zachary Crosby (Golden Eagles) Fall 2:07</li>\n<li>Champ. Round 2 - Isaiah Brown (Team No Ego WC) won by fall over Aaron Zalar (Metamora Kids WC) Fall 2:13</li>\n<li>Champ. Round 2 - James Watters (Edwardsville WC) won by fall over Justin Scott (Geneseo Spider WC) Fall 0:55</li>\n<li>Champ. Round 2 - Michael Olsen (Elk Grove Junior Grens) won by decision over Whalen Rockwell (Bismarck-Henning WC) Dec 7-5</li>\n<li>Champ. Round 2 - Brady Rude (Sauk Valley WC) won by injury default over Shamon Harlan (East St. Louis Wrestling) Inj. 0:00</li>\n<li>Champ. Round 2 - Kyle Betourne (Brawlers WC) won by decision over Nathan Traxler (SCN Youth WC) Dec 9-4</li>\n<li>Champ. Round 2 - George Roskuszka (Little Falcons WC) won by fall over Alex Montbriand (Villa-Lombard Cougars) Fall 4:12</li>\n<li>Champ. Round 2 - Nick Graziano (Oak Forest Warriors) won by decision over Michael Jacobs (Hononegah WC) Dec 3-1</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Andrew Okayama (Force WC) won by fall over Jonathan Ransom (Pontiac WC) Fall 5:30</li>\n<li>Quarterfinal - Trent Rakers (Highland Bulldog Jr WC) won by decision over Nate Jimenez (SCN Youth WC) Dec 7-0</li>\n<li>Quarterfinal - Jacob Crisman (Pekin Boys &amp; Girls Club) won by disqualification over David Apple (Team West Wolves) DQ</li>\n<li>Quarterfinal - Cyress Ahart (Edwardsville WC) won by major decision over Scott Sierzega (Vittum Cats) Maj 9-1</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Jayleen Fitzpatrick (Gomez Wrestling Academy) won by decision over Desmond Nunez (Lil Reaper WC) Dec 7-2</li>\n<li>Quarterfinal - Jacob Warner (Champaign WC) won in overtime over Cole Bateman (Orland Park Pioneers) OT 3-1</li>\n<li>Quarterfinal - Zachary Blasioli (Bulls WC) won by decision over Mason Kroening (Waubonsie WC) Dec 4-0</li>\n<li>Quarterfinal - Robert Goodwin (Bolingbrook Junior Raiders) won by fall over David Cushing (Badger WC) Fall 1:08</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Jaime Hernandez (Martinez Fox Valley Elite) won by fall over Chase Raap (Dundee Highlanders WC) Fall 0:39</li>\n<li>Quarterfinal - Keaton Titus (Cumberland Youth WC) won by decision over Carlos Aguilar (Notre Dame WC) Dec 8-2</li>\n<li>Quarterfinal - Riley Vanik (Martinez Fox Valley Elite) won by decision over Kobey Bosworth (O`Fallon Little Panthers) Dec 6-4</li>\n<li>Quarterfinal - Gavin Goddard (Champaign WC) won by decision over Gavin Mast (Champions WC) Dec 11-9</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Ryan Doubek (Z`s Team Pena) won by fall over Enrique Aguirre (Martinez Fox Valley Elite) Fall 0:45</li>\n<li>Quarterfinal - William Wagner (Mustang WC) won by decision over Erick Cole (Moline WC) Dec 4-0</li>\n<li>Quarterfinal - Nikola Ivanisevic (Hinsdale WC) won by decision over Daniel McNally (Cross Town WC) Dec 7-0</li>\n<li>Quarterfinal - Caleb Adams (West Hancock WC) won by fall over Dyllan Hess (Huntley Jr. Red Raiders) Fall 1:47</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Anthony Marchetti (Hawk WC) won by fall over Luke Reinhardt (Arlington Cardinals) Fall 1:19</li>\n<li>Quarterfinal - Thomas Rollette (Hononegah WC) won in overtime over Brian Foley (Hinsdale WC) OT 3-2</li>\n<li>Quarterfinal - Emmanuel Terrell (Rams WC) won by fall over Noah Bates (Golden Eagles) Fall 2:50</li>\n<li>Quarterfinal - Blake Zalapi (Hononegah WC) won by fall over Tommy Pickett (Champions WC) Fall 2:42</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Dominic Ferraro (Gomez Wrestling Academy) won by fall over Kevin Alvarez (Team No Ego WC) Fall 2:35</li>\n<li>Quarterfinal - Jeremiah Glenn (Little Huskies WC) won by decision over Shane Raber (Force WC) Dec 4-1</li>\n<li>Quarterfinal - Blake McCarthy (Rocket Fuel WC) won by fall over Terrance Taylor (MS Youth WC) Fall 1:14</li>\n<li>Quarterfinal - John Terry (Hononegah WC) won by tech fall over Kyle Connolly (Jacksonville Area Wrestling) TF 17-0</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Aaron Zebrauskas (Southside Stallions) won by decision over Justin Cardani (MS Youth WC) Dec 3-0</li>\n<li>Quarterfinal - Anthony Schickel (Martinez Fox Valley Elite) won by fall over Lucas Schevikhoven (Lakeland Predators) Fall 3:50</li>\n<li>Quarterfinal - Travis Ford-Melton (Harvey Twisters) won by decision over Austin Rudsinski (Force WC) Dec 10-7</li>\n<li>Quarterfinal - Kaleb Thompson (Martinez Fox Valley Elite) won by decision over Noah Paul (Xtreme WC) Dec 9-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Joey Melendez (Maine Eagles) won by tech fall over Michael Leveille (Oak Forest Warriors) TF 17-2</li>\n<li>Quarterfinal - Nathan Callaway (Brawlers WC) won by decision over Ryan Roper (SCN Youth WC) Dec 4-1</li>\n<li>Quarterfinal - Ben Emery (Little Celtic WC) won by decision over Chase Bittle (Crusaders` Elite) Dec 6-5</li>\n<li>Quarterfinal - Anthony Turner (Lionheart Intense Wrestling) won by decision over Anthony Schaer (Wolves Wrestling Club Inc.) Dec 9-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Fidel Mayora (Izzy Style School of Wrestling) won by decision over Joshua Ogunsanya (Harvey Twisters) Dec 6-2</li>\n<li>Quarterfinal - Michael Mcgee (Force WC) won by fall over Garrett Bass (King Select Wrestling) Fall 4:20</li>\n<li>Quarterfinal - Hassan Johnson (Harvey Twisters) won by decision over Kameron Moss (King Select Wrestling) Dec 4-1</li>\n<li>Quarterfinal - Dylan Burnoski (Bolingbrook Junior Raiders) won by fall over Austin Kedzie (Martinez Fox Valley Elite) Fall 4:26</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Jake Szlenk (Crystal Lake Wizards) won by decision over Logan Johnson (King Select Wrestling) Dec 4-0</li>\n<li>Quarterfinal - Anthony Madrigal (Martinez Fox Valley Elite) won by major decision over Joseph Egan (Mustang WC) Maj 13-1</li>\n<li>Quarterfinal - Juan Bazaldua (Martinez Fox Valley Elite) won by decision over Alek Ziegler (King Select Wrestling) Dec 8-3</li>\n<li>Quarterfinal - Giovanni Cassioppi (Hononegah WC) won by decision over Jackson Lingle (Maddog Wrestling Academy) Dec 7-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Markus Hartman (Barrington Broncos) won by decision over Alec Meronk (Metamora Kids WC) Dec 8-4</li>\n<li>Quarterfinal - Jason Renteria (Martinez Fox Valley Elite) won by fall over Gabriel Berta (Lemont Bears) Fall 1:12</li>\n<li>Quarterfinal - Peter Ogunsanya (Harvey Twisters) won by decision over Will Lewan (Maine Eagles) Dec 6-5</li>\n<li>Quarterfinal - Sean Mckenna (Martinez Fox Valley Elite) won by major decision over Joshua Stenger (Crystal Lake Wizards) Maj 8-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Peter Ferraro (SCN Youth WC) won by decision over Tim Houston (Tinley Park Bulldogs) Dec 9-2</li>\n<li>Quarterfinal - Yahya Thomas (Harvey Twisters) won by fall over John Paul Smith (Bison WC) Fall 1:23</li>\n<li>Quarterfinal - Jaritt Shinhoster (Arlington Cardinals) won by major decision over Jackson O`reilly (Waubonsie WC) Maj 17-3</li>\n<li>Quarterfinal - Bilal Bailey (Harvey Twisters) won by decision over Charles Faber (Izzy Style School of Wrestling) Dec 4-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Brad Gross (Sauk Valley WC) won by fall over David Ferrante (Golden Eagles) Fall 4:20</li>\n<li>Quarterfinal - Cameron White (Harvey Twisters) won by fall over Peter Golec (Barrington Broncos) Fall 1:28</li>\n<li>Quarterfinal - Juwan Robinson (Bolingbrook Junior Raiders) won by major decision over Jakob Cysewski (Barrington Broncos) Maj 9-0</li>\n<li>Quarterfinal - Zachary Villarreal (Downers Grove Cougars WC) won by decision over Drake Davis (Illinois Valley Elite Wrestling) Dec 9-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Julian Blanco (Epic Wrestling) won by tech fall over Miklo Strader (Lionheart Intense Wrestling) TF 15-0</li>\n<li>Quarterfinal - Jake Polka (Little Celtic WC) won by decision over Jake Meyer (Barrington Broncos) Dec 8-6</li>\n<li>Quarterfinal - Emille Shannon (King Select Wrestling) won by decision over Sebastian Valentin (Junior Spartans WC) Dec 3-2</li>\n<li>Quarterfinal - Isaac Jacquez (Martinez Fox Valley Elite) won by decision over Joshua Jones (Renegade WC (NFP)) Dec 10-5</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Blaize Punke (Central Elite Rebels) won by decision over Cameron Caffey (Carbondale WC) Dec 11-6</li>\n<li>Quarterfinal - Jesse Ellis (Cross Town WC) won by fall over Terrell Hess (Peoria Razorbacks) Fall 0:41</li>\n<li>Quarterfinal - Jacob Dudeck (Martinez Fox Valley Elite) won by decision over Ryan Gillooley (Lincoln Way WC) Dec 6-2</li>\n<li>Quarterfinal - Ethan Pardilla (Arlington Cardinals) won by fall over Alex Harvey (Rochelle WC) Fall 1:24</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Datrelle Kozeluh (Cross Town WC) won by major decision over Noah Jackson (Waukegan Youth WC) Maj 17-3</li>\n<li>Quarterfinal - Kordell Norfleet (Harvey Twisters) won by fall over Frankie Indelli (Little Falcons WC) Fall 3:30</li>\n<li>Quarterfinal - Henry Graham (Lionheart Intense Wrestling) won by decision over Rafael Roman (Granite City WC) Dec 8-4</li>\n<li>Quarterfinal - Stephen Silva (Junior Spartans WC) won by fall over Matthew Pazienza (Mustang WC) Fall 1:28</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Jack Jessen (Villa Park Young Warriors) won by fall over Dan Benoit (Redhawk WC) Fall 0:52</li>\n<li>Quarterfinal - Brandon Rutherford (Mt Vernon Lions) won by decision over Jake Price (Little Celtic WC) Dec 6-1</li>\n<li>Quarterfinal - Dylan Conway (Junior Spartans WC) won by fall over Jason Bowman (SJO Youth WC) Fall 2:26</li>\n<li>Quarterfinal - Joshua Torres (Team No Ego WC) won by decision over Joshua Carter (Harlem Cougar WC) Dec 8-7</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Riley DeMoss (SCN Youth WC) won by major decision over Kenneth Abitua (Xtreme WC) Maj 12-4</li>\n<li>Quarterfinal - Tanner Strobel (Arlington Cardinals) won by decision over Cole Hunzeker (Geneseo Spider WC) Dec 10-6</li>\n<li>Quarterfinal - Carson Oughton (Indians Elite) won by tech fall over Luis Penaloza (Villa-Lombard Cougars) TF 17-0</li>\n<li>Quarterfinal - Jenner Hecox (Hecox Team Benaiah) won by decision over Dru Worker (Tinley Park Bulldogs) Dec 5-4</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Jared Smith (Lakeland Predators) won by decision over Romeo Mcknight (Crystal Lake Wizards) Dec 6-0</li>\n<li>Quarterfinal - Danny Saracco (Force WC) won by fall over De`Gyon Macklin (Rockford WC) Fall 1:14</li>\n<li>Quarterfinal - Matt Brozovich (Indians Elite) won by fall over Joseph Landmeier (SCN Youth WC) Fall 0:34</li>\n<li>Quarterfinal - Al`lon Carter (Gladiators WC) won in overtime over Brandon Elliott (Harlem Cougar WC) OT 2-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - John Embrey (Martinez Fox Valley Elite) won by fall over Bryce Gabel (Brawlers WC) Fall 0:23</li>\n<li>Quarterfinal - George Bessette (Lakeland Predators) won by fall over Wesley Kibler (SJO Youth WC) Fall 2:32</li>\n<li>Quarterfinal - Allen Stallings (Gladiators WC) won by major decision over Matthew Wylie (Granite City WC) Maj 14-3</li>\n<li>Quarterfinal - Evan McTaggart (Glen Ellyn Dungeon WC) won by fall over Reginald Ferguson (Yorkville WC) Fall 1:19</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Keiffer Johnston (Shelbyville Junior Wrestling Rams) won by fall over Grant Palmer (Arlington Cardinals) Fall 2:24</li>\n<li>Quarterfinal - Joshua King (Power House WC) won by major decision over Devin Moore (Blackhawk WC) Maj 16-5</li>\n<li>Quarterfinal - Matt Allen (Hinsdale WC) won by fall over Alexander Hunter (Naperville WC) Fall 2:40</li>\n<li>Quarterfinal - Tyler Caldwell (Yorkville WC) won by fall over Reid Fleeger (Xtreme WC) Fall 2:31</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Andrew Wise (Aces Wrestling Club) won by decision over Karim Fuentes (Little Huskies WC) Dec 7-0</li>\n<li>Quarterfinal - Lucas Warren (Blackhawk WC) won by fall over Mitchell Taylor (Junior Spartans WC) Fall 0:30</li>\n<li>Quarterfinal - Octavius McCloud (Carbondale WC) won by fall over Joshua House (Danville Chargers Wrestling) Fall 2:18</li>\n<li>Quarterfinal - Matt Sarhage (Triad Little Knights) won by decision over Stephen Kreyenbuhl (Junior Dukes WC) Dec 7-4</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Anthony Mckinney (Harlem Cougar WC) won by fall over Brandon Reyes (Wrestling Wolverines) Fall 4:30</li>\n<li>Quarterfinal - Sam Deisher (Blackhawk WC) won by fall over J. Antonio Vargas (Arlington Cardinals) Fall 0:44</li>\n<li>Quarterfinal - Bryan Ditchman (Tinley Park Bulldogs) won by fall over James Rowe (Junior Spartans WC) Fall 0:11</li>\n<li>Quarterfinal - Matthew Crandall (Hawk WC) won by major decision over Robert Burnside (Edwardsville WC) Maj 14-0</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Michael Tortorice (Wolves Wrestling Club Inc.) won by decision over Kevin Stearns (Tinley Park Bulldogs) Dec 4-2</li>\n<li>Quarterfinal - Kolbe O`Brien (SCN Youth WC) won by decision over Benjamin Kirby (Oak Forest Warriors) Dec 9-2</li>\n<li>Quarterfinal - Louie Hayes (Little Huskies WC) won by decision over Marcus Povlick (Force WC) Dec 10-3</li>\n<li>Quarterfinal - Kyle Szlenk (Crystal Lake Wizards) won by decision over Tyler Moon (King Select Wrestling) Dec 2-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Pat Walker (Gomez Wrestling Academy) won by fall over Joshua Gentry (Vittum Cats) Fall 2:45</li>\n<li>Quarterfinal - Anthony Cheloni (SCN Youth WC) won by decision over Nicholas Norris (Chilli Dawgs WC) Dec 4-0</li>\n<li>Quarterfinal - Hunter Vester (Yorkville WC) won by decision over Cooper Secker (King Select Wrestling) Dec 7-0</li>\n<li>Quarterfinal - Hazen Rice (Maddog Wrestling Academy) won by decision over Brady Wilsie (Xtreme WC) Dec 5-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Jake Dibenedetto (Vittum Cats) won by decision over Beau Harrier (Golden Eagles) Dec 9-2</li>\n<li>Quarterfinal - Zachary Krause (Force WC) won by decision over Mitchell Stathakis (Barrington Broncos) Dec 3-1</li>\n<li>Quarterfinal - Gavin Sutton (Gomez Wrestling Academy) won by fall over Mohammed Taylor (Harvey Twisters) Fall 2:28</li>\n<li>Quarterfinal - Dack Punke (Central Elite Rebels) won by decision over Nolan Baker (Xtreme WC) Dec 8-6</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Colin Glascott (Orland Park Pioneers) won by decision over Brandon Critchfield (King Select Wrestling) Dec 7-4</li>\n<li>Quarterfinal - Austin Gomez (Gomez Wrestling Academy) won by fall over Brandon Hanik (Vittum Cats) Fall 3:36</li>\n<li>Quarterfinal - Dylan Duncan (SCN Youth WC) won by fall over Tanner Coleman (Peoria Heights Minutemen WC) Fall 3:33</li>\n<li>Quarterfinal - Travis Piotrowski (Wolves Wrestling Club Inc.) won by decision over Sean Cullen (Wrestling Factory) Dec 3-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Austin O`Connor (Tinley Park Bulldogs) won by fall over Anthony Rubino (SCN Youth WC) Fall 3:28</li>\n<li>Quarterfinal - Jarod Foiles (Roxana Kids WC) won by decision over Kyle Peisker (Gomez Wrestling Academy) Dec 5-4</li>\n<li>Quarterfinal - Dylan Thurston (Little Falcons WC) won by decision over Nathan Dlugopolski (Lakeland Predators) Dec 7-2</li>\n<li>Quarterfinal - Christian Robertson (Vittum Cats) won by decision over Roberto Campos (Bolingbrook Junior Raiders) Dec 4-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Drake Boverie (Bulls WC) won by fall over Rahman Johnson (Harvey Twisters) Fall 2:44</li>\n<li>Quarterfinal - Aj Jaffe (SCN Youth WC) won by decision over Andrew O`brien (Redhawk WC) Dec 7-1</li>\n<li>Quarterfinal - Jacob Silzer (Tinley Park Bulldogs) won in overtime over Hunter Grau (Geneseo Spider WC) OT 4-3</li>\n<li>Quarterfinal - Logan Gruszka (Team No Ego WC) won by decision over Jake Fiorito (Crystal Lake Wizards) Dec 6-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Guy Brown (Edwardsville WC) won by decision over Jonathan Warner (Geneseo Spider WC) Dec 7-5</li>\n<li>Quarterfinal - Richard Townsell (Little Huskies WC) won by decision over Devin Donovan (Villa-Lombard Cougars) Dec 6-1</li>\n<li>Quarterfinal - Shayne Oster (Junior Porters WC) won by fall over Johnathon Doyle (Gomez Wrestling Academy) Fall 2:10</li>\n<li>Quarterfinal - Keegan Powers (Hononegah WC) won by fall over Devin Kane (Martinez Fox Valley Elite) Fall 2:49</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Ryder Punke (Central Elite Rebels) won by decision over Rudy Yates (Lions WC) Dec 6-4</li>\n<li>Quarterfinal - Michael Callahan (SCN Youth WC) won by decision over Jeremiah Recinos (Gomez Wrestling Academy) Dec 7-0</li>\n<li>Quarterfinal - Nick Kokkines (Force WC) won by decision over Patrick Mcgowan (Tinley Park Bulldogs) Dec 24-21</li>\n<li>Quarterfinal - Ameen Hamdan (Triumph `The Art of Wrestling`) won by fall over Dylan Elmore (Harlem Cougar WC) Fall 3:59</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Brian Krasowski (Orland Park Pioneers) won by decision over Matt Kleinkopf (Gomez Wrestling Academy) Dec 6-2</li>\n<li>Quarterfinal - Cole Witzig (Triad Little Knights) won in overtime over Elijah Baltazar (SCN Youth WC) OT 2-1</li>\n<li>Quarterfinal - Jake Lanning (Pontiac WC) won by decision over Johnny Mologousis (Lions WC) Dec 4-2</li>\n<li>Quarterfinal - Matthew Ferraro (SCN Youth WC) won in overtime over Gregory Krulas (Dakota WC) OT 4-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Chris Prosser (Edwardsville WC) won by decision over Vaughn Hobart (Pontiac WC) Dec 6-5</li>\n<li>Quarterfinal - Eric Schultz (Tinley Park Bulldogs) won in overtime over Thomas Brennan (Orland Park Pioneers) OT 3-2</li>\n<li>Quarterfinal - Isaiah White (Harvey Twisters) won by fall over Matthew Wroblewski (Martinez Fox Valley Elite) Fall 1:17</li>\n<li>Quarterfinal - Tyler Eggemeyer (Panther Powerhouse WC) won by fall over Dylan Mannes (Fox Lake WC) Fall 0:49</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Randy Meneweather (Knox County Krushers) won in overtime over Mason Delong (Brawlers WC) OT 5-3</li>\n<li>Quarterfinal - Troy Ott (Maddog Wrestling Academy) won by decision over Joseph Muscolino (Martinez Fox Valley Elite) Dec 11-5</li>\n<li>Quarterfinal - Trace Carello (Mt Vernon Lions) won by major decision over Cody Ralston (Junior Spartans WC) Maj 10-2</li>\n<li>Quarterfinal - Fernie Silva (Crystal Lake Wizards) won by fall over Johnny Davidson (Barrington Broncos) Fall 1:50</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Kamal Bey (Harvey Twisters) won by fall over Isaiah Brown (Team No Ego WC) Fall 0:35</li>\n<li>Quarterfinal - James Watters (Edwardsville WC) won by fall over Michael Olsen (Elk Grove Junior Grens) Fall 2:41</li>\n<li>Quarterfinal - Kyle Betourne (Brawlers WC) won in double overtime over Brady Rude (Sauk Valley WC) 2-OT 4-3</li>\n<li>Quarterfinal - George Roskuszka (Little Falcons WC) won by decision over Nick Graziano (Oak Forest Warriors) Dec 4-2</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Xavian Girona (Lakeland Predators) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Hammitt (Tigertown Tanglers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Will Meador (Carbondale WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Cassioppi (Hononegah WC) won by decision over Jake Hutchinson (Orland Park Pioneers) Dec 16-9</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Ryan Yohe (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Thompson (Granite City WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Rafe (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cadin Koeppel (Cary Matmen) won by forfeit over Edward Wolf (Little Redskins WC) FF</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Tariq Thurman (Gladiators WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Bleeker (Pekin Boys &amp; Girls Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Devin O`Rourke (Oak Forest Warriors) won by fall over Brett Hyink (Lincoln Way WC) Fall 1:29</li>\n<li>Cons. Round 1 - Nicholas Sondag (Waubonsie WC) won in overtime over Cade Meier (Dakota WC) OT 3-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Ivan Rodriguez (Fenton Bison WC) won by fall over Jacob Ramos (Bolingbrook Junior Raiders) Fall 2:44</li>\n<li>Cons. Round 1 - Ryan Pancamo (Kane County Grapplers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Earney (Granite City WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Davion Talbert (Little Huskies WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Austin Sweet (Granite City WC) won by fall over Lance Jewell (Cumberland Youth WC) Fall 0:40</li>\n<li>Cons. Round 1 - Dylan Souza (Yorkville WC) won by fall over Todd O`dell (Junior Spartans WC) Fall 2:08</li>\n<li>Cons. Round 1 - Steven Norman (Blackhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Kincade (East Alton Wood River Jr. Oilers) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Jeff Fombelle (A-J Jr. Wildcat Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chase McDaniel (Harrisburg Jr. Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Abiel Horta (Badger WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aiden Montoya (Team West Wolves) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Domenick Zaccone (Orland Park Pioneers) won by major decision over Ethan Holcomb (Rocket Fuel WC) Maj 14-1</li>\n<li>Cons. Round 1 - Christopher Kennedy (Little Celtic WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mason Mcbride (Westville Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brendan Smith (Edwardsville WC) won by fall over Elijah Ankney (Dixon Wrestling Club) Fall 0:37</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Payton Pulliam (Pontiac WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ethan Harsted (Seneca Irish Cadets) won by decision over Justin Montani (Sycamore WC) Dec 10-6</li>\n<li>Cons. Round 1 - Hunter Edwards (WW Tigers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Eddie Bolivar (Gomez Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Kase Myerson (Lil Bucs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hugh Gorman (Redhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - John McCaffrey (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Fiegel (Crystal Lake Wizards) won by fall over Isaac Martinez (Moline WC) Fall 1:09</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Nicholas Sullivan (Bolingbrook Junior Raiders) won by major decision over Marcus Long (Pontiac WC) Maj 9-0</li>\n<li>Cons. Round 1 - Nicholas Donovan (Villa-Lombard Cougars) won by decision over Jayton Hall (Renegades Elite) Dec 7-0</li>\n<li>Cons. Round 1 - Donnell Washington (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon Muselman (Tinley Park Bulldogs) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Austin Macias (Z`s Team Pena) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Randazzo (Golden Eagles) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gannon Hughes (Team No Ego WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jason Stokes (Little Celtic WC) won by fall over Joel Sarver (Champaign WC) Fall 0:43</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Alex Zacharuk (Harlem Cougar WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dominick Ambrose (Orland Park Pioneers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jaleel Hollingsworth (Little Huskies WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Micah Krueger (Seneca Irish Cadets) won by decision over Baylor Fernandes (Bolingbrook Junior Raiders) Dec 4-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Niko Derain (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cody Baldridge (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - We Rachal (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Mulay (Tinley Park Bulldogs) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Nicholas Piaskowy (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Barzowski (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Baan Rachal (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Marre (Gomez Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Matthew Hennessey (Villa Park Young Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bobby Pryhocki (Lakeland Predators) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drew Hoselton (Prairie Central Hawks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeremy Rumsey (MS Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Blaha (Junior Kahoks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Liam O`Donnell (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Samuel Seneker (Plainfield WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Frank Carone (Crystal Lake Wizards) won by major decision over Evan Schaibley (Seneca Irish Cadets) Maj 14-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Jordan Gumila (Force WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Daniel Pence (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Guerrero (Villa Park Young Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Demos (Fox Lake WC) won by decision over Andrew Holderer (Edwardsville WC) Dec 6-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Freddy Walton (Force WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jarryd Cabusao (Golden Eagles) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Hammel-Brown (Junior Kahoks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Thurman (Crusaders` Elite) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Jack Golnick (Golden Eagles) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gregorio Aparicio (Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Crone (Edwardsville WC) won by fall over Brady Tolbert (Prairie Central Hawks) Fall 0:12</li>\n<li>Cons. Round 1 - Joseph McIntyre (Arlington Cardinals) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Larry Adams (East St. Louis Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bradley Hensley (Rochelle WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Adam Shultz (WW Tigers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jordan Shahrikian (Hononegah WC) won by major decision over Devan Everett (Taylorville WC) Maj 9-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Jeremy Daum (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dylan Ervin (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Carlos Burgos (Rams WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Helton (Junior Dukes WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Devon Sieveking (Benton Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Julio Sifuentes (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Bernal (Notre Dame WC) won by fall over Dylan Uzumecki (Batavia Pinners) Fall 2:46</li>\n<li>Cons. Round 1 - Austin Ziriaxe (Belvidere Bandits) won by fall over Justin Bills (Renegade WC (NFP)) Fall 1:22</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Christian Beck (WW Tigers WC) won in overtime over Jeremy Mull (Granite City WC) OT 1-0</li>\n<li>Cons. Round 1 - Martell Beasley (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - James Davis (Rochelle WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cyress Bergeron (Little Falcons WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - John Paul Stedwill (Central Elite Rebels) won by major decision over Ethan Mckinstry (Lawrence County WC) Maj 13-4</li>\n<li>Cons. Round 1 - Colin Barker (Xtreme WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Wood (Tigertown Tanglers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Stephanie Sommers (Arlington Cardinals) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Hayes (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Sobol (East Alton Wood River Jr. Oilers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon Ramos (Bolingbrook Junior Raiders) won by fall over Carter Pelletier (Team No Ego WC) Fall 0:54</li>\n<li>Cons. Round 1 - Ethan Reel (Central Elite Rebels) won by tech fall over Devin Poole (Pekin Boys &amp; Girls Club) TF 19-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Kobe Watts (Midwest Central Youth WC) won by decision over Jason Giuliano (Maddog Wrestling Academy) Dec 4-2</li>\n<li>Cons. Round 1 - Demarius Terhune (Champaign WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Mitchell (Highland Bulldog Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Merik Fulton (Triad Little Knights) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Wylie Allen (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Seth Wisowaty (Hononegah WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Adam Nixon (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicolas Augustave (Junior Spartans WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Matt Breitbarth (Junior Spartans WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jared Ellingwood (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Devin Michicich (Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christopher Dranka (Crystal Lake Wizards) won by major decision over Chad Gholson (Yorkville WC) Maj 13-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Braxten Ary (Midwest Central Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joey Schloegel (Lincoln Way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Verr (Villa Park Young Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Ruettiger (Lincoln Way WC) won by tech fall over Dylan Pate (Hoopeston Area WC) TF 16-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Andrew Wenger (Dakota WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matt Rowland (Villa Park Young Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Patrick Larkin (Redhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jesse Ditzler (Sauk Valley WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Carsten Brauns (Highland Bulldog Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Patrick Brucki (Orland Park Pioneers) won by decision over Dylan McCollum (Roxana Kids WC) Dec 11-4</li>\n<li>Cons. Round 1 - Alex Rodriguez (Fox Lake WC) won by major decision over Nick Mohr (Yorkville WC) Maj 16-2</li>\n<li>Cons. Round 1 - Dino Gutierrez (Notre Dame WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Amir Zegar (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ben Schneider (Little Huskies WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - David Riojas (Force WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Delporte (Arlington Cardinals) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Nicholas Sundberg (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ethan Cain (Sauk Valley WC) won by decision over Jacob Elsbury (Xtreme WC) Dec 5-2</li>\n<li>Cons. Round 1 - Steven Schmult (Force WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicolas Delgado (Marengo Youth Wrestling) won by fall over Thomas Fazy (Orland Park Pioneers) Fall 0:29</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Kobe Lear (Fox Lake WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Welch (Crystal Lake Wizards) won by fall over Evan Broniarczyk (Tinley Park Bulldogs) Fall 1:00</li>\n<li>Cons. Round 1 - Brendon Gambill (Little Falcons WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Tomac (Force WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Zachary Crosby (Golden Eagles) received a bye   () Bye</li>\n<li>Cons. Round 1 - Justin Scott (Geneseo Spider WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Traxler (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Montbriand (Villa-Lombard Cougars) won by fall over Jacob Albert (A-J Jr. Wildcat Wrestling) Fall 2:30</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Jonathan Ransom (Pontiac WC) won by fall over Xavian Girona (Lakeland Predators) Fall 3:28</li>\n<li>Cons. Round 2 - Nate Jimenez (SCN Youth WC) won by fall over Tyler Hammitt (Tigertown Tanglers) Fall 3:00</li>\n<li>Cons. Round 2 - Will Meador (Carbondale WC) won by forfeit over David Apple (Team West Wolves) FF</li>\n<li>Cons. Round 2 - Anthony Cassioppi (Hononegah WC) won by fall over Scott Sierzega (Vittum Cats) Fall 1:13</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Desmond Nunez (Lil Reaper WC) won by fall over Ryan Yohe (Martinez Fox Valley Elite) Fall 4:21</li>\n<li>Cons. Round 2 - Cole Bateman (Orland Park Pioneers) won by major decision over Kyle Thompson (Granite City WC) Maj 9-0</li>\n<li>Cons. Round 2 - Mason Kroening (Waubonsie WC) won by fall over Matthew Rafe (Brawlers WC) Fall 2:53</li>\n<li>Cons. Round 2 - Cadin Koeppel (Cary Matmen) won by fall over David Cushing (Badger WC) Fall 0:47</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Tariq Thurman (Gladiators WC) won by fall over Chase Raap (Dundee Highlanders WC) Fall 2:04</li>\n<li>Cons. Round 2 - Matthew Bleeker (Pekin Boys &amp; Girls Club) won by fall over Carlos Aguilar (Notre Dame WC) Fall 4:23</li>\n<li>Cons. Round 2 - Devin O`Rourke (Oak Forest Warriors) won by decision over Kobey Bosworth (O`Fallon Little Panthers) Dec 13-8</li>\n<li>Cons. Round 2 - Gavin Mast (Champions WC) won by major decision over Nicholas Sondag (Waubonsie WC) Maj 16-7</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Ivan Rodriguez (Fenton Bison WC) won by fall over Enrique Aguirre (Martinez Fox Valley Elite) Fall 3:38</li>\n<li>Cons. Round 2 - Erick Cole (Moline WC) won by decision over Ryan Pancamo (Kane County Grapplers) Dec 5-4</li>\n<li>Cons. Round 2 - Daniel McNally (Cross Town WC) won by decision over Ryan Earney (Granite City WC) Dec 11-9</li>\n<li>Cons. Round 2 - Davion Talbert (Little Huskies WC) won by fall over Dyllan Hess (Huntley Jr. Red Raiders) Fall 3:30</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Austin Sweet (Granite City WC) won by decision over Luke Reinhardt (Arlington Cardinals) Dec 2-0</li>\n<li>Cons. Round 2 - Brian Foley (Hinsdale WC) won by decision over Dylan Souza (Yorkville WC) Dec 7-2</li>\n<li>Cons. Round 2 - Noah Bates (Golden Eagles) won by decision over Steven Norman (Blackhawk WC) Dec 5-2</li>\n<li>Cons. Round 2 - Tommy Pickett (Champions WC) won by fall over Zachary Kincade (East Alton Wood River Jr. Oilers) Fall 2:33</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Kevin Alvarez (Team No Ego WC) won by fall over Jeff Fombelle (A-J Jr. Wildcat Wrestling) Fall 1:18</li>\n<li>Cons. Round 2 - Shane Raber (Force WC) won by decision over Chase McDaniel (Harrisburg Jr. Bulldogs) Dec 4-3</li>\n<li>Cons. Round 2 - Terrance Taylor (MS Youth WC) won by fall over Abiel Horta (Badger WC) Fall 1:30</li>\n<li>Cons. Round 2 - Kyle Connolly (Jacksonville Area Wrestling) won by fall over Aiden Montoya (Team West Wolves) Fall 0:44</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Justin Cardani (MS Youth WC) won by decision over Domenick Zaccone (Orland Park Pioneers) Dec 3-2</li>\n<li>Cons. Round 2 - Lucas Schevikhoven (Lakeland Predators) won by decision over Christopher Kennedy (Little Celtic WC) Dec 4-3</li>\n<li>Cons. Round 2 - Austin Rudsinski (Force WC) won by fall over Mason Mcbride (Westville Youth WC) Fall 2:41</li>\n<li>Cons. Round 2 - Noah Paul (Xtreme WC) won by decision over Brendan Smith (Edwardsville WC) Dec 11-4</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Payton Pulliam (Pontiac WC) won by decision over Michael Leveille (Oak Forest Warriors) Dec 11-5</li>\n<li>Cons. Round 2 - Ethan Harsted (Seneca Irish Cadets) won by decision over Ryan Roper (SCN Youth WC) Dec 9-2</li>\n<li>Cons. Round 2 - Chase Bittle (Crusaders` Elite) won by fall over Hunter Edwards (WW Tigers WC) Fall 1:30</li>\n<li>Cons. Round 2 - Eddie Bolivar (Gomez Wrestling Academy) won by decision over Anthony Schaer (Wolves Wrestling Club Inc.) Dec 7-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Joshua Ogunsanya (Harvey Twisters) won by decision over Kase Myerson (Lil Bucs WC) Dec 6-3</li>\n<li>Cons. Round 2 - Garrett Bass (King Select Wrestling) won by fall over Hugh Gorman (Redhawk WC) Fall 0:54</li>\n<li>Cons. Round 2 - Kameron Moss (King Select Wrestling) won by major decision over John McCaffrey (Martinez Fox Valley Elite) Maj 9-1</li>\n<li>Cons. Round 2 - Joshua Fiegel (Crystal Lake Wizards) won by decision over Austin Kedzie (Martinez Fox Valley Elite) Dec 3-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Logan Johnson (King Select Wrestling) won by decision over Nicholas Sullivan (Bolingbrook Junior Raiders) Dec 9-6</li>\n<li>Cons. Round 2 - Joseph Egan (Mustang WC) won in overtime over Nicholas Donovan (Villa-Lombard Cougars) OT 8-6</li>\n<li>Cons. Round 2 - Alek Ziegler (King Select Wrestling) won by fall over Donnell Washington (Harvey Twisters) Fall 4:16</li>\n<li>Cons. Round 2 - Brandon Muselman (Tinley Park Bulldogs) won by decision over Jackson Lingle (Maddog Wrestling Academy) Dec 6-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Austin Macias (Z`s Team Pena) won by fall over Alec Meronk (Metamora Kids WC) Fall 1:17</li>\n<li>Cons. Round 2 - Anthony Randazzo (Golden Eagles) won by decision over Gabriel Berta (Lemont Bears) Dec 7-2</li>\n<li>Cons. Round 2 - Will Lewan (Maine Eagles) won by major decision over Gannon Hughes (Team No Ego WC) Maj 11-1</li>\n<li>Cons. Round 2 - Joshua Stenger (Crystal Lake Wizards) won in overtime over Jason Stokes (Little Celtic WC) OT 6-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Alex Zacharuk (Harlem Cougar WC) won by decision over Tim Houston (Tinley Park Bulldogs) Dec 9-2</li>\n<li>Cons. Round 2 - Dominick Ambrose (Orland Park Pioneers) won by major decision over John Paul Smith (Bison WC) Maj 11-3</li>\n<li>Cons. Round 2 - Jaleel Hollingsworth (Little Huskies WC) won by decision over Jackson O`reilly (Waubonsie WC) Dec 7-1</li>\n<li>Cons. Round 2 - Charles Faber (Izzy Style School of Wrestling) won by decision over Micah Krueger (Seneca Irish Cadets) Dec 5-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Niko Derain (Martinez Fox Valley Elite) won by fall over David Ferrante (Golden Eagles) Fall 4:09</li>\n<li>Cons. Round 2 - Cody Baldridge (Martinez Fox Valley Elite) won by decision over Peter Golec (Barrington Broncos) Dec 9-2</li>\n<li>Cons. Round 2 - Jakob Cysewski (Barrington Broncos) won by fall over We Rachal (Harvey Twisters) Fall 3:48</li>\n<li>Cons. Round 2 - Drake Davis (Illinois Valley Elite Wrestling) won by decision over Jack Mulay (Tinley Park Bulldogs) Dec 10-8</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Miklo Strader (Lionheart Intense Wrestling) won by decision over Nicholas Piaskowy (SCN Youth WC) Dec 5-3</li>\n<li>Cons. Round 2 - Jake Meyer (Barrington Broncos) won in overtime over Joshua Barzowski (Martinez Fox Valley Elite) OT 7-5</li>\n<li>Cons. Round 2 - Sebastian Valentin (Junior Spartans WC) won by decision over Baan Rachal (Harvey Twisters) Dec 6-4</li>\n<li>Cons. Round 2 - Joshua Jones (Renegade WC (NFP)) won by decision over Anthony Marre (Gomez Wrestling Academy) Dec 4-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Cameron Caffey (Carbondale WC) won in overtime over Matthew Hennessey (Villa Park Young Warriors) OT 6-4</li>\n<li>Cons. Round 2 - Bobby Pryhocki (Lakeland Predators) won by fall over Terrell Hess (Peoria Razorbacks) Fall 4:02</li>\n<li>Cons. Round 2 - Ryan Gillooley (Lincoln Way WC) won by decision over Drew Hoselton (Prairie Central Hawks) Dec 4-3</li>\n<li>Cons. Round 2 - Alex Harvey (Rochelle WC) won by decision over Jeremy Rumsey (MS Youth WC) Dec 2-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Noah Jackson (Waukegan Youth WC) won by decision over Jacob Blaha (Junior Kahoks) Dec 7-6</li>\n<li>Cons. Round 2 - Frankie Indelli (Little Falcons WC) won by decision over Liam O`Donnell (Crystal Lake Wizards) Dec 7-5</li>\n<li>Cons. Round 2 - Samuel Seneker (Plainfield WC) won by major decision over Rafael Roman (Granite City WC) Maj 10-1</li>\n<li>Cons. Round 2 - Frank Carone (Crystal Lake Wizards) won by fall over Matthew Pazienza (Mustang WC) Fall 3:45</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Jordan Gumila (Force WC) won by fall over Dan Benoit (Redhawk WC) Fall 0:53</li>\n<li>Cons. Round 2 - Jake Price (Little Celtic WC) won by fall over Daniel Pence (Crystal Lake Wizards) Fall 1:55</li>\n<li>Cons. Round 2 - Tyler Guerrero (Villa Park Young Warriors) won by decision over Jason Bowman (SJO Youth WC) Dec 7-5</li>\n<li>Cons. Round 2 - Joshua Carter (Harlem Cougar WC) won by decision over Andrew Demos (Fox Lake WC) Dec 9-5</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Kenneth Abitua (Xtreme WC) won by decision over Freddy Walton (Force WC) Dec 6-3</li>\n<li>Cons. Round 2 - Jarryd Cabusao (Golden Eagles) won by decision over Cole Hunzeker (Geneseo Spider WC) Dec 5-4</li>\n<li>Cons. Round 2 - Zachary Hammel-Brown (Junior Kahoks) won by fall over Luis Penaloza (Villa-Lombard Cougars) Fall 2:18</li>\n<li>Cons. Round 2 - Dru Worker (Tinley Park Bulldogs) won by major decision over Austin Thurman (Crusaders` Elite) Maj 15-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Romeo Mcknight (Crystal Lake Wizards) won by fall over Jack Golnick (Golden Eagles) Fall 1:30</li>\n<li>Cons. Round 2 - Gregorio Aparicio (Vittum Cats) won by fall over De`Gyon Macklin (Rockford WC) Fall 2:10</li>\n<li>Cons. Round 2 - Nathan Crone (Edwardsville WC) won by fall over Joseph Landmeier (SCN Youth WC) Fall 4:02</li>\n<li>Cons. Round 2 - Brandon Elliott (Harlem Cougar WC) won by decision over Joseph McIntyre (Arlington Cardinals) Dec 6-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Bryce Gabel (Brawlers WC) won by fall over Larry Adams (East St. Louis Wrestling) Fall 0:58</li>\n<li>Cons. Round 2 - Wesley Kibler (SJO Youth WC) won by fall over Bradley Hensley (Rochelle WC) Fall 0:37</li>\n<li>Cons. Round 2 - Adam Shultz (WW Tigers WC) won by decision over Matthew Wylie (Granite City WC) Dec 9-4</li>\n<li>Cons. Round 2 - Reginald Ferguson (Yorkville WC) won in overtime over Jordan Shahrikian (Hononegah WC) OT 7-3</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Jeremy Daum (SCN Youth WC) won by decision over Grant Palmer (Arlington Cardinals) Dec 4-2</li>\n<li>Cons. Round 2 - Dylan Ervin (Martinez Fox Valley Elite) won by fall over Devin Moore (Blackhawk WC) Fall 3:24</li>\n<li>Cons. Round 2 - Alexander Hunter (Naperville WC) won by fall over Carlos Burgos (Rams WC) Fall 2:50</li>\n<li>Cons. Round 2 - Thomas Helton (Junior Dukes WC) won by fall over Reid Fleeger (Xtreme WC) Fall 4:02</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Karim Fuentes (Little Huskies WC) won by decision over Devon Sieveking (Benton Jr WC) Dec 14-8</li>\n<li>Cons. Round 2 - Julio Sifuentes (Martinez Fox Valley Elite) won by decision over Mitchell Taylor (Junior Spartans WC) Dec 8-4</li>\n<li>Cons. Round 2 - Matthew Bernal (Notre Dame WC) won by fall over Joshua House (Danville Chargers Wrestling) Fall 1:07</li>\n<li>Cons. Round 2 - Austin Ziriaxe (Belvidere Bandits) won by fall over Stephen Kreyenbuhl (Junior Dukes WC) Fall 0:32</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Brandon Reyes (Wrestling Wolverines) won by decision over Christian Beck (WW Tigers WC) Dec 6-5</li>\n<li>Cons. Round 2 - J. Antonio Vargas (Arlington Cardinals) won by decision over Martell Beasley (Harvey Twisters) Dec 2-0</li>\n<li>Cons. Round 2 - James Rowe (Junior Spartans WC) won by fall over James Davis (Rochelle WC) Fall 3:56</li>\n<li>Cons. Round 2 - Robert Burnside (Edwardsville WC) won by fall over Cyress Bergeron (Little Falcons WC) Fall 1:08</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - John Paul Stedwill (Central Elite Rebels) won by decision over Kevin Stearns (Tinley Park Bulldogs) Dec 7-0</li>\n<li>Cons. Round 2 - Benjamin Kirby (Oak Forest Warriors) won by decision over Colin Barker (Xtreme WC) Dec 6-4</li>\n<li>Cons. Round 2 - Marcus Povlick (Force WC) won by fall over Tyler Wood (Tigertown Tanglers) Fall 0:45</li>\n<li>Cons. Round 2 - Tyler Moon (King Select Wrestling) won by fall over Stephanie Sommers (Arlington Cardinals) Fall 4:28</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Joshua Gentry (Vittum Cats) won by major decision over Jacob Hayes (Crystal Lake Wizards) Maj 11-3</li>\n<li>Cons. Round 2 - Nicholas Norris (Chilli Dawgs WC) won by fall over Andrew Sobol (East Alton Wood River Jr. Oilers) Fall 4:05</li>\n<li>Cons. Round 2 - Brandon Ramos (Bolingbrook Junior Raiders) won by major decision over Cooper Secker (King Select Wrestling) Maj 15-2</li>\n<li>Cons. Round 2 - Ethan Reel (Central Elite Rebels) won by decision over Brady Wilsie (Xtreme WC) Dec 7-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Beau Harrier (Golden Eagles) won by decision over Kobe Watts (Midwest Central Youth WC) Dec 1-0</li>\n<li>Cons. Round 2 - Mitchell Stathakis (Barrington Broncos) won by decision over Demarius Terhune (Champaign WC) Dec 5-0</li>\n<li>Cons. Round 2 - Mohammed Taylor (Harvey Twisters) won by decision over Jacob Mitchell (Highland Bulldog Jr WC) Dec 5-2</li>\n<li>Cons. Round 2 - Nolan Baker (Xtreme WC) won by fall over Merik Fulton (Triad Little Knights) Fall 0:22</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Brandon Critchfield (King Select Wrestling) won by decision over Wylie Allen (Crystal Lake Wizards) Dec 5-1</li>\n<li>Cons. Round 2 - Brandon Hanik (Vittum Cats) won by fall over Seth Wisowaty (Hononegah WC) Fall 0:41</li>\n<li>Cons. Round 2 - Tanner Coleman (Peoria Heights Minutemen WC) won by fall over Adam Nixon (Gomez Wrestling Academy) Fall 3:28</li>\n<li>Cons. Round 2 - Sean Cullen (Wrestling Factory) won by fall over Nicolas Augustave (Junior Spartans WC) Fall 1:05</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Anthony Rubino (SCN Youth WC) won by fall over Matt Breitbarth (Junior Spartans WC) Fall 2:58</li>\n<li>Cons. Round 2 - Kyle Peisker (Gomez Wrestling Academy) won by decision over Jared Ellingwood (Martinez Fox Valley Elite) Dec 7-0</li>\n<li>Cons. Round 2 - Devin Michicich (Vittum Cats) won by tech fall over Nathan Dlugopolski (Lakeland Predators) TF 16-0</li>\n<li>Cons. Round 2 - Roberto Campos (Bolingbrook Junior Raiders) won by major decision over Christopher Dranka (Crystal Lake Wizards) Maj 14-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Rahman Johnson (Harvey Twisters) won by fall over Braxten Ary (Midwest Central Youth WC) Fall 4:09</li>\n<li>Cons. Round 2 - Andrew O`brien (Redhawk WC) won by decision over Joey Schloegel (Lincoln Way WC) Dec 2-0</li>\n<li>Cons. Round 2 - Andrew Verr (Villa Park Young Warriors) won by fall over Hunter Grau (Geneseo Spider WC) Fall 2:23</li>\n<li>Cons. Round 2 - Kyle Ruettiger (Lincoln Way WC) won by fall over Jake Fiorito (Crystal Lake Wizards) Fall 2:51</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Andrew Wenger (Dakota WC) won by decision over Jonathan Warner (Geneseo Spider WC) Dec 5-3</li>\n<li>Cons. Round 2 - Matt Rowland (Villa Park Young Warriors) won by major decision over Devin Donovan (Villa-Lombard Cougars) Maj 13-2</li>\n<li>Cons. Round 2 - Johnathon Doyle (Gomez Wrestling Academy) won by major decision over Patrick Larkin (Redhawk WC) Maj 16-5</li>\n<li>Cons. Round 2 - Devin Kane (Martinez Fox Valley Elite) won by fall over Jesse Ditzler (Sauk Valley WC) Fall 3:33</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Rudy Yates (Lions WC) won by tech fall over Carsten Brauns (Highland Bulldog Jr WC) TF 17-2</li>\n<li>Cons. Round 2 - Patrick Brucki (Orland Park Pioneers) won by decision over Jeremiah Recinos (Gomez Wrestling Academy) Dec 9-4</li>\n<li>Cons. Round 2 - Alex Rodriguez (Fox Lake WC) won by decision over Patrick Mcgowan (Tinley Park Bulldogs) Dec 6-1</li>\n<li>Cons. Round 2 - Dylan Elmore (Harlem Cougar WC) won by fall over Dino Gutierrez (Notre Dame WC) Fall 2:40</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Matt Kleinkopf (Gomez Wrestling Academy) won by fall over Amir Zegar (Tinley Park Bulldogs) Fall 0:25</li>\n<li>Cons. Round 2 - Ben Schneider (Little Huskies WC) won in overtime over Elijah Baltazar (SCN Youth WC) OT 2-1</li>\n<li>Cons. Round 2 - Johnny Mologousis (Lions WC) won in overtime over David Riojas (Force WC) OT 4-2</li>\n<li>Cons. Round 2 - Gregory Krulas (Dakota WC) won by fall over Nicholas Delporte (Arlington Cardinals) Fall 2:10</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Vaughn Hobart (Pontiac WC) won by decision over Nicholas Sundberg (Crystal Lake Wizards) Dec 4-2</li>\n<li>Cons. Round 2 - Thomas Brennan (Orland Park Pioneers) won by decision over Ethan Cain (Sauk Valley WC) Dec 7-1</li>\n<li>Cons. Round 2 - Matthew Wroblewski (Martinez Fox Valley Elite) won by fall over Steven Schmult (Force WC) Fall 4:16</li>\n<li>Cons. Round 2 - Dylan Mannes (Fox Lake WC) won by decision over Nicolas Delgado (Marengo Youth Wrestling) Dec 7-6</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Mason Delong (Brawlers WC) won by fall over Kobe Lear (Fox Lake WC) Fall 2:02</li>\n<li>Cons. Round 2 - Joseph Muscolino (Martinez Fox Valley Elite) won by fall over Thomas Welch (Crystal Lake Wizards) Fall 1:08</li>\n<li>Cons. Round 2 - Brendon Gambill (Little Falcons WC) won by fall over Cody Ralston (Junior Spartans WC) Fall 0:24</li>\n<li>Cons. Round 2 - Johnny Davidson (Barrington Broncos) won by major decision over Zachary Tomac (Force WC) Maj 10-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Isaiah Brown (Team No Ego WC) won by decision over Zachary Crosby (Golden Eagles) Dec 7-4</li>\n<li>Cons. Round 2 - Justin Scott (Geneseo Spider WC) won by fall over Michael Olsen (Elk Grove Junior Grens) Fall 1:17</li>\n<li>Cons. Round 2 - Brady Rude (Sauk Valley WC) won by major decision over Nathan Traxler (SCN Youth WC) Maj 13-0</li>\n<li>Cons. Round 2 - Nick Graziano (Oak Forest Warriors) won in overtime over Alex Montbriand (Villa-Lombard Cougars) OT 7-5</li>\n</ul>\n</section>",
  "Champ Semi`s & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semi`s &amp; Con Quarterfinal</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Trent Rakers (Highland Bulldog Jr WC) won by decision over Andrew Okayama (Force WC) Dec 9-2</li>\n<li>Semifinal - Cyress Ahart (Edwardsville WC) won by fall over Jacob Crisman (Pekin Boys &amp; Girls Club) Fall 3:57</li>\n<li>Cons. Round 3 - Nate Jimenez (SCN Youth WC) won by decision over Jonathan Ransom (Pontiac WC) Dec 3-1</li>\n<li>Cons. Round 3 - Anthony Cassioppi (Hononegah WC) won by decision over Will Meador (Carbondale WC) Dec 6-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Jacob Warner (Champaign WC) won by major decision over Jayleen Fitzpatrick (Gomez Wrestling Academy) Maj 10-1</li>\n<li>Semifinal - Zachary Blasioli (Bulls WC) won by major decision over Robert Goodwin (Bolingbrook Junior Raiders) Maj 8-0</li>\n<li>Cons. Round 3 - Cole Bateman (Orland Park Pioneers) won by fall over Desmond Nunez (Lil Reaper WC) Fall 4:07</li>\n<li>Cons. Round 3 - Mason Kroening (Waubonsie WC) won by fall over Cadin Koeppel (Cary Matmen) Fall 0:50</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Jaime Hernandez (Martinez Fox Valley Elite) won by decision over Keaton Titus (Cumberland Youth WC) Dec 7-1</li>\n<li>Semifinal - Riley Vanik (Martinez Fox Valley Elite) won by decision over Gavin Goddard (Champaign WC) Dec 4-2</li>\n<li>Cons. Round 3 - Tariq Thurman (Gladiators WC) won by fall over Matthew Bleeker (Pekin Boys &amp; Girls Club) Fall 2:42</li>\n<li>Cons. Round 3 - Devin O`Rourke (Oak Forest Warriors) won by major decision over Gavin Mast (Champions WC) Maj 8-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Ryan Doubek (Z`s Team Pena) won by decision over William Wagner (Mustang WC) Dec 1-0</li>\n<li>Semifinal - Caleb Adams (West Hancock WC) won by fall over Nikola Ivanisevic (Hinsdale WC) Fall 1:56</li>\n<li>Cons. Round 3 - Ivan Rodriguez (Fenton Bison WC) won by decision over Erick Cole (Moline WC) Dec 3-0</li>\n<li>Cons. Round 3 - Davion Talbert (Little Huskies WC) won by fall over Daniel McNally (Cross Town WC) Fall 3:50</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Thomas Rollette (Hononegah WC) won by fall over Anthony Marchetti (Hawk WC) Fall 1:15</li>\n<li>Semifinal - Emmanuel Terrell (Rams WC) won by decision over Blake Zalapi (Hononegah WC) Dec 9-6</li>\n<li>Cons. Round 3 - Brian Foley (Hinsdale WC) won by fall over Austin Sweet (Granite City WC) Fall 2:02</li>\n<li>Cons. Round 3 - Tommy Pickett (Champions WC) won by injury default over Noah Bates (Golden Eagles) Inj. 0:00</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Dominic Ferraro (Gomez Wrestling Academy) won by fall over Jeremiah Glenn (Little Huskies WC) Fall 1:03</li>\n<li>Semifinal - John Terry (Hononegah WC) won by fall over Blake McCarthy (Rocket Fuel WC) Fall 1:10</li>\n<li>Cons. Round 3 - Kevin Alvarez (Team No Ego WC) won in overtime over Shane Raber (Force WC) OT 7-5</li>\n<li>Cons. Round 3 - Kyle Connolly (Jacksonville Area Wrestling) won by fall over Terrance Taylor (MS Youth WC) Fall 1:17</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Aaron Zebrauskas (Southside Stallions) won by decision over Anthony Schickel (Martinez Fox Valley Elite) Dec 5-2</li>\n<li>Semifinal - Travis Ford-Melton (Harvey Twisters) won by decision over Kaleb Thompson (Martinez Fox Valley Elite) Dec 8-6</li>\n<li>Cons. Round 3 - Justin Cardani (MS Youth WC) won by decision over Lucas Schevikhoven (Lakeland Predators) Dec 3-0</li>\n<li>Cons. Round 3 - Austin Rudsinski (Force WC) won by tech fall over Noah Paul (Xtreme WC) TF 21-6</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Joey Melendez (Maine Eagles) won in double overtime over Nathan Callaway (Brawlers WC) 2-OT 2-1</li>\n<li>Semifinal - Anthony Turner (Lionheart Intense Wrestling) won by tech fall over Ben Emery (Little Celtic WC) TF 15-0</li>\n<li>Cons. Round 3 - Ethan Harsted (Seneca Irish Cadets) won by decision over Payton Pulliam (Pontiac WC) Dec 4-0</li>\n<li>Cons. Round 3 - Chase Bittle (Crusaders` Elite) won by decision over Eddie Bolivar (Gomez Wrestling Academy) Dec 7-4</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Michael Mcgee (Force WC) won by tech fall over Fidel Mayora (Izzy Style School of Wrestling) TF 17-2</li>\n<li>Semifinal - Dylan Burnoski (Bolingbrook Junior Raiders) won in overtime over Hassan Johnson (Harvey Twisters) OT 1-0</li>\n<li>Cons. Round 3 - Garrett Bass (King Select Wrestling) won by decision over Joshua Ogunsanya (Harvey Twisters) Dec 7-6</li>\n<li>Cons. Round 3 - Kameron Moss (King Select Wrestling) won by major decision over Joshua Fiegel (Crystal Lake Wizards) Maj 10-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Anthony Madrigal (Martinez Fox Valley Elite) won by fall over Jake Szlenk (Crystal Lake Wizards) Fall 3:57</li>\n<li>Semifinal - Juan Bazaldua (Martinez Fox Valley Elite) won by major decision over Giovanni Cassioppi (Hononegah WC) Maj 11-3</li>\n<li>Cons. Round 3 - Joseph Egan (Mustang WC) won by fall over Logan Johnson (King Select Wrestling) Fall 2:35</li>\n<li>Cons. Round 3 - Alek Ziegler (King Select Wrestling) won by decision over Brandon Muselman (Tinley Park Bulldogs) Dec 5-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Jason Renteria (Martinez Fox Valley Elite) won in overtime over Markus Hartman (Barrington Broncos) OT 3-2</li>\n<li>Semifinal - Peter Ogunsanya (Harvey Twisters) won by decision over Sean Mckenna (Martinez Fox Valley Elite) Dec 6-4</li>\n<li>Cons. Round 3 - Austin Macias (Z`s Team Pena) won by fall over Anthony Randazzo (Golden Eagles) Fall 3:39</li>\n<li>Cons. Round 3 - Will Lewan (Maine Eagles) won by decision over Joshua Stenger (Crystal Lake Wizards) Dec 5-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Yahya Thomas (Harvey Twisters) won by injury default over Peter Ferraro (SCN Youth WC) Inj. 0:00</li>\n<li>Semifinal - Bilal Bailey (Harvey Twisters) won by decision over Jaritt Shinhoster (Arlington Cardinals) Dec 4-2</li>\n<li>Cons. Round 3 - Dominick Ambrose (Orland Park Pioneers) won by injury default over Alex Zacharuk (Harlem Cougar WC) Inj. 0:00</li>\n<li>Cons. Round 3 - Jaleel Hollingsworth (Little Huskies WC) won by decision over Charles Faber (Izzy Style School of Wrestling) Dec 6-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Brad Gross (Sauk Valley WC) won in overtime over Cameron White (Harvey Twisters) OT 11-9</li>\n<li>Semifinal - Juwan Robinson (Bolingbrook Junior Raiders) won by decision over Zachary Villarreal (Downers Grove Cougars WC) Dec 5-4</li>\n<li>Cons. Round 3 - Cody Baldridge (Martinez Fox Valley Elite) won by major decision over Niko Derain (Martinez Fox Valley Elite) Maj 16-7</li>\n<li>Cons. Round 3 - Drake Davis (Illinois Valley Elite Wrestling) won by decision over Jakob Cysewski (Barrington Broncos) Dec 5-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Jake Polka (Little Celtic WC) won by decision over Julian Blanco (Epic Wrestling) Dec 6-5</li>\n<li>Semifinal - Emille Shannon (King Select Wrestling) won by decision over Isaac Jacquez (Martinez Fox Valley Elite) Dec 11-5</li>\n<li>Cons. Round 3 - Jake Meyer (Barrington Broncos) won by tech fall over Miklo Strader (Lionheart Intense Wrestling) TF 19-4</li>\n<li>Cons. Round 3 - Sebastian Valentin (Junior Spartans WC) won by major decision over Joshua Jones (Renegade WC (NFP)) Maj 8-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Blaize Punke (Central Elite Rebels) won by decision over Jesse Ellis (Cross Town WC) Dec 6-0</li>\n<li>Semifinal - Jacob Dudeck (Martinez Fox Valley Elite) won in overtime over Ethan Pardilla (Arlington Cardinals) OT 7-5</li>\n<li>Cons. Round 3 - Bobby Pryhocki (Lakeland Predators) won by decision over Cameron Caffey (Carbondale WC) Dec 12-6</li>\n<li>Cons. Round 3 - Ryan Gillooley (Lincoln Way WC) won by decision over Alex Harvey (Rochelle WC) Dec 3-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Kordell Norfleet (Harvey Twisters) won by fall over Datrelle Kozeluh (Cross Town WC) Fall 2:38</li>\n<li>Semifinal - Henry Graham (Lionheart Intense Wrestling) won by decision over Stephen Silva (Junior Spartans WC) Dec 12-8</li>\n<li>Cons. Round 3 - Frankie Indelli (Little Falcons WC) won by fall over Noah Jackson (Waukegan Youth WC) Fall 2:26</li>\n<li>Cons. Round 3 - Frank Carone (Crystal Lake Wizards) won by decision over Samuel Seneker (Plainfield WC) Dec 5-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Jack Jessen (Villa Park Young Warriors) won by fall over Brandon Rutherford (Mt Vernon Lions) Fall 1:29</li>\n<li>Semifinal - Dylan Conway (Junior Spartans WC) won by major decision over Joshua Torres (Team No Ego WC) Maj 14-1</li>\n<li>Cons. Round 3 - Jake Price (Little Celtic WC) won by fall over Jordan Gumila (Force WC) Fall 4:29</li>\n<li>Cons. Round 3 - Tyler Guerrero (Villa Park Young Warriors) won by fall over Joshua Carter (Harlem Cougar WC) Fall 3:42</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Riley DeMoss (SCN Youth WC) won by tech fall over Tanner Strobel (Arlington Cardinals) TF 16-1</li>\n<li>Semifinal - Carson Oughton (Indians Elite) won by decision over Jenner Hecox (Hecox Team Benaiah) Dec 6-2</li>\n<li>Cons. Round 3 - Kenneth Abitua (Xtreme WC) won by decision over Jarryd Cabusao (Golden Eagles) Dec 8-7</li>\n<li>Cons. Round 3 - Dru Worker (Tinley Park Bulldogs) won by fall over Zachary Hammel-Brown (Junior Kahoks) Fall 2:59</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Danny Saracco (Force WC) won by decision over Jared Smith (Lakeland Predators) Dec 4-1</li>\n<li>Semifinal - Al`lon Carter (Gladiators WC) won in overtime over Matt Brozovich (Indians Elite) OT 3-1</li>\n<li>Cons. Round 3 - Romeo Mcknight (Crystal Lake Wizards) won by tech fall over Gregorio Aparicio (Vittum Cats) TF 15-0</li>\n<li>Cons. Round 3 - Brandon Elliott (Harlem Cougar WC) won by fall over Nathan Crone (Edwardsville WC) Fall 3:33</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - George Bessette (Lakeland Predators) won by fall over John Embrey (Martinez Fox Valley Elite) Fall 0:41</li>\n<li>Semifinal - Allen Stallings (Gladiators WC) won by fall over Evan McTaggart (Glen Ellyn Dungeon WC) Fall 0:52</li>\n<li>Cons. Round 3 - Wesley Kibler (SJO Youth WC) won by decision over Bryce Gabel (Brawlers WC) Dec 6-4</li>\n<li>Cons. Round 3 - Reginald Ferguson (Yorkville WC) won in overtime over Adam Shultz (WW Tigers WC) OT 5-3</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Keiffer Johnston (Shelbyville Junior Wrestling Rams) won by decision over Joshua King (Power House WC) Dec 3-2</li>\n<li>Semifinal - Matt Allen (Hinsdale WC) won by decision over Tyler Caldwell (Yorkville WC) Dec 7-2</li>\n<li>Cons. Round 3 - Dylan Ervin (Martinez Fox Valley Elite) won by fall over Jeremy Daum (SCN Youth WC) Fall 4:19</li>\n<li>Cons. Round 3 - Thomas Helton (Junior Dukes WC) won by decision over Alexander Hunter (Naperville WC) Dec 5-4</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Lucas Warren (Blackhawk WC) won by fall over Andrew Wise (Aces Wrestling Club) Fall 0:57</li>\n<li>Semifinal - Octavius McCloud (Carbondale WC) won by major decision over Matt Sarhage (Triad Little Knights) Maj 14-0</li>\n<li>Cons. Round 3 - Karim Fuentes (Little Huskies WC) won by decision over Julio Sifuentes (Martinez Fox Valley Elite) Dec 4-1</li>\n<li>Cons. Round 3 - Matthew Bernal (Notre Dame WC) won by decision over Austin Ziriaxe (Belvidere Bandits) Dec 10-5</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Sam Deisher (Blackhawk WC) won by fall over Anthony Mckinney (Harlem Cougar WC) Fall 1:03</li>\n<li>Semifinal - Bryan Ditchman (Tinley Park Bulldogs) won by fall over Matthew Crandall (Hawk WC) Fall 0:18</li>\n<li>Cons. Round 3 - J. Antonio Vargas (Arlington Cardinals) won by decision over Brandon Reyes (Wrestling Wolverines) Dec 9-5</li>\n<li>Cons. Round 3 - Robert Burnside (Edwardsville WC) won by decision over James Rowe (Junior Spartans WC) Dec 3-2</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Kolbe O`Brien (SCN Youth WC) won by decision over Michael Tortorice (Wolves Wrestling Club Inc.) Dec 2-1</li>\n<li>Semifinal - Louie Hayes (Little Huskies WC) won by major decision over Kyle Szlenk (Crystal Lake Wizards) Maj 17-6</li>\n<li>Cons. Round 3 - John Paul Stedwill (Central Elite Rebels) won by fall over Benjamin Kirby (Oak Forest Warriors) Fall 2:02</li>\n<li>Cons. Round 3 - Marcus Povlick (Force WC) won by decision over Tyler Moon (King Select Wrestling) Dec 1-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Pat Walker (Gomez Wrestling Academy) won in overtime over Anthony Cheloni (SCN Youth WC) OT 4-2</li>\n<li>Semifinal - Hazen Rice (Maddog Wrestling Academy) won by fall over Hunter Vester (Yorkville WC) Fall 2:12</li>\n<li>Cons. Round 3 - Joshua Gentry (Vittum Cats) won by fall over Nicholas Norris (Chilli Dawgs WC) Fall 3:40</li>\n<li>Cons. Round 3 - Ethan Reel (Central Elite Rebels) won by decision over Brandon Ramos (Bolingbrook Junior Raiders) Dec 8-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Zachary Krause (Force WC) won by decision over Jake Dibenedetto (Vittum Cats) Dec 4-0</li>\n<li>Semifinal - Gavin Sutton (Gomez Wrestling Academy) won in overtime over Dack Punke (Central Elite Rebels) OT 6-4</li>\n<li>Cons. Round 3 - Mitchell Stathakis (Barrington Broncos) won by decision over Beau Harrier (Golden Eagles) Dec 10-3</li>\n<li>Cons. Round 3 - Nolan Baker (Xtreme WC) won by major decision over Mohammed Taylor (Harvey Twisters) Maj 15-4</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Austin Gomez (Gomez Wrestling Academy) won by major decision over Colin Glascott (Orland Park Pioneers) Maj 11-0</li>\n<li>Semifinal - Dylan Duncan (SCN Youth WC) won in overtime over Travis Piotrowski (Wolves Wrestling Club Inc.) OT 3-1</li>\n<li>Cons. Round 3 - Brandon Hanik (Vittum Cats) won by decision over Brandon Critchfield (King Select Wrestling) Dec 7-1</li>\n<li>Cons. Round 3 - Tanner Coleman (Peoria Heights Minutemen WC) won in overtime over Sean Cullen (Wrestling Factory) OT 5-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Austin O`Connor (Tinley Park Bulldogs) won by fall over Jarod Foiles (Roxana Kids WC) Fall 1:15</li>\n<li>Semifinal - Christian Robertson (Vittum Cats) won by decision over Dylan Thurston (Little Falcons WC) Dec 1-0</li>\n<li>Cons. Round 3 - Kyle Peisker (Gomez Wrestling Academy) won by decision over Anthony Rubino (SCN Youth WC) Dec 4-0</li>\n<li>Cons. Round 3 - Roberto Campos (Bolingbrook Junior Raiders) won by decision over Devin Michicich (Vittum Cats) Dec 6-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Aj Jaffe (SCN Youth WC) won by decision over Drake Boverie (Bulls WC) Dec 3-2</li>\n<li>Semifinal - Logan Gruszka (Team No Ego WC) won by decision over Jacob Silzer (Tinley Park Bulldogs) Dec 5-3</li>\n<li>Cons. Round 3 - Andrew O`brien (Redhawk WC) won by decision over Rahman Johnson (Harvey Twisters) Dec 6-3</li>\n<li>Cons. Round 3 - Kyle Ruettiger (Lincoln Way WC) won by decision over Andrew Verr (Villa Park Young Warriors) Dec 6-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Richard Townsell (Little Huskies WC) won by major decision over Guy Brown (Edwardsville WC) Maj 16-4</li>\n<li>Semifinal - Keegan Powers (Hononegah WC) won by fall over Shayne Oster (Junior Porters WC) Fall 2:16</li>\n<li>Cons. Round 3 - Matt Rowland (Villa Park Young Warriors) won by major decision over Andrew Wenger (Dakota WC) Maj 13-4</li>\n<li>Cons. Round 3 - Devin Kane (Martinez Fox Valley Elite) won by decision over Johnathon Doyle (Gomez Wrestling Academy) Dec 9-5</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Ryder Punke (Central Elite Rebels) won by decision over Michael Callahan (SCN Youth WC) Dec 3-0</li>\n<li>Semifinal - Nick Kokkines (Force WC) won by decision over Ameen Hamdan (Triumph `The Art of Wrestling`) Dec 9-6</li>\n<li>Cons. Round 3 - Rudy Yates (Lions WC) won by major decision over Patrick Brucki (Orland Park Pioneers) Maj 14-1</li>\n<li>Cons. Round 3 - Dylan Elmore (Harlem Cougar WC) won by decision over Alex Rodriguez (Fox Lake WC) Dec 8-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Cole Witzig (Triad Little Knights) won in overtime over Brian Krasowski (Orland Park Pioneers) OT 4-3</li>\n<li>Semifinal - Matthew Ferraro (SCN Youth WC) won by decision over Jake Lanning (Pontiac WC) Dec 6-4</li>\n<li>Cons. Round 3 - Ben Schneider (Little Huskies WC) won by fall over Matt Kleinkopf (Gomez Wrestling Academy) Fall 3:44</li>\n<li>Cons. Round 3 - Gregory Krulas (Dakota WC) won by decision over Johnny Mologousis (Lions WC) Dec 3-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Chris Prosser (Edwardsville WC) won by decision over Eric Schultz (Tinley Park Bulldogs) Dec 5-1</li>\n<li>Semifinal - Isaiah White (Harvey Twisters) won by fall over Tyler Eggemeyer (Panther Powerhouse WC) Fall 3:00</li>\n<li>Cons. Round 3 - Vaughn Hobart (Pontiac WC) won in overtime over Thomas Brennan (Orland Park Pioneers) OT 3-1</li>\n<li>Cons. Round 3 - Dylan Mannes (Fox Lake WC) won by fall over Matthew Wroblewski (Martinez Fox Valley Elite) Fall 2:36</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Randy Meneweather (Knox County Krushers) won by fall over Troy Ott (Maddog Wrestling Academy) Fall 2:07</li>\n<li>Semifinal - Fernie Silva (Crystal Lake Wizards) won in overtime over Trace Carello (Mt Vernon Lions) OT 3-1</li>\n<li>Cons. Round 3 - Mason Delong (Brawlers WC) won by major decision over Joseph Muscolino (Martinez Fox Valley Elite) Maj 8-0</li>\n<li>Cons. Round 3 - Johnny Davidson (Barrington Broncos) won by major decision over Brendon Gambill (Little Falcons WC) Maj 15-7</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Kamal Bey (Harvey Twisters) won by decision over James Watters (Edwardsville WC) Dec 11-5</li>\n<li>Semifinal - Kyle Betourne (Brawlers WC) won by fall over George Roskuszka (Little Falcons WC) Fall 2:06</li>\n<li>Cons. Round 3 - Isaiah Brown (Team No Ego WC) won by fall over Justin Scott (Geneseo Spider WC) Fall 4:01</li>\n<li>Cons. Round 3 - Brady Rude (Sauk Valley WC) won by fall over Nick Graziano (Oak Forest Warriors) Fall 1:16</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Nate Jimenez (SCN Youth WC) won by decision over Andrew Okayama (Force WC) Dec 5-3</li>\n<li>Cons. Semi - Anthony Cassioppi (Hononegah WC) won by fall over Jacob Crisman (Pekin Boys &amp; Girls Club) Fall 3:44</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Cole Bateman (Orland Park Pioneers) won by decision over Jayleen Fitzpatrick (Gomez Wrestling Academy) Dec 4-2</li>\n<li>Cons. Semi - Mason Kroening (Waubonsie WC) won by fall over Robert Goodwin (Bolingbrook Junior Raiders) Fall 0:50</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Keaton Titus (Cumberland Youth WC) won in overtime over Tariq Thurman (Gladiators WC) OT 6-4</li>\n<li>Cons. Semi - Gavin Goddard (Champaign WC) won by fall over Devin O`Rourke (Oak Forest Warriors) Fall 1:17</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - William Wagner (Mustang WC) won by decision over Ivan Rodriguez (Fenton Bison WC) Dec 6-2</li>\n<li>Cons. Semi - Nikola Ivanisevic (Hinsdale WC) won by decision over Davion Talbert (Little Huskies WC) Dec 9-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Brian Foley (Hinsdale WC) won by fall over Anthony Marchetti (Hawk WC) Fall 3:31</li>\n<li>Cons. Semi - Blake Zalapi (Hononegah WC) won by fall over Tommy Pickett (Champions WC) Fall 2:42</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Kevin Alvarez (Team No Ego WC) won in overtime over Jeremiah Glenn (Little Huskies WC) OT 5-3</li>\n<li>Cons. Semi - Blake McCarthy (Rocket Fuel WC) won by fall over Kyle Connolly (Jacksonville Area Wrestling) Fall 1:24</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Anthony Schickel (Martinez Fox Valley Elite) won by decision over Justin Cardani (MS Youth WC) Dec 3-2</li>\n<li>Cons. Semi - Austin Rudsinski (Force WC) won by decision over Kaleb Thompson (Martinez Fox Valley Elite) Dec 9-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Nathan Callaway (Brawlers WC) won by decision over Ethan Harsted (Seneca Irish Cadets) Dec 4-3</li>\n<li>Cons. Semi - Ben Emery (Little Celtic WC) won by decision over Chase Bittle (Crusaders` Elite) Dec 6-5</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Garrett Bass (King Select Wrestling) won by decision over Fidel Mayora (Izzy Style School of Wrestling) Dec 6-3</li>\n<li>Cons. Semi - Hassan Johnson (Harvey Twisters) won by decision over Kameron Moss (King Select Wrestling) Dec 4-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Jake Szlenk (Crystal Lake Wizards) won by decision over Joseph Egan (Mustang WC) Dec 4-2</li>\n<li>Cons. Semi - Alek Ziegler (King Select Wrestling) won by decision over Giovanni Cassioppi (Hononegah WC) Dec 3-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Markus Hartman (Barrington Broncos) won by major decision over Austin Macias (Z`s Team Pena) Maj 11-0</li>\n<li>Cons. Semi - Sean Mckenna (Martinez Fox Valley Elite) won by decision over Will Lewan (Maine Eagles) Dec 2-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Peter Ferraro (SCN Youth WC) won by fall over Dominick Ambrose (Orland Park Pioneers) Fall 2:19</li>\n<li>Cons. Semi - Jaritt Shinhoster (Arlington Cardinals) won by decision over Jaleel Hollingsworth (Little Huskies WC) Dec 8-5</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Cameron White (Harvey Twisters) won by decision over Cody Baldridge (Martinez Fox Valley Elite) Dec 11-4</li>\n<li>Cons. Semi - Zachary Villarreal (Downers Grove Cougars WC) won by decision over Drake Davis (Illinois Valley Elite Wrestling) Dec 9-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Julian Blanco (Epic Wrestling) won by decision over Jake Meyer (Barrington Broncos) Dec 6-4</li>\n<li>Cons. Semi - Sebastian Valentin (Junior Spartans WC) won in overtime over Isaac Jacquez (Martinez Fox Valley Elite) OT 1-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Jesse Ellis (Cross Town WC) won by decision over Bobby Pryhocki (Lakeland Predators) Dec 10-3</li>\n<li>Cons. Semi - Ethan Pardilla (Arlington Cardinals) won by fall over Ryan Gillooley (Lincoln Way WC) Fall 0:16</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Datrelle Kozeluh (Cross Town WC) won by fall over Frankie Indelli (Little Falcons WC) Fall 2:53</li>\n<li>Cons. Semi - Stephen Silva (Junior Spartans WC) won by fall over Frank Carone (Crystal Lake Wizards) Fall 1:28</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Brandon Rutherford (Mt Vernon Lions) won by decision over Jake Price (Little Celtic WC) Dec 6-1</li>\n<li>Cons. Semi - Tyler Guerrero (Villa Park Young Warriors) won by decision over Joshua Torres (Team No Ego WC) Dec 3-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Kenneth Abitua (Xtreme WC) won in overtime over Tanner Strobel (Arlington Cardinals) OT 5-3</li>\n<li>Cons. Semi - Jenner Hecox (Hecox Team Benaiah) won by decision over Dru Worker (Tinley Park Bulldogs) Dec 5-4</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Jared Smith (Lakeland Predators) won by decision over Romeo Mcknight (Crystal Lake Wizards) Dec 6-0</li>\n<li>Cons. Semi - Matt Brozovich (Indians Elite) won by decision over Brandon Elliott (Harlem Cougar WC) Dec 2-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - John Embrey (Martinez Fox Valley Elite) won by fall over Wesley Kibler (SJO Youth WC) Fall 2:38</li>\n<li>Cons. Semi - Evan McTaggart (Glen Ellyn Dungeon WC) won by fall over Reginald Ferguson (Yorkville WC) Fall 1:19</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Joshua King (Power House WC) won by decision over Dylan Ervin (Martinez Fox Valley Elite) Dec 13-6</li>\n<li>Cons. Semi - Tyler Caldwell (Yorkville WC) won by fall over Thomas Helton (Junior Dukes WC) Fall 2:49</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Andrew Wise (Aces Wrestling Club) won by decision over Karim Fuentes (Little Huskies WC) Dec 7-0</li>\n<li>Cons. Semi - Matthew Bernal (Notre Dame WC) won by decision over Matt Sarhage (Triad Little Knights) Dec 10-3</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - J. Antonio Vargas (Arlington Cardinals) won by fall over Anthony Mckinney (Harlem Cougar WC) Fall 1:18</li>\n<li>Cons. Semi - Matthew Crandall (Hawk WC) won by major decision over Robert Burnside (Edwardsville WC) Maj 14-0</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Michael Tortorice (Wolves Wrestling Club Inc.) won by decision over John Paul Stedwill (Central Elite Rebels) Dec 1-0</li>\n<li>Cons. Semi - Kyle Szlenk (Crystal Lake Wizards) won by major decision over Marcus Povlick (Force WC) Maj 9-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Anthony Cheloni (SCN Youth WC) won by fall over Joshua Gentry (Vittum Cats) Fall 1:26</li>\n<li>Cons. Semi - Ethan Reel (Central Elite Rebels) won by fall over Hunter Vester (Yorkville WC) Fall 3:41</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Mitchell Stathakis (Barrington Broncos) won by decision over Jake Dibenedetto (Vittum Cats) Dec 8-3</li>\n<li>Cons. Semi - Dack Punke (Central Elite Rebels) won by decision over Nolan Baker (Xtreme WC) Dec 8-6</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Brandon Hanik (Vittum Cats) won by fall over Colin Glascott (Orland Park Pioneers) Fall 1:10</li>\n<li>Cons. Semi - Travis Piotrowski (Wolves Wrestling Club Inc.) won by decision over Tanner Coleman (Peoria Heights Minutemen WC) Dec 10-4</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Jarod Foiles (Roxana Kids WC) won by decision over Kyle Peisker (Gomez Wrestling Academy) Dec 5-4</li>\n<li>Cons. Semi - Roberto Campos (Bolingbrook Junior Raiders) won by major decision over Dylan Thurston (Little Falcons WC) Maj 14-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Andrew O`brien (Redhawk WC) won by decision over Drake Boverie (Bulls WC) Dec 2-1</li>\n<li>Cons. Semi - Jacob Silzer (Tinley Park Bulldogs) won by decision over Kyle Ruettiger (Lincoln Way WC) Dec 4-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Matt Rowland (Villa Park Young Warriors) won by major decision over Guy Brown (Edwardsville WC) Maj 9-0</li>\n<li>Cons. Semi - Devin Kane (Martinez Fox Valley Elite) won by fall over Shayne Oster (Junior Porters WC) Fall 3:57</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Rudy Yates (Lions WC) won by major decision over Michael Callahan (SCN Youth WC) Maj 14-6</li>\n<li>Cons. Semi - Ameen Hamdan (Triumph `The Art of Wrestling`) won by fall over Dylan Elmore (Harlem Cougar WC) Fall 3:59</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Brian Krasowski (Orland Park Pioneers) won by decision over Ben Schneider (Little Huskies WC) Dec 1-0</li>\n<li>Cons. Semi - Gregory Krulas (Dakota WC) won in overtime over Jake Lanning (Pontiac WC) OT 2-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Vaughn Hobart (Pontiac WC) won by decision over Eric Schultz (Tinley Park Bulldogs) Dec 8-4</li>\n<li>Cons. Semi - Tyler Eggemeyer (Panther Powerhouse WC) won by fall over Dylan Mannes (Fox Lake WC) Fall 0:48</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Mason Delong (Brawlers WC) won by fall over Troy Ott (Maddog Wrestling Academy) Fall 0:29</li>\n<li>Cons. Semi - Trace Carello (Mt Vernon Lions) won by tech fall over Johnny Davidson (Barrington Broncos) TF 15-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - James Watters (Edwardsville WC) won by fall over Isaiah Brown (Team No Ego WC) Fall 1:09</li>\n<li>Cons. Semi - Brady Rude (Sauk Valley WC) won by fall over George Roskuszka (Little Falcons WC) Fall 1:49</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Anthony Cassioppi (Hononegah WC) won by decision over Nate Jimenez (SCN Youth WC) Dec 8-5</li>\n<li>5th Place Match - Andrew Okayama (Force WC) won by fall over Jacob Crisman (Pekin Boys &amp; Girls Club) Fall 1:27</li>\n<li>7th Place Match - Jonathan Ransom (Pontiac WC) won by decision over Will Meador (Carbondale WC) Dec 2-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Cole Bateman (Orland Park Pioneers) won by decision over Mason Kroening (Waubonsie WC) Dec 5-2</li>\n<li>5th Place Match - Robert Goodwin (Bolingbrook Junior Raiders) won by decision over Jayleen Fitzpatrick (Gomez Wrestling Academy) Dec 13-10</li>\n<li>7th Place Match - Desmond Nunez (Lil Reaper WC) won by fall over Cadin Koeppel (Cary Matmen) Fall 1:03</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Gavin Goddard (Champaign WC) won by decision over Keaton Titus (Cumberland Youth WC) Dec 8-2</li>\n<li>5th Place Match - Devin O`Rourke (Oak Forest Warriors) won by decision over Tariq Thurman (Gladiators WC) Dec 8-5</li>\n<li>7th Place Match - Gavin Mast (Champions WC) won by decision over Matthew Bleeker (Pekin Boys &amp; Girls Club) Dec 10-4</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Nikola Ivanisevic (Hinsdale WC) won by decision over William Wagner (Mustang WC) Dec 7-1</li>\n<li>5th Place Match - Davion Talbert (Little Huskies WC) won by fall over Ivan Rodriguez (Fenton Bison WC) Fall 3:46</li>\n<li>7th Place Match - Erick Cole (Moline WC) won by fall over Daniel McNally (Cross Town WC) Fall 4:12</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Blake Zalapi (Hononegah WC) won by decision over Brian Foley (Hinsdale WC) Dec 6-0</li>\n<li>5th Place Match - Anthony Marchetti (Hawk WC) won by fall over Tommy Pickett (Champions WC) Fall 1:07</li>\n<li>7th Place Match - Austin Sweet (Granite City WC) won by injury default over Noah Bates (Golden Eagles) Inj. 0:00</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Blake McCarthy (Rocket Fuel WC) won by fall over Kevin Alvarez (Team No Ego WC) Fall 2:43</li>\n<li>5th Place Match - Jeremiah Glenn (Little Huskies WC) won by decision over Kyle Connolly (Jacksonville Area Wrestling) Dec 4-3</li>\n<li>7th Place Match - Shane Raber (Force WC) won by fall over Terrance Taylor (MS Youth WC) Fall 1:17</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Austin Rudsinski (Force WC) won by decision over Anthony Schickel (Martinez Fox Valley Elite) Dec 4-2</li>\n<li>5th Place Match - Justin Cardani (MS Youth WC) won by decision over Kaleb Thompson (Martinez Fox Valley Elite) Dec 6-4</li>\n<li>7th Place Match - Noah Paul (Xtreme WC) won by decision over Lucas Schevikhoven (Lakeland Predators) Dec 6-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Ben Emery (Little Celtic WC) won by decision over Nathan Callaway (Brawlers WC) Dec 4-2</li>\n<li>5th Place Match - Chase Bittle (Crusaders` Elite) won by fall over Ethan Harsted (Seneca Irish Cadets) Fall 2:31</li>\n<li>7th Place Match - Eddie Bolivar (Gomez Wrestling Academy) won by major decision over Payton Pulliam (Pontiac WC) Maj 9-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Hassan Johnson (Harvey Twisters) won in overtime over Garrett Bass (King Select Wrestling) OT 4-3</li>\n<li>5th Place Match - Fidel Mayora (Izzy Style School of Wrestling) won by decision over Kameron Moss (King Select Wrestling) Dec 8-2</li>\n<li>7th Place Match - Joshua Ogunsanya (Harvey Twisters) won by decision over Joshua Fiegel (Crystal Lake Wizards) Dec 9-6</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Alek Ziegler (King Select Wrestling) won by decision over Jake Szlenk (Crystal Lake Wizards) Dec 2-0</li>\n<li>5th Place Match - Giovanni Cassioppi (Hononegah WC) won by decision over Joseph Egan (Mustang WC) Dec 3-0</li>\n<li>7th Place Match - Logan Johnson (King Select Wrestling) won by major decision over Brandon Muselman (Tinley Park Bulldogs) Maj 11-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Markus Hartman (Barrington Broncos) won in overtime over Sean Mckenna (Martinez Fox Valley Elite) OT 1-0</li>\n<li>5th Place Match - Will Lewan (Maine Eagles) won by decision over Austin Macias (Z`s Team Pena) Dec 9-8</li>\n<li>7th Place Match - Joshua Stenger (Crystal Lake Wizards) won by injury default over Anthony Randazzo (Golden Eagles) Inj. 0:00</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Peter Ferraro (SCN Youth WC) won by decision over Jaritt Shinhoster (Arlington Cardinals) Dec 6-2</li>\n<li>5th Place Match - Jaleel Hollingsworth (Little Huskies WC) won by decision over Dominick Ambrose (Orland Park Pioneers) Dec 9-4</li>\n<li>7th Place Match - Charles Faber (Izzy Style School of Wrestling) won by injury default over Alex Zacharuk (Harlem Cougar WC) Inj. 0:00</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Zachary Villarreal (Downers Grove Cougars WC) won by decision over Cameron White (Harvey Twisters) Dec 11-9</li>\n<li>5th Place Match - Cody Baldridge (Martinez Fox Valley Elite) won by decision over Drake Davis (Illinois Valley Elite Wrestling) Dec 2-1</li>\n<li>7th Place Match - Jakob Cysewski (Barrington Broncos) won by decision over Niko Derain (Martinez Fox Valley Elite) Dec 3-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Julian Blanco (Epic Wrestling) won by decision over Sebastian Valentin (Junior Spartans WC) Dec 3-2</li>\n<li>5th Place Match - Isaac Jacquez (Martinez Fox Valley Elite) won by decision over Jake Meyer (Barrington Broncos) Dec 7-1</li>\n<li>7th Place Match - Joshua Jones (Renegade WC (NFP)) won by decision over Miklo Strader (Lionheart Intense Wrestling) Dec 9-8</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Ethan Pardilla (Arlington Cardinals) won by decision over Jesse Ellis (Cross Town WC) Dec 11-5</li>\n<li>5th Place Match - Ryan Gillooley (Lincoln Way WC) won by fall over Bobby Pryhocki (Lakeland Predators) Fall 2:36</li>\n<li>7th Place Match - Alex Harvey (Rochelle WC) won by major decision over Cameron Caffey (Carbondale WC) Maj 10-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Datrelle Kozeluh (Cross Town WC) won by major decision over Stephen Silva (Junior Spartans WC) Maj 13-2</li>\n<li>5th Place Match - Frank Carone (Crystal Lake Wizards) won by fall over Frankie Indelli (Little Falcons WC) Fall 2:25</li>\n<li>7th Place Match - Samuel Seneker (Plainfield WC) won by decision over Noah Jackson (Waukegan Youth WC) Dec 9-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Brandon Rutherford (Mt Vernon Lions) won by decision over Tyler Guerrero (Villa Park Young Warriors) Dec 9-4</li>\n<li>5th Place Match - Jake Price (Little Celtic WC) won by major decision over Joshua Torres (Team No Ego WC) Maj 10-0</li>\n<li>7th Place Match - Jordan Gumila (Force WC) won by fall over Joshua Carter (Harlem Cougar WC) Fall 0:50</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Jenner Hecox (Hecox Team Benaiah) won by decision over Kenneth Abitua (Xtreme WC) Dec 3-0</li>\n<li>5th Place Match - Dru Worker (Tinley Park Bulldogs) won by decision over Tanner Strobel (Arlington Cardinals) Dec 8-1</li>\n<li>7th Place Match - Jarryd Cabusao (Golden Eagles) won by decision over Zachary Hammel-Brown (Junior Kahoks) Dec 9-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Jared Smith (Lakeland Predators) won by major decision over Matt Brozovich (Indians Elite) Maj 9-0</li>\n<li>5th Place Match - Brandon Elliott (Harlem Cougar WC) won in double overtime over Romeo Mcknight (Crystal Lake Wizards) 2-OT 3-2</li>\n<li>7th Place Match - Gregorio Aparicio (Vittum Cats) won by fall over Nathan Crone (Edwardsville WC) Fall 2:20</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - John Embrey (Martinez Fox Valley Elite) won by fall over Evan McTaggart (Glen Ellyn Dungeon WC) Fall 2:24</li>\n<li>5th Place Match - Wesley Kibler (SJO Youth WC) won by fall over Reginald Ferguson (Yorkville WC) Fall 4:12</li>\n<li>7th Place Match - Adam Shultz (WW Tigers WC) won by decision over Bryce Gabel (Brawlers WC) Dec 2-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Joshua King (Power House WC) won by decision over Tyler Caldwell (Yorkville WC) Dec 5-3</li>\n<li>5th Place Match - Dylan Ervin (Martinez Fox Valley Elite) won by fall over Thomas Helton (Junior Dukes WC) Fall 2:16</li>\n<li>7th Place Match - Jeremy Daum (SCN Youth WC) won by fall over Alexander Hunter (Naperville WC) Fall 1:15</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Matthew Bernal (Notre Dame WC) won by major decision over Andrew Wise (Aces Wrestling Club) Maj 12-4</li>\n<li>5th Place Match - Matt Sarhage (Triad Little Knights) won by major decision over Karim Fuentes (Little Huskies WC) Maj 12-3</li>\n<li>7th Place Match - Austin Ziriaxe (Belvidere Bandits) won by decision over Julio Sifuentes (Martinez Fox Valley Elite) Dec 5-1</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Matthew Crandall (Hawk WC) won by decision over J. Antonio Vargas (Arlington Cardinals) Dec 4-2</li>\n<li>5th Place Match - Robert Burnside (Edwardsville WC) won by fall over Anthony Mckinney (Harlem Cougar WC) Fall 3:38</li>\n<li>7th Place Match - Brandon Reyes (Wrestling Wolverines) won by fall over James Rowe (Junior Spartans WC) Fall 0:36</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Kyle Szlenk (Crystal Lake Wizards) won by decision over Michael Tortorice (Wolves Wrestling Club Inc.) Dec 4-0</li>\n<li>5th Place Match - Marcus Povlick (Force WC) won by fall over John Paul Stedwill (Central Elite Rebels) Fall 0:40</li>\n<li>7th Place Match - Tyler Moon (King Select Wrestling) won by fall over Benjamin Kirby (Oak Forest Warriors) Fall 4:17</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Anthony Cheloni (SCN Youth WC) won by major decision over Ethan Reel (Central Elite Rebels) Maj 10-0</li>\n<li>5th Place Match - Hunter Vester (Yorkville WC) won by decision over Joshua Gentry (Vittum Cats) Dec 8-4</li>\n<li>7th Place Match - Nicholas Norris (Chilli Dawgs WC) won by decision over Brandon Ramos (Bolingbrook Junior Raiders) Dec 7-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Dack Punke (Central Elite Rebels) won by decision over Mitchell Stathakis (Barrington Broncos) Dec 3-0</li>\n<li>5th Place Match - Nolan Baker (Xtreme WC) won by major decision over Jake Dibenedetto (Vittum Cats) Maj 10-0</li>\n<li>7th Place Match - Mohammed Taylor (Harvey Twisters) won by decision over Beau Harrier (Golden Eagles) Dec 8-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Travis Piotrowski (Wolves Wrestling Club Inc.) won by decision over Brandon Hanik (Vittum Cats) Dec 1-0</li>\n<li>5th Place Match - Colin Glascott (Orland Park Pioneers) won in overtime over Tanner Coleman (Peoria Heights Minutemen WC) OT 7-2</li>\n<li>7th Place Match - Brandon Critchfield (King Select Wrestling) won by decision over Sean Cullen (Wrestling Factory) Dec 2-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Roberto Campos (Bolingbrook Junior Raiders) won by major decision over Jarod Foiles (Roxana Kids WC) Maj 13-1</li>\n<li>5th Place Match - Kyle Peisker (Gomez Wrestling Academy) won by decision over Dylan Thurston (Little Falcons WC) Dec 6-3</li>\n<li>7th Place Match - Anthony Rubino (SCN Youth WC) won by decision over Devin Michicich (Vittum Cats) Dec 2-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Andrew O`brien (Redhawk WC) won in overtime over Jacob Silzer (Tinley Park Bulldogs) OT 3-1</li>\n<li>5th Place Match - Kyle Ruettiger (Lincoln Way WC) won by decision over Drake Boverie (Bulls WC) Dec 9-2</li>\n<li>7th Place Match - Andrew Verr (Villa Park Young Warriors) won by decision over Rahman Johnson (Harvey Twisters) Dec 6-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Matt Rowland (Villa Park Young Warriors) won by decision over Devin Kane (Martinez Fox Valley Elite) Dec 2-0</li>\n<li>5th Place Match - Guy Brown (Edwardsville WC) won by major decision over Shayne Oster (Junior Porters WC) Maj 13-3</li>\n<li>7th Place Match - Johnathon Doyle (Gomez Wrestling Academy) won by major decision over Andrew Wenger (Dakota WC) Maj 13-4</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Rudy Yates (Lions WC) won by decision over Ameen Hamdan (Triumph `The Art of Wrestling`) Dec 5-2</li>\n<li>5th Place Match - Michael Callahan (SCN Youth WC) won by decision over Dylan Elmore (Harlem Cougar WC) Dec 3-2</li>\n<li>7th Place Match - Alex Rodriguez (Fox Lake WC) won by decision over Patrick Brucki (Orland Park Pioneers) Dec 7-6</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Brian Krasowski (Orland Park Pioneers) won by decision over Gregory Krulas (Dakota WC) Dec 1-0</li>\n<li>5th Place Match - Jake Lanning (Pontiac WC) won by decision over Ben Schneider (Little Huskies WC) Dec 2-0</li>\n<li>7th Place Match - Johnny Mologousis (Lions WC) won by fall over Matt Kleinkopf (Gomez Wrestling Academy) Fall 4:22</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Vaughn Hobart (Pontiac WC) won by major decision over Tyler Eggemeyer (Panther Powerhouse WC) Maj 9-0</li>\n<li>5th Place Match - Eric Schultz (Tinley Park Bulldogs) won by decision over Dylan Mannes (Fox Lake WC) Dec 4-1</li>\n<li>7th Place Match - Thomas Brennan (Orland Park Pioneers) won by decision over Matthew Wroblewski (Martinez Fox Valley Elite) Dec 3-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Trace Carello (Mt Vernon Lions) won by decision over Mason Delong (Brawlers WC) Dec 4-2</li>\n<li>5th Place Match - Johnny Davidson (Barrington Broncos) won by fall over Troy Ott (Maddog Wrestling Academy) Fall 2:11</li>\n<li>7th Place Match - Brendon Gambill (Little Falcons WC) won by injury default over Joseph Muscolino (Martinez Fox Valley Elite) Inj. 0:00</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Brady Rude (Sauk Valley WC) won by fall over James Watters (Edwardsville WC) Fall 1:55</li>\n<li>5th Place Match - George Roskuszka (Little Falcons WC) won by decision over Isaiah Brown (Team No Ego WC) Dec 8-6</li>\n<li>7th Place Match - Justin Scott (Geneseo Spider WC) won by decision over Nick Graziano (Oak Forest Warriors) Dec 11-6</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Cyress Ahart (Edwardsville WC) won by decision over Trent Rakers (Highland Bulldog Jr WC) Dec 3-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Jacob Warner (Champaign WC) won by decision over Zachary Blasioli (Bulls WC) Dec 8-6</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Jaime Hernandez (Martinez Fox Valley Elite) won by decision over Riley Vanik (Martinez Fox Valley Elite) Dec 5-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Ryan Doubek (Z`s Team Pena) won by decision over Caleb Adams (West Hancock WC) Dec 6-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Emmanuel Terrell (Rams WC) won by fall over Thomas Rollette (Hononegah WC) Fall 4:26</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Dominic Ferraro (Gomez Wrestling Academy) won by decision over John Terry (Hononegah WC) Dec 5-2</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Travis Ford-Melton (Harvey Twisters) won by major decision over Aaron Zebrauskas (Southside Stallions) Maj 11-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Anthony Turner (Lionheart Intense Wrestling) won in overtime over Joey Melendez (Maine Eagles) OT 7-5</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Michael Mcgee (Force WC) won by major decision over Dylan Burnoski (Bolingbrook Junior Raiders) Maj 12-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Anthony Madrigal (Martinez Fox Valley Elite) won in overtime over Juan Bazaldua (Martinez Fox Valley Elite) OT 2-1</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Jason Renteria (Martinez Fox Valley Elite) won by decision over Peter Ogunsanya (Harvey Twisters) Dec 4-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Yahya Thomas (Harvey Twisters) won by decision over Bilal Bailey (Harvey Twisters) Dec 3-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Juwan Robinson (Bolingbrook Junior Raiders) won by major decision over Brad Gross (Sauk Valley WC) Maj 9-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Emille Shannon (King Select Wrestling) won by fall over Jake Polka (Little Celtic WC) Fall 2:40</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Blaize Punke (Central Elite Rebels) won by decision over Jacob Dudeck (Martinez Fox Valley Elite) Dec 5-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Kordell Norfleet (Harvey Twisters) won by major decision over Henry Graham (Lionheart Intense Wrestling) Maj 15-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Jack Jessen (Villa Park Young Warriors) won by major decision over Dylan Conway (Junior Spartans WC) Maj 11-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Carson Oughton (Indians Elite) won by decision over Riley DeMoss (SCN Youth WC) Dec 7-6</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Danny Saracco (Force WC) won by fall over Al`lon Carter (Gladiators WC) Fall 3:33</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Allen Stallings (Gladiators WC) won by fall over George Bessette (Lakeland Predators) Fall 4:10</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Matt Allen (Hinsdale WC) won by decision over Keiffer Johnston (Shelbyville Junior Wrestling Rams) Dec 3-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Lucas Warren (Blackhawk WC) won by tech fall over Octavius McCloud (Carbondale WC) TF 16-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Bryan Ditchman (Tinley Park Bulldogs) won by fall over Sam Deisher (Blackhawk WC) Fall 0:41</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Louie Hayes (Little Huskies WC) won by tech fall over Kolbe O`Brien (SCN Youth WC) TF 23-7</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Pat Walker (Gomez Wrestling Academy) won in double overtime over Hazen Rice (Maddog Wrestling Academy) 2-OT 8-7</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Gavin Sutton (Gomez Wrestling Academy) won by decision over Zachary Krause (Force WC) Dec 2-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Dylan Duncan (SCN Youth WC) won by decision over Austin Gomez (Gomez Wrestling Academy) Dec 5-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Austin O`Connor (Tinley Park Bulldogs) won by major decision over Christian Robertson (Vittum Cats) Maj 12-4</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Aj Jaffe (SCN Youth WC) won by decision over Logan Gruszka (Team No Ego WC) Dec 3-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Keegan Powers (Hononegah WC) won by decision over Richard Townsell (Little Huskies WC) Dec 6-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Ryder Punke (Central Elite Rebels) won by fall over Nick Kokkines (Force WC) Fall 1:28</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Matthew Ferraro (SCN Youth WC) won by decision over Cole Witzig (Triad Little Knights) Dec 5-4</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Isaiah White (Harvey Twisters) won by fall over Chris Prosser (Edwardsville WC) Fall 1:03</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Fernie Silva (Crystal Lake Wizards) won by fall over Randy Meneweather (Knox County Krushers) Fall 2:07</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Kyle Betourne (Brawlers WC) won by major decision over Kamal Bey (Harvey Twisters) Maj 15-4</li>\n</ul>\n</section>"
}
