{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>Champ. Round 1 - Destin Lathon (Williamsville WC) won by fall over Finnegan Larkin (Lockport Junior Porters WC) Fall 2:56</li>\n<li>Champ. Round 1 - Brooks Tyler (Evanston School of Wrestling) won by fall over Logan Van Vlymen (Macomb Little Bombers Wrestling) Fall 0:52</li>\n<li>Champ. Round 1 - Nathaniel Olivares (Notre Dame WC) won by decision over Timotheus Conner (Demolition WC) Dec 6-2</li>\n<li>Champ. Round 1 - Camryn Sarver (Rantoul Youth Wrestling) won by decision over Marcus Robinson (Peoria Razorbacks WC) Dec 6-5</li>\n<li>Champ. Round 1 - Logan Boley (Marengo Youth WC) won by major decision over Harrison Sneathen (Beat the Streets Chicago-Oak Park) Maj 12-0</li>\n<li>Champ. Round 1 - Rex Chavez-Jimenez (Downers Grove WC) won by decision over Cohen Albatt (Triad Knights WC) Dec 6-4</li>\n<li>Champ. Round 1 - Nathan Vogler (Oak Forest Warriors WC) won by fall over Asher VanDerMolen (St. Charles WC) Fall 3:45</li>\n<li>Champ. Round 1 - Daniel Jackson (Southern Illinois Bulldogs WC) won by fall over Chance VenHuizen (Stockton Renegades WC) Fall 1:12</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>Champ. Round 1 - Angelo Ngoho (Champaign WC) won by major decision over Garrett Ziller (Lockport Junior Porters WC) Maj 12-4</li>\n<li>Champ. Round 1 - Braylon Cunningham (Edwardsville WC) won by fall over Krystian Przychocki (Hinsdale Red Devil WC) Fall 2:28</li>\n<li>Champ. Round 1 - Gentry Michels (Olney Cubs WC) won by fall over Liam Carter (SJO Youth WC) Fall 4:08</li>\n<li>Champ. Round 1 - Cash Wetenkamp (Lincoln-Way WC) won by fall over Carter Paduch (Scorpion WC) Fall 0:37</li>\n<li>Champ. Round 1 - Musa Amin (Evanston School of Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Patrick Martin (Crystal Lake Wizards WC) won by fall over Charles Shelton (Mustang WC) Fall 0:38</li>\n<li>Champ. Round 1 - Mason Henderson (Stockton Renegades WC) won by fall over Jacksyn Windham (Hawk WC) Fall 2:10</li>\n<li>Champ. Round 1 - Travis Hinton Jr (Toss Em Up Wrestling Academy) won by fall over Tommy Beverly (Panther WC) Fall 0:14</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Owen Kommer (Gladiator Elite WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Anthony Salcedo (Harvard WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Donovan Olmstead (Southern Illinois Bulldogs WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Abdulrahman Abukhdeir (Badger WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Nathan German (Toss Em Up Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Waleed Fuqaha (Badger WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Champ. Round 1 - Caleb Pate (SCN Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jason Beyer (Blackhawk WC) won by fall over Matthew Porter (Murphysboro Wrestling) Fall 1:18</li>\n<li>Champ. Round 1 - Vincent Cumbo (Vittum Cats WC) won by major decision over Liko Garrett (Gladiator Elite WC) Maj 9-0</li>\n<li>Champ. Round 1 - Jake Dulumback (Effingham Youth WC) won by major decision over Jordan Reitz (Little Falcons WC) Maj 18-7</li>\n<li>Champ. Round 1 - Brayden Graves (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Camden Chapman (Gladiator Elite WC) won by tech fall over Caleb Bell (Frankfort Wildcats Wrestling) TF 19-2</li>\n<li>Champ. Round 1 - Julian Godina (Lincoln-Way WC) won by decision over Abigail Godard (Edwardsville WC) Dec 6-4</li>\n<li>Champ. Round 1 - Tenli Madriles (Crystal Lake Wizards WC) won by fall over Tanner Ekstrom (Rock Island WC) Fall 0:59</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Champ. Round 1 - Braylyn Shirley (Sauk Valley WC) won by fall over Karsen Jorgensen (Argenta-Oreana Kids WC) Fall 2:22</li>\n<li>Champ. Round 1 - Rocco Maheras (Vittum Cats WC) won by major decision over Marshall Rajcevich (Crystal Lake Wizards WC) Maj 9-0</li>\n<li>Champ. Round 1 - Giovonni Nix (Englewood Live Wire WC) won by fall over Makai Steele (Olney Cubs WC) Fall 2:21</li>\n<li>Champ. Round 1 - Brody Wenninger (Champbuilders Wrestling) won by major decision over KyLynn Larkin (ISI WC) Maj 20-6</li>\n<li>Champ. Round 1 - Mason Beattie (Fox Lake WC) won by fall over Ronald Houk (Frankfort Wildcats Wrestling) Fall 2:36</li>\n<li>Champ. Round 1 - Dayton Patterson (Vandalia Jr WC) won by fall over Elijah Perez (Greg Gomez Trained Wrestling) Fall 0:31</li>\n<li>Champ. Round 1 - Jaxon Fraedrich (Team El1te Wrestling) won by major decision over Dominic Macellaio (Little Falcons WC) Maj 8-0</li>\n<li>Champ. Round 1 - Eli Schaefer (Southern Illinois Bulldogs WC) won by fall over Tyler Vail (Lincoln-Way WC) Fall 0:37</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Champ. Round 1 - Armin O`Guin (Southern Illinois Bulldogs WC) won by fall over Quinn Peight (The Law WC) Fall 2:54</li>\n<li>Champ. Round 1 - Bentley Morse (Storm Youth WC) won by decision over Gage Enos (Batavia WC) Dec 9-2</li>\n<li>Champ. Round 1 - Colt Rosentreter (Carlinville WC) won by fall over Isaiah Reynolds (SJO Youth WC) Fall 0:45</li>\n<li>Champ. Round 1 - Travis Wilgosiewicz (ISI WC) won by fall over Maximus Aye (St. Charles WC) Fall 4:28</li>\n<li>Champ. Round 1 - William Bousk (Arlington Cardinals WC) won by tech fall over Benjamin Knapp (Vittum Cats WC) TF 15-0</li>\n<li>Champ. Round 1 - Maddux Kennedy (Blue Line Training Academy) won by major decision over Lorenzo Gonzalez (Force Elite WC) Maj 9-1</li>\n<li>Champ. Round 1 - Carter Noonan (Ottawa Wolfpack WC) won by fall over Nikolas Oyervides (Oak Forest Warriors WC) Fall 3:50</li>\n<li>Champ. Round 1 - Thomas Blanke (Barrington Broncos WC) won by fall over Caleb Callaghan (Lincoln-Way WC) Fall 2:47</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Braxton McCall (O`Fallon Little Panthers WC) won by tech fall over Gavin Somers (Unity Youth WC) TF 19-2</li>\n<li>Champ. Round 1 - Dominic Melody (Mat Rat WC) won by decision over Clark Goodwin (Lincoln-Way WC) Dec 5-2</li>\n<li>Champ. Round 1 - Rylan Glauser (Fox Lake WC) won by major decision over Titus Harkleroad (Storm Youth WC) Maj 9-1</li>\n<li>Champ. Round 1 - Luke Drexel (Frankfort Wildcats Wrestling) won by decision over Evan Gill (Edwardsville WC) Dec 6-4</li>\n<li>Champ. Round 1 - David Wesierski (ISI WC) won by decision over Devin DiSilvestro (Greg Gomez Trained Wrestling) Dec 6-1</li>\n<li>Champ. Round 1 - Liam Kissane (Tinley Park Bulldogs WC) won by major decision over Zachary Wilson (Moline WC) Maj 10-0</li>\n<li>Champ. Round 1 - Santino Scardina (Lions WC) won by decision over Salvatore Sheridan (SCN Youth WC) Dec 7-3</li>\n<li>Champ. Round 1 - Cale Dauber (Ottawa Wolfpack WC) won by decision over Kayden Cover (Hawk WC) Dec 8-1</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Champ. Round 1 - Gabriel Thornquist (East Peoria River Bandits Wrestling) won by decision over Brady Lowe (SOT-C) Dec 6-5</li>\n<li>Champ. Round 1 - Charlie Strezo (Lincoln-Way WC) won by decision over Liam Schroeder (Sycamore WC) Dec 6-0</li>\n<li>Champ. Round 1 - Nolan Glynn (Lincoln-Way WC) won by decision over Aiden Sinetos (nWo WC) Dec 6-4</li>\n<li>Champ. Round 1 - Jack Benesh (Hawk WC) won by fall over Cress Maddox (Williamsville WC) Fall 0:54</li>\n<li>Champ. Round 1 - Riley Smith (Carlinville WC) won by decision over Jadiel Castillo (Mat Rat WC) Dec 6-0</li>\n<li>Champ. Round 1 - Adonis Washington (Harvey Twisters WC) won by major decision over Charlie Datz (Batavia WC) Maj 10-0</li>\n<li>Champ. Round 1 - Brayden Johnson (SCN Youth WC) won by decision over Griffin Diehl (Murphysboro Wrestling) Dec 4-2</li>\n<li>Champ. Round 1 - Owen Thomas (Toss Em Up Wrestling Academy) won by decision over Aaron Griffin Jr (Harvey Twisters WC) Dec 6-3</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Champ. Round 1 - Everett Garretson (Yorkville WC) won by decision over Peyton Nowicki (Champaign WC) Dec 3-2</li>\n<li>Champ. Round 1 - Obadiah Willis (Beat the Streets Chicago-Midway) won by tech fall over Marcus Smith (Fox Valley WC) TF 18-3</li>\n<li>Champ. Round 1 - Jase Edrington (Storm Youth WC) won by major decision over Chris Jones (Martinez Fox Valley Elite WC) Maj 8-0</li>\n<li>Champ. Round 1 - Jeremy Powell Jr (Harvey Twisters WC) won by fall over Bennett Johnson (Moline WC) Fall 2:06</li>\n<li>Champ. Round 1 - Lucas Macdonald (ISI WC) won by decision over Rudolph Mihelich (Callan Wrestling Academy) Dec 5-2</li>\n<li>Champ. Round 1 - Vannak Khiev (Mat Rat WC) won by major decision over Parker Gestes (Edwardsville WC) Maj 11-3</li>\n<li>Champ. Round 1 - Brogan Sendele (Hononegah WC) won by major decision over Cole Pilliard (Triad Knights WC) Maj 10-1</li>\n<li>Champ. Round 1 - Kiernan Delaney (Toss Em Up Wrestling Academy) won by tech fall over Mickey Olszta (Lincoln-Way WC) TF 15-0</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Champ. Round 1 - Nolan Chrisse (Bolingbrook Junior Raiders WC) won by fall over Trotter Titus (Mattoon Youth WC) Fall 4:15</li>\n<li>Champ. Round 1 - Jonathan Fields (Mustang WC) won by fall over Ashlie Penovich (Arlington Cardinals WC) Fall 0:36</li>\n<li>Champ. Round 1 - Hayden Smith (Unity Youth WC) won by decision over Matthew Blanke (Barrington Broncos WC) Dec 6-5</li>\n<li>Champ. Round 1 - Santiago Trejo (Southside Outlaws WC) won by decision over Lucas Forsythe (Lincoln-Way WC) Dec 5-3</li>\n<li>Champ. Round 1 - Jaxon Lynn (Lion`s Den Wrestling Academy) won by decision over Archer Biag (Naperville WC) Dec 8-4</li>\n<li>Champ. Round 1 - Landen Vincent (Blue Line Training Academy) won by fall over Nathan Frankowitch (Red Raiders Wrestling Team) Fall 3:57</li>\n<li>Champ. Round 1 - Maximus Pearch (nWo WC) won by major decision over Joseph Torrence (Greg Gomez Trained Wrestling) Maj 12-2</li>\n<li>Champ. Round 1 - Camden Spiniolas (Richmond WC) won by fall over Luca Filice (Mat Rat WC) Fall 1:11</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Champ. Round 1 - Colton Johnson (Falcon Youth WC) won by decision over Mitchell Aukes (Marengo Youth WC) Dec 2-1</li>\n<li>Champ. Round 1 - Nathan Raban (Southern Illinois Bulldogs WC) won by major decision over Joshua Edelheit (Junior Titans Wrestling) Maj 9-0</li>\n<li>Champ. Round 1 - Dominic Martinello (Fenton Jr. Bison WC) won by decision over Braden Opperman (Pontiac WC) Dec 8-3</li>\n<li>Champ. Round 1 - Dylan Curtis (Sycamore WC) won by fall over Gabriel Eldridge (Herrin Junior WC) Fall 2:55</li>\n<li>Champ. Round 1 - Gabriel Travis Jr (Will County Warriors WC) won by decision over Tavarius Briar (nWo WC) Dec 4-0</li>\n<li>Champ. Round 1 - Vincente Halverson (Tribe WC) won in sudden victory - 1 over Rain Scott (Springs Elite WC) SV-1 5-3</li>\n<li>Champ. Round 1 - Maddox Stonitsch (Lincoln-Way WC) won by decision over Charlotte Nold (Beat the Streets Chicago-Oak Park) Dec 5-0</li>\n<li>Champ. Round 1 - Jackson Wells (Batavia WC) won by fall over Rocky Delgado (Yorkville WC) Fall 1:59</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Jesse Swiney (Champaign WC) won by fall over Stella Piazza (St. Charles WC) Fall 0:53</li>\n<li>Champ. Round 1 - Andrew Ayala-Mendoza (Beat the Streets Chicago-Midway) won by decision over Braxton Glodo (Sparta Junior Bulldogs WC) Dec 5-0</li>\n<li>Champ. Round 1 - Nino Capuano (Beat the Streets Chicago-Hyde Park) won by decision over Connor Misner (Mt. Zion Kids WC) Dec 7-1</li>\n<li>Champ. Round 1 - Landon Weidler (Belleville Little Devils WC) won by tech fall over Lucas Zhao (Downers Grove WC) TF 15-0</li>\n<li>Champ. Round 1 - John Gough (MadDog Wrestling Academy) won by decision over Martin Hernandez (Belvidere Bandits WC) Dec 5-2</li>\n<li>Champ. Round 1 - Wyatt Mikkelsen (LaSalle Peru Crunching Cavs Youth WC) won by fall over Thayer Larson (Demolition WC) Fall 2:01</li>\n<li>Champ. Round 1 - Logan Woodbury (ISI WC) won by fall over Corbin Brown (Tiger Town Tanglers WC) Fall 3:53</li>\n<li>Champ. Round 1 - Max Mandac (Lincoln-Way WC) won by fall over Giovanni Soto (Fox Lake WC) Fall 1:57</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Champ. Round 1 - Andrew Vliek (Wheaton Tigers WC) won by fall over Frank Watson (Saber WC) Fall 3:51</li>\n<li>Champ. Round 1 - Dawson Hull (Blue Line Training Academy) won by fall over Owen Feltz (Demolition WC) Fall 2:20</li>\n<li>Champ. Round 1 - Connor Kern (Yorkville WC) won by decision over Myles Monis (Stampede WC) Dec 8-2</li>\n<li>Champ. Round 1 - Ryker Long (Demolition WC) won by fall over Ivy Grant (Urbana Tigers WC) Fall 3:51</li>\n<li>Champ. Round 1 - Gregory Harkey (Bulls WC) won by fall over Michael Rowe (Oak Forest Warriors WC) Fall 0:21</li>\n<li>Champ. Round 1 - Brooks Auker (Alber Athletics WC) won by fall over Lucas Youmara (Evanston School of Wrestling) Fall 3:44</li>\n<li>Champ. Round 1 - Titan Henderson (Gladiator Elite WC) won by fall over Noah Cerny (Red Raiders Wrestling Team) Fall 2:00</li>\n<li>Champ. Round 1 - Damir Duharkic (MadDog Wrestling Academy) won by fall over Joseph Vela (Vittum Cats WC) Fall 1:27</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Champ. Round 1 - Jayden Hermacinski (Peoria Razorbacks WC) won by decision over Brier Mcpeek (Stockton Renegades WC) Dec 15-8</li>\n<li>Champ. Round 1 - Dennis Hawthorne (Urbana Tigers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Keandre Towns (Champaign WC) won by fall over Emily Taylor (Belvidere Bandits WC) Fall 2:32</li>\n<li>Champ. Round 1 - Hudson Wesley (Bulls WC) won by fall over Brady Thompson (Eureka WC) Fall 1:22</li>\n<li>Champ. Round 1 - Lucas Maida (Stampede WC) won by decision over Ryan Costello (Mustang WC) Dec 6-1</li>\n<li>Champ. Round 1 - Dimetri Kean (Demolition WC) won by fall over Antonio Reyes (Beat the Streets Chicago-Avondale) Fall 2:58</li>\n<li>Champ. Round 1 - Luke Banas (Demolition WC) won by fall over Blake Vande Loo (Batavia WC) Fall 0:44</li>\n<li>Champ. Round 1 - Rico Silvestre (Harvey Twisters WC) won by fall over Pearce Estrada (Toss Em Up Wrestling Academy) Fall 4:23</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Champ. Round 1 - Naijier Morris (Urbana Tigers WC) won by fall over Piper Sandell (Stockton Renegades WC) Fall 2:21</li>\n<li>Champ. Round 1 - Harrison Yankellow (Beat the Streets Chicago-Avondale) won by decision over Juan Velez (Southside Outlaws WC) Dec 7-3</li>\n<li>Champ. Round 1 - Trent Watson (Englewood Live Wire WC) won by major decision over Owen Alderson (Williamsville WC) Maj 14-5</li>\n<li>Champ. Round 1 - Benjamin Morris (Rochelle WC) won by fall over George Arvanitis (Maine Eagles WC) Fall 2:33</li>\n<li>Champ. Round 1 - Jack Dykes (TJ Trained Wrestling) won in tie breaker - 1 over Jordan Myers (Murphysboro Wrestling) TB-1 3-2</li>\n<li>Champ. Round 1 - Reid Balis (Naperville WC) won by decision over Kellan Breen (Bolingbrook Junior Raiders WC) Dec 3-1</li>\n<li>Champ. Round 1 - Hazen Murray (St. Charles WC) won by fall over Oliver Hoke (Crawford County WC) Fall 2:41</li>\n<li>Champ. Round 1 - Levi Pretzsch (Dixon WC) won by fall over Anastasia Rodnikova (Force Elite WC) Fall 4:01</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Champ. Round 1 - Amillian Beasley (Urbana Tigers WC) won by fall over Jax Arocho (Orland Park Pioneers WC) Fall 1:20</li>\n<li>Champ. Round 1 - Isaiah Robinson (Beat the Streets Chicago-Bellwood) won by fall over Adam Carrick (Sycamore WC) Fall 0:46</li>\n<li>Champ. Round 1 - Daniel Costello (Mustang WC) won by fall over Eren Kurt (Champaign WC) Fall 0:28</li>\n<li>Champ. Round 1 - Wyatt Kinney (Hononegah WC) won by decision over Robert Greenberg (Force Elite WC) Dec 8-5</li>\n<li>Champ. Round 1 - Julian Moon (Effingham Youth WC) won by fall over Lucas Pretkelis (Tribe WC) Fall 3:00</li>\n<li>Champ. Round 1 - Michael Kimbrough (Blue Crew WC) won by decision over Martin Noth (Izzy Style Wrestling) Dec 4-2</li>\n<li>Champ. Round 1 - Maison Toliver (Peoria Heights Minutemen WC) won by decision over Anthony Senese (Vittum Cats WC) Dec 13-12</li>\n<li>Champ. Round 1 - Payton Chanerl (East St. Louis WC) won by fall over Devin Aviles (Fenton Jr. Bison WC) Fall 2:06</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Champ. Round 1 - Jack Hagerty (Edwardsville WC) won by fall over Wes Grilec (Oak Forest Warriors WC) Fall 0:21</li>\n<li>Champ. Round 1 - Matthew Carver (MadDog Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Diego Lopez (Evanston School of Wrestling) won by fall over Luke Zajicek (Elmhurst Titans Wrestling Academy) Fall 2:15</li>\n<li>Champ. Round 1 - Matthew Murray (Sauk Valley WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Maddox McRoberts (Sycamore WC) won by fall over Luke Vasquez (Lions WC) Fall 2:58</li>\n<li>Champ. Round 1 - Charles Jacquez (Trico WC) won by decision over Jacob Magana (Wheaton Tigers WC) Dec 8-3</li>\n<li>Champ. Round 1 - Kenneth Seggerson (Beat the Streets Chicago-Midway) won by fall over Greyson Hohimer (Fox Valley WC) Fall 1:48</li>\n<li>Champ. Round 1 - Ivan Torres (Collinsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Champ. Round 1 - Cayden Smith (Junior Cyclones WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Christian Paige (Oswego WC) won by fall over Matthew Lowe (Edwardsville WC) Fall 0:48</li>\n<li>Champ. Round 1 - Fares Ibraheem (Fox Valley WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Luke Nielsen (Lincoln-Way WC) won by fall over Christopher Fernandez (Aurora WC) Fall 3:13</li>\n<li>Champ. Round 1 - Romeo Hernandez (Toss Em Up Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Blaine Becker (Belvidere Bandits WC) won by major decision over Jovany Gaytan (Blackhawk WC) Maj 11-2</li>\n<li>Champ. Round 1 - Richard Butler (Crystal Lake Wizards WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Gregory Heavey (Wheaton Tigers WC) won by fall over Jack Monn (Fox Valley WC) Fall 0:56</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Remington Bryant (Charleston WC) won by fall over Mason Waller (Pekin Boys &amp; Girls Club) Fall 1:21</li>\n<li>Champ. Round 1 - Braylon Hill-Lomax (Edwardsville WC) won by fall over Jaiden Williams (Elevate Wrestling Academy) Fall 0:25</li>\n<li>Champ. Round 1 - Tommy Yannias (Glenbard East Jr Rams WC) won by fall over Harper Davis (Bulls WC) Fall 2:08</li>\n<li>Champ. Round 1 - Raymond Morales (Lion`s Den Wrestling Academy) won by fall over Rowdy Vick (Storm Youth WC) Fall 2:46</li>\n<li>Champ. Round 1 - Bradyn Haynes (Pekin Boys &amp; Girls Club) won by decision over John Turner (Sycamore WC) Dec 3-2</li>\n<li>Champ. Round 1 - Aiden Bishop (Fox Valley WC) won by fall over Sean Cook (Notre Dame WC) Fall 0:52</li>\n<li>Champ. Round 1 - Samuel Swais (MadDog Wrestling Academy) won by fall over Luke Petravicz (Hononegah WC) Fall 0:59</li>\n<li>Champ. Round 1 - Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) won by fall over Angel Alcala (Aurora WC) Fall 3:38</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Jayden Chavez (Blackhawk WC) won by fall over Joelten Griffin (Murphysboro Wrestling) Fall 1:23</li>\n<li>Champ. Round 1 - Trey Harris (Williamsville WC) won by fall over Saul Pulido III (Izzy Style Wrestling) Fall 2:20</li>\n<li>Champ. Round 1 - Hoyt Choate (Oswego WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jake Johnson (Naperville WC) won by fall over Jhuliyan Carter (Wolfpak WC) Fall 0:37</li>\n<li>Champ. Round 1 - Michael Fuller (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Caybren Hubbard (Murphysboro Wrestling) won by fall over Chase Paduch (Scorpion WC) Fall 4:17</li>\n<li>Champ. Round 1 - Jack Amann (Southern Illinois Bulldogs WC) won by fall over Jose Velazquez (Scorpion WC) Fall 0:26</li>\n<li>Champ. Round 1 - Josh Melsa (Naperville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Damon Glenn (Storm Youth WC) won by fall over Jaxen Mitchell (PSF Wrestling Academy) Fall 1:14</li>\n<li>Champ. Round 1 - Zander Johnson (Lion`s Den Wrestling Academy) won by decision over Liam O`Shea (Tinley Park Bulldogs WC) Dec 5-1</li>\n<li>Champ. Round 1 - Ignacio Figueroa (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Davin Torza (Bolingbrook Junior Raiders WC) won by fall over Owen Manning (Dinamo Wrestling) Fall 0:44</li>\n<li>Champ. Round 1 - Elijah Bell (Frankfort Wildcats Wrestling) won by decision over Luthor Rajcevich (Crystal Lake Wizards WC) Dec 4-2</li>\n<li>Champ. Round 1 - Ayden Winchell (Callan Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jack Munn (Lincoln-Way WC) won by decision over Jacob Simon (Oak Forest Warriors WC) Dec 6-1</li>\n<li>Champ. Round 1 - Beckem Carney (St. Charles WC) won by fall over Chase Cook (Sycamore WC) Fall 0:26</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Colton Madison (Edwardsville WC) won by decision over Silas Harkleroad (Storm Youth WC) Dec 3-2</li>\n<li>Champ. Round 1 - Nathan Butcher (St. Charles WC) won by fall over Connor Willis (Arlington Cardinals WC) Fall 2:07</li>\n<li>Champ. Round 1 - Santino Pignatelli (Mat Rat WC) won by major decision over Dalton DeLong (Dwight WC) Maj 9-0</li>\n<li>Champ. Round 1 - Hudson Anderton (Nomad Wrestling Academy) won by decision over Cooper Boron (Belleville Little Devils WC) Dec 4-2</li>\n<li>Champ. Round 1 - Joseph Calvillo (Batavia WC) won by major decision over Draven Harris (Champaign WC) Maj 9-0</li>\n<li>Champ. Round 1 - Benjamin Jurkovic (Tinley Park Bulldogs WC) won by fall over Brody Sanders (Unity Youth WC) Fall 0:50</li>\n<li>Champ. Round 1 - Rocco Valvano (Tribe WC) won by fall over Jayden Long (Highland Bulldog Jr. WC) Fall 1:55</li>\n<li>Champ. Round 1 - Christian Johnson (Blue Crew WC) won by fall over Gage Hughes (Charleston WC) Fall 0:27</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Christian Corcoran (Lincoln-Way WC) won by fall over David Hooper (West Frankfort Jr. Redbirds WC) Fall 0:25</li>\n<li>Champ. Round 1 - Jack Koenig (Team 312 WC) won by decision over Salah Dajani (Lincoln-Way WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jayce Glauser (Fox Lake WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Aiden Weber (Elevate Wrestling Academy) won by tech fall over Cole Dulumback (Effingham Youth WC) TF 16-0</li>\n<li>Champ. Round 1 - Preston Morrison (SCN Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Gerald Donnelly (Tinley Park Bulldogs WC) won by fall over Camryn Chapman (nWo WC) Fall 2:47</li>\n<li>Champ. Round 1 - Ray Long (Martinez Fox Valley Elite WC) won by fall over Jacob Sebek (Oak Forest Warriors WC) Fall 1:58</li>\n<li>Champ. Round 1 - Declan McReynolds (Blue Crew WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Champ. Round 1 - Aedan Dillow (Beat the Streets Chicago-Avondale) won by fall over Shaughn McAvoy (Pekin Boys &amp; Girls Club) Fall 1:20</li>\n<li>Champ. Round 1 - Daniel Myint (Arlington Cardinals WC) won by decision over Lukas Quartz (Southern Illinois Bulldogs WC) Dec 8-2</li>\n<li>Champ. Round 1 - Hank Burge (Edwardsville WC) won by major decision over Blair Grennan (Sauk Valley WC) Maj 8-0</li>\n<li>Champ. Round 1 - Nick Dilallo (Arlington Cardinals WC) won by fall over Drew Ritchie (Demolition WC) Fall 1:15</li>\n<li>Champ. Round 1 - Nolan O`Grady (Oswego WC) won by fall over Cardevion Gordon (Beat the Streets Chicago-Bellwood) Fall 0:36</li>\n<li>Champ. Round 1 - Leyton Bartley (Lincoln-Way WC) won by fall over Brody Johnson (Bulls WC) Fall 2:40</li>\n<li>Champ. Round 1 - Ryan Rowan (Sycamore WC) won by decision over Jakob Geestman (River Bend WC) Dec 11-5</li>\n<li>Champ. Round 1 - Jackson Marlett (St. Charles WC) won by major decision over Kyle Hayes (Contender Wrestling) Maj 10-0</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Champ. Round 1 - Pedro Alberto Rangel (Storm Youth WC) won by fall over Kaleb Joyner (Peoria Razorbacks WC) Fall 0:40</li>\n<li>Champ. Round 1 - Elijah Sawyers (Harvey Twisters WC) won by tech fall over Sean Serbinski (Naperville WC) TF 19-2</li>\n<li>Champ. Round 1 - Zayden Mansfield (Unity Youth WC) won by tech fall over William Howenstein (Fox Valley WC) TF 20-5</li>\n<li>Champ. Round 1 - Aidan Lopez (nWo WC) won by decision over Lucas Landry (Mustang WC) Dec 7-0</li>\n<li>Champ. Round 1 - Shane Stream (Lincoln-Way WC) won by fall over Brayden Crawford (Belvidere Bandits WC) Fall 0:34</li>\n<li>Champ. Round 1 - Dominic Pasquale (Izzy Style Wrestling) won by decision over Jackson Schadegg (Southern Illinois Bulldogs WC) Dec 4-2</li>\n<li>Champ. Round 1 - Kanton Richards (Murphysboro Wrestling) won by decision over Alex Vanmastrigt (Sycamore WC) Dec 10-4</li>\n<li>Champ. Round 1 - Rielen Hermsen (Toss Em Up Wrestling Academy) won by decision over Jt Theis (Frankfort Wildcats Wrestling) Dec 4-2</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Champ. Round 1 - Max Moreno (Ottawa Wolfpack WC) won by fall over Gabriel Hernandez (Fenton Jr. Bison WC) Fall 2:31</li>\n<li>Champ. Round 1 - Jayden Hernandez (St. Charles WC) won by fall over Heath Ewins (El Paso Gridley Youth WC) Fall 4:13</li>\n<li>Champ. Round 1 - Kristian DeClercq (ISI WC) won by fall over Giuseppe Lomeli (Team El1te Wrestling) Fall 2:48</li>\n<li>Champ. Round 1 - Jadyn Pearson (Fox Valley WC) won by decision over Dakoda Hentz (Fighting Farmers WC) Dec 10-4</li>\n<li>Champ. Round 1 - Jarryion Agnew (Murphysboro Wrestling) won by decision over Eric Hoselton (Lincoln-Way WC) Dec 9-5</li>\n<li>Champ. Round 1 - Charlie Connors (Alber Athletics WC) won by decision over Kannon Judycki (Southside Outlaws WC) Dec 4-2</li>\n<li>Champ. Round 1 - Nicholas Marchese (Crystal Lake Wizards WC) won by fall over Paxton Pyatt (Murphysboro Wrestling) Fall 2:03</li>\n<li>Champ. Round 1 - Colin Phelan (Bolingbrook Junior Raiders WC) won by decision over Anthony Brown (Beat the Streets Chicago-Bellwood) Dec 4-0</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Lachenberg (Lincoln-Way WC) won by fall over Nolan Lowe (SOT-C) Fall 1:05</li>\n<li>Champ. Round 1 - Robert Williams (Harvey Twisters WC) won by fall over Nathaniel Carroll (Team El1te Wrestling) Fall 1:21</li>\n<li>Champ. Round 1 - Logan Aaron (Cumberland Youth WC) won by decision over Michael Goolish (MadDog Wrestling Academy) Dec 12-8</li>\n<li>Champ. Round 1 - Anthony Farina (Elevate Wrestling Academy) won by major decision over Dylan McBride (Oak Forest Warriors WC) Maj 9-0</li>\n<li>Champ. Round 1 - Cohen Sweely (PSF Wrestling Academy) won by fall over Deziree Azar (Naperville WC) Fall 2:19</li>\n<li>Champ. Round 1 - Riqo Garcia (ISI WC) won by fall over Devon Swope (DC WC) Fall 2:57</li>\n<li>Champ. Round 1 - Vincent Konecki (Yorkville WC) won by fall over Daniel Skura (Tribe WC) Fall 3:52</li>\n<li>Champ. Round 1 - Benjamin Nadig (Alber Athletics WC) won by fall over Xander Humphrey (Edwardsville WC) Fall 3:30</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Champ. Round 1 - Eliud Lombardia (Rochelle WC) won by decision over Avery Crouch (SOT-C) Dec 11-7</li>\n<li>Champ. Round 1 - Joshua Harkey (Bulls WC) won by decision over Samuel Cushman (Barrington Broncos WC) Dec 18-16</li>\n<li>Champ. Round 1 - Michael Malizzio (Team El1te Wrestling) won by fall over Keegan Germano (Unity Youth WC) Fall 1:25</li>\n<li>Champ. Round 1 - Max Mulhearn (Riot Room Wrestling) won by decision over Colton Sadaka (Edwardsville WC) Dec 5-4</li>\n<li>Champ. Round 1 - Aiden Arnett (Lincoln-Way WC) won by tech fall over Daniel Martino (Yorkville WC) TF 16-1</li>\n<li>Champ. Round 1 - Alexander Korpan (St. Charles WC) won by fall over Jeremiah Corona (Mustang WC) Fall 2:27</li>\n<li>Champ. Round 1 - Dawson Mack (Bolingbrook Junior Raiders WC) won by decision over Eddie Astorga (Mustang WC) Dec 3-0</li>\n<li>Champ. Round 1 - A.Jonathan Kopcio (Batavia WC) won by fall over Dakota Royer (Blue Crew WC) Fall 0:40</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Champ. Round 1 - Harley Pierce (Cumberland Youth WC) won by decision over Jackson Ponto (Fox Valley WC) Dec 2-0</li>\n<li>Champ. Round 1 - Tony Lombardo (Southside Outlaws WC) won by fall over Nate Page (Gladiator Elite WC) Fall 3:50</li>\n<li>Champ. Round 1 - Melik Robinson (Springs Elite WC) won by fall over Cody Culbertson (Rantoul Youth Wrestling) Fall 0:25</li>\n<li>Champ. Round 1 - Malan Njumbe-Hatfield (Blackhawk WC) won by decision over Cole Littlejohn (Crawford County WC) Dec 8-3</li>\n<li>Champ. Round 1 - Jaden Penna (Headlock Wrestling Academy) won by major decision over Daniel Snow (Crystal Lake Wizards WC) Maj 13-4</li>\n<li>Champ. Round 1 - Izaac Gaines (Blue Line Training Academy) won by decision over Isaac Mayora (Bolingbrook Junior Raiders WC) Dec 3-0</li>\n<li>Champ. Round 1 - Maximus Delgado (Yorkville WC) won by decision over Nick Zuehlke (Crystal Lake Wizards WC) Dec 10-3</li>\n<li>Champ. Round 1 - Jaxon Jorgensen (Bolingbrook Junior Raiders WC) won by major decision over Brody Hinkle (MadDog Wrestling Academy) Maj 16-5</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Champ. Round 1 - Brian Correa (Martinez Fox Valley Elite WC) won by fall over Jackson Fisher-Foth (Champaign WC) Fall 0:30</li>\n<li>Champ. Round 1 - Brysen Manly (nWo WC) won by fall over Nolan O`Shea (Elevate Wrestling Academy) Fall 0:27</li>\n<li>Champ. Round 1 - Daniel Gonzalez (Aurora WC) won by decision over Antonio Toliver (Peoria Heights Minutemen WC) Dec 9-5</li>\n<li>Champ. Round 1 - Ethan Harvey (Lincoln-Way WC) won by tech fall over Aiden Prendergast (Pontiac WC) TF 16-0</li>\n<li>Champ. Round 1 - Daniel Lynch (Tinley Park Bulldogs WC) won by decision over Lucas Parker (West Frankfort Jr. Redbirds WC) Dec 3-2</li>\n<li>Champ. Round 1 - Uriah Beamon (Red Raiders Wrestling Team) won by decision over Colton Huff (Evanston School of Wrestling) Dec 11-9</li>\n<li>Champ. Round 1 - Gavin Watson (Sparta Junior Bulldogs WC) won by major decision over Alex Rink (Sycamore WC) Maj 8-0</li>\n<li>Champ. Round 1 - Frank Miceli (Mustang WC) won by major decision over Marco Rafael (Mat Rat WC) Maj 16-2</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Champ. Round 1 - Benjamin Anderson (Sycamore WC) won by fall over Piper McGinnis (Cumberland Youth WC) Fall 0:29</li>\n<li>Champ. Round 1 - Daithan Narayanan (Batavia WC) won by fall over Logan Yerkey (Frankfort Wildcats Wrestling) Fall 1:24</li>\n<li>Champ. Round 1 - Jayden Britton (Blackhawk WC) won by fall over Brody Ketelaar (Lincoln-Way WC) Fall 2:22</li>\n<li>Champ. Round 1 - Brody Stien (Alber Athletics WC) won by fall over Chase Siguenza (Tribe WC) Fall 1:03</li>\n<li>Champ. Round 1 - Xavier Smiley (Mat Rat WC) won by decision over Zachary Michaud (Beat the Streets Chicago-Oak Park) Dec 5-2</li>\n<li>Champ. Round 1 - Benjamin Mullins (Crawford County WC) won by fall over Donncha Souza (Yorkville WC) Fall 4:14</li>\n<li>Champ. Round 1 - Allante Jackson (Beat the Streets Chicago-Bellwood) won by fall over Riley Mason (Sauk Valley WC) Fall 2:19</li>\n<li>Champ. Round 1 - Maxon Stearns (Murphysboro Wrestling) won by fall over Jackson Spizzirri (Junior Cougar WC) Fall 1:29</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Champ. Round 1 - Jasper Hintz (Red Raiders Wrestling Team) won by decision over Jayden Schmick (DC WC) Dec 9-6</li>\n<li>Champ. Round 1 - Bryce Bryant (Williamsville WC) won by fall over Logan Tanner (Murphysboro Wrestling) Fall 0:46</li>\n<li>Champ. Round 1 - Nicolas Astacio (ISI WC) won by fall over Earl Kelnhofer (Hoopeston Area WC) Fall 0:32</li>\n<li>Champ. Round 1 - Corey Robinson (East St. Louis WC) won by fall over Elias Mueller (DC WC) Fall 1:58</li>\n<li>Champ. Round 1 - Nicolas Olvera (Naperville WC) won by decision over Arkail Griffin Edwards (Beat the Streets Chicago-Midway) Dec 4-2</li>\n<li>Champ. Round 1 - Justin Langford (Lincoln-Way WC) won by decision over Michael Flatley (Lakeland Predators WC) Dec 8-2</li>\n<li>Champ. Round 1 - Xander Keslin (Force Elite WC) won by fall over Benjamin Menzer (Wheaton Tigers WC) Fall 3:55</li>\n<li>Champ. Round 1 - Kevin May (Southside Outlaws WC) won by fall over Aleksander Knapik (Team 312 WC) Fall 2:32</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>Champ. Round 2 - Eli Miller (Granite City Wrestling Association) won by fall over Destin Lathon (Williamsville WC) Fall 0:25</li>\n<li>Champ. Round 2 - Quinn Hogan (Greg Gomez Trained Wrestling) won by tech fall over Brooks Tyler (Evanston School of Wrestling) TF 20-5</li>\n<li>Champ. Round 2 - Zion Silvestre (Harvey Twisters WC) won by fall over Nathaniel Olivares (Notre Dame WC) Fall 0:17</li>\n<li>Champ. Round 2 - Aiden Rodriguez (ISI WC) won by fall over Camryn Sarver (Rantoul Youth Wrestling) Fall 0:58</li>\n<li>Champ. Round 2 - Logan Boley (Marengo Youth WC) won by fall over Travis Kinkead Jr. (Blue Line Training Academy) Fall 2:37</li>\n<li>Champ. Round 2 - Rex Chavez-Jimenez (Downers Grove WC) won by tech fall over Brendan Weber (Fox Lake WC) TF 17-1</li>\n<li>Champ. Round 2 - Xavier Pratt (Crosstown Spartan Elite WC) won by tech fall over Nathan Vogler (Oak Forest Warriors WC) TF 18-2</li>\n<li>Champ. Round 2 - Daniel Jackson (Southern Illinois Bulldogs WC) won by fall over Brody York (Argenta-Oreana Kids WC) Fall 0:56</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>Champ. Round 2 - Jake Luedtke (Tinley Park Bulldogs WC) won by fall over Angelo Ngoho (Champaign WC) Fall 0:55</li>\n<li>Champ. Round 2 - Knox Homola (Riot Room Wrestling) won by injury default over Braylon Cunningham (Edwardsville WC) Inj. 0:03</li>\n<li>Champ. Round 2 - Gentry Michels (Olney Cubs WC) won by fall over Levi Armstrong (Peoria Razorbacks WC) Fall 4:30</li>\n<li>Champ. Round 2 - Cash Wetenkamp (Lincoln-Way WC) won by fall over Art Bytyqi (Evanston School of Wrestling) Fall 4:30</li>\n<li>Champ. Round 2 - Rage Henderson (Gladiator Elite WC) won by fall over Musa Amin (Evanston School of Wrestling) Fall 1:00</li>\n<li>Champ. Round 2 - Luka Rankovic (Naperville WC) won by fall over Patrick Martin (Crystal Lake Wizards WC) Fall 2:37</li>\n<li>Champ. Round 2 - Anthony Samanich (Lockport Junior Porters WC) won by fall over Mason Henderson (Stockton Renegades WC) Fall 1:10</li>\n<li>Champ. Round 2 - Samuel Golladay (Williamsville WC) won by fall over Travis Hinton Jr (Toss Em Up Wrestling Academy) Fall 0:32</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Timothy Harrison (Harvey Twisters WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Michael Limon-Prado (Bulldog Elite WC) won by fall over Owen Kommer (Gladiator Elite WC) Fall 0:41</li>\n<li>Champ. Round 2 - Anthony Salcedo (Harvard WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Donovan Olmstead (Southern Illinois Bulldogs WC) won by fall over Jacob Garcia (Martinez Fox Valley Elite WC) Fall 2:32</li>\n<li>Champ. Round 2 - Cameron Casey (Team Mascoutah WC) won by fall over Abdulrahman Abukhdeir (Badger WC) Fall 0:31</li>\n<li>Champ. Round 2 - Nathan German (Toss Em Up Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 2 - Asher Acevedo (Stockton Renegades WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Waleed Fuqaha (Badger WC) won by decision over Olivia Rosine (Charleston WC) Dec 11-5</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Champ. Round 2 - Caleb Pate (SCN Youth WC) won by decision over Baylee Nehring (Sauk Valley WC) Dec 13-6</li>\n<li>Champ. Round 2 - Cannon Ziller (Hawk WC) won by fall over Jason Beyer (Blackhawk WC) Fall 0:31</li>\n<li>Champ. Round 2 - Cobey Stulce (Southern Illinois Bulldogs WC) won by fall over Vincent Cumbo (Vittum Cats WC) Fall 1:14</li>\n<li>Champ. Round 2 - Jackson Allen (G2 WC) won by tech fall over Jake Dulumback (Effingham Youth WC) TF 16-0</li>\n<li>Champ. Round 2 - Archer Smith (Hononegah WC) won by major decision over Brayden Graves (Lincoln-Way WC) Maj 11-0</li>\n<li>Champ. Round 2 - Calvin Babcock (St. Charles WC) won by decision over Camden Chapman (Gladiator Elite WC) Dec 9-4</li>\n<li>Champ. Round 2 - Kamari Tate (Englewood Live Wire WC) won by major decision over Julian Godina (Lincoln-Way WC) Maj 13-1</li>\n<li>Champ. Round 2 - Tenli Madriles (Crystal Lake Wizards WC) won by decision over Paul Ryan (Argenta-Oreana Kids WC) Dec 7-2</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Champ. Round 2 - Grayson Anderton (Nomad Wrestling Academy) won by fall over Braylyn Shirley (Sauk Valley WC) Fall 1:05</li>\n<li>Champ. Round 2 - Rocco Maheras (Vittum Cats WC) won by decision over Noah Flores (Force Elite WC) Dec 6-5</li>\n<li>Champ. Round 2 - Giovonni Nix (Englewood Live Wire WC) won by decision over Grady Glowacki (Lakeland Predators WC) Dec 7-3</li>\n<li>Champ. Round 2 - Bennett Hoffberg (St. Charles WC) won by decision over Brody Wenninger (Champbuilders Wrestling) Dec 7-3</li>\n<li>Champ. Round 2 - Aden Spinelli (nWo WC) won by decision over Mason Beattie (Fox Lake WC) Dec 10-3</li>\n<li>Champ. Round 2 - Dayton Patterson (Vandalia Jr WC) won by decision over Teddy Millard (Rochelle WC) Dec 4-3</li>\n<li>Champ. Round 2 - Jimmy Roach (Panther WC) won by fall over Jaxon Fraedrich (Team El1te Wrestling) Fall 2:48</li>\n<li>Champ. Round 2 - Eli Schaefer (Southern Illinois Bulldogs WC) won by tech fall over Kru McDonald (SJO Youth WC) TF 17-1</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Champ. Round 2 - Brady Myatt (Fox Lake WC) won by decision over Armin O`Guin (Southern Illinois Bulldogs WC) Dec 7-0</li>\n<li>Champ. Round 2 - Easton McDonnell (Lincoln-Way WC) won by tech fall over Bentley Morse (Storm Youth WC) TF 20-5</li>\n<li>Champ. Round 2 - Wesley Janick (nWo WC) won by fall over Colt Rosentreter (Carlinville WC) Fall 1:16</li>\n<li>Champ. Round 2 - Fran Blake (Panther WC) won by fall over Travis Wilgosiewicz (ISI WC) Fall 2:39</li>\n<li>Champ. Round 2 - Reese Babcock (St. Charles WC) won by fall over William Bousk (Arlington Cardinals WC) Fall 2:16</li>\n<li>Champ. Round 2 - Maddux Kennedy (Blue Line Training Academy) won by major decision over Tyler Sullivan (Sycamore WC) Maj 8-0</li>\n<li>Champ. Round 2 - Carter Noonan (Ottawa Wolfpack WC) won by decision over Noah Thomas (Bulls WC) Dec 1-0</li>\n<li>Champ. Round 2 - Cameron Ramp (SOT-C) won by decision over Thomas Blanke (Barrington Broncos WC) Dec 5-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Landon Near (nWo WC) won by fall over Braxton McCall (O`Fallon Little Panthers WC) Fall 3:32</li>\n<li>Champ. Round 2 - Crue Hatchell (Southside Outlaws WC) won by fall over Dominic Melody (Mat Rat WC) Fall 0:25</li>\n<li>Champ. Round 2 - Hogan Rice (St. Charles WC) won by fall over Rylan Glauser (Fox Lake WC) Fall 4:08</li>\n<li>Champ. Round 2 - Elijah Nadig (Alber Athletics WC) won by fall over Luke Drexel (Frankfort Wildcats Wrestling) Fall 0:39</li>\n<li>Champ. Round 2 - Erik Klichurov (Izzy Style Wrestling) won by fall over David Wesierski (ISI WC) Fall 1:04</li>\n<li>Champ. Round 2 - Liam Kissane (Tinley Park Bulldogs WC) won by decision over Noah Rauen (Force Elite WC) Dec 7-2</li>\n<li>Champ. Round 2 - Santino Scardina (Lions WC) won by decision over Drevan Bramlett (Trico WC) Dec 4-2</li>\n<li>Champ. Round 2 - Cale Dauber (Ottawa Wolfpack WC) won by decision over Ian Rotramel (SOT-C) Dec 8-2</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Champ. Round 2 - Jeffrey Dunaway (St. Charles WC) won by tech fall over Gabriel Thornquist (East Peoria River Bandits Wrestling) TF 17-2</li>\n<li>Champ. Round 2 - Jaden Washington (Harvey Twisters WC) won by fall over Charlie Strezo (Lincoln-Way WC) Fall 0:31</li>\n<li>Champ. Round 2 - Cael Saldana (Toss Em Up Wrestling Academy) won by fall over Nolan Glynn (Lincoln-Way WC) Fall 3:25</li>\n<li>Champ. Round 2 - Colin Crouch (Triad Knights WC) won by decision over Jack Benesh (Hawk WC) Dec 7-0</li>\n<li>Champ. Round 2 - Maddux Rabczak (Alber Athletics WC) won by tech fall over Riley Smith (Carlinville WC) TF 16-0</li>\n<li>Champ. Round 2 - Finn McDermott (Force Elite WC) won by decision over Adonis Washington (Harvey Twisters WC) Dec 6-1</li>\n<li>Champ. Round 2 - Tad Moore (Blue Line Training Academy) won by decision over Brayden Johnson (SCN Youth WC) Dec 7-2</li>\n<li>Champ. Round 2 - Owen Thomas (Toss Em Up Wrestling Academy) won by tech fall over Nico Rangel (Storm Youth WC) TF 15-0</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Champ. Round 2 - Nikolas Duarte (Arlington Cardinals WC) won by tech fall over Everett Garretson (Yorkville WC) TF 17-1</li>\n<li>Champ. Round 2 - Obadiah Willis (Beat the Streets Chicago-Midway) won by major decision over Carl Cody Weidner (Combative Sports Athletic Center Wrestling) Maj 14-0</li>\n<li>Champ. Round 2 - Daniel Zuehlke (Crystal Lake Wizards WC) won by fall over Jase Edrington (Storm Youth WC) Fall 2:26</li>\n<li>Champ. Round 2 - Griffin Heeney (Elevate Wrestling Academy) won by decision over Jeremy Powell Jr (Harvey Twisters WC) Dec 8-2</li>\n<li>Champ. Round 2 - Jack Bashore (Batavia WC) won in sudden victory - 1 over Lucas Macdonald (ISI WC) SV-1 11-9</li>\n<li>Champ. Round 2 - Te`Jon Beals (Harvey Twisters WC) won by decision over Vannak Khiev (Mat Rat WC) Dec 6-4</li>\n<li>Champ. Round 2 - Rhyis Polenske (Blue Line Training Academy) won by fall over Brogan Sendele (Hononegah WC) Fall 0:33</li>\n<li>Champ. Round 2 - Kiernan Delaney (Toss Em Up Wrestling Academy) won by fall over Alec Daly (Unity Youth WC) Fall 1:04</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Champ. Round 2 - Cameron Young (Alber Athletics WC) won by decision over Nolan Chrisse (Bolingbrook Junior Raiders WC) Dec 4-2</li>\n<li>Champ. Round 2 - Jonathan Fields (Mustang WC) won by decision over Eli Quartz (Southern Illinois Bulldogs WC) Dec 8-4</li>\n<li>Champ. Round 2 - Hayden Smith (Unity Youth WC) won by fall over Gabriel Richmond (Batavia WC) Fall 4:16</li>\n<li>Champ. Round 2 - Brody Page (Yorkville WC) won by decision over Santiago Trejo (Southside Outlaws WC) Dec 6-0</li>\n<li>Champ. Round 2 - Colton Schultz (Callan Wrestling Academy) won by fall over Jaxon Lynn (Lion`s Den Wrestling Academy) Fall 0:50</li>\n<li>Champ. Round 2 - Ethan Hamilton (Harvey Twisters WC) won by decision over Landen Vincent (Blue Line Training Academy) Dec 4-3</li>\n<li>Champ. Round 2 - Maximus Pearch (nWo WC) won by decision over Owen Catalano (Fox Lake WC) Dec 7-2</li>\n<li>Champ. Round 2 - Jeremiah Hayes (Warrior Wrestling) won by fall over Camden Spiniolas (Richmond WC) Fall 3:20</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Champ. Round 2 - Kai Balice (Naperville WC) won by tech fall over Colton Johnson (Falcon Youth WC) TF 16-1</li>\n<li>Champ. Round 2 - Kane Dauber (Ottawa Wolfpack WC) won by fall over Nathan Raban (Southern Illinois Bulldogs WC) Fall 3:00</li>\n<li>Champ. Round 2 - Lincoln Mack (Bolingbrook Junior Raiders WC) won by fall over Dominic Martinello (Fenton Jr. Bison WC) Fall 0:19</li>\n<li>Champ. Round 2 - Dylan Curtis (Sycamore WC) won by decision over Vinn Tunis (Lemont Bears WC) Dec 7-6</li>\n<li>Champ. Round 2 - Dylan Knaus (ISI WC) won by fall over Gabriel Travis Jr (Will County Warriors WC) Fall 1:30</li>\n<li>Champ. Round 2 - Colton Stearns (Granite City Wrestling Association) won by decision over Vincente Halverson (Tribe WC) Dec 8-3</li>\n<li>Champ. Round 2 - Maddox Stonitsch (Lincoln-Way WC) won by major decision over Justin Green (Elk Grove Junior Grens WC) Maj 15-2</li>\n<li>Champ. Round 2 - Jackson Wells (Batavia WC) won by decision over Rylan Poeta (Champaign WC) Dec 10-7</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Cleto Protti (Bolingbrook Junior Raiders WC) won by decision over Jesse Swiney (Champaign WC) Dec 6-2</li>\n<li>Champ. Round 2 - Julius Cole (Yorkville WC) won by decision over Andrew Ayala-Mendoza (Beat the Streets Chicago-Midway) Dec 8-7</li>\n<li>Champ. Round 2 - Wyatt Franckowiak (Richmond WC) won by fall over Nino Capuano (Beat the Streets Chicago-Hyde Park) Fall 4:14</li>\n<li>Champ. Round 2 - Landon Weidler (Belleville Little Devils WC) won by decision over Cade Vazquez (Izzy Style Wrestling) Dec 4-1</li>\n<li>Champ. Round 2 - Andrew Lehman (Beat the Streets Chicago-Midway) won by major decision over John Gough (MadDog Wrestling Academy) Maj 8-0</li>\n<li>Champ. Round 2 - Wyatt Mikkelsen (LaSalle Peru Crunching Cavs Youth WC) won by fall over Omar Mendez (Lion`s Den Wrestling Academy) Fall 1:39</li>\n<li>Champ. Round 2 - Kai Enos (Batavia WC) won by decision over Logan Woodbury (ISI WC) Dec 6-2</li>\n<li>Champ. Round 2 - Devin Ehler (Storm Youth WC) won by decision over Max Mandac (Lincoln-Way WC) Dec 6-0</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Champ. Round 2 - Gavin Beauchamp (ISI WC) won by fall over Andrew Vliek (Wheaton Tigers WC) Fall 0:44</li>\n<li>Champ. Round 2 - Dawson Hull (Blue Line Training Academy) won by fall over Joseph Cameron (Built By Brunson Wrestling) Fall 2:35</li>\n<li>Champ. Round 2 - Axel Rodriguez (Beat the Streets Chicago-Midway) won by tech fall over Connor Kern (Yorkville WC) TF 16-0</li>\n<li>Champ. Round 2 - Myles Greenfield (Belleville Little Devils WC) won by decision over Ryker Long (Demolition WC) Dec 6-1</li>\n<li>Champ. Round 2 - Andrew Pellicci (Lincoln-Way WC) won by major decision over Gregory Harkey (Bulls WC) Maj 11-2</li>\n<li>Champ. Round 2 - Jaxon Trofimchuck (nWo WC) won by fall over Brooks Auker (Alber Athletics WC) Fall 1:16</li>\n<li>Champ. Round 2 - Titan Henderson (Gladiator Elite WC) won by fall over Ricky Alfaro (Tribe WC) Fall 0:41</li>\n<li>Champ. Round 2 - Yariah Shaw (Lionheart Intense Wrestling) won by major decision over Damir Duharkic (MadDog Wrestling Academy) Maj 16-2</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Champ. Round 2 - Otis Davis (Harvey Twisters WC) won by major decision over Jayden Hermacinski (Peoria Razorbacks WC) Maj 9-1</li>\n<li>Champ. Round 2 - Christopher Navarro (Notre Dame WC) won by fall over Dennis Hawthorne (Urbana Tigers WC) Fall 2:16</li>\n<li>Champ. Round 2 - Ameer Khalil (Bolingbrook Junior Raiders WC) won by tech fall over Keandre Towns (Champaign WC) TF 15-0</li>\n<li>Champ. Round 2 - Jeffrey Hill (Naperville WC) won by tech fall over Hudson Wesley (Bulls WC) TF 16-1</li>\n<li>Champ. Round 2 - Lucas Maida (Stampede WC) won by decision over Jaret Waters (Road Warriors WC) Dec 15-11</li>\n<li>Champ. Round 2 - Mason Villarreal (nWo WC) won by decision over Dimetri Kean (Demolition WC) Dec 7-0</li>\n<li>Champ. Round 2 - Luke Banas (Demolition WC) won by decision over Brannick Alexander (Alber Athletics WC) Dec 6-0</li>\n<li>Champ. Round 2 - Lucas Maier (SOT-C) won by fall over Rico Silvestre (Harvey Twisters WC) Fall 3:45</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Champ. Round 2 - Naijier Morris (Urbana Tigers WC) won by fall over Austin Bielski (Elevate Wrestling Academy) Fall 2:35</li>\n<li>Champ. Round 2 - Langston Norlin (Oswego WC) won by decision over Harrison Yankellow (Beat the Streets Chicago-Avondale) Dec 10-5</li>\n<li>Champ. Round 2 - Trent Watson (Englewood Live Wire WC) won by fall over Jaxton Carroll (Vandalia Jr WC) Fall 2:03</li>\n<li>Champ. Round 2 - Sean Martinez (Peoria Razorbacks WC) won by fall over Benjamin Morris (Rochelle WC) Fall 0:24</li>\n<li>Champ. Round 2 - Brian Goggin (Panther WC) won by fall over Jack Dykes (TJ Trained Wrestling) Fall 0:21</li>\n<li>Champ. Round 2 - Angel Martinez (Bulldog Elite WC) won by decision over Reid Balis (Naperville WC) Dec 5-0</li>\n<li>Champ. Round 2 - Hazen Murray (St. Charles WC) won by decision over Wyatt Stacy (Xtreme WC) Dec 3-2</li>\n<li>Champ. Round 2 - Liam Hughes (Storm Youth WC) won by fall over Levi Pretzsch (Dixon WC) Fall 2:50</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Champ. Round 2 - Amillian Beasley (Urbana Tigers WC) won by fall over Evan Grove (TJ Trained Wrestling) Fall 1:07</li>\n<li>Champ. Round 2 - Xavier Arroyo (Fox Lake WC) won by decision over Isaiah Robinson (Beat the Streets Chicago-Bellwood) Dec 6-3</li>\n<li>Champ. Round 2 - Daniel Costello (Mustang WC) won by decision over Dane Olmstead (Southern Illinois Bulldogs WC) Dec 7-2</li>\n<li>Champ. Round 2 - Isaiah Garcia (Blackhawk WC) won by fall over Wyatt Kinney (Hononegah WC) Fall 0:35</li>\n<li>Champ. Round 2 - Sergio Calleros (Beat the Streets Chicago-Midway) won by major decision over Julian Moon (Effingham Youth WC) Maj 18-4</li>\n<li>Champ. Round 2 - Micah Stringini (The Law WC) won by decision over Michael Kimbrough (Blue Crew WC) Dec 13-6</li>\n<li>Champ. Round 2 - Isaac Barrientos (Bolingbrook Junior Raiders WC) won by major decision over Maison Toliver (Peoria Heights Minutemen WC) Maj 11-2</li>\n<li>Champ. Round 2 - Jamison Chambliss (Storm Youth WC) won by fall over Payton Chanerl (East St. Louis WC) Fall 1:18</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Champ. Round 2 - Jaxson Mathenia (Southern Illinois Bulldogs WC) won by fall over Jack Hagerty (Edwardsville WC) Fall 1:04</li>\n<li>Champ. Round 2 - Fernando Anaya (Blackhawk WC) won by fall over Matthew Carver (MadDog Wrestling Academy) Fall 0:54</li>\n<li>Champ. Round 2 - Malakai Davis (Beat the Streets Chicago-Midway) won by fall over Diego Lopez (Evanston School of Wrestling) Fall 2:25</li>\n<li>Champ. Round 2 - Carter Hintz (Red Raiders Wrestling Team) won by fall over Matthew Murray (Sauk Valley WC) Fall 2:24</li>\n<li>Champ. Round 2 - Hayden Wheeler (Yorkville WC) won by tech fall over Maddox McRoberts (Sycamore WC) TF 18-2</li>\n<li>Champ. Round 2 - Aaden Arroyo (Fox Lake WC) won by fall over Charles Jacquez (Trico WC) Fall 4:07</li>\n<li>Champ. Round 2 - Cole Yirsa (Lincoln-Way WC) won by fall over Kenneth Seggerson (Beat the Streets Chicago-Midway) Fall 1:53</li>\n<li>Champ. Round 2 - Ivan Torres (Collinsville WC) won by fall over Brayden Meeker (Storm Youth WC) Fall 2:26</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Champ. Round 2 - Cayden Smith (Junior Cyclones WC) won by fall over Brayden Hawkinson (Oak Forest Warriors WC) Fall 1:25</li>\n<li>Champ. Round 2 - Clyde Nott (Sycamore WC) won by decision over Christian Paige (Oswego WC) Dec 4-1</li>\n<li>Champ. Round 2 - Fares Ibraheem (Fox Valley WC) won by fall over Keigan Hull (Lion`s Den Wrestling Academy) Fall 1:13</li>\n<li>Champ. Round 2 - Luke Nielsen (Lincoln-Way WC) won by fall over Michael Guerrero (Wolfpak WC) Fall 3:33</li>\n<li>Champ. Round 2 - Mason West (Southern Illinois Bulldogs WC) won by fall over Romeo Hernandez (Toss Em Up Wrestling Academy) Fall 0:54</li>\n<li>Champ. Round 2 - Gavin Ericson (Stampede WC) won by fall over Blaine Becker (Belvidere Bandits WC) Fall 0:27</li>\n<li>Champ. Round 2 - Christopher Easley (Force Elite WC) won by fall over Richard Butler (Crystal Lake Wizards WC) Fall 1:18</li>\n<li>Champ. Round 2 - Michael Hardin (Danville Chargers WC) won by fall over Gregory Heavey (Wheaton Tigers WC) Fall 2:01</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Hunter Wahtola (Beat the Streets Chicago-Avondale) won by fall over Remington Bryant (Charleston WC) Fall 0:38</li>\n<li>Champ. Round 2 - Aj Forst (Fox Valley WC) won by decision over Braylon Hill-Lomax (Edwardsville WC) Dec 11-5</li>\n<li>Champ. Round 2 - Evan Flanagan (Clipper WC) won by fall over Tommy Yannias (Glenbard East Jr Rams WC) Fall 0:36</li>\n<li>Champ. Round 2 - Gannon Dunker (The Law WC) won by fall over Raymond Morales (Lion`s Den Wrestling Academy) Fall 2:37</li>\n<li>Champ. Round 2 - Jonathon Caudle (O`Fallon Little Panthers WC) won by fall over Bradyn Haynes (Pekin Boys &amp; Girls Club) Fall 2:34</li>\n<li>Champ. Round 2 - Aiden Bishop (Fox Valley WC) won by fall over Cayden Berryhill (G2 WC) Fall 0:18</li>\n<li>Champ. Round 2 - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Samuel Swais (MadDog Wrestling Academy) Fall 0:30</li>\n<li>Champ. Round 2 - Khaden Hallowell (SJO Youth WC) won by fall over Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) Fall 0:55</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Jayden Chavez (Blackhawk WC) won by fall over D`Anthony Brooks (Peoria Razorbacks WC) Fall 2:15</li>\n<li>Champ. Round 2 - Jasmine Enriquez (Sycamore WC) won by fall over Trey Harris (Williamsville WC) Fall 2:22</li>\n<li>Champ. Round 2 - Deandre Wilson (Lion`s Den Wrestling Academy) won by fall over Hoyt Choate (Oswego WC) Fall 0:47</li>\n<li>Champ. Round 2 - Jake Johnson (Naperville WC) won by fall over Luke Heinen (Lincoln-Way WC) Fall 2:51</li>\n<li>Champ. Round 2 - Gabriel Kopecky (Team 312 WC) won by decision over Michael Fuller (Edwardsville WC) Dec 7-3</li>\n<li>Champ. Round 2 - Brandon Monroy (Aurora WC) won by fall over Caybren Hubbard (Murphysboro Wrestling) Fall 1:20</li>\n<li>Champ. Round 2 - Jack Amann (Southern Illinois Bulldogs WC) won by fall over Christopher Korduplewski (Tinley Park Bulldogs WC) Fall 2:46</li>\n<li>Champ. Round 2 - Liam Dodsworth (Williamsville WC) won by fall over Josh Melsa (Naperville WC) Fall 1:55</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Donovan Johnson (Blackhawk WC) won by decision over Damon Glenn (Storm Youth WC) Dec 6-4</li>\n<li>Champ. Round 2 - Treyden Diduch (Alber Athletics WC) won by decision over Zander Johnson (Lion`s Den Wrestling Academy) Dec 7-2</li>\n<li>Champ. Round 2 - Lucas Medina (Arlington Cardinals WC) won by fall over Ignacio Figueroa (Edwardsville WC) Fall 0:47</li>\n<li>Champ. Round 2 - Julian Medina (Bolingbrook Junior Raiders WC) won by decision over Davin Torza (Bolingbrook Junior Raiders WC) Dec 6-2</li>\n<li>Champ. Round 2 - Landon Jenkins (Yorkville WC) won by decision over Elijah Bell (Frankfort Wildcats Wrestling) Dec 9-6</li>\n<li>Champ. Round 2 - Ayden Winchell (Callan Wrestling Academy) won by fall over Kevin Bisonaya (Panther WC) Fall 2:13</li>\n<li>Champ. Round 2 - Michael McNamara (Edwardsville WC) won by major decision over Jack Munn (Lincoln-Way WC) Maj 9-0</li>\n<li>Champ. Round 2 - Benjamin Wells (Champaign WC) won by fall over Beckem Carney (St. Charles WC) Fall 2:10</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Brycen Fahnestock (Blue Line Training Academy) won by major decision over Colton Madison (Edwardsville WC) Maj 9-0</li>\n<li>Champ. Round 2 - Logan Viau (Tinley Park Bulldogs WC) won by fall over Nathan Butcher (St. Charles WC) Fall 0:43</li>\n<li>Champ. Round 2 - Carson West (St. Charles WC) won by fall over Santino Pignatelli (Mat Rat WC) Fall 2:51</li>\n<li>Champ. Round 2 - Cam Whitehead (Alber Athletics WC) won by decision over Hudson Anderton (Nomad Wrestling Academy) Dec 6-0</li>\n<li>Champ. Round 2 - Michael Rundell (Arlington Cardinals WC) won by tech fall over Joseph Calvillo (Batavia WC) TF 17-1</li>\n<li>Champ. Round 2 - Brandon Kalman (Elevate Wrestling Academy) won by major decision over Benjamin Jurkovic (Tinley Park Bulldogs WC) Maj 13-1</li>\n<li>Champ. Round 2 - Rocco Valvano (Tribe WC) won by fall over Wesley Smith (Carlinville WC) Fall 0:58</li>\n<li>Champ. Round 2 - Weston Frazier (Storm Youth WC) won by decision over Christian Johnson (Blue Crew WC) Dec 11-8</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Christian Corcoran (Lincoln-Way WC) won by fall over Brayden Bickett (Tiger Town Tanglers WC) Fall 0:45</li>\n<li>Champ. Round 2 - Jack Koenig (Team 312 WC) won by decision over Nathan Ortiz (Tinley Park Bulldogs WC) Dec 3-2</li>\n<li>Champ. Round 2 - Jayce Glauser (Fox Lake WC) won by decision over Kaden Potter (St. Charles WC) Dec 3-0</li>\n<li>Champ. Round 2 - Charlie Olson (Sycamore WC) won by fall over Aiden Weber (Elevate Wrestling Academy) Fall 1:16</li>\n<li>Champ. Round 2 - Niko Odiotti (Arlington Cardinals WC) won by major decision over Preston Morrison (SCN Youth WC) Maj 13-4</li>\n<li>Champ. Round 2 - Colton Wyller (Demolition WC) won by decision over Gerald Donnelly (Tinley Park Bulldogs WC) Dec 4-0</li>\n<li>Champ. Round 2 - Ray Long (Martinez Fox Valley Elite WC) won by decision over Matthew Deutch (Southern Illinois Bulldogs WC) Dec 8-3</li>\n<li>Champ. Round 2 - Steven Uden (Storm Youth WC) won by fall over Declan McReynolds (Blue Crew WC) Fall 1:04</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Champ. Round 2 - Aedan Dillow (Beat the Streets Chicago-Avondale) won by fall over Jonathon Sebring (Marengo Youth WC) Fall 0:30</li>\n<li>Champ. Round 2 - Brady Glynn (Lincoln-Way WC) won in sudden victory - 1 over Daniel Myint (Arlington Cardinals WC) SV-1 9-4</li>\n<li>Champ. Round 2 - Logan Conover (Batavia WC) won by major decision over Hank Burge (Edwardsville WC) Maj 9-0</li>\n<li>Champ. Round 2 - Nick Dilallo (Arlington Cardinals WC) won by fall over Justin Forbes (Caravan Kids WC) Fall 2:25</li>\n<li>Champ. Round 2 - Robert Ruscitti (Arlington Cardinals WC) won by fall over Nolan O`Grady (Oswego WC) Fall 1:13</li>\n<li>Champ. Round 2 - Eddie Woody Jr. (Edwardsville WC) won by fall over Leyton Bartley (Lincoln-Way WC) Fall 4:02</li>\n<li>Champ. Round 2 - Michael Benge (Ottawa Wolfpack WC) won by fall over Ryan Rowan (Sycamore WC) Fall 1:51</li>\n<li>Champ. Round 2 - Jackson Marlett (St. Charles WC) won by decision over Roberto Rangel (Oak Forest Warriors WC) Dec 5-1</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Champ. Round 2 - Kaleb Pratt (Arlington Cardinals WC) won by major decision over Pedro Alberto Rangel (Storm Youth WC) Maj 9-1</li>\n<li>Champ. Round 2 - Dawson Hawthorne (Granite City Wrestling Association) won by fall over Elijah Sawyers (Harvey Twisters WC) Fall 1:17</li>\n<li>Champ. Round 2 - Isaiah Perez (Alber Athletics WC) won by decision over Zayden Mansfield (Unity Youth WC) Dec 1-0</li>\n<li>Champ. Round 2 - Lukas Foster (Callan Wrestling Academy) won by fall over Aidan Lopez (nWo WC) Fall 2:50</li>\n<li>Champ. Round 2 - Shane Stream (Lincoln-Way WC) won by fall over Declan Sons (St. Charles WC) Fall 1:12</li>\n<li>Champ. Round 2 - Jamiel Castleberry (Beat the Streets Chicago-Bellwood) won by tech fall over Dominic Pasquale (Izzy Style Wrestling) TF 22-7</li>\n<li>Champ. Round 2 - Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) won by decision over Kanton Richards (Murphysboro Wrestling) Dec 7-0</li>\n<li>Champ. Round 2 - Talin Baker (Champaign WC) won by fall over Rielen Hermsen (Toss Em Up Wrestling Academy) Fall 1:16</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Champ. Round 2 - Oscar Kalman (Elevate Wrestling Academy) won by fall over Max Moreno (Ottawa Wolfpack WC) Fall 1:05</li>\n<li>Champ. Round 2 - Adante Washington (Harvey Twisters WC) won by fall over Jayden Hernandez (St. Charles WC) Fall 1:26</li>\n<li>Champ. Round 2 - Rocco Cassioppi (Hononegah WC) won by fall over Kristian DeClercq (ISI WC) Fall 0:52</li>\n<li>Champ. Round 2 - Avery Jaime (Bulls WC) won by tech fall over Jadyn Pearson (Fox Valley WC) TF 17-0</li>\n<li>Champ. Round 2 - Cole Forsyth (Stampede WC) won by decision over Jarryion Agnew (Murphysboro Wrestling) Dec 5-2</li>\n<li>Champ. Round 2 - Charlie Connors (Alber Athletics WC) won by decision over Kie Smith (Blue Line Training Academy) Dec 8-1</li>\n<li>Champ. Round 2 - Nicholas Marchese (Crystal Lake Wizards WC) won by decision over Michael Miranda (Team 312 WC) Dec 2-1</li>\n<li>Champ. Round 2 - Mason Swartz (Storm Youth WC) won by decision over Colin Phelan (Bolingbrook Junior Raiders WC) Dec 10-4</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Champ. Round 2 - Bruno Cassioppi (Hononegah WC) won by decision over Tyler Lachenberg (Lincoln-Way WC) Dec 8-2</li>\n<li>Champ. Round 2 - Preston Waughtel (Bulls WC) won by fall over Robert Williams (Harvey Twisters WC) Fall 1:55</li>\n<li>Champ. Round 2 - Gavin Woodmancy (St. Charles WC) won by tech fall over Logan Aaron (Cumberland Youth WC) TF 17-1</li>\n<li>Champ. Round 2 - Hunter Toliver (Peoria Heights Minutemen WC) won by decision over Anthony Farina (Elevate Wrestling Academy) Dec 4-1</li>\n<li>Champ. Round 2 - Cohen Sweely (PSF Wrestling Academy) won by major decision over Jonathan Harris (Crosstown Spartan Elite WC) Maj 17-7</li>\n<li>Champ. Round 2 - Riqo Garcia (ISI WC) won by fall over Kyrin King (Harvey Twisters WC) Fall 2:40</li>\n<li>Champ. Round 2 - John Hanrahan (Arlington Cardinals WC) won by major decision over Vincent Konecki (Yorkville WC) Maj 12-4</li>\n<li>Champ. Round 2 - Benjamin Nadig (Alber Athletics WC) won by fall over Robert Moss (Urbana Tigers WC) Fall 2:12</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Champ. Round 2 - Cameron Engels (Scorpion WC) won by fall over Eliud Lombardia (Rochelle WC) Fall 3:41</li>\n<li>Champ. Round 2 - Joshua Harkey (Bulls WC) won by fall over Caiden Heath (Clipper WC) Fall 1:48</li>\n<li>Champ. Round 2 - Ethan Sonne (Lincoln-Way WC) won by decision over Michael Malizzio (Team El1te Wrestling) Dec 2-1</li>\n<li>Champ. Round 2 - Josiah Willis (Beat the Streets Chicago-Midway) won by decision over Max Mulhearn (Riot Room Wrestling) Dec 2-0</li>\n<li>Champ. Round 2 - Aiden Arnett (Lincoln-Way WC) won by decision over Sawyer Valdez (Sycamore WC) Dec 5-0</li>\n<li>Champ. Round 2 - Braxton Tolley (Granite City Wrestling Association) won by fall over Alexander Korpan (St. Charles WC) Fall 2:54</li>\n<li>Champ. Round 2 - Dawson Mack (Bolingbrook Junior Raiders WC) won by decision over Jacob Alvarez (Izzy Style Wrestling) Dec 9-5</li>\n<li>Champ. Round 2 - A.Jonathan Kopcio (Batavia WC) won by decision over Malachi Hutchinson (Urbana Tigers WC) Dec 6-4</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Champ. Round 2 - Thomas Banas (Demolition WC) won by fall over Harley Pierce (Cumberland Youth WC) Fall 0:24</li>\n<li>Champ. Round 2 - Chase Krantz (Blue Line Training Academy) won by decision over Tony Lombardo (Southside Outlaws WC) Dec 6-0</li>\n<li>Champ. Round 2 - Brendan Nardin (Alber Athletics WC) won by decision over Melik Robinson (Springs Elite WC) Dec 4-2</li>\n<li>Champ. Round 2 - Daniel Blanke (Barrington Broncos WC) won by major decision over Malan Njumbe-Hatfield (Blackhawk WC) Maj 13-0</li>\n<li>Champ. Round 2 - Davian Hall (Englewood Live Wire WC) won by decision over Jaden Penna (Headlock Wrestling Academy) Dec 4-2</li>\n<li>Champ. Round 2 - Izaac Gaines (Blue Line Training Academy) won by tech fall over Say-Vair Williams (Murphysboro Wrestling) TF 16-0</li>\n<li>Champ. Round 2 - Maximus Delgado (Yorkville WC) won by decision over Jayden Dohogne (St. Charles WC) Dec 11-4</li>\n<li>Champ. Round 2 - Jaxon Jorgensen (Bolingbrook Junior Raiders WC) won by decision over Taylor Finley (Unity Youth WC) Dec 6-1</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Champ. Round 2 - Douglas Gemberling (Sycamore WC) won by decision over Brian Correa (Martinez Fox Valley Elite WC) Dec 8-1</li>\n<li>Champ. Round 2 - Aiden Quevedo (MadDog Wrestling Academy) won by major decision over Brysen Manly (nWo WC) Maj 10-0</li>\n<li>Champ. Round 2 - Brayden McKay (Tinley Park Bulldogs WC) won by fall over Daniel Gonzalez (Aurora WC) Fall 4:24</li>\n<li>Champ. Round 2 - Knox Verbais (Combative Sports Athletic Center Wrestling) won by tech fall over Ethan Harvey (Lincoln-Way WC) TF 15-0</li>\n<li>Champ. Round 2 - Jadon Zimmer (Lincoln-Way WC) won by decision over Daniel Lynch (Tinley Park Bulldogs WC) Dec 7-1</li>\n<li>Champ. Round 2 - Donovan Rosauer (Yorkville WC) won by major decision over Uriah Beamon (Red Raiders Wrestling Team) Maj 9-1</li>\n<li>Champ. Round 2 - Gavin Watson (Sparta Junior Bulldogs WC) won by decision over Grayson Garcia (Fitz Wrestling Academy) Dec 3-2</li>\n<li>Champ. Round 2 - Frank Miceli (Mustang WC) won by fall over Thomas Ware (SJO Youth WC) Fall 2:25</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Champ. Round 2 - Killian Rauch (Southern Illinois Bulldogs WC) won by fall over Benjamin Anderson (Sycamore WC) Fall 0:58</li>\n<li>Champ. Round 2 - Reily Leifheit (Ottawa Wolfpack WC) won by fall over Daithan Narayanan (Batavia WC) Fall 1:09</li>\n<li>Champ. Round 2 - Trevon Williams (Springs Elite WC) won by fall over Jayden Britton (Blackhawk WC) Fall 0:25</li>\n<li>Champ. Round 2 - Nicholas Hermsen (Toss Em Up Wrestling Academy) won by decision over Brody Stien (Alber Athletics WC) Dec 4-0</li>\n<li>Champ. Round 2 - Kaden Meyer (Bolingbrook Junior Raiders WC) won by fall over Xavier Smiley (Mat Rat WC) Fall 2:13</li>\n<li>Champ. Round 2 - Ronin Brom (Fox Valley WC) won by decision over Benjamin Mullins (Crawford County WC) Dec 4-1</li>\n<li>Champ. Round 2 - Radic Dvorak (ISI WC) won by major decision over Allante Jackson (Beat the Streets Chicago-Bellwood) Maj 11-3</li>\n<li>Champ. Round 2 - Maxon Stearns (Murphysboro Wrestling) won by fall over Alexander Mager (Rantoul Youth Wrestling) Fall 0:18</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Champ. Round 2 - John McGinnis (Oak Forest Warriors WC) won by fall over Jasper Hintz (Red Raiders Wrestling Team) Fall 1:12</li>\n<li>Champ. Round 2 - Rodrigo Salinas (Evanston School of Wrestling) won by decision over Bryce Bryant (Williamsville WC) Dec 6-0</li>\n<li>Champ. Round 2 - Nicolas Astacio (ISI WC) won by decision over Isaac Saldana (Bolingbrook Junior Raiders WC) Dec 7-0</li>\n<li>Champ. Round 2 - Garrett Patnoudes (Fox Valley WC) won by decision over Corey Robinson (East St. Louis WC) Dec 9-8</li>\n<li>Champ. Round 2 - James Wojcikiewicz (Bulls WC) won by fall over Nicolas Olvera (Naperville WC) Fall 4:27</li>\n<li>Champ. Round 2 - Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) won by fall over Justin Langford (Lincoln-Way WC) Fall 2:26</li>\n<li>Champ. Round 2 - Brody Sendele (Hononegah WC) won by fall over Xander Keslin (Force Elite WC) Fall 1:49</li>\n<li>Champ. Round 2 - Kevin May (Southside Outlaws WC) won by decision over Sergio Baity (Urbana Tigers WC) Dec 8-5</li>\n</ul>\n</section>",
  "Consolation First Round": "<section class=\"tw-list\">\n<h1>Consolation First Round</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>Cons. Round 2 - Finnegan Larkin (Lockport Junior Porters WC) won by fall over Brody York (Argenta-Oreana Kids WC) Fall 2:25</li>\n<li>Cons. Round 2 - Nathan Vogler (Oak Forest Warriors WC) won by fall over Logan Van Vlymen (Macomb Little Bombers Wrestling) Fall 0:23</li>\n<li>Cons. Round 2 - Brendan Weber (Fox Lake WC) won by fall over Timotheus Conner (Demolition WC) Fall 1:21</li>\n<li>Cons. Round 2 - Marcus Robinson (Peoria Razorbacks WC) won by decision over Travis Kinkead Jr. (Blue Line Training Academy) Dec 10-7</li>\n<li>Cons. Round 2 - Harrison Sneathen (Beat the Streets Chicago-Oak Park) won by fall over Camryn Sarver (Rantoul Youth Wrestling) Fall 0:14</li>\n<li>Cons. Round 2 - Cohen Albatt (Triad Knights WC) won by major decision over Nathaniel Olivares (Notre Dame WC) Maj 8-0</li>\n<li>Cons. Round 2 - Brooks Tyler (Evanston School of Wrestling) won by fall over Asher VanDerMolen (St. Charles WC) Fall 2:05</li>\n<li>Cons. Round 2 - Destin Lathon (Williamsville WC) won by decision over Chance VenHuizen (Stockton Renegades WC) Dec 6-5</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>Cons. Round 2 - Travis Hinton Jr (Toss Em Up Wrestling Academy) won by decision over Garrett Ziller (Lockport Junior Porters WC) Dec 9-8</li>\n<li>Cons. Round 2 - Mason Henderson (Stockton Renegades WC) won by fall over Krystian Przychocki (Hinsdale Red Devil WC) Fall 0:59</li>\n<li>Cons. Round 2 - Patrick Martin (Crystal Lake Wizards WC) won by decision over Liam Carter (SJO Youth WC) Dec 7-0</li>\n<li>Cons. Round 2 - Musa Amin (Evanston School of Wrestling) won by fall over Carter Paduch (Scorpion WC) Fall 2:08</li>\n<li>Cons. Round 2 - Art Bytyqi (Evanston School of Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 2 - Levi Armstrong (Peoria Razorbacks WC) won by fall over Charles Shelton (Mustang WC) Fall 0:39</li>\n<li>Cons. Round 2 - Jacksyn Windham (Hawk WC) won by fall over Braylon Cunningham (Edwardsville WC) Fall 2:21</li>\n<li>Cons. Round 2 - Angelo Ngoho (Champaign WC) won by fall over Tommy Beverly (Panther WC) Fall 1:19</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Olivia Rosine (Charleston WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Abdulrahman Abukhdeir (Badger WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jacob Garcia (Martinez Fox Valley Elite WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Owen Kommer (Gladiator Elite WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Cons. Round 2 - Paul Ryan (Argenta-Oreana Kids WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Julian Godina (Lincoln-Way WC) won by fall over Matthew Porter (Murphysboro Wrestling) Fall 0:31</li>\n<li>Cons. Round 2 - Camden Chapman (Gladiator Elite WC) won by fall over Liko Garrett (Gladiator Elite WC) Fall 2:59</li>\n<li>Cons. Round 2 - Brayden Graves (Lincoln-Way WC) won by fall over Jordan Reitz (Little Falcons WC) Fall 1:08</li>\n<li>Cons. Round 2 - Jake Dulumback (Effingham Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Vincent Cumbo (Vittum Cats WC) won by major decision over Caleb Bell (Frankfort Wildcats Wrestling) Maj 9-0</li>\n<li>Cons. Round 2 - Abigail Godard (Edwardsville WC) won by fall over Jason Beyer (Blackhawk WC) Fall 1:57</li>\n<li>Cons. Round 2 - Baylee Nehring (Sauk Valley WC) won by fall over Tanner Ekstrom (Rock Island WC) Fall 1:59</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Cons. Round 2 - Kru McDonald (SJO Youth WC) won by fall over Karsen Jorgensen (Argenta-Oreana Kids WC) Fall 2:41</li>\n<li>Cons. Round 2 - Jaxon Fraedrich (Team El1te Wrestling) won by major decision over Marshall Rajcevich (Crystal Lake Wizards WC) Maj 13-2</li>\n<li>Cons. Round 2 - Makai Steele (Olney Cubs WC) won by decision over Teddy Millard (Rochelle WC) Dec 7-6</li>\n<li>Cons. Round 2 - Mason Beattie (Fox Lake WC) won by decision over KyLynn Larkin (ISI WC) Dec 14-7</li>\n<li>Cons. Round 2 - Brody Wenninger (Champbuilders Wrestling) won by fall over Ronald Houk (Frankfort Wildcats Wrestling) Fall 1:20</li>\n<li>Cons. Round 2 - Grady Glowacki (Lakeland Predators WC) won by fall over Elijah Perez (Greg Gomez Trained Wrestling) Fall 0:28</li>\n<li>Cons. Round 2 - Noah Flores (Force Elite WC) won by fall over Dominic Macellaio (Little Falcons WC) Fall 4:10</li>\n<li>Cons. Round 2 - Braylyn Shirley (Sauk Valley WC) won by fall over Tyler Vail (Lincoln-Way WC) Fall 0:08</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Cons. Round 2 - Thomas Blanke (Barrington Broncos WC) won by fall over Quinn Peight (The Law WC) Fall 2:20</li>\n<li>Cons. Round 2 - Noah Thomas (Bulls WC) won by fall over Gage Enos (Batavia WC) Fall 2:43</li>\n<li>Cons. Round 2 - Tyler Sullivan (Sycamore WC) won by fall over Isaiah Reynolds (SJO Youth WC) Fall 2:21</li>\n<li>Cons. Round 2 - William Bousk (Arlington Cardinals WC) won by decision over Maximus Aye (St. Charles WC) Dec 7-6</li>\n<li>Cons. Round 2 - Travis Wilgosiewicz (ISI WC) won by major decision over Benjamin Knapp (Vittum Cats WC) Maj 13-0</li>\n<li>Cons. Round 2 - Colt Rosentreter (Carlinville WC) won by fall over Lorenzo Gonzalez (Force Elite WC) Fall 2:47</li>\n<li>Cons. Round 2 - Nikolas Oyervides (Oak Forest Warriors WC) won by decision over Bentley Morse (Storm Youth WC) Dec 4-0</li>\n<li>Cons. Round 2 - Caleb Callaghan (Lincoln-Way WC) won by decision over Armin O`Guin (Southern Illinois Bulldogs WC) Dec 3-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Ian Rotramel (SOT-C) won by decision over Gavin Somers (Unity Youth WC) Dec 7-4</li>\n<li>Cons. Round 2 - Clark Goodwin (Lincoln-Way WC) won by decision over Drevan Bramlett (Trico WC) Dec 3-2</li>\n<li>Cons. Round 2 - Noah Rauen (Force Elite WC) won in sudden victory - 1 over Titus Harkleroad (Storm Youth WC) SV-1 7-5</li>\n<li>Cons. Round 2 - David Wesierski (ISI WC) won by major decision over Evan Gill (Edwardsville WC) Maj 11-0</li>\n<li>Cons. Round 2 - Devin DiSilvestro (Greg Gomez Trained Wrestling) won by fall over Luke Drexel (Frankfort Wildcats Wrestling) Fall 3:27</li>\n<li>Cons. Round 2 - Rylan Glauser (Fox Lake WC) won by decision over Zachary Wilson (Moline WC) Dec 4-3</li>\n<li>Cons. Round 2 - Salvatore Sheridan (SCN Youth WC) won by fall over Dominic Melody (Mat Rat WC) Fall 0:52</li>\n<li>Cons. Round 2 - Braxton McCall (O`Fallon Little Panthers WC) won by tech fall over Kayden Cover (Hawk WC) TF 18-2</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Cons. Round 2 - Brady Lowe (SOT-C) won by fall over Nico Rangel (Storm Youth WC) Fall 4:09</li>\n<li>Cons. Round 2 - Liam Schroeder (Sycamore WC) won by decision over Brayden Johnson (SCN Youth WC) Dec 5-0</li>\n<li>Cons. Round 2 - Adonis Washington (Harvey Twisters WC) won by fall over Aiden Sinetos (nWo WC) Fall 3:25</li>\n<li>Cons. Round 2 - Riley Smith (Carlinville WC) won by fall over Cress Maddox (Williamsville WC) Fall 1:48</li>\n<li>Cons. Round 2 - Jack Benesh (Hawk WC) won by fall over Jadiel Castillo (Mat Rat WC) Fall 2:33</li>\n<li>Cons. Round 2 - Nolan Glynn (Lincoln-Way WC) won by major decision over Charlie Datz (Batavia WC) Maj 8-0</li>\n<li>Cons. Round 2 - Charlie Strezo (Lincoln-Way WC) won by fall over Griffin Diehl (Murphysboro Wrestling) Fall 1:15</li>\n<li>Cons. Round 2 - Aaron Griffin Jr (Harvey Twisters WC) won by major decision over Gabriel Thornquist (East Peoria River Bandits Wrestling) Maj 12-1</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Cons. Round 2 - Alec Daly (Unity Youth WC) won by major decision over Peyton Nowicki (Champaign WC) Maj 9-0</li>\n<li>Cons. Round 2 - Brogan Sendele (Hononegah WC) won by decision over Marcus Smith (Fox Valley WC) Dec 8-2</li>\n<li>Cons. Round 2 - Vannak Khiev (Mat Rat WC) won by fall over Chris Jones (Martinez Fox Valley Elite WC) Fall 0:57</li>\n<li>Cons. Round 2 - Lucas Macdonald (ISI WC) won by decision over Bennett Johnson (Moline WC) Dec 5-4</li>\n<li>Cons. Round 2 - Jeremy Powell Jr (Harvey Twisters WC) won by decision over Rudolph Mihelich (Callan Wrestling Academy) Dec 6-1</li>\n<li>Cons. Round 2 - Jase Edrington (Storm Youth WC) won by decision over Parker Gestes (Edwardsville WC) Dec 4-1</li>\n<li>Cons. Round 2 - Carl Cody Weidner (Combative Sports Athletic Center Wrestling) won by major decision over Cole Pilliard (Triad Knights WC) Maj 13-3</li>\n<li>Cons. Round 2 - Mickey Olszta (Lincoln-Way WC) won by fall over Everett Garretson (Yorkville WC) Fall 4:25</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Cons. Round 2 - Camden Spiniolas (Richmond WC) won by fall over Trotter Titus (Mattoon Youth WC) Fall 0:46</li>\n<li>Cons. Round 2 - Owen Catalano (Fox Lake WC) won by fall over Ashlie Penovich (Arlington Cardinals WC) Fall 0:51</li>\n<li>Cons. Round 2 - Landen Vincent (Blue Line Training Academy) won by major decision over Matthew Blanke (Barrington Broncos WC) Maj 8-0</li>\n<li>Cons. Round 2 - Lucas Forsythe (Lincoln-Way WC) won by decision over Jaxon Lynn (Lion`s Den Wrestling Academy) Dec 8-3</li>\n<li>Cons. Round 2 - Santiago Trejo (Southside Outlaws WC) won by fall over Archer Biag (Naperville WC) Fall 2:10</li>\n<li>Cons. Round 2 - Gabriel Richmond (Batavia WC) won by fall over Nathan Frankowitch (Red Raiders Wrestling Team) Fall 3:40</li>\n<li>Cons. Round 2 - Eli Quartz (Southern Illinois Bulldogs WC) won by fall over Joseph Torrence (Greg Gomez Trained Wrestling) Fall 3:45</li>\n<li>Cons. Round 2 - Nolan Chrisse (Bolingbrook Junior Raiders WC) won by fall over Luca Filice (Mat Rat WC) Fall 1:46</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Cons. Round 2 - Rylan Poeta (Champaign WC) won by fall over Mitchell Aukes (Marengo Youth WC) Fall 4:14</li>\n<li>Cons. Round 2 - Joshua Edelheit (Junior Titans Wrestling) won by decision over Justin Green (Elk Grove Junior Grens WC) Dec 7-0</li>\n<li>Cons. Round 2 - Vincente Halverson (Tribe WC) won by decision over Braden Opperman (Pontiac WC) Dec 3-0</li>\n<li>Cons. Round 2 - Gabriel Travis Jr (Will County Warriors WC) won by fall over Gabriel Eldridge (Herrin Junior WC) Fall 1:52</li>\n<li>Cons. Round 2 - Vinn Tunis (Lemont Bears WC) won by decision over Tavarius Briar (nWo WC) Dec 7-3</li>\n<li>Cons. Round 2 - Rain Scott (Springs Elite WC) won by fall over Dominic Martinello (Fenton Jr. Bison WC) Fall 2:20</li>\n<li>Cons. Round 2 - Nathan Raban (Southern Illinois Bulldogs WC) won by decision over Charlotte Nold (Beat the Streets Chicago-Oak Park) Dec 6-3</li>\n<li>Cons. Round 2 - Rocky Delgado (Yorkville WC) won by fall over Colton Johnson (Falcon Youth WC) Fall 3:34</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Max Mandac (Lincoln-Way WC) won by fall over Stella Piazza (St. Charles WC) Fall 0:22</li>\n<li>Cons. Round 2 - Logan Woodbury (ISI WC) won by major decision over Braxton Glodo (Sparta Junior Bulldogs WC) Maj 10-2</li>\n<li>Cons. Round 2 - Omar Mendez (Lion`s Den Wrestling Academy) won by major decision over Connor Misner (Mt. Zion Kids WC) Maj 15-1</li>\n<li>Cons. Round 2 - Lucas Zhao (Downers Grove WC) won by major decision over John Gough (MadDog Wrestling Academy) Maj 14-3</li>\n<li>Cons. Round 2 - Cade Vazquez (Izzy Style Wrestling) won by decision over Martin Hernandez (Belvidere Bandits WC) Dec 4-1</li>\n<li>Cons. Round 2 - Nino Capuano (Beat the Streets Chicago-Hyde Park) won by decision over Thayer Larson (Demolition WC) Dec 11-4</li>\n<li>Cons. Round 2 - Corbin Brown (Tiger Town Tanglers WC) won by decision over Andrew Ayala-Mendoza (Beat the Streets Chicago-Midway) Dec 8-2</li>\n<li>Cons. Round 2 - Jesse Swiney (Champaign WC) won by fall over Giovanni Soto (Fox Lake WC) Fall 2:34</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Cons. Round 2 - Damir Duharkic (MadDog Wrestling Academy) won by fall over Frank Watson (Saber WC) Fall 0:36</li>\n<li>Cons. Round 2 - Ricky Alfaro (Tribe WC) won by fall over Owen Feltz (Demolition WC) Fall 0:27</li>\n<li>Cons. Round 2 - Brooks Auker (Alber Athletics WC) won by fall over Myles Monis (Stampede WC) Fall 3:52</li>\n<li>Cons. Round 2 - Gregory Harkey (Bulls WC) won by fall over Ivy Grant (Urbana Tigers WC) Fall 0:45</li>\n<li>Cons. Round 2 - Ryker Long (Demolition WC) won in tie breaker - 1 over Michael Rowe (Oak Forest Warriors WC) TB-1 1-0</li>\n<li>Cons. Round 2 - Connor Kern (Yorkville WC) won by decision over Lucas Youmara (Evanston School of Wrestling) Dec 7-0</li>\n<li>Cons. Round 2 - Noah Cerny (Red Raiders Wrestling Team) won by decision over Joseph Cameron (Built By Brunson Wrestling) Dec 9-2</li>\n<li>Cons. Round 2 - Andrew Vliek (Wheaton Tigers WC) won by fall over Joseph Vela (Vittum Cats WC) Fall 1:20</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Cons. Round 2 - Rico Silvestre (Harvey Twisters WC) won by decision over Brier Mcpeek (Stockton Renegades WC) Dec 7-3</li>\n<li>Cons. Round 2 - Brannick Alexander (Alber Athletics WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Dimetri Kean (Demolition WC) won in double overtime over Emily Taylor (Belvidere Bandits WC) 2-OT 3-3</li>\n<li>Cons. Round 2 - Jaret Waters (Road Warriors WC) won by fall over Brady Thompson (Eureka WC) Fall 2:35</li>\n<li>Cons. Round 2 - Hudson Wesley (Bulls WC) won by fall over Ryan Costello (Mustang WC) Fall 1:04</li>\n<li>Cons. Round 2 - Keandre Towns (Champaign WC) won by fall over Antonio Reyes (Beat the Streets Chicago-Avondale) Fall 0:28</li>\n<li>Cons. Round 2 - Dennis Hawthorne (Urbana Tigers WC) won by fall over Blake Vande Loo (Batavia WC) Fall 1:14</li>\n<li>Cons. Round 2 - Jayden Hermacinski (Peoria Razorbacks WC) won by fall over Pearce Estrada (Toss Em Up Wrestling Academy) Fall 4:09</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Cons. Round 2 - Piper Sandell (Stockton Renegades WC) won by decision over Levi Pretzsch (Dixon WC) Dec 5-2</li>\n<li>Cons. Round 2 - Juan Velez (Southside Outlaws WC) won by decision over Wyatt Stacy (Xtreme WC) Dec 11-7</li>\n<li>Cons. Round 2 - Owen Alderson (Williamsville WC) won by fall over Reid Balis (Naperville WC) Fall 4:01</li>\n<li>Cons. Round 2 - George Arvanitis (Maine Eagles WC) won by fall over Jack Dykes (TJ Trained Wrestling) Fall 3:17</li>\n<li>Cons. Round 2 - Jordan Myers (Murphysboro Wrestling) won by decision over Benjamin Morris (Rochelle WC) Dec 6-3</li>\n<li>Cons. Round 2 - Jaxton Carroll (Vandalia Jr WC) won by fall over Kellan Breen (Bolingbrook Junior Raiders WC) Fall 2:09</li>\n<li>Cons. Round 2 - Harrison Yankellow (Beat the Streets Chicago-Avondale) won by fall over Oliver Hoke (Crawford County WC) Fall 0:46</li>\n<li>Cons. Round 2 - Austin Bielski (Elevate Wrestling Academy) won by decision over Anastasia Rodnikova (Force Elite WC) Dec 3-0</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Cons. Round 2 - Payton Chanerl (East St. Louis WC) won by fall over Jax Arocho (Orland Park Pioneers WC) Fall 2:11</li>\n<li>Cons. Round 2 - Adam Carrick (Sycamore WC) won by decision over Maison Toliver (Peoria Heights Minutemen WC) Dec 6-4</li>\n<li>Cons. Round 2 - Michael Kimbrough (Blue Crew WC) won by fall over Eren Kurt (Champaign WC) Fall 1:04</li>\n<li>Cons. Round 2 - Julian Moon (Effingham Youth WC) won by tech fall over Robert Greenberg (Force Elite WC) TF 18-3</li>\n<li>Cons. Round 2 - Lucas Pretkelis (Tribe WC) won by fall over Wyatt Kinney (Hononegah WC) Fall 2:29</li>\n<li>Cons. Round 2 - Dane Olmstead (Southern Illinois Bulldogs WC) won by major decision over Martin Noth (Izzy Style Wrestling) Maj 11-0</li>\n<li>Cons. Round 2 - Isaiah Robinson (Beat the Streets Chicago-Bellwood) won by decision over Anthony Senese (Vittum Cats WC) Dec 6-2</li>\n<li>Cons. Round 2 - Evan Grove (TJ Trained Wrestling) won by fall over Devin Aviles (Fenton Jr. Bison WC) Fall 3:27</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Cons. Round 2 - Brayden Meeker (Storm Youth WC) won by fall over Wes Grilec (Oak Forest Warriors WC) Fall 0:54</li>\n<li>Cons. Round 2 - Kenneth Seggerson (Beat the Streets Chicago-Midway) received a bye   () Bye</li>\n<li>Cons. Round 2 - Charles Jacquez (Trico WC) won by major decision over Luke Zajicek (Elmhurst Titans Wrestling Academy) Maj 13-0</li>\n<li>Cons. Round 2 - Maddox McRoberts (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Matthew Murray (Sauk Valley WC) won by fall over Luke Vasquez (Lions WC) Fall 2:12</li>\n<li>Cons. Round 2 - Diego Lopez (Evanston School of Wrestling) won by fall over Jacob Magana (Wheaton Tigers WC) Fall 3:56</li>\n<li>Cons. Round 2 - Matthew Carver (MadDog Wrestling Academy) won by fall over Greyson Hohimer (Fox Valley WC) Fall 2:59</li>\n<li>Cons. Round 2 - Jack Hagerty (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Cons. Round 2 - Gregory Heavey (Wheaton Tigers WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Richard Butler (Crystal Lake Wizards WC) won by fall over Matthew Lowe (Edwardsville WC) Fall 3:48</li>\n<li>Cons. Round 2 - Blaine Becker (Belvidere Bandits WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Romeo Hernandez (Toss Em Up Wrestling Academy) won by fall over Christopher Fernandez (Aurora WC) Fall 0:55</li>\n<li>Cons. Round 2 - Michael Guerrero (Wolfpak WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jovany Gaytan (Blackhawk WC) won by fall over Keigan Hull (Lion`s Den Wrestling Academy) Fall 0:48</li>\n<li>Cons. Round 2 - Christian Paige (Oswego WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jack Monn (Fox Valley WC) won by fall over Brayden Hawkinson (Oak Forest Warriors WC) Fall 4:28</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) won by fall over Mason Waller (Pekin Boys &amp; Girls Club) Fall 4:11</li>\n<li>Cons. Round 2 - Samuel Swais (MadDog Wrestling Academy) won by fall over Jaiden Williams (Elevate Wrestling Academy) Fall 1:25</li>\n<li>Cons. Round 2 - Cayden Berryhill (G2 WC) won by fall over Harper Davis (Bulls WC) Fall 0:33</li>\n<li>Cons. Round 2 - Bradyn Haynes (Pekin Boys &amp; Girls Club) won by decision over Rowdy Vick (Storm Youth WC) Dec 4-2</li>\n<li>Cons. Round 2 - John Turner (Sycamore WC) won by fall over Raymond Morales (Lion`s Den Wrestling Academy) Fall 2:59</li>\n<li>Cons. Round 2 - Sean Cook (Notre Dame WC) won by fall over Tommy Yannias (Glenbard East Jr Rams WC) Fall 1:11</li>\n<li>Cons. Round 2 - Braylon Hill-Lomax (Edwardsville WC) won by fall over Luke Petravicz (Hononegah WC) Fall 1:57</li>\n<li>Cons. Round 2 - Angel Alcala (Aurora WC) won by fall over Remington Bryant (Charleston WC) Fall 3:55</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Josh Melsa (Naperville WC) won by fall over Joelten Griffin (Murphysboro Wrestling) Fall 2:35</li>\n<li>Cons. Round 2 - Christopher Korduplewski (Tinley Park Bulldogs WC) won by fall over Saul Pulido III (Izzy Style Wrestling) Fall 2:34</li>\n<li>Cons. Round 2 - Caybren Hubbard (Murphysboro Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jhuliyan Carter (Wolfpak WC) won by fall over Michael Fuller (Edwardsville WC) Fall 1:11</li>\n<li>Cons. Round 2 - Luke Heinen (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Hoyt Choate (Oswego WC) won by decision over Chase Paduch (Scorpion WC) Dec 2-0</li>\n<li>Cons. Round 2 - Trey Harris (Williamsville WC) won by fall over Jose Velazquez (Scorpion WC) Fall 1:04</li>\n<li>Cons. Round 2 - D`Anthony Brooks (Peoria Razorbacks WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Beckem Carney (St. Charles WC) won by fall over Jaxen Mitchell (PSF Wrestling Academy) Fall 1:07</li>\n<li>Cons. Round 2 - Jack Munn (Lincoln-Way WC) won by fall over Liam O`Shea (Tinley Park Bulldogs WC) Fall 4:13</li>\n<li>Cons. Round 2 - Kevin Bisonaya (Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Elijah Bell (Frankfort Wildcats Wrestling) won by fall over Owen Manning (Dinamo Wrestling) Fall 0:55</li>\n<li>Cons. Round 2 - Luthor Rajcevich (Crystal Lake Wizards WC) won by fall over Davin Torza (Bolingbrook Junior Raiders WC) Fall 2:59</li>\n<li>Cons. Round 2 - Ignacio Figueroa (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Zander Johnson (Lion`s Den Wrestling Academy) won by fall over Jacob Simon (Oak Forest Warriors WC) Fall 1:25</li>\n<li>Cons. Round 2 - Damon Glenn (Storm Youth WC) won by major decision over Chase Cook (Sycamore WC) Maj 16-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Christian Johnson (Blue Crew WC) won in sudden victory - 1 over Silas Harkleroad (Storm Youth WC) SV-1 7-5</li>\n<li>Cons. Round 2 - Wesley Smith (Carlinville WC) won by fall over Connor Willis (Arlington Cardinals WC) Fall 0:47</li>\n<li>Cons. Round 2 - Benjamin Jurkovic (Tinley Park Bulldogs WC) won by major decision over Dalton DeLong (Dwight WC) Maj 10-0</li>\n<li>Cons. Round 2 - Joseph Calvillo (Batavia WC) won by fall over Cooper Boron (Belleville Little Devils WC) Fall 3:43</li>\n<li>Cons. Round 2 - Hudson Anderton (Nomad Wrestling Academy) won by major decision over Draven Harris (Champaign WC) Maj 12-0</li>\n<li>Cons. Round 2 - Santino Pignatelli (Mat Rat WC) won by fall over Brody Sanders (Unity Youth WC) Fall 1:02</li>\n<li>Cons. Round 2 - Nathan Butcher (St. Charles WC) won by fall over Jayden Long (Highland Bulldog Jr. WC) Fall 2:19</li>\n<li>Cons. Round 2 - Colton Madison (Edwardsville WC) won by fall over Gage Hughes (Charleston WC) Fall 0:52</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Declan McReynolds (Blue Crew WC) won by fall over David Hooper (West Frankfort Jr. Redbirds WC) Fall 0:41</li>\n<li>Cons. Round 2 - Matthew Deutch (Southern Illinois Bulldogs WC) won by decision over Salah Dajani (Lincoln-Way WC) Dec 9-2</li>\n<li>Cons. Round 2 - Gerald Donnelly (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Preston Morrison (SCN Youth WC) won by tech fall over Cole Dulumback (Effingham Youth WC) TF 19-2</li>\n<li>Cons. Round 2 - Aiden Weber (Elevate Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 2 - Kaden Potter (St. Charles WC) won by fall over Camryn Chapman (nWo WC) Fall 2:46</li>\n<li>Cons. Round 2 - Nathan Ortiz (Tinley Park Bulldogs WC) won by major decision over Jacob Sebek (Oak Forest Warriors WC) Maj 11-1</li>\n<li>Cons. Round 2 - Brayden Bickett (Tiger Town Tanglers WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Cons. Round 2 - Roberto Rangel (Oak Forest Warriors WC) won by fall over Shaughn McAvoy (Pekin Boys &amp; Girls Club) Fall 3:56</li>\n<li>Cons. Round 2 - Lukas Quartz (Southern Illinois Bulldogs WC) won by fall over Ryan Rowan (Sycamore WC) Fall 1:02</li>\n<li>Cons. Round 2 - Leyton Bartley (Lincoln-Way WC) won by fall over Blair Grennan (Sauk Valley WC) Fall 0:59</li>\n<li>Cons. Round 2 - Nolan O`Grady (Oswego WC) won by fall over Drew Ritchie (Demolition WC) Fall 2:56</li>\n<li>Cons. Round 2 - Justin Forbes (Caravan Kids WC) won by tech fall over Cardevion Gordon (Beat the Streets Chicago-Bellwood) TF 17-2</li>\n<li>Cons. Round 2 - Hank Burge (Edwardsville WC) won by fall over Brody Johnson (Bulls WC) Fall 2:25</li>\n<li>Cons. Round 2 - Daniel Myint (Arlington Cardinals WC) won by fall over Jakob Geestman (River Bend WC) Fall 2:15</li>\n<li>Cons. Round 2 - Kyle Hayes (Contender Wrestling) won by fall over Jonathon Sebring (Marengo Youth WC) Fall 2:16</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Cons. Round 2 - Rielen Hermsen (Toss Em Up Wrestling Academy) won by fall over Kaleb Joyner (Peoria Razorbacks WC) Fall 3:59</li>\n<li>Cons. Round 2 - Kanton Richards (Murphysboro Wrestling) won by fall over Sean Serbinski (Naperville WC) Fall 1:30</li>\n<li>Cons. Round 2 - Dominic Pasquale (Izzy Style Wrestling) won by decision over William Howenstein (Fox Valley WC) Dec 9-4</li>\n<li>Cons. Round 2 - Declan Sons (St. Charles WC) won by major decision over Lucas Landry (Mustang WC) Maj 8-0</li>\n<li>Cons. Round 2 - Aidan Lopez (nWo WC) won by fall over Brayden Crawford (Belvidere Bandits WC) Fall 4:14</li>\n<li>Cons. Round 2 - Zayden Mansfield (Unity Youth WC) won by major decision over Jackson Schadegg (Southern Illinois Bulldogs WC) Maj 11-2</li>\n<li>Cons. Round 2 - Elijah Sawyers (Harvey Twisters WC) won by major decision over Alex Vanmastrigt (Sycamore WC) Maj 14-4</li>\n<li>Cons. Round 2 - Jt Theis (Frankfort Wildcats Wrestling) won by decision over Pedro Alberto Rangel (Storm Youth WC) Dec 3-2</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Cons. Round 2 - Colin Phelan (Bolingbrook Junior Raiders WC) won by fall over Gabriel Hernandez (Fenton Jr. Bison WC) Fall 1:48</li>\n<li>Cons. Round 2 - Michael Miranda (Team 312 WC) won by fall over Heath Ewins (El Paso Gridley Youth WC) Fall 2:51</li>\n<li>Cons. Round 2 - Kie Smith (Blue Line Training Academy) won by fall over Giuseppe Lomeli (Team El1te Wrestling) Fall 2:18</li>\n<li>Cons. Round 2 - Jarryion Agnew (Murphysboro Wrestling) won by major decision over Dakoda Hentz (Fighting Farmers WC) Maj 14-3</li>\n<li>Cons. Round 2 - Eric Hoselton (Lincoln-Way WC) won by decision over Jadyn Pearson (Fox Valley WC) Dec 7-5</li>\n<li>Cons. Round 2 - Kannon Judycki (Southside Outlaws WC) won by major decision over Kristian DeClercq (ISI WC) Maj 15-5</li>\n<li>Cons. Round 2 - Paxton Pyatt (Murphysboro Wrestling) won by fall over Jayden Hernandez (St. Charles WC) Fall 1:27</li>\n<li>Cons. Round 2 - Anthony Brown (Beat the Streets Chicago-Bellwood) won by decision over Max Moreno (Ottawa Wolfpack WC) Dec 9-2</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Cons. Round 2 - Nolan Lowe (SOT-C) won by decision over Robert Moss (Urbana Tigers WC) Dec 11-8</li>\n<li>Cons. Round 2 - Vincent Konecki (Yorkville WC) won by decision over Nathaniel Carroll (Team El1te Wrestling) Dec 10-4</li>\n<li>Cons. Round 2 - Kyrin King (Harvey Twisters WC) won by major decision over Michael Goolish (MadDog Wrestling Academy) Maj 14-0</li>\n<li>Cons. Round 2 - Jonathan Harris (Crosstown Spartan Elite WC) won by fall over Dylan McBride (Oak Forest Warriors WC) Fall 1:02</li>\n<li>Cons. Round 2 - Anthony Farina (Elevate Wrestling Academy) won in tie breaker - 1 over Deziree Azar (Naperville WC) TB-1 2-1</li>\n<li>Cons. Round 2 - Logan Aaron (Cumberland Youth WC) won by fall over Devon Swope (DC WC) Fall 0:52</li>\n<li>Cons. Round 2 - Daniel Skura (Tribe WC) won by major decision over Robert Williams (Harvey Twisters WC) Maj 14-5</li>\n<li>Cons. Round 2 - Tyler Lachenberg (Lincoln-Way WC) won by tech fall over Xander Humphrey (Edwardsville WC) TF 17-2</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Cons. Round 2 - Malachi Hutchinson (Urbana Tigers WC) won by decision over Avery Crouch (SOT-C) Dec 7-1</li>\n<li>Cons. Round 2 - Jacob Alvarez (Izzy Style Wrestling) won by major decision over Samuel Cushman (Barrington Broncos WC) Maj 16-6</li>\n<li>Cons. Round 2 - Keegan Germano (Unity Youth WC) won by fall over Alexander Korpan (St. Charles WC) Fall 4:25</li>\n<li>Cons. Round 2 - Sawyer Valdez (Sycamore WC) won by decision over Colton Sadaka (Edwardsville WC) Dec 10-7</li>\n<li>Cons. Round 2 - Max Mulhearn (Riot Room Wrestling) won by major decision over Daniel Martino (Yorkville WC) Maj 9-0</li>\n<li>Cons. Round 2 - Michael Malizzio (Team El1te Wrestling) won by tech fall over Jeremiah Corona (Mustang WC) TF 16-0</li>\n<li>Cons. Round 2 - Eddie Astorga (Mustang WC) won by fall over Caiden Heath (Clipper WC) Fall 4:03</li>\n<li>Cons. Round 2 - Eliud Lombardia (Rochelle WC) won by fall over Dakota Royer (Blue Crew WC) Fall 2:37</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Cons. Round 2 - Taylor Finley (Unity Youth WC) won by decision over Jackson Ponto (Fox Valley WC) Dec 2-0</li>\n<li>Cons. Round 2 - Jayden Dohogne (St. Charles WC) won by tech fall over Nate Page (Gladiator Elite WC) TF 18-2</li>\n<li>Cons. Round 2 - Say-Vair Williams (Murphysboro Wrestling) won by fall over Cody Culbertson (Rantoul Youth Wrestling) Fall 0:30</li>\n<li>Cons. Round 2 - Jaden Penna (Headlock Wrestling Academy) won by major decision over Cole Littlejohn (Crawford County WC) Maj 16-6</li>\n<li>Cons. Round 2 - Malan Njumbe-Hatfield (Blackhawk WC) won by major decision over Daniel Snow (Crystal Lake Wizards WC) Maj 14-3</li>\n<li>Cons. Round 2 - Isaac Mayora (Bolingbrook Junior Raiders WC) won by fall over Melik Robinson (Springs Elite WC) Fall 2:34</li>\n<li>Cons. Round 2 - Tony Lombardo (Southside Outlaws WC) won in sudden victory - 1 over Nick Zuehlke (Crystal Lake Wizards WC) SV-1 7-5</li>\n<li>Cons. Round 2 - Brody Hinkle (MadDog Wrestling Academy) won by fall over Harley Pierce (Cumberland Youth WC) Fall 4:06</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Cons. Round 2 - Thomas Ware (SJO Youth WC) won by fall over Jackson Fisher-Foth (Champaign WC) Fall 0:59</li>\n<li>Cons. Round 2 - Grayson Garcia (Fitz Wrestling Academy) won by fall over Nolan O`Shea (Elevate Wrestling Academy) Fall 0:48</li>\n<li>Cons. Round 2 - Antonio Toliver (Peoria Heights Minutemen WC) won by decision over Uriah Beamon (Red Raiders Wrestling Team) Dec 10-7</li>\n<li>Cons. Round 2 - Daniel Lynch (Tinley Park Bulldogs WC) won by fall over Aiden Prendergast (Pontiac WC) Fall 0:35</li>\n<li>Cons. Round 2 - Ethan Harvey (Lincoln-Way WC) won by decision over Lucas Parker (West Frankfort Jr. Redbirds WC) Dec 6-5</li>\n<li>Cons. Round 2 - Daniel Gonzalez (Aurora WC) won by medical forfeit over Colton Huff (Evanston School of Wrestling) MFF</li>\n<li>Cons. Round 2 - Alex Rink (Sycamore WC) won by decision over Brysen Manly (nWo WC) Dec 2-1</li>\n<li>Cons. Round 2 - Brian Correa (Martinez Fox Valley Elite WC) won by tech fall over Marco Rafael (Mat Rat WC) TF 18-2</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Cons. Round 2 - Alexander Mager (Rantoul Youth Wrestling) won by major decision over Piper McGinnis (Cumberland Youth WC) Maj 9-0</li>\n<li>Cons. Round 2 - Allante Jackson (Beat the Streets Chicago-Bellwood) won by decision over Logan Yerkey (Frankfort Wildcats Wrestling) Dec 9-3</li>\n<li>Cons. Round 2 - Benjamin Mullins (Crawford County WC) won by decision over Brody Ketelaar (Lincoln-Way WC) Dec 5-0</li>\n<li>Cons. Round 2 - Chase Siguenza (Tribe WC) won by major decision over Xavier Smiley (Mat Rat WC) Maj 13-5</li>\n<li>Cons. Round 2 - Brody Stien (Alber Athletics WC) won by major decision over Zachary Michaud (Beat the Streets Chicago-Oak Park) Maj 11-2</li>\n<li>Cons. Round 2 - Donncha Souza (Yorkville WC) won by major decision over Jayden Britton (Blackhawk WC) Maj 9-0</li>\n<li>Cons. Round 2 - Daithan Narayanan (Batavia WC) won by fall over Riley Mason (Sauk Valley WC) Fall 1:10</li>\n<li>Cons. Round 2 - Benjamin Anderson (Sycamore WC) won by decision over Jackson Spizzirri (Junior Cougar WC) Dec 8-5</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Cons. Round 2 - Jayden Schmick (DC WC) won by fall over Sergio Baity (Urbana Tigers WC) Fall 0:42</li>\n<li>Cons. Round 2 - Xander Keslin (Force Elite WC) won by fall over Logan Tanner (Murphysboro Wrestling) Fall 1:01</li>\n<li>Cons. Round 2 - Justin Langford (Lincoln-Way WC) won by injury default over Earl Kelnhofer (Hoopeston Area WC) Inj. 1:30</li>\n<li>Cons. Round 2 - Nicolas Olvera (Naperville WC) won by fall over Elias Mueller (DC WC) Fall 0:55</li>\n<li>Cons. Round 2 - Corey Robinson (East St. Louis WC) won by decision over Arkail Griffin Edwards (Beat the Streets Chicago-Midway) Dec 3-1</li>\n<li>Cons. Round 2 - Isaac Saldana (Bolingbrook Junior Raiders WC) won by fall over Michael Flatley (Lakeland Predators WC) Fall 1:01</li>\n<li>Cons. Round 2 - Bryce Bryant (Williamsville WC) won in sudden victory - 1 over Benjamin Menzer (Wheaton Tigers WC) SV-1 11-6</li>\n<li>Cons. Round 2 - Jasper Hintz (Red Raiders Wrestling Team) won by fall over Aleksander Knapik (Team 312 WC) Fall 1:12</li>\n</ul>\n</section>",
  "Champ Quarters & Consolation 2nd Round": "<section class=\"tw-list\">\n<h1>Champ Quarters &amp; Consolation 2nd Round</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>Quarterfinal - Eli Miller (Granite City Wrestling Association) won by fall over Quinn Hogan (Greg Gomez Trained Wrestling) Fall 0:19</li>\n<li>Quarterfinal - Aiden Rodriguez (ISI WC) won in tie breaker - 1 over Zion Silvestre (Harvey Twisters WC) TB-1 3-2</li>\n<li>Quarterfinal - Logan Boley (Marengo Youth WC) won by major decision over Rex Chavez-Jimenez (Downers Grove WC) Maj 11-2</li>\n<li>Quarterfinal - Daniel Jackson (Southern Illinois Bulldogs WC) won by fall over Xavier Pratt (Crosstown Spartan Elite WC) Fall 2:15</li>\n<li>Cons. Round 3 - Nathan Vogler (Oak Forest Warriors WC) won by fall over Finnegan Larkin (Lockport Junior Porters WC) Fall 2:33</li>\n<li>Cons. Round 3 - Brendan Weber (Fox Lake WC) won by fall over Marcus Robinson (Peoria Razorbacks WC) Fall 2:20</li>\n<li>Cons. Round 3 - Cohen Albatt (Triad Knights WC) won by major decision over Harrison Sneathen (Beat the Streets Chicago-Oak Park) Maj 10-0</li>\n<li>Cons. Round 3 - Brooks Tyler (Evanston School of Wrestling) won by fall over Destin Lathon (Williamsville WC) Fall 2:43</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>Quarterfinal - Jake Luedtke (Tinley Park Bulldogs WC) won by fall over Knox Homola (Riot Room Wrestling) Fall 1:18</li>\n<li>Quarterfinal - Cash Wetenkamp (Lincoln-Way WC) won in sudden victory - 1 over Gentry Michels (Olney Cubs WC) SV-1 2-0</li>\n<li>Quarterfinal - Rage Henderson (Gladiator Elite WC) won by fall over Luka Rankovic (Naperville WC) Fall 0:40</li>\n<li>Quarterfinal - Anthony Samanich (Lockport Junior Porters WC) won by decision over Samuel Golladay (Williamsville WC) Dec 9-6</li>\n<li>Cons. Round 3 - Mason Henderson (Stockton Renegades WC) won by fall over Travis Hinton Jr (Toss Em Up Wrestling Academy) Fall 1:00</li>\n<li>Cons. Round 3 - Patrick Martin (Crystal Lake Wizards WC) won by fall over Musa Amin (Evanston School of Wrestling) Fall 2:33</li>\n<li>Cons. Round 3 - Art Bytyqi (Evanston School of Wrestling) won by fall over Levi Armstrong (Peoria Razorbacks WC) Fall 2:24</li>\n<li>Cons. Round 3 - Angelo Ngoho (Champaign WC) won by decision over Jacksyn Windham (Hawk WC) Dec 6-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Michael Limon-Prado (Bulldog Elite WC) won by decision over Timothy Harrison (Harvey Twisters WC) Dec 3-2</li>\n<li>Quarterfinal - Donovan Olmstead (Southern Illinois Bulldogs WC) won by fall over Anthony Salcedo (Harvard WC) Fall 0:15</li>\n<li>Quarterfinal - Cameron Casey (Team Mascoutah WC) won by fall over Nathan German (Toss Em Up Wrestling Academy) Fall 3:38</li>\n<li>Quarterfinal - Asher Acevedo (Stockton Renegades WC) won by decision over Waleed Fuqaha (Badger WC) Dec 5-4</li>\n<li>Cons. Round 3 - Olivia Rosine (Charleston WC) received a bye   () Bye</li>\n<li>Cons. Round 3 - Abdulrahman Abukhdeir (Badger WC) received a bye   () Bye</li>\n<li>Cons. Round 3 - Jacob Garcia (Martinez Fox Valley Elite WC) received a bye   () Bye</li>\n<li>Cons. Round 3 - Owen Kommer (Gladiator Elite WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Quarterfinal - Cannon Ziller (Hawk WC) won by fall over Caleb Pate (SCN Youth WC) Fall 1:08</li>\n<li>Quarterfinal - Jackson Allen (G2 WC) won by decision over Cobey Stulce (Southern Illinois Bulldogs WC) Dec 9-6</li>\n<li>Quarterfinal - Calvin Babcock (St. Charles WC) won by decision over Archer Smith (Hononegah WC) Dec 3-0</li>\n<li>Quarterfinal - Kamari Tate (Englewood Live Wire WC) won by fall over Tenli Madriles (Crystal Lake Wizards WC) Fall 3:42</li>\n<li>Cons. Round 3 - Julian Godina (Lincoln-Way WC) won by fall over Paul Ryan (Argenta-Oreana Kids WC) Fall 0:53</li>\n<li>Cons. Round 3 - Camden Chapman (Gladiator Elite WC) won by major decision over Brayden Graves (Lincoln-Way WC) Maj 11-2</li>\n<li>Cons. Round 3 - Vincent Cumbo (Vittum Cats WC) won by decision over Jake Dulumback (Effingham Youth WC) Dec 5-2</li>\n<li>Cons. Round 3 - Abigail Godard (Edwardsville WC) won by fall over Baylee Nehring (Sauk Valley WC) Fall 1:04</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Quarterfinal - Grayson Anderton (Nomad Wrestling Academy) won by decision over Rocco Maheras (Vittum Cats WC) Dec 3-0</li>\n<li>Quarterfinal - Giovonni Nix (Englewood Live Wire WC) won by tech fall over Bennett Hoffberg (St. Charles WC) TF 18-3</li>\n<li>Quarterfinal - Aden Spinelli (nWo WC) won by fall over Dayton Patterson (Vandalia Jr WC) Fall 0:53</li>\n<li>Quarterfinal - Jimmy Roach (Panther WC) won by decision over Eli Schaefer (Southern Illinois Bulldogs WC) Dec 4-2</li>\n<li>Cons. Round 3 - Jaxon Fraedrich (Team El1te Wrestling) won by fall over Kru McDonald (SJO Youth WC) Fall 0:36</li>\n<li>Cons. Round 3 - Mason Beattie (Fox Lake WC) won by major decision over Makai Steele (Olney Cubs WC) Maj 12-4</li>\n<li>Cons. Round 3 - Grady Glowacki (Lakeland Predators WC) won by fall over Brody Wenninger (Champbuilders Wrestling) Fall 2:09</li>\n<li>Cons. Round 3 - Noah Flores (Force Elite WC) won by decision over Braylyn Shirley (Sauk Valley WC) Dec 14-7</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Quarterfinal - Easton McDonnell (Lincoln-Way WC) won in sudden victory - 1 over Brady Myatt (Fox Lake WC) SV-1 4-2</li>\n<li>Quarterfinal - Wesley Janick (nWo WC) won by decision over Fran Blake (Panther WC) Dec 7-0</li>\n<li>Quarterfinal - Reese Babcock (St. Charles WC) won by fall over Maddux Kennedy (Blue Line Training Academy) Fall 0:32</li>\n<li>Quarterfinal - Carter Noonan (Ottawa Wolfpack WC) won by decision over Cameron Ramp (SOT-C) Dec 3-0</li>\n<li>Cons. Round 3 - Noah Thomas (Bulls WC) won by decision over Thomas Blanke (Barrington Broncos WC) Dec 2-0</li>\n<li>Cons. Round 3 - William Bousk (Arlington Cardinals WC) won by major decision over Tyler Sullivan (Sycamore WC) Maj 13-2</li>\n<li>Cons. Round 3 - Colt Rosentreter (Carlinville WC) won by fall over Travis Wilgosiewicz (ISI WC) Fall 0:45</li>\n<li>Cons. Round 3 - Caleb Callaghan (Lincoln-Way WC) won by fall over Nikolas Oyervides (Oak Forest Warriors WC) Fall 1:30</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Crue Hatchell (Southside Outlaws WC) won by major decision over Landon Near (nWo WC) Maj 11-2</li>\n<li>Quarterfinal - Hogan Rice (St. Charles WC) won by decision over Elijah Nadig (Alber Athletics WC) Dec 6-3</li>\n<li>Quarterfinal - Erik Klichurov (Izzy Style Wrestling) won by decision over Liam Kissane (Tinley Park Bulldogs WC) Dec 7-0</li>\n<li>Quarterfinal - Santino Scardina (Lions WC) won by decision over Cale Dauber (Ottawa Wolfpack WC) Dec 3-2</li>\n<li>Cons. Round 3 - Clark Goodwin (Lincoln-Way WC) won by decision over Ian Rotramel (SOT-C) Dec 2-0</li>\n<li>Cons. Round 3 - Noah Rauen (Force Elite WC) won by decision over David Wesierski (ISI WC) Dec 5-2</li>\n<li>Cons. Round 3 - Devin DiSilvestro (Greg Gomez Trained Wrestling) won by decision over Rylan Glauser (Fox Lake WC) Dec 1-0</li>\n<li>Cons. Round 3 - Braxton McCall (O`Fallon Little Panthers WC) won by fall over Salvatore Sheridan (SCN Youth WC) Fall 2:42</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Quarterfinal - Jaden Washington (Harvey Twisters WC) won by decision over Jeffrey Dunaway (St. Charles WC) Dec 7-2</li>\n<li>Quarterfinal - Cael Saldana (Toss Em Up Wrestling Academy) won in sudden victory - 1 over Colin Crouch (Triad Knights WC) SV-1 7-3</li>\n<li>Quarterfinal - Finn McDermott (Force Elite WC) won by fall over Maddux Rabczak (Alber Athletics WC) Fall 0:29</li>\n<li>Quarterfinal - Owen Thomas (Toss Em Up Wrestling Academy) won by decision over Tad Moore (Blue Line Training Academy) Dec 4-3</li>\n<li>Cons. Round 3 - Liam Schroeder (Sycamore WC) won by fall over Brady Lowe (SOT-C) Fall 3:35</li>\n<li>Cons. Round 3 - Adonis Washington (Harvey Twisters WC) won by fall over Riley Smith (Carlinville WC) Fall 4:14</li>\n<li>Cons. Round 3 - Jack Benesh (Hawk WC) won by fall over Nolan Glynn (Lincoln-Way WC) Fall 0:57</li>\n<li>Cons. Round 3 - Charlie Strezo (Lincoln-Way WC) won by decision over Aaron Griffin Jr (Harvey Twisters WC) Dec 1-0</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Quarterfinal - Nikolas Duarte (Arlington Cardinals WC) won by decision over Obadiah Willis (Beat the Streets Chicago-Midway) Dec 4-2</li>\n<li>Quarterfinal - Daniel Zuehlke (Crystal Lake Wizards WC) won by major decision over Griffin Heeney (Elevate Wrestling Academy) Maj 14-4</li>\n<li>Quarterfinal - Te`Jon Beals (Harvey Twisters WC) won by fall over Jack Bashore (Batavia WC) Fall 0:57</li>\n<li>Quarterfinal - Rhyis Polenske (Blue Line Training Academy) won by decision over Kiernan Delaney (Toss Em Up Wrestling Academy) Dec 8-5</li>\n<li>Cons. Round 3 - Alec Daly (Unity Youth WC) won by major decision over Brogan Sendele (Hononegah WC) Maj 9-1</li>\n<li>Cons. Round 3 - Vannak Khiev (Mat Rat WC) won by decision over Lucas Macdonald (ISI WC) Dec 5-0</li>\n<li>Cons. Round 3 - Jase Edrington (Storm Youth WC) won by decision over Jeremy Powell Jr (Harvey Twisters WC) Dec 6-4</li>\n<li>Cons. Round 3 - Carl Cody Weidner (Combative Sports Athletic Center Wrestling) won by major decision over Mickey Olszta (Lincoln-Way WC) Maj 8-0</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Quarterfinal - Cameron Young (Alber Athletics WC) won by decision over Jonathan Fields (Mustang WC) Dec 4-2</li>\n<li>Quarterfinal - Brody Page (Yorkville WC) won by tech fall over Hayden Smith (Unity Youth WC) TF 18-3</li>\n<li>Quarterfinal - Ethan Hamilton (Harvey Twisters WC) won in sudden victory - 1 over Colton Schultz (Callan Wrestling Academy) SV-1 6-4</li>\n<li>Quarterfinal - Jeremiah Hayes (Warrior Wrestling) won by decision over Maximus Pearch (nWo WC) Dec 7-1</li>\n<li>Cons. Round 3 - Owen Catalano (Fox Lake WC) won by major decision over Camden Spiniolas (Richmond WC) Maj 10-1</li>\n<li>Cons. Round 3 - Landen Vincent (Blue Line Training Academy) won by major decision over Lucas Forsythe (Lincoln-Way WC) Maj 10-2</li>\n<li>Cons. Round 3 - Santiago Trejo (Southside Outlaws WC) won by tech fall over Gabriel Richmond (Batavia WC) TF 15-0</li>\n<li>Cons. Round 3 - Nolan Chrisse (Bolingbrook Junior Raiders WC) won by decision over Eli Quartz (Southern Illinois Bulldogs WC) Dec 8-1</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Quarterfinal - Kane Dauber (Ottawa Wolfpack WC) won by fall over Kai Balice (Naperville WC) Fall 1:08</li>\n<li>Quarterfinal - Lincoln Mack (Bolingbrook Junior Raiders WC) won by decision over Dylan Curtis (Sycamore WC) Dec 10-6</li>\n<li>Quarterfinal - Dylan Knaus (ISI WC) won by decision over Colton Stearns (Granite City Wrestling Association) Dec 7-0</li>\n<li>Quarterfinal - Maddox Stonitsch (Lincoln-Way WC) won in tie breaker - 1 over Jackson Wells (Batavia WC) TB-1 3-2</li>\n<li>Cons. Round 3 - Rylan Poeta (Champaign WC) won by decision over Joshua Edelheit (Junior Titans Wrestling) Dec 1-0</li>\n<li>Cons. Round 3 - Vincente Halverson (Tribe WC) won by fall over Gabriel Travis Jr (Will County Warriors WC) Fall 4:26</li>\n<li>Cons. Round 3 - Rain Scott (Springs Elite WC) won by decision over Vinn Tunis (Lemont Bears WC) Dec 4-3</li>\n<li>Cons. Round 3 - Nathan Raban (Southern Illinois Bulldogs WC) won by fall over Rocky Delgado (Yorkville WC) Fall 1:20</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Julius Cole (Yorkville WC) won by decision over Cleto Protti (Bolingbrook Junior Raiders WC) Dec 7-5</li>\n<li>Quarterfinal - Wyatt Franckowiak (Richmond WC) won by fall over Landon Weidler (Belleville Little Devils WC) Fall 2:17</li>\n<li>Quarterfinal - Wyatt Mikkelsen (LaSalle Peru Crunching Cavs Youth WC) won by decision over Andrew Lehman (Beat the Streets Chicago-Midway) Dec 7-2</li>\n<li>Quarterfinal - Devin Ehler (Storm Youth WC) won in sudden victory - 1 over Kai Enos (Batavia WC) SV-1 5-3</li>\n<li>Cons. Round 3 - Max Mandac (Lincoln-Way WC) won by decision over Logan Woodbury (ISI WC) Dec 6-0</li>\n<li>Cons. Round 3 - Omar Mendez (Lion`s Den Wrestling Academy) won by major decision over Lucas Zhao (Downers Grove WC) Maj 10-0</li>\n<li>Cons. Round 3 - Cade Vazquez (Izzy Style Wrestling) won in sudden victory - 1 over Nino Capuano (Beat the Streets Chicago-Hyde Park) SV-1 3-1</li>\n<li>Cons. Round 3 - Jesse Swiney (Champaign WC) won by fall over Corbin Brown (Tiger Town Tanglers WC) Fall 1:00</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Quarterfinal - Dawson Hull (Blue Line Training Academy) won by major decision over Gavin Beauchamp (ISI WC) Maj 10-2</li>\n<li>Quarterfinal - Axel Rodriguez (Beat the Streets Chicago-Midway) won by decision over Myles Greenfield (Belleville Little Devils WC) Dec 1-0</li>\n<li>Quarterfinal - Jaxon Trofimchuck (nWo WC) won by decision over Andrew Pellicci (Lincoln-Way WC) Dec 3-2</li>\n<li>Quarterfinal - Titan Henderson (Gladiator Elite WC) won by fall over Yariah Shaw (Lionheart Intense Wrestling) Fall 3:26</li>\n<li>Cons. Round 3 - Ricky Alfaro (Tribe WC) won by tech fall over Damir Duharkic (MadDog Wrestling Academy) TF 19-4</li>\n<li>Cons. Round 3 - Gregory Harkey (Bulls WC) won by decision over Brooks Auker (Alber Athletics WC) Dec 8-2</li>\n<li>Cons. Round 3 - Connor Kern (Yorkville WC) won by decision over Ryker Long (Demolition WC) Dec 5-3</li>\n<li>Cons. Round 3 - Noah Cerny (Red Raiders Wrestling Team) won by major decision over Andrew Vliek (Wheaton Tigers WC) Maj 12-0</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Quarterfinal - Otis Davis (Harvey Twisters WC) won by fall over Christopher Navarro (Notre Dame WC) Fall 0:56</li>\n<li>Quarterfinal - Ameer Khalil (Bolingbrook Junior Raiders WC) won by tech fall over Jeffrey Hill (Naperville WC) TF 15-0</li>\n<li>Quarterfinal - Mason Villarreal (nWo WC) won by major decision over Lucas Maida (Stampede WC) Maj 13-3</li>\n<li>Quarterfinal - Luke Banas (Demolition WC) won by decision over Lucas Maier (SOT-C) Dec 7-2</li>\n<li>Cons. Round 3 - Rico Silvestre (Harvey Twisters WC) won by decision over Brannick Alexander (Alber Athletics WC) Dec 4-2</li>\n<li>Cons. Round 3 - Jaret Waters (Road Warriors WC) won by decision over Dimetri Kean (Demolition WC) Dec 5-0</li>\n<li>Cons. Round 3 - Hudson Wesley (Bulls WC) won by major decision over Keandre Towns (Champaign WC) Maj 13-3</li>\n<li>Cons. Round 3 - Jayden Hermacinski (Peoria Razorbacks WC) won by fall over Dennis Hawthorne (Urbana Tigers WC) Fall 1:12</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Quarterfinal - Langston Norlin (Oswego WC) won by decision over Naijier Morris (Urbana Tigers WC) Dec 5-3</li>\n<li>Quarterfinal - Trent Watson (Englewood Live Wire WC) won by decision over Sean Martinez (Peoria Razorbacks WC) Dec 6-4</li>\n<li>Quarterfinal - Brian Goggin (Panther WC) won by decision over Angel Martinez (Bulldog Elite WC) Dec 8-3</li>\n<li>Quarterfinal - Liam Hughes (Storm Youth WC) won by fall over Hazen Murray (St. Charles WC) Fall 1:20</li>\n<li>Cons. Round 3 - Juan Velez (Southside Outlaws WC) won by fall over Piper Sandell (Stockton Renegades WC) Fall 1:20</li>\n<li>Cons. Round 3 - Owen Alderson (Williamsville WC) won by fall over George Arvanitis (Maine Eagles WC) Fall 2:13</li>\n<li>Cons. Round 3 - Jaxton Carroll (Vandalia Jr WC) won by fall over Jordan Myers (Murphysboro Wrestling) Fall 4:04</li>\n<li>Cons. Round 3 - Austin Bielski (Elevate Wrestling Academy) won by decision over Harrison Yankellow (Beat the Streets Chicago-Avondale) Dec 7-2</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Quarterfinal - Xavier Arroyo (Fox Lake WC) won by decision over Amillian Beasley (Urbana Tigers WC) Dec 8-3</li>\n<li>Quarterfinal - Daniel Costello (Mustang WC) won by fall over Isaiah Garcia (Blackhawk WC) Fall 2:11</li>\n<li>Quarterfinal - Sergio Calleros (Beat the Streets Chicago-Midway) won by tech fall over Micah Stringini (The Law WC) TF 16-1</li>\n<li>Quarterfinal - Isaac Barrientos (Bolingbrook Junior Raiders WC) won in tie breaker - 1 over Jamison Chambliss (Storm Youth WC) TB-1 3-1</li>\n<li>Cons. Round 3 - Payton Chanerl (East St. Louis WC) won by fall over Adam Carrick (Sycamore WC) Fall 0:23</li>\n<li>Cons. Round 3 - Michael Kimbrough (Blue Crew WC) won by disqualification over Julian Moon (Effingham Youth WC) DQ</li>\n<li>Cons. Round 3 - Dane Olmstead (Southern Illinois Bulldogs WC) won by major decision over Lucas Pretkelis (Tribe WC) Maj 19-6</li>\n<li>Cons. Round 3 - Isaiah Robinson (Beat the Streets Chicago-Bellwood) won by fall over Evan Grove (TJ Trained Wrestling) Fall 3:45</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Quarterfinal - Jaxson Mathenia (Southern Illinois Bulldogs WC) won by fall over Fernando Anaya (Blackhawk WC) Fall 1:20</li>\n<li>Quarterfinal - Carter Hintz (Red Raiders Wrestling Team) won by fall over Malakai Davis (Beat the Streets Chicago-Midway) Fall 0:50</li>\n<li>Quarterfinal - Aaden Arroyo (Fox Lake WC) won by fall over Hayden Wheeler (Yorkville WC) Fall 2:43</li>\n<li>Quarterfinal - Cole Yirsa (Lincoln-Way WC) won by fall over Ivan Torres (Collinsville WC) Fall 0:40</li>\n<li>Cons. Round 3 - Kenneth Seggerson (Beat the Streets Chicago-Midway) won by fall over Brayden Meeker (Storm Youth WC) Fall 2:05</li>\n<li>Cons. Round 3 - Charles Jacquez (Trico WC) won by fall over Maddox McRoberts (Sycamore WC) Fall 1:21</li>\n<li>Cons. Round 3 - Matthew Murray (Sauk Valley WC) won by decision over Diego Lopez (Evanston School of Wrestling) Dec 7-2</li>\n<li>Cons. Round 3 - Matthew Carver (MadDog Wrestling Academy) won by fall over Jack Hagerty (Edwardsville WC) Fall 1:16</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Quarterfinal - Clyde Nott (Sycamore WC) won by major decision over Cayden Smith (Junior Cyclones WC) Maj 10-2</li>\n<li>Quarterfinal - Fares Ibraheem (Fox Valley WC) won in sudden victory - 1 over Luke Nielsen (Lincoln-Way WC) SV-1 6-4</li>\n<li>Quarterfinal - Gavin Ericson (Stampede WC) won by fall over Mason West (Southern Illinois Bulldogs WC) Fall 2:34</li>\n<li>Quarterfinal - Michael Hardin (Danville Chargers WC) won by fall over Christopher Easley (Force Elite WC) Fall 0:37</li>\n<li>Cons. Round 3 - Gregory Heavey (Wheaton Tigers WC) won by fall over Richard Butler (Crystal Lake Wizards WC) Fall 0:43</li>\n<li>Cons. Round 3 - Romeo Hernandez (Toss Em Up Wrestling Academy) won by fall over Blaine Becker (Belvidere Bandits WC) Fall 0:55</li>\n<li>Cons. Round 3 - Michael Guerrero (Wolfpak WC) won by fall over Jovany Gaytan (Blackhawk WC) Fall 2:31</li>\n<li>Cons. Round 3 - Christian Paige (Oswego WC) won by major decision over Jack Monn (Fox Valley WC) Maj 13-2</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Hunter Wahtola (Beat the Streets Chicago-Avondale) won by fall over Aj Forst (Fox Valley WC) Fall 1:12</li>\n<li>Quarterfinal - Gannon Dunker (The Law WC) won by fall over Evan Flanagan (Clipper WC) Fall 1:12</li>\n<li>Quarterfinal - Aiden Bishop (Fox Valley WC) won by fall over Jonathon Caudle (O`Fallon Little Panthers WC) Fall 0:53</li>\n<li>Quarterfinal - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Khaden Hallowell (SJO Youth WC) Fall 2:22</li>\n<li>Cons. Round 3 - Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) won by fall over Samuel Swais (MadDog Wrestling Academy) Fall 1:56</li>\n<li>Cons. Round 3 - Bradyn Haynes (Pekin Boys &amp; Girls Club) won by fall over Cayden Berryhill (G2 WC) Fall 1:13</li>\n<li>Cons. Round 3 - Sean Cook (Notre Dame WC) won by fall over John Turner (Sycamore WC) Fall 1:12</li>\n<li>Cons. Round 3 - Braylon Hill-Lomax (Edwardsville WC) won by fall over Angel Alcala (Aurora WC) Fall 4:26</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Jayden Chavez (Blackhawk WC) won by fall over Jasmine Enriquez (Sycamore WC) Fall 0:17</li>\n<li>Quarterfinal - Jake Johnson (Naperville WC) won by fall over Deandre Wilson (Lion`s Den Wrestling Academy) Fall 1:56</li>\n<li>Quarterfinal - Brandon Monroy (Aurora WC) won by fall over Gabriel Kopecky (Team 312 WC) Fall 1:04</li>\n<li>Quarterfinal - Jack Amann (Southern Illinois Bulldogs WC) won by fall over Liam Dodsworth (Williamsville WC) Fall 2:41</li>\n<li>Cons. Round 3 - Christopher Korduplewski (Tinley Park Bulldogs WC) won by fall over Josh Melsa (Naperville WC) Fall 1:22</li>\n<li>Cons. Round 3 - Caybren Hubbard (Murphysboro Wrestling) won by fall over Jhuliyan Carter (Wolfpak WC) Fall 0:32</li>\n<li>Cons. Round 3 - Hoyt Choate (Oswego WC) won by fall over Luke Heinen (Lincoln-Way WC) Fall 1:04</li>\n<li>Cons. Round 3 - D`Anthony Brooks (Peoria Razorbacks WC) won by fall over Trey Harris (Williamsville WC) Fall 1:53</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Treyden Diduch (Alber Athletics WC) won by major decision over Donovan Johnson (Blackhawk WC) Maj 19-7</li>\n<li>Quarterfinal - Lucas Medina (Arlington Cardinals WC) won by major decision over Julian Medina (Bolingbrook Junior Raiders WC) Maj 11-3</li>\n<li>Quarterfinal - Ayden Winchell (Callan Wrestling Academy) won by fall over Landon Jenkins (Yorkville WC) Fall 1:59</li>\n<li>Quarterfinal - Michael McNamara (Edwardsville WC) won by fall over Benjamin Wells (Champaign WC) Fall 1:13</li>\n<li>Cons. Round 3 - Jack Munn (Lincoln-Way WC) won by tech fall over Beckem Carney (St. Charles WC) TF 15-0</li>\n<li>Cons. Round 3 - Elijah Bell (Frankfort Wildcats Wrestling) won by fall over Kevin Bisonaya (Panther WC) Fall 4:22</li>\n<li>Cons. Round 3 - Luthor Rajcevich (Crystal Lake Wizards WC) won by decision over Ignacio Figueroa (Edwardsville WC) Dec 2-0</li>\n<li>Cons. Round 3 - Zander Johnson (Lion`s Den Wrestling Academy) won by fall over Damon Glenn (Storm Youth WC) Fall 2:15</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Brycen Fahnestock (Blue Line Training Academy) won by decision over Logan Viau (Tinley Park Bulldogs WC) Dec 4-3</li>\n<li>Quarterfinal - Carson West (St. Charles WC) won by major decision over Cam Whitehead (Alber Athletics WC) Maj 12-4</li>\n<li>Quarterfinal - Michael Rundell (Arlington Cardinals WC) won by fall over Brandon Kalman (Elevate Wrestling Academy) Fall 0:52</li>\n<li>Quarterfinal - Weston Frazier (Storm Youth WC) won by decision over Rocco Valvano (Tribe WC) Dec 6-2</li>\n<li>Cons. Round 3 - Wesley Smith (Carlinville WC) won by fall over Christian Johnson (Blue Crew WC) Fall 1:11</li>\n<li>Cons. Round 3 - Joseph Calvillo (Batavia WC) won by decision over Benjamin Jurkovic (Tinley Park Bulldogs WC) Dec 6-4</li>\n<li>Cons. Round 3 - Hudson Anderton (Nomad Wrestling Academy) won by decision over Santino Pignatelli (Mat Rat WC) Dec 2-0</li>\n<li>Cons. Round 3 - Nathan Butcher (St. Charles WC) won by decision over Colton Madison (Edwardsville WC) Dec 8-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Christian Corcoran (Lincoln-Way WC) won by decision over Jack Koenig (Team 312 WC) Dec 9-3</li>\n<li>Quarterfinal - Jayce Glauser (Fox Lake WC) won by major decision over Charlie Olson (Sycamore WC) Maj 10-1</li>\n<li>Quarterfinal - Niko Odiotti (Arlington Cardinals WC) won by decision over Colton Wyller (Demolition WC) Dec 6-5</li>\n<li>Quarterfinal - Ray Long (Martinez Fox Valley Elite WC) won by injury default over Steven Uden (Storm Youth WC) Inj. 3:41</li>\n<li>Cons. Round 3 - Matthew Deutch (Southern Illinois Bulldogs WC) won by fall over Declan McReynolds (Blue Crew WC) Fall 0:48</li>\n<li>Cons. Round 3 - Preston Morrison (SCN Youth WC) won by decision over Gerald Donnelly (Tinley Park Bulldogs WC) Dec 8-3</li>\n<li>Cons. Round 3 - Kaden Potter (St. Charles WC) won by fall over Aiden Weber (Elevate Wrestling Academy) Fall 3:26</li>\n<li>Cons. Round 3 - Nathan Ortiz (Tinley Park Bulldogs WC) won by fall over Brayden Bickett (Tiger Town Tanglers WC) Fall 1:28</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Quarterfinal - Brady Glynn (Lincoln-Way WC) won by decision over Aedan Dillow (Beat the Streets Chicago-Avondale) Dec 4-0</li>\n<li>Quarterfinal - Logan Conover (Batavia WC) won by injury default over Nick Dilallo (Arlington Cardinals WC) Inj. 4:18</li>\n<li>Quarterfinal - Robert Ruscitti (Arlington Cardinals WC) won by decision over Eddie Woody Jr. (Edwardsville WC) Dec 1-0</li>\n<li>Quarterfinal - Jackson Marlett (St. Charles WC) won by tech fall over Michael Benge (Ottawa Wolfpack WC) TF 18-2</li>\n<li>Cons. Round 3 - Roberto Rangel (Oak Forest Warriors WC) won by decision over Lukas Quartz (Southern Illinois Bulldogs WC) Dec 3-0</li>\n<li>Cons. Round 3 - Leyton Bartley (Lincoln-Way WC) won by major decision over Nolan O`Grady (Oswego WC) Maj 12-2</li>\n<li>Cons. Round 3 - Justin Forbes (Caravan Kids WC) won by decision over Hank Burge (Edwardsville WC) Dec 10-5</li>\n<li>Cons. Round 3 - Daniel Myint (Arlington Cardinals WC) won by fall over Kyle Hayes (Contender Wrestling) Fall 3:39</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Quarterfinal - Dawson Hawthorne (Granite City Wrestling Association) won by tech fall over Kaleb Pratt (Arlington Cardinals WC) TF 16-0</li>\n<li>Quarterfinal - Lukas Foster (Callan Wrestling Academy) won by decision over Isaiah Perez (Alber Athletics WC) Dec 4-0</li>\n<li>Quarterfinal - Jamiel Castleberry (Beat the Streets Chicago-Bellwood) won by major decision over Shane Stream (Lincoln-Way WC) Maj 10-1</li>\n<li>Quarterfinal - Talin Baker (Champaign WC) won by decision over Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) Dec 3-2</li>\n<li>Cons. Round 3 - Rielen Hermsen (Toss Em Up Wrestling Academy) won by major decision over Kanton Richards (Murphysboro Wrestling) Maj 14-1</li>\n<li>Cons. Round 3 - Declan Sons (St. Charles WC) won by decision over Dominic Pasquale (Izzy Style Wrestling) Dec 3-2</li>\n<li>Cons. Round 3 - Zayden Mansfield (Unity Youth WC) won by decision over Aidan Lopez (nWo WC) Dec 6-0</li>\n<li>Cons. Round 3 - Jt Theis (Frankfort Wildcats Wrestling) won by decision over Elijah Sawyers (Harvey Twisters WC) Dec 4-0</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Quarterfinal - Adante Washington (Harvey Twisters WC) won by major decision over Oscar Kalman (Elevate Wrestling Academy) Maj 12-0</li>\n<li>Quarterfinal - Rocco Cassioppi (Hononegah WC) won by fall over Avery Jaime (Bulls WC) Fall 3:33</li>\n<li>Quarterfinal - Charlie Connors (Alber Athletics WC) won by major decision over Cole Forsyth (Stampede WC) Maj 10-1</li>\n<li>Quarterfinal - Nicholas Marchese (Crystal Lake Wizards WC) won in sudden victory - 1 over Mason Swartz (Storm Youth WC) SV-1 4-2</li>\n<li>Cons. Round 3 - Michael Miranda (Team 312 WC) won by fall over Colin Phelan (Bolingbrook Junior Raiders WC) Fall 0:58</li>\n<li>Cons. Round 3 - Kie Smith (Blue Line Training Academy) won by fall over Jarryion Agnew (Murphysboro Wrestling) Fall 3:58</li>\n<li>Cons. Round 3 - Kannon Judycki (Southside Outlaws WC) won by fall over Eric Hoselton (Lincoln-Way WC) Fall 3:57</li>\n<li>Cons. Round 3 - Anthony Brown (Beat the Streets Chicago-Bellwood) won by decision over Paxton Pyatt (Murphysboro Wrestling) Dec 3-2</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Quarterfinal - Bruno Cassioppi (Hononegah WC) won in sudden victory - 1 over Preston Waughtel (Bulls WC) SV-1 3-1</li>\n<li>Quarterfinal - Gavin Woodmancy (St. Charles WC) won by decision over Hunter Toliver (Peoria Heights Minutemen WC) Dec 6-3</li>\n<li>Quarterfinal - Cohen Sweely (PSF Wrestling Academy) won by decision over Riqo Garcia (ISI WC) Dec 4-1</li>\n<li>Quarterfinal - Benjamin Nadig (Alber Athletics WC) won by decision over John Hanrahan (Arlington Cardinals WC) Dec 10-4</li>\n<li>Cons. Round 3 - Vincent Konecki (Yorkville WC) won by fall over Nolan Lowe (SOT-C) Fall 2:54</li>\n<li>Cons. Round 3 - Jonathan Harris (Crosstown Spartan Elite WC) won by decision over Kyrin King (Harvey Twisters WC) Dec 9-6</li>\n<li>Cons. Round 3 - Anthony Farina (Elevate Wrestling Academy) won by decision over Logan Aaron (Cumberland Youth WC) Dec 3-2</li>\n<li>Cons. Round 3 - Tyler Lachenberg (Lincoln-Way WC) won by major decision over Daniel Skura (Tribe WC) Maj 12-0</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Quarterfinal - Cameron Engels (Scorpion WC) won by fall over Joshua Harkey (Bulls WC) Fall 2:28</li>\n<li>Quarterfinal - Ethan Sonne (Lincoln-Way WC) won by fall over Josiah Willis (Beat the Streets Chicago-Midway) Fall 0:38</li>\n<li>Quarterfinal - Aiden Arnett (Lincoln-Way WC) won by decision over Braxton Tolley (Granite City Wrestling Association) Dec 5-2</li>\n<li>Quarterfinal - Dawson Mack (Bolingbrook Junior Raiders WC) won by decision over A.Jonathan Kopcio (Batavia WC) Dec 6-0</li>\n<li>Cons. Round 3 - Jacob Alvarez (Izzy Style Wrestling) won by fall over Malachi Hutchinson (Urbana Tigers WC) Fall 2:58</li>\n<li>Cons. Round 3 - Sawyer Valdez (Sycamore WC) won by major decision over Keegan Germano (Unity Youth WC) Maj 9-1</li>\n<li>Cons. Round 3 - Michael Malizzio (Team El1te Wrestling) won by tech fall over Max Mulhearn (Riot Room Wrestling) TF 15-0</li>\n<li>Cons. Round 3 - Eddie Astorga (Mustang WC) won by injury default over Eliud Lombardia (Rochelle WC) Inj. 2:54</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Quarterfinal - Thomas Banas (Demolition WC) won by decision over Chase Krantz (Blue Line Training Academy) Dec 10-3</li>\n<li>Quarterfinal - Daniel Blanke (Barrington Broncos WC) won by fall over Brendan Nardin (Alber Athletics WC) Fall 2:30</li>\n<li>Quarterfinal - Izaac Gaines (Blue Line Training Academy) won by decision over Davian Hall (Englewood Live Wire WC) Dec 8-2</li>\n<li>Quarterfinal - Maximus Delgado (Yorkville WC) won by decision over Jaxon Jorgensen (Bolingbrook Junior Raiders WC) Dec 3-2</li>\n<li>Cons. Round 3 - Jayden Dohogne (St. Charles WC) won by decision over Taylor Finley (Unity Youth WC) Dec 7-2</li>\n<li>Cons. Round 3 - Jaden Penna (Headlock Wrestling Academy) won by decision over Say-Vair Williams (Murphysboro Wrestling) Dec 9-2</li>\n<li>Cons. Round 3 - Isaac Mayora (Bolingbrook Junior Raiders WC) won by decision over Malan Njumbe-Hatfield (Blackhawk WC) Dec 9-2</li>\n<li>Cons. Round 3 - Tony Lombardo (Southside Outlaws WC) won by decision over Brody Hinkle (MadDog Wrestling Academy) Dec 4-0</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Quarterfinal - Aiden Quevedo (MadDog Wrestling Academy) won by decision over Douglas Gemberling (Sycamore WC) Dec 4-2</li>\n<li>Quarterfinal - Knox Verbais (Combative Sports Athletic Center Wrestling) won by fall over Brayden McKay (Tinley Park Bulldogs WC) Fall 2:10</li>\n<li>Quarterfinal - Donovan Rosauer (Yorkville WC) won by fall over Jadon Zimmer (Lincoln-Way WC) Fall 4:27</li>\n<li>Quarterfinal - Gavin Watson (Sparta Junior Bulldogs WC) won by fall over Frank Miceli (Mustang WC) Fall 2:15</li>\n<li>Cons. Round 3 - Grayson Garcia (Fitz Wrestling Academy) won by decision over Thomas Ware (SJO Youth WC) Dec 2-0</li>\n<li>Cons. Round 3 - Daniel Lynch (Tinley Park Bulldogs WC) won by decision over Antonio Toliver (Peoria Heights Minutemen WC) Dec 6-2</li>\n<li>Cons. Round 3 - Ethan Harvey (Lincoln-Way WC) won by decision over Daniel Gonzalez (Aurora WC) Dec 5-1</li>\n<li>Cons. Round 3 - Brian Correa (Martinez Fox Valley Elite WC) won by fall over Alex Rink (Sycamore WC) Fall 4:06</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Quarterfinal - Reily Leifheit (Ottawa Wolfpack WC) won by decision over Killian Rauch (Southern Illinois Bulldogs WC) Dec 7-5</li>\n<li>Quarterfinal - Trevon Williams (Springs Elite WC) won by decision over Nicholas Hermsen (Toss Em Up Wrestling Academy) Dec 4-2</li>\n<li>Quarterfinal - Kaden Meyer (Bolingbrook Junior Raiders WC) won in sudden victory - 1 over Ronin Brom (Fox Valley WC) SV-1 8-6</li>\n<li>Quarterfinal - Radic Dvorak (ISI WC) won by fall over Maxon Stearns (Murphysboro Wrestling) Fall 1:02</li>\n<li>Cons. Round 3 - Allante Jackson (Beat the Streets Chicago-Bellwood) won by fall over Alexander Mager (Rantoul Youth Wrestling) Fall 0:59</li>\n<li>Cons. Round 3 - Benjamin Mullins (Crawford County WC) won by decision over Chase Siguenza (Tribe WC) Dec 10-6</li>\n<li>Cons. Round 3 - Brody Stien (Alber Athletics WC) won by decision over Donncha Souza (Yorkville WC) Dec 7-2</li>\n<li>Cons. Round 3 - Benjamin Anderson (Sycamore WC) won by decision over Daithan Narayanan (Batavia WC) Dec 3-2</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Quarterfinal - Rodrigo Salinas (Evanston School of Wrestling) won by decision over John McGinnis (Oak Forest Warriors WC) Dec 7-2</li>\n<li>Quarterfinal - Nicolas Astacio (ISI WC) won by decision over Garrett Patnoudes (Fox Valley WC) Dec 4-0</li>\n<li>Quarterfinal - James Wojcikiewicz (Bulls WC) won by fall over Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) Fall 1:16</li>\n<li>Quarterfinal - Brody Sendele (Hononegah WC) won by fall over Kevin May (Southside Outlaws WC) Fall 1:18</li>\n<li>Cons. Round 3 - Xander Keslin (Force Elite WC) won by fall over Jayden Schmick (DC WC) Fall 2:37</li>\n<li>Cons. Round 3 - Nicolas Olvera (Naperville WC) won by decision over Justin Langford (Lincoln-Way WC) Dec 6-1</li>\n<li>Cons. Round 3 - Isaac Saldana (Bolingbrook Junior Raiders WC) won by decision over Corey Robinson (East St. Louis WC) Dec 5-1</li>\n<li>Cons. Round 3 - Jasper Hintz (Red Raiders Wrestling Team) won by decision over Bryce Bryant (Williamsville WC) Dec 11-9</li>\n</ul>\n</section>",
  "Consolation 3rd Round": "<section class=\"tw-list\">\n<h1>Consolation 3rd Round</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>Cons. Round 4 - Nathan Vogler (Oak Forest Warriors WC) won by decision over Zion Silvestre (Harvey Twisters WC) Dec 6-2</li>\n<li>Cons. Round 4 - Quinn Hogan (Greg Gomez Trained Wrestling) won by fall over Brendan Weber (Fox Lake WC) Fall 3:35</li>\n<li>Cons. Round 4 - Xavier Pratt (Crosstown Spartan Elite WC) won by decision over Cohen Albatt (Triad Knights WC) Dec 4-3</li>\n<li>Cons. Round 4 - Brooks Tyler (Evanston School of Wrestling) won by decision over Rex Chavez-Jimenez (Downers Grove WC) Dec 6-4</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>Cons. Round 4 - Mason Henderson (Stockton Renegades WC) won by fall over Gentry Michels (Olney Cubs WC) Fall 0:41</li>\n<li>Cons. Round 4 - Knox Homola (Riot Room Wrestling) won by fall over Patrick Martin (Crystal Lake Wizards WC) Fall 1:22</li>\n<li>Cons. Round 4 - Art Bytyqi (Evanston School of Wrestling) won by fall over Samuel Golladay (Williamsville WC) Fall 3:32</li>\n<li>Cons. Round 4 - Luka Rankovic (Naperville WC) won by fall over Angelo Ngoho (Champaign WC) Fall 0:41</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 4 - Olivia Rosine (Charleston WC) won by decision over Anthony Salcedo (Harvard WC) Dec 7-4</li>\n<li>Cons. Round 4 - Timothy Harrison (Harvey Twisters WC) won by fall over Abdulrahman Abukhdeir (Badger WC) Fall 1:07</li>\n<li>Cons. Round 4 - Jacob Garcia (Martinez Fox Valley Elite WC) won by fall over Waleed Fuqaha (Badger WC) Fall 0:52</li>\n<li>Cons. Round 4 - Nathan German (Toss Em Up Wrestling Academy) won by fall over Owen Kommer (Gladiator Elite WC) Fall 0:38</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Cons. Round 4 - Julian Godina (Lincoln-Way WC) won by fall over Cobey Stulce (Southern Illinois Bulldogs WC) Fall 2:27</li>\n<li>Cons. Round 4 - Camden Chapman (Gladiator Elite WC) won by tech fall over Caleb Pate (SCN Youth WC) TF 15-0</li>\n<li>Cons. Round 4 - Vincent Cumbo (Vittum Cats WC) won by decision over Tenli Madriles (Crystal Lake Wizards WC) Dec 5-0</li>\n<li>Cons. Round 4 - Archer Smith (Hononegah WC) won by fall over Abigail Godard (Edwardsville WC) Fall 2:54</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Cons. Round 4 - Bennett Hoffberg (St. Charles WC) won by fall over Jaxon Fraedrich (Team El1te Wrestling) Fall 1:11</li>\n<li>Cons. Round 4 - Rocco Maheras (Vittum Cats WC) won by fall over Mason Beattie (Fox Lake WC) Fall 1:16</li>\n<li>Cons. Round 4 - Grady Glowacki (Lakeland Predators WC) won by fall over Eli Schaefer (Southern Illinois Bulldogs WC) Fall 0:37</li>\n<li>Cons. Round 4 - Noah Flores (Force Elite WC) won by fall over Dayton Patterson (Vandalia Jr WC) Fall 3:39</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Cons. Round 4 - Noah Thomas (Bulls WC) won by fall over Fran Blake (Panther WC) Fall 0:49</li>\n<li>Cons. Round 4 - Brady Myatt (Fox Lake WC) won by tech fall over William Bousk (Arlington Cardinals WC) TF 15-0</li>\n<li>Cons. Round 4 - Cameron Ramp (SOT-C) won by tech fall over Colt Rosentreter (Carlinville WC) TF 15-0</li>\n<li>Cons. Round 4 - Caleb Callaghan (Lincoln-Way WC) won by fall over Maddux Kennedy (Blue Line Training Academy) Fall 1:16</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 4 - Elijah Nadig (Alber Athletics WC) won by decision over Clark Goodwin (Lincoln-Way WC) Dec 2-0</li>\n<li>Cons. Round 4 - Landon Near (nWo WC) won by fall over Noah Rauen (Force Elite WC) Fall 1:11</li>\n<li>Cons. Round 4 - Cale Dauber (Ottawa Wolfpack WC) won by decision over Devin DiSilvestro (Greg Gomez Trained Wrestling) Dec 6-1</li>\n<li>Cons. Round 4 - Liam Kissane (Tinley Park Bulldogs WC) won by fall over Braxton McCall (O`Fallon Little Panthers WC) Fall 4:08</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Cons. Round 4 - Colin Crouch (Triad Knights WC) won by decision over Liam Schroeder (Sycamore WC) Dec 6-0</li>\n<li>Cons. Round 4 - Jeffrey Dunaway (St. Charles WC) won by decision over Adonis Washington (Harvey Twisters WC) Dec 7-1</li>\n<li>Cons. Round 4 - Jack Benesh (Hawk WC) won by decision over Tad Moore (Blue Line Training Academy) Dec 7-2</li>\n<li>Cons. Round 4 - Maddux Rabczak (Alber Athletics WC) won by decision over Charlie Strezo (Lincoln-Way WC) Dec 6-3</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Cons. Round 4 - Alec Daly (Unity Youth WC) won by decision over Griffin Heeney (Elevate Wrestling Academy) Dec 7-1</li>\n<li>Cons. Round 4 - Obadiah Willis (Beat the Streets Chicago-Midway) won by decision over Vannak Khiev (Mat Rat WC) Dec 4-2</li>\n<li>Cons. Round 4 - Kiernan Delaney (Toss Em Up Wrestling Academy) won by fall over Jase Edrington (Storm Youth WC) Fall 2:41</li>\n<li>Cons. Round 4 - Carl Cody Weidner (Combative Sports Athletic Center Wrestling) won by fall over Jack Bashore (Batavia WC) Fall 0:38</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Cons. Round 4 - Owen Catalano (Fox Lake WC) won by fall over Hayden Smith (Unity Youth WC) Fall 4:22</li>\n<li>Cons. Round 4 - Landen Vincent (Blue Line Training Academy) won by major decision over Jonathan Fields (Mustang WC) Maj 11-1</li>\n<li>Cons. Round 4 - Maximus Pearch (nWo WC) won by fall over Santiago Trejo (Southside Outlaws WC) Fall 2:49</li>\n<li>Cons. Round 4 - Colton Schultz (Callan Wrestling Academy) won by decision over Nolan Chrisse (Bolingbrook Junior Raiders WC) Dec 8-1</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Cons. Round 4 - Dylan Curtis (Sycamore WC) won by fall over Rylan Poeta (Champaign WC) Fall 3:53</li>\n<li>Cons. Round 4 - Vincente Halverson (Tribe WC) won by decision over Kai Balice (Naperville WC) Dec 4-2</li>\n<li>Cons. Round 4 - Rain Scott (Springs Elite WC) won by decision over Jackson Wells (Batavia WC) Dec 4-1</li>\n<li>Cons. Round 4 - Nathan Raban (Southern Illinois Bulldogs WC) won by major decision over Colton Stearns (Granite City Wrestling Association) Maj 11-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 4 - Landon Weidler (Belleville Little Devils WC) won by decision over Max Mandac (Lincoln-Way WC) Dec 7-6</li>\n<li>Cons. Round 4 - Cleto Protti (Bolingbrook Junior Raiders WC) won by decision over Omar Mendez (Lion`s Den Wrestling Academy) Dec 9-2</li>\n<li>Cons. Round 4 - Kai Enos (Batavia WC) won by decision over Cade Vazquez (Izzy Style Wrestling) Dec 5-0</li>\n<li>Cons. Round 4 - Andrew Lehman (Beat the Streets Chicago-Midway) won by decision over Jesse Swiney (Champaign WC) Dec 6-3</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Cons. Round 4 - Ricky Alfaro (Tribe WC) won by decision over Myles Greenfield (Belleville Little Devils WC) Dec 4-3</li>\n<li>Cons. Round 4 - Gregory Harkey (Bulls WC) won by decision over Gavin Beauchamp (ISI WC) Dec 2-1</li>\n<li>Cons. Round 4 - Connor Kern (Yorkville WC) won by fall over Yariah Shaw (Lionheart Intense Wrestling) Fall 2:21</li>\n<li>Cons. Round 4 - Noah Cerny (Red Raiders Wrestling Team) won by decision over Andrew Pellicci (Lincoln-Way WC) Dec 6-3</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Cons. Round 4 - Jeffrey Hill (Naperville WC) won by fall over Rico Silvestre (Harvey Twisters WC) Fall 0:38</li>\n<li>Cons. Round 4 - Jaret Waters (Road Warriors WC) won by fall over Christopher Navarro (Notre Dame WC) Fall 2:52</li>\n<li>Cons. Round 4 - Lucas Maier (SOT-C) won by decision over Hudson Wesley (Bulls WC) Dec 4-0</li>\n<li>Cons. Round 4 - Jayden Hermacinski (Peoria Razorbacks WC) won by decision over Lucas Maida (Stampede WC) Dec 2-0</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Cons. Round 4 - Sean Martinez (Peoria Razorbacks WC) won by fall over Juan Velez (Southside Outlaws WC) Fall 1:50</li>\n<li>Cons. Round 4 - Owen Alderson (Williamsville WC) won by fall over Naijier Morris (Urbana Tigers WC) Fall 2:07</li>\n<li>Cons. Round 4 - Jaxton Carroll (Vandalia Jr WC) won by decision over Hazen Murray (St. Charles WC) Dec 7-3</li>\n<li>Cons. Round 4 - Austin Bielski (Elevate Wrestling Academy) won by decision over Angel Martinez (Bulldog Elite WC) Dec 3-2</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Cons. Round 4 - Payton Chanerl (East St. Louis WC) won by fall over Isaiah Garcia (Blackhawk WC) Fall 2:01</li>\n<li>Cons. Round 4 - Amillian Beasley (Urbana Tigers WC) won by decision over Michael Kimbrough (Blue Crew WC) Dec 6-2</li>\n<li>Cons. Round 4 - Jamison Chambliss (Storm Youth WC) won by major decision over Dane Olmstead (Southern Illinois Bulldogs WC) Maj 8-0</li>\n<li>Cons. Round 4 - Micah Stringini (The Law WC) won by fall over Isaiah Robinson (Beat the Streets Chicago-Bellwood) Fall 0:53</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Cons. Round 4 - Malakai Davis (Beat the Streets Chicago-Midway) won by fall over Kenneth Seggerson (Beat the Streets Chicago-Midway) Fall 2:18</li>\n<li>Cons. Round 4 - Fernando Anaya (Blackhawk WC) won by decision over Charles Jacquez (Trico WC) Dec 8-4</li>\n<li>Cons. Round 4 - Ivan Torres (Collinsville WC) won by fall over Matthew Murray (Sauk Valley WC) Fall 3:59</li>\n<li>Cons. Round 4 - Hayden Wheeler (Yorkville WC) won by decision over Matthew Carver (MadDog Wrestling Academy) Dec 4-1</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Cons. Round 4 - Gregory Heavey (Wheaton Tigers WC) won by fall over Luke Nielsen (Lincoln-Way WC) Fall 3:45</li>\n<li>Cons. Round 4 - Romeo Hernandez (Toss Em Up Wrestling Academy) won by major decision over Cayden Smith (Junior Cyclones WC) Maj 9-1</li>\n<li>Cons. Round 4 - Christopher Easley (Force Elite WC) won by fall over Michael Guerrero (Wolfpak WC) Fall 0:19</li>\n<li>Cons. Round 4 - Mason West (Southern Illinois Bulldogs WC) won by decision over Christian Paige (Oswego WC) Dec 8-3</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 4 - Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) won by decision over Evan Flanagan (Clipper WC) Dec 7-3</li>\n<li>Cons. Round 4 - Aj Forst (Fox Valley WC) won by fall over Bradyn Haynes (Pekin Boys &amp; Girls Club) Fall 0:17</li>\n<li>Cons. Round 4 - Khaden Hallowell (SJO Youth WC) won by fall over Sean Cook (Notre Dame WC) Fall 2:05</li>\n<li>Cons. Round 4 - Jonathon Caudle (O`Fallon Little Panthers WC) won by fall over Braylon Hill-Lomax (Edwardsville WC) Fall 1:51</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 4 - Christopher Korduplewski (Tinley Park Bulldogs WC) won by fall over Deandre Wilson (Lion`s Den Wrestling Academy) Fall 1:56</li>\n<li>Cons. Round 4 - Caybren Hubbard (Murphysboro Wrestling) won by fall over Jasmine Enriquez (Sycamore WC) Fall 0:29</li>\n<li>Cons. Round 4 - Hoyt Choate (Oswego WC) won by fall over Liam Dodsworth (Williamsville WC) Fall 0:19</li>\n<li>Cons. Round 4 - Gabriel Kopecky (Team 312 WC) won by fall over D`Anthony Brooks (Peoria Razorbacks WC) Fall 1:16</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 4 - Julian Medina (Bolingbrook Junior Raiders WC) won by decision over Jack Munn (Lincoln-Way WC) Dec 7-1</li>\n<li>Cons. Round 4 - Elijah Bell (Frankfort Wildcats Wrestling) won by decision over Donovan Johnson (Blackhawk WC) Dec 7-2</li>\n<li>Cons. Round 4 - Benjamin Wells (Champaign WC) won by decision over Luthor Rajcevich (Crystal Lake Wizards WC) Dec 9-7</li>\n<li>Cons. Round 4 - Zander Johnson (Lion`s Den Wrestling Academy) won by decision over Landon Jenkins (Yorkville WC) Dec 9-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 4 - Cam Whitehead (Alber Athletics WC) won by fall over Wesley Smith (Carlinville WC) Fall 2:28</li>\n<li>Cons. Round 4 - Logan Viau (Tinley Park Bulldogs WC) won by decision over Joseph Calvillo (Batavia WC) Dec 8-1</li>\n<li>Cons. Round 4 - Rocco Valvano (Tribe WC) won by tech fall over Hudson Anderton (Nomad Wrestling Academy) TF 17-2</li>\n<li>Cons. Round 4 - Brandon Kalman (Elevate Wrestling Academy) won by decision over Nathan Butcher (St. Charles WC) Dec 9-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 4 - Matthew Deutch (Southern Illinois Bulldogs WC) won by tech fall over Charlie Olson (Sycamore WC) TF 19-2</li>\n<li>Cons. Round 4 - Preston Morrison (SCN Youth WC) won by decision over Jack Koenig (Team 312 WC) Dec 11-6</li>\n<li>Cons. Round 4 - Kaden Potter (St. Charles WC) won by medical forfeit over Steven Uden (Storm Youth WC) MFF</li>\n<li>Cons. Round 4 - Colton Wyller (Demolition WC) won by fall over Nathan Ortiz (Tinley Park Bulldogs WC) Fall 4:25</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Cons. Round 4 - Nick Dilallo (Arlington Cardinals WC) won by major decision over Roberto Rangel (Oak Forest Warriors WC) Maj 14-4</li>\n<li>Cons. Round 4 - Leyton Bartley (Lincoln-Way WC) won by decision over Aedan Dillow (Beat the Streets Chicago-Avondale) Dec 2-0</li>\n<li>Cons. Round 4 - Justin Forbes (Caravan Kids WC) won by major decision over Michael Benge (Ottawa Wolfpack WC) Maj 10-0</li>\n<li>Cons. Round 4 - Eddie Woody Jr. (Edwardsville WC) won by fall over Daniel Myint (Arlington Cardinals WC) Fall 2:45</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Cons. Round 4 - Rielen Hermsen (Toss Em Up Wrestling Academy) won by major decision over Isaiah Perez (Alber Athletics WC) Maj 10-0</li>\n<li>Cons. Round 4 - Kaleb Pratt (Arlington Cardinals WC) won by fall over Declan Sons (St. Charles WC) Fall 0:53</li>\n<li>Cons. Round 4 - Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) won by decision over Zayden Mansfield (Unity Youth WC) Dec 8-2</li>\n<li>Cons. Round 4 - Shane Stream (Lincoln-Way WC) won by decision over Jt Theis (Frankfort Wildcats Wrestling) Dec 3-0</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Cons. Round 4 - Michael Miranda (Team 312 WC) won by decision over Avery Jaime (Bulls WC) Dec 3-0</li>\n<li>Cons. Round 4 - Oscar Kalman (Elevate Wrestling Academy) won by fall over Kie Smith (Blue Line Training Academy) Fall 1:24</li>\n<li>Cons. Round 4 - Mason Swartz (Storm Youth WC) won by decision over Kannon Judycki (Southside Outlaws WC) Dec 7-0</li>\n<li>Cons. Round 4 - Cole Forsyth (Stampede WC) won by decision over Anthony Brown (Beat the Streets Chicago-Bellwood) Dec 1-0</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Cons. Round 4 - Hunter Toliver (Peoria Heights Minutemen WC) won by fall over Vincent Konecki (Yorkville WC) Fall 3:27</li>\n<li>Cons. Round 4 - Preston Waughtel (Bulls WC) won by fall over Jonathan Harris (Crosstown Spartan Elite WC) Fall 2:33</li>\n<li>Cons. Round 4 - John Hanrahan (Arlington Cardinals WC) won by fall over Anthony Farina (Elevate Wrestling Academy) Fall 3:56</li>\n<li>Cons. Round 4 - Tyler Lachenberg (Lincoln-Way WC) won by tech fall over Riqo Garcia (ISI WC) TF 15-0</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Cons. Round 4 - Jacob Alvarez (Izzy Style Wrestling) won by fall over Josiah Willis (Beat the Streets Chicago-Midway) Fall 0:53</li>\n<li>Cons. Round 4 - Sawyer Valdez (Sycamore WC) won by tech fall over Joshua Harkey (Bulls WC) TF 16-0</li>\n<li>Cons. Round 4 - Michael Malizzio (Team El1te Wrestling) won by major decision over A.Jonathan Kopcio (Batavia WC) Maj 8-0</li>\n<li>Cons. Round 4 - Braxton Tolley (Granite City Wrestling Association) won by fall over Eddie Astorga (Mustang WC) Fall 4:06</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Cons. Round 4 - Brendan Nardin (Alber Athletics WC) won by decision over Jayden Dohogne (St. Charles WC) Dec 6-1</li>\n<li>Cons. Round 4 - Chase Krantz (Blue Line Training Academy) won by fall over Jaden Penna (Headlock Wrestling Academy) Fall 2:08</li>\n<li>Cons. Round 4 - Jaxon Jorgensen (Bolingbrook Junior Raiders WC) won by decision over Isaac Mayora (Bolingbrook Junior Raiders WC) Dec 5-0</li>\n<li>Cons. Round 4 - Davian Hall (Englewood Live Wire WC) won by forfeit over Tony Lombardo (Southside Outlaws WC) FF</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Cons. Round 4 - Brayden McKay (Tinley Park Bulldogs WC) won by fall over Grayson Garcia (Fitz Wrestling Academy) Fall 1:27</li>\n<li>Cons. Round 4 - Douglas Gemberling (Sycamore WC) won by decision over Daniel Lynch (Tinley Park Bulldogs WC) Dec 4-3</li>\n<li>Cons. Round 4 - Frank Miceli (Mustang WC) won by decision over Ethan Harvey (Lincoln-Way WC) Dec 5-3</li>\n<li>Cons. Round 4 - Jadon Zimmer (Lincoln-Way WC) won by decision over Brian Correa (Martinez Fox Valley Elite WC) Dec 7-2</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Cons. Round 4 - Nicholas Hermsen (Toss Em Up Wrestling Academy) won by fall over Allante Jackson (Beat the Streets Chicago-Bellwood) Fall 2:14</li>\n<li>Cons. Round 4 - Killian Rauch (Southern Illinois Bulldogs WC) won by major decision over Benjamin Mullins (Crawford County WC) Maj 10-0</li>\n<li>Cons. Round 4 - Brody Stien (Alber Athletics WC) won by fall over Maxon Stearns (Murphysboro Wrestling) Fall 1:21</li>\n<li>Cons. Round 4 - Benjamin Anderson (Sycamore WC) won by decision over Ronin Brom (Fox Valley WC) Dec 6-1</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Cons. Round 4 - Xander Keslin (Force Elite WC) won by decision over Garrett Patnoudes (Fox Valley WC) Dec 2-0</li>\n<li>Cons. Round 4 - Nicolas Olvera (Naperville WC) won by decision over John McGinnis (Oak Forest Warriors WC) Dec 9-3</li>\n<li>Cons. Round 4 - Kevin May (Southside Outlaws WC) won by decision over Isaac Saldana (Bolingbrook Junior Raiders WC) Dec 6-3</li>\n<li>Cons. Round 4 - Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) won by fall over Jasper Hintz (Red Raiders Wrestling Team) Fall 1:30</li>\n</ul>\n</section>",
  "Champ Semis & Consolation 4th Round": "<section class=\"tw-list\">\n<h1>Champ Semis &amp; Consolation 4th Round</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>Semifinal - Eli Miller (Granite City Wrestling Association) won by fall over Aiden Rodriguez (ISI WC) Fall 2:27</li>\n<li>Semifinal - Daniel Jackson (Southern Illinois Bulldogs WC) won by fall over Logan Boley (Marengo Youth WC) Fall 3:51</li>\n<li>Cons. Round 5 - Quinn Hogan (Greg Gomez Trained Wrestling) won by major decision over Nathan Vogler (Oak Forest Warriors WC) Maj 17-6</li>\n<li>Cons. Round 5 - Xavier Pratt (Crosstown Spartan Elite WC) won by decision over Brooks Tyler (Evanston School of Wrestling) Dec 7-2</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>Semifinal - Jake Luedtke (Tinley Park Bulldogs WC) won by major decision over Cash Wetenkamp (Lincoln-Way WC) Maj 8-0</li>\n<li>Semifinal - Rage Henderson (Gladiator Elite WC) won by fall over Anthony Samanich (Lockport Junior Porters WC) Fall 0:26</li>\n<li>Cons. Round 5 - Knox Homola (Riot Room Wrestling) won by fall over Mason Henderson (Stockton Renegades WC) Fall 2:44</li>\n<li>Cons. Round 5 - Luka Rankovic (Naperville WC) won by fall over Art Bytyqi (Evanston School of Wrestling) Fall 0:34</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Donovan Olmstead (Southern Illinois Bulldogs WC) won by fall over Michael Limon-Prado (Bulldog Elite WC) Fall 0:34</li>\n<li>Semifinal - Cameron Casey (Team Mascoutah WC) won by fall over Asher Acevedo (Stockton Renegades WC) Fall 3:52</li>\n<li>Cons. Round 5 - Timothy Harrison (Harvey Twisters WC) won by fall over Olivia Rosine (Charleston WC) Fall 1:00</li>\n<li>Cons. Round 5 - Nathan German (Toss Em Up Wrestling Academy) won by decision over Jacob Garcia (Martinez Fox Valley Elite WC) Dec 7-4</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Semifinal - Cannon Ziller (Hawk WC) won by decision over Jackson Allen (G2 WC) Dec 5-2</li>\n<li>Semifinal - Kamari Tate (Englewood Live Wire WC) won by major decision over Calvin Babcock (St. Charles WC) Maj 14-4</li>\n<li>Cons. Round 5 - Camden Chapman (Gladiator Elite WC) won by decision over Julian Godina (Lincoln-Way WC) Dec 9-2</li>\n<li>Cons. Round 5 - Archer Smith (Hononegah WC) won by tech fall over Vincent Cumbo (Vittum Cats WC) TF 16-0</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Semifinal - Giovonni Nix (Englewood Live Wire WC) won by major decision over Grayson Anderton (Nomad Wrestling Academy) Maj 9-1</li>\n<li>Semifinal - Aden Spinelli (nWo WC) won by decision over Jimmy Roach (Panther WC) Dec 3-2</li>\n<li>Cons. Round 5 - Bennett Hoffberg (St. Charles WC) won by decision over Rocco Maheras (Vittum Cats WC) Dec 7-2</li>\n<li>Cons. Round 5 - Grady Glowacki (Lakeland Predators WC) won by fall over Noah Flores (Force Elite WC) Fall 1:13</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Semifinal - Wesley Janick (nWo WC) won by decision over Easton McDonnell (Lincoln-Way WC) Dec 5-0</li>\n<li>Semifinal - Carter Noonan (Ottawa Wolfpack WC) won by decision over Reese Babcock (St. Charles WC) Dec 1-0</li>\n<li>Cons. Round 5 - Noah Thomas (Bulls WC) won by major decision over Brady Myatt (Fox Lake WC) Maj 11-0</li>\n<li>Cons. Round 5 - Cameron Ramp (SOT-C) won by tech fall over Caleb Callaghan (Lincoln-Way WC) TF 16-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Hogan Rice (St. Charles WC) won by decision over Crue Hatchell (Southside Outlaws WC) Dec 7-3</li>\n<li>Semifinal - Erik Klichurov (Izzy Style Wrestling) won by fall over Santino Scardina (Lions WC) Fall 2:22</li>\n<li>Cons. Round 5 - Landon Near (nWo WC) won by decision over Elijah Nadig (Alber Athletics WC) Dec 1-0</li>\n<li>Cons. Round 5 - Cale Dauber (Ottawa Wolfpack WC) won by decision over Liam Kissane (Tinley Park Bulldogs WC) Dec 5-1</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Semifinal - Jaden Washington (Harvey Twisters WC) won by fall over Cael Saldana (Toss Em Up Wrestling Academy) Fall 0:36</li>\n<li>Semifinal - Finn McDermott (Force Elite WC) won by decision over Owen Thomas (Toss Em Up Wrestling Academy) Dec 7-0</li>\n<li>Cons. Round 5 - Jeffrey Dunaway (St. Charles WC) won by decision over Colin Crouch (Triad Knights WC) Dec 3-2</li>\n<li>Cons. Round 5 - Maddux Rabczak (Alber Athletics WC) won by major decision over Jack Benesh (Hawk WC) Maj 11-2</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Semifinal - Nikolas Duarte (Arlington Cardinals WC) won by fall over Daniel Zuehlke (Crystal Lake Wizards WC) Fall 3:37</li>\n<li>Semifinal - Te`Jon Beals (Harvey Twisters WC) won by decision over Rhyis Polenske (Blue Line Training Academy) Dec 2-0</li>\n<li>Cons. Round 5 - Obadiah Willis (Beat the Streets Chicago-Midway) won by fall over Alec Daly (Unity Youth WC) Fall 3:26</li>\n<li>Cons. Round 5 - Kiernan Delaney (Toss Em Up Wrestling Academy) won by fall over Carl Cody Weidner (Combative Sports Athletic Center Wrestling) Fall 1:11</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Semifinal - Brody Page (Yorkville WC) won in sudden victory - 1 over Cameron Young (Alber Athletics WC) SV-1 3-1</li>\n<li>Semifinal - Ethan Hamilton (Harvey Twisters WC) won by decision over Jeremiah Hayes (Warrior Wrestling) Dec 6-4</li>\n<li>Cons. Round 5 - Landen Vincent (Blue Line Training Academy) won in sudden victory - 1 over Owen Catalano (Fox Lake WC) SV-1 6-4</li>\n<li>Cons. Round 5 - Colton Schultz (Callan Wrestling Academy) won by decision over Maximus Pearch (nWo WC) Dec 2-0</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Semifinal - Kane Dauber (Ottawa Wolfpack WC) won by fall over Lincoln Mack (Bolingbrook Junior Raiders WC) Fall 0:45</li>\n<li>Semifinal - Dylan Knaus (ISI WC) won in sudden victory - 1 over Maddox Stonitsch (Lincoln-Way WC) SV-1 2-0</li>\n<li>Cons. Round 5 - Vincente Halverson (Tribe WC) won by decision over Dylan Curtis (Sycamore WC) Dec 4-3</li>\n<li>Cons. Round 5 - Rain Scott (Springs Elite WC) won by decision over Nathan Raban (Southern Illinois Bulldogs WC) Dec 10-7</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Julius Cole (Yorkville WC) won by decision over Wyatt Franckowiak (Richmond WC) Dec 5-3</li>\n<li>Semifinal - Devin Ehler (Storm Youth WC) won by decision over Wyatt Mikkelsen (LaSalle Peru Crunching Cavs Youth WC) Dec 6-4</li>\n<li>Cons. Round 5 - Landon Weidler (Belleville Little Devils WC) won by fall over Cleto Protti (Bolingbrook Junior Raiders WC) Fall 3:57</li>\n<li>Cons. Round 5 - Kai Enos (Batavia WC) won by decision over Andrew Lehman (Beat the Streets Chicago-Midway) Dec 4-2</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Semifinal - Axel Rodriguez (Beat the Streets Chicago-Midway) won by fall over Dawson Hull (Blue Line Training Academy) Fall 3:53</li>\n<li>Semifinal - Titan Henderson (Gladiator Elite WC) won by fall over Jaxon Trofimchuck (nWo WC) Fall 3:18</li>\n<li>Cons. Round 5 - Ricky Alfaro (Tribe WC) won by decision over Gregory Harkey (Bulls WC) Dec 6-1</li>\n<li>Cons. Round 5 - Connor Kern (Yorkville WC) won by decision over Noah Cerny (Red Raiders Wrestling Team) Dec 8-3</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Semifinal - Otis Davis (Harvey Twisters WC) won by decision over Ameer Khalil (Bolingbrook Junior Raiders WC) Dec 6-3</li>\n<li>Semifinal - Mason Villarreal (nWo WC) won by fall over Luke Banas (Demolition WC) Fall 2:55</li>\n<li>Cons. Round 5 - Jeffrey Hill (Naperville WC) won by decision over Jaret Waters (Road Warriors WC) Dec 11-8</li>\n<li>Cons. Round 5 - Lucas Maier (SOT-C) won by decision over Jayden Hermacinski (Peoria Razorbacks WC) Dec 5-0</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Semifinal - Langston Norlin (Oswego WC) won by decision over Trent Watson (Englewood Live Wire WC) Dec 8-6</li>\n<li>Semifinal - Brian Goggin (Panther WC) won by fall over Liam Hughes (Storm Youth WC) Fall 2:20</li>\n<li>Cons. Round 5 - Sean Martinez (Peoria Razorbacks WC) won by decision over Owen Alderson (Williamsville WC) Dec 7-1</li>\n<li>Cons. Round 5 - Austin Bielski (Elevate Wrestling Academy) won by major decision over Jaxton Carroll (Vandalia Jr WC) Maj 13-0</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Semifinal - Daniel Costello (Mustang WC) won by fall over Xavier Arroyo (Fox Lake WC) Fall 1:21</li>\n<li>Semifinal - Isaac Barrientos (Bolingbrook Junior Raiders WC) won by decision over Sergio Calleros (Beat the Streets Chicago-Midway) Dec 2-1</li>\n<li>Cons. Round 5 - Amillian Beasley (Urbana Tigers WC) won by decision over Payton Chanerl (East St. Louis WC) Dec 6-3</li>\n<li>Cons. Round 5 - Jamison Chambliss (Storm Youth WC) won by fall over Micah Stringini (The Law WC) Fall 2:28</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Semifinal - Jaxson Mathenia (Southern Illinois Bulldogs WC) won by fall over Carter Hintz (Red Raiders Wrestling Team) Fall 3:00</li>\n<li>Semifinal - Aaden Arroyo (Fox Lake WC) won by fall over Cole Yirsa (Lincoln-Way WC) Fall 0:51</li>\n<li>Cons. Round 5 - Malakai Davis (Beat the Streets Chicago-Midway) won by fall over Fernando Anaya (Blackhawk WC) Fall 2:00</li>\n<li>Cons. Round 5 - Ivan Torres (Collinsville WC) won by fall over Hayden Wheeler (Yorkville WC) Fall 1:57</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Semifinal - Fares Ibraheem (Fox Valley WC) won by major decision over Clyde Nott (Sycamore WC) Maj 11-0</li>\n<li>Semifinal - Michael Hardin (Danville Chargers WC) won by fall over Gavin Ericson (Stampede WC) Fall 0:50</li>\n<li>Cons. Round 5 - Romeo Hernandez (Toss Em Up Wrestling Academy) won by decision over Gregory Heavey (Wheaton Tigers WC) Dec 10-7</li>\n<li>Cons. Round 5 - Christopher Easley (Force Elite WC) won by fall over Mason West (Southern Illinois Bulldogs WC) Fall 0:37</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Hunter Wahtola (Beat the Streets Chicago-Avondale) won by decision over Gannon Dunker (The Law WC) Dec 8-7</li>\n<li>Semifinal - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Aiden Bishop (Fox Valley WC) Fall 3:47</li>\n<li>Cons. Round 5 - Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) won by fall over Aj Forst (Fox Valley WC) Fall 3:28</li>\n<li>Cons. Round 5 - Khaden Hallowell (SJO Youth WC) won by fall over Jonathon Caudle (O`Fallon Little Panthers WC) Fall 2:43</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Jake Johnson (Naperville WC) won by fall over Jayden Chavez (Blackhawk WC) Fall 2:45</li>\n<li>Semifinal - Brandon Monroy (Aurora WC) won by fall over Jack Amann (Southern Illinois Bulldogs WC) Fall 4:02</li>\n<li>Cons. Round 5 - Christopher Korduplewski (Tinley Park Bulldogs WC) won by fall over Caybren Hubbard (Murphysboro Wrestling) Fall 1:21</li>\n<li>Cons. Round 5 - Hoyt Choate (Oswego WC) won by fall over Gabriel Kopecky (Team 312 WC) Fall 1:01</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Treyden Diduch (Alber Athletics WC) won by decision over Lucas Medina (Arlington Cardinals WC) Dec 7-6</li>\n<li>Semifinal - Michael McNamara (Edwardsville WC) won in tie breaker - 1 over Ayden Winchell (Callan Wrestling Academy) TB-1 4-3</li>\n<li>Cons. Round 5 - Julian Medina (Bolingbrook Junior Raiders WC) won by fall over Elijah Bell (Frankfort Wildcats Wrestling) Fall 0:49</li>\n<li>Cons. Round 5 - Benjamin Wells (Champaign WC) won by decision over Zander Johnson (Lion`s Den Wrestling Academy) Dec 9-4</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Carson West (St. Charles WC) won by major decision over Brycen Fahnestock (Blue Line Training Academy) Maj 16-4</li>\n<li>Semifinal - Michael Rundell (Arlington Cardinals WC) won by fall over Weston Frazier (Storm Youth WC) Fall 2:27</li>\n<li>Cons. Round 5 - Cam Whitehead (Alber Athletics WC) won by major decision over Logan Viau (Tinley Park Bulldogs WC) Maj 8-0</li>\n<li>Cons. Round 5 - Brandon Kalman (Elevate Wrestling Academy) won by decision over Rocco Valvano (Tribe WC) Dec 4-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Jayce Glauser (Fox Lake WC) won by major decision over Christian Corcoran (Lincoln-Way WC) Maj 14-0</li>\n<li>Semifinal - Ray Long (Martinez Fox Valley Elite WC) won by decision over Niko Odiotti (Arlington Cardinals WC) Dec 3-2</li>\n<li>Cons. Round 5 - Preston Morrison (SCN Youth WC) won by fall over Matthew Deutch (Southern Illinois Bulldogs WC) Fall 3:32</li>\n<li>Cons. Round 5 - Colton Wyller (Demolition WC) won by fall over Kaden Potter (St. Charles WC) Fall 2:54</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Semifinal - Logan Conover (Batavia WC) won by fall over Brady Glynn (Lincoln-Way WC) Fall 0:47</li>\n<li>Semifinal - Robert Ruscitti (Arlington Cardinals WC) won by tech fall over Jackson Marlett (St. Charles WC) TF 16-1</li>\n<li>Cons. Round 5 - Nick Dilallo (Arlington Cardinals WC) won by decision over Leyton Bartley (Lincoln-Way WC) Dec 7-1</li>\n<li>Cons. Round 5 - Eddie Woody Jr. (Edwardsville WC) won by tech fall over Justin Forbes (Caravan Kids WC) TF 16-1</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Semifinal - Dawson Hawthorne (Granite City Wrestling Association) won by decision over Lukas Foster (Callan Wrestling Academy) Dec 6-3</li>\n<li>Semifinal - Jamiel Castleberry (Beat the Streets Chicago-Bellwood) won by major decision over Talin Baker (Champaign WC) Maj 15-2</li>\n<li>Cons. Round 5 - Kaleb Pratt (Arlington Cardinals WC) won by fall over Rielen Hermsen (Toss Em Up Wrestling Academy) Fall 3:49</li>\n<li>Cons. Round 5 - Shane Stream (Lincoln-Way WC) won by decision over Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) Dec 4-2</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Semifinal - Rocco Cassioppi (Hononegah WC) won by fall over Adante Washington (Harvey Twisters WC) Fall 1:05</li>\n<li>Semifinal - Charlie Connors (Alber Athletics WC) won in SV-1 by fall over Nicholas Marchese (Crystal Lake Wizards WC) SV-1 (Fall) 5:01</li>\n<li>Cons. Round 5 - Michael Miranda (Team 312 WC) won by decision over Oscar Kalman (Elevate Wrestling Academy) Dec 6-0</li>\n<li>Cons. Round 5 - Mason Swartz (Storm Youth WC) won by major decision over Cole Forsyth (Stampede WC) Maj 10-0</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Semifinal - Bruno Cassioppi (Hononegah WC) won by fall over Gavin Woodmancy (St. Charles WC) Fall 0:44</li>\n<li>Semifinal - Benjamin Nadig (Alber Athletics WC) won by decision over Cohen Sweely (PSF Wrestling Academy) Dec 8-3</li>\n<li>Cons. Round 5 - Preston Waughtel (Bulls WC) won by tech fall over Hunter Toliver (Peoria Heights Minutemen WC) TF 17-2</li>\n<li>Cons. Round 5 - Tyler Lachenberg (Lincoln-Way WC) won by decision over John Hanrahan (Arlington Cardinals WC) Dec 7-0</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Semifinal - Ethan Sonne (Lincoln-Way WC) won by decision over Cameron Engels (Scorpion WC) Dec 8-2</li>\n<li>Semifinal - Aiden Arnett (Lincoln-Way WC) won by decision over Dawson Mack (Bolingbrook Junior Raiders WC) Dec 1-0</li>\n<li>Cons. Round 5 - Jacob Alvarez (Izzy Style Wrestling) won by decision over Sawyer Valdez (Sycamore WC) Dec 6-2</li>\n<li>Cons. Round 5 - Braxton Tolley (Granite City Wrestling Association) won by fall over Michael Malizzio (Team El1te Wrestling) Fall 2:32</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Semifinal - Thomas Banas (Demolition WC) won by decision over Daniel Blanke (Barrington Broncos WC) Dec 5-4</li>\n<li>Semifinal - Maximus Delgado (Yorkville WC) won by decision over Izaac Gaines (Blue Line Training Academy) Dec 2-0</li>\n<li>Cons. Round 5 - Brendan Nardin (Alber Athletics WC) won by decision over Chase Krantz (Blue Line Training Academy) Dec 2-0</li>\n<li>Cons. Round 5 - Jaxon Jorgensen (Bolingbrook Junior Raiders WC) won by tech fall over Davian Hall (Englewood Live Wire WC) TF 16-1</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Semifinal - Knox Verbais (Combative Sports Athletic Center Wrestling) won by tech fall over Aiden Quevedo (MadDog Wrestling Academy) TF 18-3</li>\n<li>Semifinal - Donovan Rosauer (Yorkville WC) won by decision over Gavin Watson (Sparta Junior Bulldogs WC) Dec 11-4</li>\n<li>Cons. Round 5 - Brayden McKay (Tinley Park Bulldogs WC) won by fall over Douglas Gemberling (Sycamore WC) Fall 0:53</li>\n<li>Cons. Round 5 - Frank Miceli (Mustang WC) won by decision over Jadon Zimmer (Lincoln-Way WC) Dec 9-4</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Semifinal - Trevon Williams (Springs Elite WC) won by decision over Reily Leifheit (Ottawa Wolfpack WC) Dec 7-5</li>\n<li>Semifinal - Radic Dvorak (ISI WC) won by decision over Kaden Meyer (Bolingbrook Junior Raiders WC) Dec 5-0</li>\n<li>Cons. Round 5 - Killian Rauch (Southern Illinois Bulldogs WC) won by decision over Nicholas Hermsen (Toss Em Up Wrestling Academy) Dec 5-4</li>\n<li>Cons. Round 5 - Brody Stien (Alber Athletics WC) won by fall over Benjamin Anderson (Sycamore WC) Fall 2:31</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Semifinal - Nicolas Astacio (ISI WC) won by fall over Rodrigo Salinas (Evanston School of Wrestling) Fall 0:23</li>\n<li>Semifinal - Brody Sendele (Hononegah WC) won by tech fall over James Wojcikiewicz (Bulls WC) TF 19-3</li>\n<li>Cons. Round 5 - Xander Keslin (Force Elite WC) won by fall over Nicolas Olvera (Naperville WC) Fall 0:59</li>\n<li>Cons. Round 5 - Kevin May (Southside Outlaws WC) won by fall over Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) Fall 3:00</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>Cons. Semi - Logan Boley (Marengo Youth WC) won by major decision over Quinn Hogan (Greg Gomez Trained Wrestling) Maj 17-6</li>\n<li>Cons. Semi - Aiden Rodriguez (ISI WC) won by fall over Xavier Pratt (Crosstown Spartan Elite WC) Fall 0:56</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>Cons. Semi - Knox Homola (Riot Room Wrestling) won by major decision over Anthony Samanich (Lockport Junior Porters WC) Maj 10-0</li>\n<li>Cons. Semi - Luka Rankovic (Naperville WC) won by fall over Cash Wetenkamp (Lincoln-Way WC) Fall 2:54</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Timothy Harrison (Harvey Twisters WC) won by fall over Asher Acevedo (Stockton Renegades WC) Fall 3:51</li>\n<li>Cons. Semi - Michael Limon-Prado (Bulldog Elite WC) won by fall over Nathan German (Toss Em Up Wrestling Academy) Fall 1:30</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Cons. Semi - Calvin Babcock (St. Charles WC) won by decision over Camden Chapman (Gladiator Elite WC) Dec 9-4</li>\n<li>Cons. Semi - Archer Smith (Hononegah WC) won in sudden victory - 1 over Jackson Allen (G2 WC) SV-1 9-7</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Cons. Semi - Jimmy Roach (Panther WC) won by decision over Bennett Hoffberg (St. Charles WC) Dec 9-2</li>\n<li>Cons. Semi - Grady Glowacki (Lakeland Predators WC) won by fall over Grayson Anderton (Nomad Wrestling Academy) Fall 0:17</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Cons. Semi - Reese Babcock (St. Charles WC) won by decision over Noah Thomas (Bulls WC) Dec 9-3</li>\n<li>Cons. Semi - Cameron Ramp (SOT-C) won by decision over Easton McDonnell (Lincoln-Way WC) Dec 7-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Landon Near (nWo WC) won by fall over Santino Scardina (Lions WC) Fall 3:52</li>\n<li>Cons. Semi - Crue Hatchell (Southside Outlaws WC) won by fall over Cale Dauber (Ottawa Wolfpack WC) Fall 1:00</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Cons. Semi - Jeffrey Dunaway (St. Charles WC) won by decision over Owen Thomas (Toss Em Up Wrestling Academy) Dec 7-2</li>\n<li>Cons. Semi - Maddux Rabczak (Alber Athletics WC) won by decision over Cael Saldana (Toss Em Up Wrestling Academy) Dec 10-3</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Cons. Semi - Obadiah Willis (Beat the Streets Chicago-Midway) won by decision over Rhyis Polenske (Blue Line Training Academy) Dec 8-1</li>\n<li>Cons. Semi - Kiernan Delaney (Toss Em Up Wrestling Academy) won by major decision over Daniel Zuehlke (Crystal Lake Wizards WC) Maj 10-0</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Cons. Semi - Jeremiah Hayes (Warrior Wrestling) won by fall over Landen Vincent (Blue Line Training Academy) Fall 1:14</li>\n<li>Cons. Semi - Colton Schultz (Callan Wrestling Academy) won by decision over Cameron Young (Alber Athletics WC) Dec 3-0</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Cons. Semi - Maddox Stonitsch (Lincoln-Way WC) won by decision over Vincente Halverson (Tribe WC) Dec 5-0</li>\n<li>Cons. Semi - Lincoln Mack (Bolingbrook Junior Raiders WC) won by decision over Rain Scott (Springs Elite WC) Dec 11-6</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Wyatt Mikkelsen (LaSalle Peru Crunching Cavs Youth WC) won by decision over Landon Weidler (Belleville Little Devils WC) Dec 9-4</li>\n<li>Cons. Semi - Kai Enos (Batavia WC) won by decision over Wyatt Franckowiak (Richmond WC) Dec 5-2</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Cons. Semi - Jaxon Trofimchuck (nWo WC) won by fall over Ricky Alfaro (Tribe WC) Fall 2:49</li>\n<li>Cons. Semi - Dawson Hull (Blue Line Training Academy) won by decision over Connor Kern (Yorkville WC) Dec 6-0</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Cons. Semi - Luke Banas (Demolition WC) won by decision over Jeffrey Hill (Naperville WC) Dec 13-8</li>\n<li>Cons. Semi - Ameer Khalil (Bolingbrook Junior Raiders WC) won by tech fall over Lucas Maier (SOT-C) TF 15-0</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Cons. Semi - Liam Hughes (Storm Youth WC) won by major decision over Sean Martinez (Peoria Razorbacks WC) Maj 8-0</li>\n<li>Cons. Semi - Trent Watson (Englewood Live Wire WC) won by decision over Austin Bielski (Elevate Wrestling Academy) Dec 6-5</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Cons. Semi - Sergio Calleros (Beat the Streets Chicago-Midway) won by decision over Amillian Beasley (Urbana Tigers WC) Dec 7-3</li>\n<li>Cons. Semi - Jamison Chambliss (Storm Youth WC) won by fall over Xavier Arroyo (Fox Lake WC) Fall 2:14</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Cons. Semi - Cole Yirsa (Lincoln-Way WC) won by fall over Malakai Davis (Beat the Streets Chicago-Midway) Fall 0:27</li>\n<li>Cons. Semi - Carter Hintz (Red Raiders Wrestling Team) won by tech fall over Ivan Torres (Collinsville WC) TF 21-6</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Cons. Semi - Gavin Ericson (Stampede WC) won by fall over Romeo Hernandez (Toss Em Up Wrestling Academy) Fall 1:22</li>\n<li>Cons. Semi - Christopher Easley (Force Elite WC) won by fall over Clyde Nott (Sycamore WC) Fall 0:28</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Aiden Bishop (Fox Valley WC) won by fall over Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) Fall 1:45</li>\n<li>Cons. Semi - Khaden Hallowell (SJO Youth WC) won by fall over Gannon Dunker (The Law WC) Fall 1:14</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Jack Amann (Southern Illinois Bulldogs WC) won by decision over Christopher Korduplewski (Tinley Park Bulldogs WC) Dec 2-0</li>\n<li>Cons. Semi - Jayden Chavez (Blackhawk WC) won by fall over Hoyt Choate (Oswego WC) Fall 1:22</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Julian Medina (Bolingbrook Junior Raiders WC) won by decision over Ayden Winchell (Callan Wrestling Academy) Dec 6-0</li>\n<li>Cons. Semi - Lucas Medina (Arlington Cardinals WC) won by major decision over Benjamin Wells (Champaign WC) Maj 13-4</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Cam Whitehead (Alber Athletics WC) won by major decision over Weston Frazier (Storm Youth WC) Maj 13-3</li>\n<li>Cons. Semi - Brycen Fahnestock (Blue Line Training Academy) won by decision over Brandon Kalman (Elevate Wrestling Academy) Dec 7-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Preston Morrison (SCN Youth WC) won by decision over Niko Odiotti (Arlington Cardinals WC) Dec 4-2</li>\n<li>Cons. Semi - Colton Wyller (Demolition WC) won by major decision over Christian Corcoran (Lincoln-Way WC) Maj 12-0</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Cons. Semi - Nick Dilallo (Arlington Cardinals WC) won by fall over Jackson Marlett (St. Charles WC) Fall 1:04</li>\n<li>Cons. Semi - Eddie Woody Jr. (Edwardsville WC) won by decision over Brady Glynn (Lincoln-Way WC) Dec 2-0</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Cons. Semi - Kaleb Pratt (Arlington Cardinals WC) won by decision over Talin Baker (Champaign WC) Dec 7-3</li>\n<li>Cons. Semi - Lukas Foster (Callan Wrestling Academy) won by decision over Shane Stream (Lincoln-Way WC) Dec 6-3</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Cons. Semi - Nicholas Marchese (Crystal Lake Wizards WC) won by decision over Michael Miranda (Team 312 WC) Dec 5-3</li>\n<li>Cons. Semi - Adante Washington (Harvey Twisters WC) won by major decision over Mason Swartz (Storm Youth WC) Maj 8-0</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Cons. Semi - Preston Waughtel (Bulls WC) won by fall over Cohen Sweely (PSF Wrestling Academy) Fall 2:44</li>\n<li>Cons. Semi - Tyler Lachenberg (Lincoln-Way WC) won by fall over Gavin Woodmancy (St. Charles WC) Fall 0:39</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Cons. Semi - Dawson Mack (Bolingbrook Junior Raiders WC) won by decision over Jacob Alvarez (Izzy Style Wrestling) Dec 10-6</li>\n<li>Cons. Semi - Braxton Tolley (Granite City Wrestling Association) won by fall over Cameron Engels (Scorpion WC) Fall 1:47</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Cons. Semi - Izaac Gaines (Blue Line Training Academy) won by decision over Brendan Nardin (Alber Athletics WC) Dec 6-1</li>\n<li>Cons. Semi - Daniel Blanke (Barrington Broncos WC) won by decision over Jaxon Jorgensen (Bolingbrook Junior Raiders WC) Dec 4-3</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Cons. Semi - Brayden McKay (Tinley Park Bulldogs WC) won by decision over Gavin Watson (Sparta Junior Bulldogs WC) Dec 7-0</li>\n<li>Cons. Semi - Frank Miceli (Mustang WC) won by decision over Aiden Quevedo (MadDog Wrestling Academy) Dec 4-3</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Cons. Semi - Killian Rauch (Southern Illinois Bulldogs WC) won by decision over Kaden Meyer (Bolingbrook Junior Raiders WC) Dec 7-6</li>\n<li>Cons. Semi - Reily Leifheit (Ottawa Wolfpack WC) won by fall over Brody Stien (Alber Athletics WC) Fall 0:50</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Cons. Semi - James Wojcikiewicz (Bulls WC) won by decision over Xander Keslin (Force Elite WC) Dec 8-3</li>\n<li>Cons. Semi - Kevin May (Southside Outlaws WC) won by fall over Rodrigo Salinas (Evanston School of Wrestling) Fall 2:56</li>\n</ul>\n</section>",
  "3rd, 5th, & 7th Place Bouts": "<section class=\"tw-list\">\n<h1>3rd, 5th, &amp; 7th Place Bouts</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>3rd Place Match - Aiden Rodriguez (ISI WC) won by decision over Logan Boley (Marengo Youth WC) Dec 7-6</li>\n<li>5th Place Match - Quinn Hogan (Greg Gomez Trained Wrestling) won by decision over Xavier Pratt (Crosstown Spartan Elite WC) Dec 10-5</li>\n<li>7th Place Match - Nathan Vogler (Oak Forest Warriors WC) won by fall over Brooks Tyler (Evanston School of Wrestling) Fall 3:30</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>3rd Place Match - Knox Homola (Riot Room Wrestling) won by decision over Luka Rankovic (Naperville WC) Dec 3-1</li>\n<li>5th Place Match - Anthony Samanich (Lockport Junior Porters WC) won by injury default over Cash Wetenkamp (Lincoln-Way WC) Inj. 0:00</li>\n<li>7th Place Match - Art Bytyqi (Evanston School of Wrestling) won by major decision over Mason Henderson (Stockton Renegades WC) Maj 9-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Timothy Harrison (Harvey Twisters WC) won by fall over Michael Limon-Prado (Bulldog Elite WC) Fall 3:57</li>\n<li>5th Place Match - Nathan German (Toss Em Up Wrestling Academy) won by decision over Asher Acevedo (Stockton Renegades WC) Dec 9-2</li>\n<li>7th Place Match - Jacob Garcia (Martinez Fox Valley Elite WC) won by fall over Olivia Rosine (Charleston WC) Fall 0:18</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>3rd Place Match - Calvin Babcock (St. Charles WC) won by decision over Archer Smith (Hononegah WC) Dec 5-3</li>\n<li>5th Place Match - Camden Chapman (Gladiator Elite WC) won by fall over Jackson Allen (G2 WC) Fall 3:34</li>\n<li>7th Place Match - Julian Godina (Lincoln-Way WC) won by fall over Vincent Cumbo (Vittum Cats WC) Fall 0:37</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>3rd Place Match - Grady Glowacki (Lakeland Predators WC) won in sudden victory - 1 over Jimmy Roach (Panther WC) SV-1 8-6</li>\n<li>5th Place Match - Bennett Hoffberg (St. Charles WC) won by decision over Grayson Anderton (Nomad Wrestling Academy) Dec 5-3</li>\n<li>7th Place Match - Noah Flores (Force Elite WC) won by decision over Rocco Maheras (Vittum Cats WC) Dec 6-2</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>3rd Place Match - Reese Babcock (St. Charles WC) won by major decision over Cameron Ramp (SOT-C) Maj 10-1</li>\n<li>5th Place Match - Noah Thomas (Bulls WC) won by major decision over Easton McDonnell (Lincoln-Way WC) Maj 8-0</li>\n<li>7th Place Match - Brady Myatt (Fox Lake WC) won by fall over Caleb Callaghan (Lincoln-Way WC) Fall 2:39</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Crue Hatchell (Southside Outlaws WC) won by major decision over Landon Near (nWo WC) Maj 14-3</li>\n<li>5th Place Match - Cale Dauber (Ottawa Wolfpack WC) won by injury default over Santino Scardina (Lions WC) Inj. 3:45</li>\n<li>7th Place Match - Liam Kissane (Tinley Park Bulldogs WC) won by decision over Elijah Nadig (Alber Athletics WC) Dec 3-0</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>3rd Place Match - Jeffrey Dunaway (St. Charles WC) won by major decision over Maddux Rabczak (Alber Athletics WC) Maj 10-2</li>\n<li>5th Place Match - Cael Saldana (Toss Em Up Wrestling Academy) won by fall over Owen Thomas (Toss Em Up Wrestling Academy) Fall 3:35</li>\n<li>7th Place Match - Colin Crouch (Triad Knights WC) won by decision over Jack Benesh (Hawk WC) Dec 9-4</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>3rd Place Match - Kiernan Delaney (Toss Em Up Wrestling Academy) won by decision over Obadiah Willis (Beat the Streets Chicago-Midway) Dec 4-2</li>\n<li>5th Place Match - Rhyis Polenske (Blue Line Training Academy) won by decision over Daniel Zuehlke (Crystal Lake Wizards WC) Dec 7-4</li>\n<li>7th Place Match - Alec Daly (Unity Youth WC) won by decision over Carl Cody Weidner (Combative Sports Athletic Center Wrestling) Dec 8-2</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>3rd Place Match - Colton Schultz (Callan Wrestling Academy) won by decision over Jeremiah Hayes (Warrior Wrestling) Dec 9-2</li>\n<li>5th Place Match - Cameron Young (Alber Athletics WC) won by decision over Landen Vincent (Blue Line Training Academy) Dec 3-1</li>\n<li>7th Place Match - Maximus Pearch (nWo WC) won by decision over Owen Catalano (Fox Lake WC) Dec 3-1</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>3rd Place Match - Lincoln Mack (Bolingbrook Junior Raiders WC) won by decision over Maddox Stonitsch (Lincoln-Way WC) Dec 5-3</li>\n<li>5th Place Match - Rain Scott (Springs Elite WC) won by major decision over Vincente Halverson (Tribe WC) Maj 10-1</li>\n<li>7th Place Match - Dylan Curtis (Sycamore WC) won by major decision over Nathan Raban (Southern Illinois Bulldogs WC) Maj 13-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Kai Enos (Batavia WC) won by decision over Wyatt Mikkelsen (LaSalle Peru Crunching Cavs Youth WC) Dec 8-1</li>\n<li>5th Place Match - Landon Weidler (Belleville Little Devils WC) won by decision over Wyatt Franckowiak (Richmond WC) Dec 5-2</li>\n<li>7th Place Match - Andrew Lehman (Beat the Streets Chicago-Midway) won in sudden victory - 1 over Cleto Protti (Bolingbrook Junior Raiders WC) SV-1 6-4</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>3rd Place Match - Dawson Hull (Blue Line Training Academy) won by decision over Jaxon Trofimchuck (nWo WC) Dec 6-2</li>\n<li>5th Place Match - Ricky Alfaro (Tribe WC) won in sudden victory - 1 over Connor Kern (Yorkville WC) SV-1 2-0</li>\n<li>7th Place Match - Gregory Harkey (Bulls WC) won by decision over Noah Cerny (Red Raiders Wrestling Team) Dec 7-0</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>3rd Place Match - Ameer Khalil (Bolingbrook Junior Raiders WC) won by decision over Luke Banas (Demolition WC) Dec 6-0</li>\n<li>5th Place Match - Lucas Maier (SOT-C) won by fall over Jeffrey Hill (Naperville WC) Fall 2:18</li>\n<li>7th Place Match - Jaret Waters (Road Warriors WC) won by decision over Jayden Hermacinski (Peoria Razorbacks WC) Dec 11-8</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>3rd Place Match - Liam Hughes (Storm Youth WC) won by fall over Trent Watson (Englewood Live Wire WC) Fall 4:28</li>\n<li>5th Place Match - Sean Martinez (Peoria Razorbacks WC) won by decision over Austin Bielski (Elevate Wrestling Academy) Dec 2-0</li>\n<li>7th Place Match - Jaxton Carroll (Vandalia Jr WC) won by decision over Owen Alderson (Williamsville WC) Dec 5-2</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>3rd Place Match - Jamison Chambliss (Storm Youth WC) won in tie breaker - 1 over Sergio Calleros (Beat the Streets Chicago-Midway) TB-1 2-1</li>\n<li>5th Place Match - Xavier Arroyo (Fox Lake WC) won by major decision over Amillian Beasley (Urbana Tigers WC) Maj 11-3</li>\n<li>7th Place Match - Micah Stringini (The Law WC) won by fall over Payton Chanerl (East St. Louis WC) Fall 1:50</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>3rd Place Match - Carter Hintz (Red Raiders Wrestling Team) won by fall over Cole Yirsa (Lincoln-Way WC) Fall 1:43</li>\n<li>5th Place Match - Malakai Davis (Beat the Streets Chicago-Midway) won by tech fall over Ivan Torres (Collinsville WC) TF 15-0</li>\n<li>7th Place Match - Hayden Wheeler (Yorkville WC) won by decision over Fernando Anaya (Blackhawk WC) Dec 11-4</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>3rd Place Match - Gavin Ericson (Stampede WC) won by fall over Christopher Easley (Force Elite WC) Fall 0:15</li>\n<li>5th Place Match - Clyde Nott (Sycamore WC) won by fall over Romeo Hernandez (Toss Em Up Wrestling Academy) Fall 2:25</li>\n<li>7th Place Match - Mason West (Southern Illinois Bulldogs WC) won by fall over Gregory Heavey (Wheaton Tigers WC) Fall 1:17</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Aiden Bishop (Fox Valley WC) won by fall over Khaden Hallowell (SJO Youth WC) Fall 2:50</li>\n<li>5th Place Match - Gannon Dunker (The Law WC) won by fall over Alex Tucker (LaSalle Peru Crunching Cavs Youth WC) Fall 0:27</li>\n<li>7th Place Match - Jonathon Caudle (O`Fallon Little Panthers WC) won by fall over Aj Forst (Fox Valley WC) Fall 0:40</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Jayden Chavez (Blackhawk WC) won by fall over Jack Amann (Southern Illinois Bulldogs WC) Fall 2:46</li>\n<li>5th Place Match - Christopher Korduplewski (Tinley Park Bulldogs WC) won in sudden victory - 1 over Hoyt Choate (Oswego WC) SV-1 9-7</li>\n<li>7th Place Match - Caybren Hubbard (Murphysboro Wrestling) won by fall over Gabriel Kopecky (Team 312 WC) Fall 2:45</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Julian Medina (Bolingbrook Junior Raiders WC) won by fall over Lucas Medina (Arlington Cardinals WC) Fall 1:19</li>\n<li>5th Place Match - Ayden Winchell (Callan Wrestling Academy) won by fall over Benjamin Wells (Champaign WC) Fall 2:49</li>\n<li>7th Place Match - Elijah Bell (Frankfort Wildcats Wrestling) won by decision over Zander Johnson (Lion`s Den Wrestling Academy) Dec 4-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Cam Whitehead (Alber Athletics WC) won by fall over Brycen Fahnestock (Blue Line Training Academy) Fall 3:51</li>\n<li>5th Place Match - Brandon Kalman (Elevate Wrestling Academy) won by decision over Weston Frazier (Storm Youth WC) Dec 5-4</li>\n<li>7th Place Match - Rocco Valvano (Tribe WC) won by fall over Logan Viau (Tinley Park Bulldogs WC) Fall 3:54</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Colton Wyller (Demolition WC) won by decision over Preston Morrison (SCN Youth WC) Dec 1-0</li>\n<li>5th Place Match - Niko Odiotti (Arlington Cardinals WC) won by decision over Christian Corcoran (Lincoln-Way WC) Dec 2-0</li>\n<li>7th Place Match - Kaden Potter (St. Charles WC) won by decision over Matthew Deutch (Southern Illinois Bulldogs WC) Dec 7-0</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>3rd Place Match - Eddie Woody Jr. (Edwardsville WC) won by fall over Nick Dilallo (Arlington Cardinals WC) Fall 2:38</li>\n<li>5th Place Match - Jackson Marlett (St. Charles WC) won by decision over Brady Glynn (Lincoln-Way WC) Dec 6-2</li>\n<li>7th Place Match - Leyton Bartley (Lincoln-Way WC) won by decision over Justin Forbes (Caravan Kids WC) Dec 5-2</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>3rd Place Match - Lukas Foster (Callan Wrestling Academy) won by decision over Kaleb Pratt (Arlington Cardinals WC) Dec 4-2</li>\n<li>5th Place Match - Talin Baker (Champaign WC) won by decision over Shane Stream (Lincoln-Way WC) Dec 4-0</li>\n<li>7th Place Match - Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) won by decision over Rielen Hermsen (Toss Em Up Wrestling Academy) Dec 9-2</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>3rd Place Match - Adante Washington (Harvey Twisters WC) won by decision over Nicholas Marchese (Crystal Lake Wizards WC) Dec 5-0</li>\n<li>5th Place Match - Mason Swartz (Storm Youth WC) won by decision over Michael Miranda (Team 312 WC) Dec 6-4</li>\n<li>7th Place Match - Oscar Kalman (Elevate Wrestling Academy) won by decision over Cole Forsyth (Stampede WC) Dec 5-0</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>3rd Place Match - Preston Waughtel (Bulls WC) won by major decision over Tyler Lachenberg (Lincoln-Way WC) Maj 15-3</li>\n<li>5th Place Match - Cohen Sweely (PSF Wrestling Academy) won by fall over Gavin Woodmancy (St. Charles WC) Fall 1:30</li>\n<li>7th Place Match - John Hanrahan (Arlington Cardinals WC) won by major decision over Hunter Toliver (Peoria Heights Minutemen WC) Maj 14-6</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>3rd Place Match - Dawson Mack (Bolingbrook Junior Raiders WC) won by decision over Braxton Tolley (Granite City Wrestling Association) Dec 7-0</li>\n<li>5th Place Match - Jacob Alvarez (Izzy Style Wrestling) won by tech fall over Cameron Engels (Scorpion WC) TF 15-0</li>\n<li>7th Place Match - Michael Malizzio (Team El1te Wrestling) won in tie breaker - 1 over Sawyer Valdez (Sycamore WC) TB-1 2-1</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>3rd Place Match - Daniel Blanke (Barrington Broncos WC) won by fall over Izaac Gaines (Blue Line Training Academy) Fall 1:26</li>\n<li>5th Place Match - Jaxon Jorgensen (Bolingbrook Junior Raiders WC) won by decision over Brendan Nardin (Alber Athletics WC) Dec 6-3</li>\n<li>7th Place Match - Chase Krantz (Blue Line Training Academy) won by major decision over Davian Hall (Englewood Live Wire WC) Maj 10-2</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>3rd Place Match - Frank Miceli (Mustang WC) won by decision over Brayden McKay (Tinley Park Bulldogs WC) Dec 2-1</li>\n<li>5th Place Match - Gavin Watson (Sparta Junior Bulldogs WC) won by decision over Aiden Quevedo (MadDog Wrestling Academy) Dec 1-0</li>\n<li>7th Place Match - Jadon Zimmer (Lincoln-Way WC) won by decision over Douglas Gemberling (Sycamore WC) Dec 10-4</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>3rd Place Match - Killian Rauch (Southern Illinois Bulldogs WC) won by fall over Reily Leifheit (Ottawa Wolfpack WC) Fall 4:00</li>\n<li>5th Place Match - Kaden Meyer (Bolingbrook Junior Raiders WC) won in sudden victory - 1 over Brody Stien (Alber Athletics WC) SV-1 4-2</li>\n<li>7th Place Match - Nicholas Hermsen (Toss Em Up Wrestling Academy) won by major decision over Benjamin Anderson (Sycamore WC) Maj 11-0</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>3rd Place Match - James Wojcikiewicz (Bulls WC) won by fall over Kevin May (Southside Outlaws WC) Fall 3:48</li>\n<li>5th Place Match - Rodrigo Salinas (Evanston School of Wrestling) won by decision over Xander Keslin (Force Elite WC) Dec 5-1</li>\n<li>7th Place Match - Nicolas Olvera (Naperville WC) won by decision over Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) Dec 5-3</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 154</h2>\n<ul>\n<li>1st Place Match - Eli Miller (Granite City Wrestling Association) won by fall over Daniel Jackson (Southern Illinois Bulldogs WC) Fall 4:16</li>\n</ul>\n<h2>Novice 178</h2>\n<ul>\n<li>1st Place Match - Rage Henderson (Gladiator Elite WC) won by fall over Jake Luedtke (Tinley Park Bulldogs WC) Fall 0:50</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Cameron Casey (Team Mascoutah WC) won by fall over Donovan Olmstead (Southern Illinois Bulldogs WC) Fall 0:22</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>1st Place Match - Kamari Tate (Englewood Live Wire WC) won by decision over Cannon Ziller (Hawk WC) Dec 7-3</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>1st Place Match - Giovonni Nix (Englewood Live Wire WC) won by major decision over Aden Spinelli (nWo WC) Maj 14-2</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>1st Place Match - Carter Noonan (Ottawa Wolfpack WC) won by decision over Wesley Janick (nWo WC) Dec 1-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Erik Klichurov (Izzy Style Wrestling) won by decision over Hogan Rice (St. Charles WC) Dec 5-1</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>1st Place Match - Jaden Washington (Harvey Twisters WC) won by fall over Finn McDermott (Force Elite WC) Fall 3:52</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>1st Place Match - Nikolas Duarte (Arlington Cardinals WC) won by decision over Te`Jon Beals (Harvey Twisters WC) Dec 6-1</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>1st Place Match - Brody Page (Yorkville WC) won by decision over Ethan Hamilton (Harvey Twisters WC) Dec 7-5</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>1st Place Match - Kane Dauber (Ottawa Wolfpack WC) won by decision over Dylan Knaus (ISI WC) Dec 7-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Devin Ehler (Storm Youth WC) won by decision over Julius Cole (Yorkville WC) Dec 9-3</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>1st Place Match - Axel Rodriguez (Beat the Streets Chicago-Midway) won by fall over Titan Henderson (Gladiator Elite WC) Fall 3:59</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>1st Place Match - Otis Davis (Harvey Twisters WC) won by fall over Mason Villarreal (nWo WC) Fall 0:56</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>1st Place Match - Brian Goggin (Panther WC) won by decision over Langston Norlin (Oswego WC) Dec 9-7</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>1st Place Match - Isaac Barrientos (Bolingbrook Junior Raiders WC) won by decision over Daniel Costello (Mustang WC) Dec 8-5</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>1st Place Match - Jaxson Mathenia (Southern Illinois Bulldogs WC) won by fall over Aaden Arroyo (Fox Lake WC) Fall 0:39</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>1st Place Match - Fares Ibraheem (Fox Valley WC) won by fall over Michael Hardin (Danville Chargers WC) Fall 3:00</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Hunter Wahtola (Beat the Streets Chicago-Avondale) Fall 2:49</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Brandon Monroy (Aurora WC) won by decision over Jake Johnson (Naperville WC) Dec 5-0</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Michael McNamara (Edwardsville WC) won by major decision over Treyden Diduch (Alber Athletics WC) Maj 13-4</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Michael Rundell (Arlington Cardinals WC) won by fall over Carson West (St. Charles WC) Fall 2:56</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Ray Long (Martinez Fox Valley Elite WC) won by decision over Jayce Glauser (Fox Lake WC) Dec 5-2</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>1st Place Match - Logan Conover (Batavia WC) won by decision over Robert Ruscitti (Arlington Cardinals WC) Dec 8-6</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>1st Place Match - Jamiel Castleberry (Beat the Streets Chicago-Bellwood) won by decision over Dawson Hawthorne (Granite City Wrestling Association) Dec 5-1</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>1st Place Match - Rocco Cassioppi (Hononegah WC) won by fall over Charlie Connors (Alber Athletics WC) Fall 2:38</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>1st Place Match - Bruno Cassioppi (Hononegah WC) won by fall over Benjamin Nadig (Alber Athletics WC) Fall 4:27</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>1st Place Match - Ethan Sonne (Lincoln-Way WC) won in sudden victory - 1 over Aiden Arnett (Lincoln-Way WC) SV-1 4-2</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>1st Place Match - Thomas Banas (Demolition WC) won in sudden victory - 1 over Maximus Delgado (Yorkville WC) SV-1 5-3</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>1st Place Match - Knox Verbais (Combative Sports Athletic Center Wrestling) won by decision over Donovan Rosauer (Yorkville WC) Dec 11-4</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>1st Place Match - Radic Dvorak (ISI WC) won by decision over Trevon Williams (Springs Elite WC) Dec 7-2</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>1st Place Match - Brody Sendele (Hononegah WC) won by tech fall over Nicolas Astacio (ISI WC) TF 21-4</li>\n</ul>\n</section>"
}
