{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>Champ. Round 1 - Michael Hardin (Danville Chargers WC) won by fall over Rylee McClellan (Bulls WC) Fall 1:15</li>\n<li>Champ. Round 1 - Luka Rankovic (Naperville WC) won by fall over Garrett Ziller (Lockport Junior Porters WC) Fall 0:43</li>\n<li>Champ. Round 1 - Kalvin Brazzell (Mattoon Youth WC) won by fall over Anthony Samanich (Lockport Junior Porters WC) Fall 0:57</li>\n<li>Champ. Round 1 - Blake Pohlman (Glenbard East Jr Rams WC) won by fall over Drake Boucher (Murphysboro Wrestling) Fall 1:01</li>\n<li>Champ. Round 1 - Frankie Solis (Marengo Youth WC) won by fall over Levi Armstrong (Peoria Razorbacks WC) Fall 1:27</li>\n<li>Champ. Round 1 - Travis Ellis (Harvey Twisters) won by fall over Jacksyn Windham (Hawk WC) Fall 3:12</li>\n<li>Champ. Round 1 - Gregory Heavey (Wheaton Tigers WC) won by decision over Ryan Hess (Marengo Youth WC) Dec 8-2</li>\n<li>Champ. Round 1 - Hayden Wheeler (Yorkville WC) won in SV-1 by fall over Christopher Korduplewski (Tinley Park Bulldogs WC) SV-1 (Fall) 0:00</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Donovan Olmstead (Belleville Little Devils WC) won by fall over Nathan Marshall (Champaign WC) Fall 2:23</li>\n<li>Champ. Round 1 - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Nathaniel Dorado (Wolfpak WC) Fall 1:25</li>\n<li>Champ. Round 1 - Jonathon Caudle (O`Fallon Little Panthers WC) won by fall over Cayden Berryhill (G2 WC) Fall 0:26</li>\n<li>Champ. Round 1 - Samuel Swais (Elk Grove Junior Grens WC) won by fall over Keagen Schneider (Metamora Kids WC) Fall 1:26</li>\n<li>Champ. Round 1 - Dennis Rottmann (Highland Bulldog Jr. WC) won by fall over Vaughn Schmidt (Glenbard East Jr Rams WC) Fall 2:50</li>\n<li>Champ. Round 1 - William Reyes (MadDog Wrestling Academy) won by fall over Andrew Abernathie (Morton Youth WC) Fall 2:03</li>\n<li>Champ. Round 1 - Bane Wulf (Lions WC) won by fall over Jose Octavio Velazquez (Scorpion WC) Fall 0:39</li>\n<li>Champ. Round 1 - Alex Tucker (Timber Wolves WC) won by fall over Nicholas Kackert (Guerrero`s Garage Wrestling) Fall 1:06</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Champ. Round 1 - Jackson Collins (Falcon Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jimmy Roach (Panther WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Julian Godina (Harvey Twisters) received a bye   () Bye</li>\n<li>Champ. Round 1 - Nolan Renz (Metamora Kids WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Kaden Cox (Murphysboro Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Anthony Hansen (River Bend WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Champ. Round 1 - Clark Goodwin (Lincoln-Way WC) won by decision over Damon Glenn (Unity Youth WC) Dec 7-1</li>\n<li>Champ. Round 1 - Coltin Hartman (River Bend WC) won by decision over Zander Johnson (Granite City Wrestling Association) Dec 6-5</li>\n<li>Champ. Round 1 - Julian Medina (Bolingbrook Junior Raiders WC) won by decision over Zachary Cooley (Granite City Wrestling Association) Dec 7-4</li>\n<li>Champ. Round 1 - Maddox Lawrence (Yorkville WC) won by fall over Kason Cramer (Storm Youth WC) Fall 3:36</li>\n<li>Champ. Round 1 - Gage Enos (Batavia WC) won by fall over Liam Mcgovern (Fox Lake WC) Fall 1:30</li>\n<li>Champ. Round 1 - Travis Wilgosiewicz (ISI WC) won by decision over Rocco Maheras (Vittum Cats WC) Dec 5-0</li>\n<li>Champ. Round 1 - Donovan Johnson (Blackhawk WC) won by decision over Kevin Bisonaya (Panther WC) Dec 5-3</li>\n<li>Champ. Round 1 - Jace Scribner (Rockford WC) won by decision over Mateo Odiotti (Arlington Cardinals WC) Dec 11-9</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Champ. Round 1 - Connor Collins (Olympia WC) won by fall over Dominic Melody (Mat Rat WC) Fall 2:42</li>\n<li>Champ. Round 1 - Jeffrey Dunaway (St. Charles WC) won by decision over Ayden Winchell (Callan Wrestling Academy) Dec 5-0</li>\n<li>Champ. Round 1 - Zayne Salah (Elevate Wrestling Academy) won by decision over Rhett Wilson (Williamsville WC) Dec 7-2</li>\n<li>Champ. Round 1 - Erik Klichurov (Izzy Style Wrestling) won by tech fall over Rocco Valvano (Tribe WC) TF 22-7</li>\n<li>Champ. Round 1 - Riley Smith (Granite City Wrestling Association) won by decision over Lincoln Carlson (Oak Forest Warriors WC) Dec 5-0</li>\n<li>Champ. Round 1 - Hudson Price (River Bend WC) won by fall over John Chappell (Bulls WC) Fall 1:25</li>\n<li>Champ. Round 1 - Liam Kissane (Tinley Park Bulldogs WC) won by fall over Daniel Macatangay (Force Elite WC) Fall 0:59</li>\n<li>Champ. Round 1 - Brycen Fahnestock (Junior Raiders West WC) won by major decision over Michael McNamara (Edwardsville WC) Maj 8-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Jayce Glauser (Fox Lake WC) won by fall over Jase Edrington (Storm Youth WC) Fall 4:03</li>\n<li>Champ. Round 1 - Colton Drinkwine (nWo WC) won by fall over Nolan Glynn (Lincoln-Way WC) Fall 4:21</li>\n<li>Champ. Round 1 - Landon Rhodes (Storm Youth WC) won by major decision over Gabriel Bass (Team 1006 Wrestling) Maj 12-2</li>\n<li>Champ. Round 1 - Kiernan Delaney (Toss Em Up Wrestling Academy) won by major decision over Aiden Weber (Elevate Wrestling Academy) Maj 9-0</li>\n<li>Champ. Round 1 - Adonis Washington (Harvey Twisters) won by decision over Jackson Marlett (St. Charles WC) Dec 8-5</li>\n<li>Champ. Round 1 - Dominic Angileri (Hononegah WC) won by major decision over Chace Hall (Murphysboro Wrestling) Maj 16-6</li>\n<li>Champ. Round 1 - Obadiah Willis (Beat the Streets-Chicago) won by tech fall over Maddox Williams (Alton Little Redbirds WC) TF 17-0</li>\n<li>Champ. Round 1 - Charlie Olson (Sycamore WC) won by major decision over Joseph Calvillo (Batavia WC) Maj 16-2</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Champ. Round 1 - Pedro Alberto Rangel (Storm Youth WC) won by fall over Kazmyn Barber (Dixon WC) Fall 1:20</li>\n<li>Champ. Round 1 - Santiago Trejo (Southside Outlaws WC) won by decision over Aiden Evans (Vandalia Jr WC) Dec 3-0</li>\n<li>Champ. Round 1 - Rain Scott (Springs Elite WC) won by decision over Bentley Fields (Falcon Youth WC) Dec 6-1</li>\n<li>Champ. Round 1 - Aidan Lopez (nWo WC) won by major decision over Griffin Diehl (Murphysboro Wrestling) Maj 11-2</li>\n<li>Champ. Round 1 - Archer Biag (Naperville WC) won by decision over Landon Jaski (Alber Athletics WC) Dec 3-0</li>\n<li>Champ. Round 1 - Shane Stream (Lincoln-Way WC) won by major decision over Ray Long (Team El1te Wrestling) Maj 15-4</li>\n<li>Champ. Round 1 - Brady Glynn (Lincoln-Way WC) won by fall over Brogan Sendele (Hononegah WC) Fall 0:26</li>\n<li>Champ. Round 1 - Jacob Smith (Lakeland Predators WC) won by decision over James Kowalkski (Scorpion WC) Dec 6-0</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Champ. Round 1 - Robert Ruscitti (Arlington Cardinals WC) won by decision over Talin Baker (Champaign WC) Dec 5-2</li>\n<li>Champ. Round 1 - Louie King (Lions WC) won by decision over Max Moreno (LaSalle Peru Crunching Cavs Youth WC) Dec 11-10</li>\n<li>Champ. Round 1 - Alexander Osborne (Team Poeta) won by tech fall over Rocky Delgado (Yorkville WC) TF 17-0</li>\n<li>Champ. Round 1 - Kannon Judycki (Southside Outlaws WC) won by fall over Weston Church (Storm Youth WC) Fall 2:01</li>\n<li>Champ. Round 1 - Oscar Kalman (Elevate Wrestling Academy) won by fall over Carson Benesh (Hawk WC) Fall 2:52</li>\n<li>Champ. Round 1 - Carl Cody Weidner (Highland Bulldog Jr. WC) won by fall over Quinn Vitek (St. Charles WC) Fall 3:59</li>\n<li>Champ. Round 1 - Nolan Chrisse (Bolingbrook Junior Raiders WC) won by major decision over Michael Riggs (Wheaton Tigers WC) Maj 10-1</li>\n<li>Champ. Round 1 - Christopher Talbert (Crystal Lake Wizards WC) won by fall over Kanton Richards (Murphysboro Wrestling) Fall 1:03</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Champ. Round 1 - Jesse Swiney (Champaign WC) won by fall over Trotter Titus (Mattoon Youth WC) Fall 2:41</li>\n<li>Champ. Round 1 - Ethan Sonne (Lincoln-Way WC) won by decision over Logan Woodbury (ISI WC) Dec 2-0</li>\n<li>Champ. Round 1 - Cameron Young (Belvidere Bandits WC) won by decision over Rylan Poeta (Champaign WC) Dec 6-1</li>\n<li>Champ. Round 1 - Max Mandac (Lincoln-Way WC) won by major decision over Michael Goolish (MadDog Wrestling Academy) Maj 12-2</li>\n<li>Champ. Round 1 - Cole Forsyth (Junior Bronco WC) won by decision over Jase Holshouser (AJ Jr. Wildcats WC) Dec 7-4</li>\n<li>Champ. Round 1 - Robert Williams (Harvey Twisters) won by decision over Brody Page (Yorkville WC) Dec 9-5</li>\n<li>Champ. Round 1 - Lucas Zhao (Downers Grove WC) won in tie breaker - 1 over Chase Frye (Fighting Farmers WC) TB-1 5-4</li>\n<li>Champ. Round 1 - Andrew Lehman (Beat the Streets-Chicago) won by decision over Kaeden Davis (Olney Cubs WC) Dec 7-2</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Champ. Round 1 - Anthony Brown (Proviso Township Gladiators WC) won by fall over John Gough (MadDog Wrestling Academy) Fall 0:59</li>\n<li>Champ. Round 1 - Zachary Johnson (Rochelle WC) won by decision over Colton Johnson (Falcon Youth WC) Dec 5-4</li>\n<li>Champ. Round 1 - Khalid Eid (Astro WC) won by fall over Jeremy Judd (Williamsville WC) Fall 2:50</li>\n<li>Champ. Round 1 - Wyatt Franckowiak (Richmond WC) won by fall over Jack Hills (Team Poeta) Fall 3:55</li>\n<li>Champ. Round 1 - Landen Vincent (Junior Pioneer WC) won by major decision over Myles Greenfield (Belleville Little Devils WC) Maj 9-0</li>\n<li>Champ. Round 1 - Jadon Zimmer (Lincoln-Way WC) won by major decision over Jace Serpa (Tribe WC) Maj 11-3</li>\n<li>Champ. Round 1 - Devon Swope (DC WC) won by major decision over Ashton Glisson (St. Charles WC) Maj 10-0</li>\n<li>Champ. Round 1 - Joshua Harkey (Bulls WC) won by decision over Matthew Laird (Callan Wrestling Academy) Dec 6-4</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Cael Perry (Batavia WC) won by decision over Keandre Towns (Champaign WC) Dec 7-6</li>\n<li>Champ. Round 1 - Dawson Hull (Blue Line Training Academy) won by fall over Malek Jaber (Beat the Streets-Chicago) Fall 0:51</li>\n<li>Champ. Round 1 - Kardeon Glover (Proviso Township Gladiators WC) won by major decision over Cody Culbertson (Rantoul Youth Wrestling) Maj 11-2</li>\n<li>Champ. Round 1 - Colton Mosack (DC WC) won by major decision over Deziree Azar (Naperville WC) Maj 10-0</li>\n<li>Champ. Round 1 - Samuel Cushman (Barrington Broncos WC) won by fall over Titan Henderson (Gladiator Elite WC) Fall 3:27</li>\n<li>Champ. Round 1 - Tyler Lachenberg (Lincoln-Way WC) won by fall over Dylan Knaus (ISI WC) Fall 0:44</li>\n<li>Champ. Round 1 - Brady Ritter (Bolingbrook Junior Raiders WC) won by decision over Antoine Shaw (Gladiator Elite WC) Dec 7-1</li>\n<li>Champ. Round 1 - William Julian (Xtreme WC) won by fall over Dominic Sponsel (Arlington Cardinals WC) Fall 0:55</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Champ. Round 1 - Daniel Lynch (Tinley Park Bulldogs WC) won by decision over Alexander Vega (Red Raiders Wrestling Team) Dec 9-3</li>\n<li>Champ. Round 1 - Yariah Shaw (Lionheart Intense Wrestling) won by fall over Jack Brown (Batavia WC) Fall 1:06</li>\n<li>Champ. Round 1 - Max Mulhearn (Whips WC) won by decision over Lucas Maier (Pontiac WC) Dec 6-0</li>\n<li>Champ. Round 1 - Malan Njumbe-Hatfield (Blackhawk WC) won by decision over Frank Miceli (Mustang WC) Dec 7-0</li>\n<li>Champ. Round 1 - Ricky Leukhardt (Lakeland Predators WC) won by fall over Jaidyn Antosh (Fox Lake WC) Fall 1:57</li>\n<li>Champ. Round 1 - Maximus Delgado (Yorkville WC) won by fall over Desi Wade (Team Mascoutah WC) Fall 3:30</li>\n<li>Champ. Round 1 - Isaac Johnson (Junior Titans Wrestling) won by decision over Cole Littlejohn (Crawford County WC) Dec 7-2</li>\n<li>Champ. Round 1 - Izaac Gaines (Blue Line Training Academy) won by fall over Jordyn Jackson (Crosstown Spartan Elite WC) Fall 0:46</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Champ. Round 1 - Nathan Kozlowski (Crystal Lake Wizards WC) won by fall over Naijier Morris (Urbana Tigers WC) Fall 2:46</li>\n<li>Champ. Round 1 - Tyler Nolan (Granite City Wrestling Association) won by decision over Nolan Zuniga (MadDog Wrestling Academy) Dec 7-2</li>\n<li>Champ. Round 1 - Owen Hurd (Red Raiders Wrestling Team) won by fall over Antonio Reyes (Wolfpak WC) Fall 0:32</li>\n<li>Champ. Round 1 - Leann Cory (O`Fallon Little Panthers WC) won by fall over William Ellis (Murphysboro Wrestling) Fall 0:59</li>\n<li>Champ. Round 1 - Drew Williams (Peoria Razorbacks WC) won by decision over Austin Solis (Force Elite WC) Dec 6-0</li>\n<li>Champ. Round 1 - Nicholas Rociola (G2 WC) won by fall over Blake Vande Loo (Batavia WC) Fall 1:12</li>\n<li>Champ. Round 1 - Justin Skryd (Naperville WC) won by decision over Jackson Witt (Team 1006 Wrestling) Dec 4-0</li>\n<li>Champ. Round 1 - Zion Silvestre (Harvey Twisters) won by fall over Austin Bielski (Elevate Wrestling Academy) Fall 4:17</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Champ. Round 1 - Rex Chavez-Jimenez (Downers Grove WC) won by major decision over Piper McGinnis (Cumberland Youth WC) Maj 11-2</li>\n<li>Champ. Round 1 - Aiden Larson (Stockton Renegades WC) won by fall over Omar Mendez (Benton WC) Fall 1:12</li>\n<li>Champ. Round 1 - Daniel Jackson (Waterloo Bulldog Wrestling) won by fall over Owen Alderson (Williamsville WC) Fall 1:54</li>\n<li>Champ. Round 1 - Karter Pollock (Golden Eagles WC) won by fall over Anthony Zeno (Oswego WC) Fall 1:10</li>\n<li>Champ. Round 1 - Anthony Senese (Vittum Cats WC) won by fall over Maxwell Carroll (Lockport Junior Porters WC) Fall 2:14</li>\n<li>Champ. Round 1 - Sean Martinez (Peoria Razorbacks WC) won in sudden victory - 1 over Daniel Duran (MadDog Wrestling Academy) SV-1 4-2</li>\n<li>Champ. Round 1 - Dylan McKeown (Lockport Junior Porters WC) won by fall over Jeramy Hamm (Notre Dame WC) Fall 1:13</li>\n<li>Champ. Round 1 - Dillon Viscogliosi (Team 1006 Wrestling) won by major decision over Nathan Vogler (Oak Forest Warriors WC) Maj 9-0</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>Champ. Round 1 - Brayden Felice (Oswego WC) won by fall over Iy`Jah Grant (Urbana Tigers WC) Fall 1:18</li>\n<li>Champ. Round 1 - Jacob Crawford (Mustang WC) won by fall over Jeziah Campos (Blackhawk WC) Fall 1:29</li>\n<li>Champ. Round 1 - Gabriel Del Toro (TJ Trained Wrestling) won by fall over Aiden Brito (Unity Youth WC) Fall 1:29</li>\n<li>Champ. Round 1 - Isaiah Garcia (Blackhawk WC) won by fall over Jake Luedtke (Tinley Park Bulldogs WC) Fall 0:40</li>\n<li>Champ. Round 1 - Evan Grove (Metamora Kids WC) won by fall over Art Bytyqi (Evanston School of Wrestling) Fall 1:16</li>\n<li>Champ. Round 1 - Julian Moon (Effingham Youth WC) won by fall over Jesus Reyes Jr. (Dundee Highlanders WC) Fall 0:52</li>\n<li>Champ. Round 1 - Michael Kimbrough (Limestone Blue Crew WC) won by major decision over Brandin Kirk (Rochelle WC) Maj 9-0</li>\n<li>Champ. Round 1 - Eli Miller (Granite City Wrestling Association) won by fall over Zachary Myers (MadDog Wrestling Academy) Fall 0:30</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Champ. Round 1 - Jeremiah Watters (Edwardsville WC) won by fall over Khaden Hallowell (SJO Youth WC) Fall 1:01</li>\n<li>Champ. Round 1 - Jacob Sharrock (Waterloo Bulldog Wrestling) won by fall over Gavin Ericson (Junior Bronco WC) Fall 2:47</li>\n<li>Champ. Round 1 - Justin Koch (RWC) won by fall over Bela Jackson (Lincoln-Way WC) Fall 1:27</li>\n<li>Champ. Round 1 - Colin Murphy (Downers Grove WC) won by fall over Peyton Robinson (Benton WC) Fall 3:23</li>\n<li>Champ. Round 1 - Caden Schladt (Crystal Lake Wizards WC) won by major decision over Eathan Stallings (Glenbard East Jr Rams WC) Maj 15-5</li>\n<li>Champ. Round 1 - Joseph Torres (Junior Titans Wrestling) won by fall over Connor Evans (Lions WC) Fall 0:39</li>\n<li>Champ. Round 1 - Jorge Morales (Team El1te Wrestling) won by fall over Jesus Ayon (Bulldog Elite WC) Fall 2:10</li>\n<li>Champ. Round 1 - Isaac Brown (Fox Valley WC) won by fall over Joseph Mercadante (Mat Rat WC) Fall 0:32</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Champ. Round 1 - Raymond Morales (Lion`s Den Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Roman Janek (Lion`s Den Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jonathan Ramaker (Trico WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Alan Tauscher (Belvidere Bandits WC) won by fall over Caine Straus (Blackhawk WC) Fall 0:56</li>\n<li>Champ. Round 1 - Daniel Mahoney (Panther WC) won by fall over Logan Baker (West Hancock WC) Fall 3:00</li>\n<li>Champ. Round 1 - Jack Parker (Kaneland Knights WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Logan Abrams (Crystal Lake Wizards WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - King Liggins (Harvey Twisters) won by fall over Aaron Grotefendt (Edwardsville WC) Fall 1:22</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Phoenix Molina (Unity Youth WC) won by fall over Malachi Heath (Belvidere Bandits WC) Fall 0:56</li>\n<li>Champ. Round 1 - Zander Schrader (Olney Cubs WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Marcel Debski (Maine Eagles WC) won by decision over Caybren Hubbard (Murphysboro Wrestling) Dec 7-4</li>\n<li>Champ. Round 1 - John Turner (Sycamore WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jacob Palucki (Tinley Park Bulldogs WC) won by fall over Garan Brown (East St. Louis WC) Fall 1:51</li>\n<li>Champ. Round 1 - Connor Uhler (Dundee Highlanders WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Randy McPeek (Dakota WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Wyatt Hochgraber (Panther WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Raul Martinez (Rantoul Youth Wrestling) won by fall over Lucas Crown (Granite City Wrestling Association) Fall 0:46</li>\n<li>Champ. Round 1 - Austin Kunz (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Ever Ceniceros (Aurora WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Fernando Anaya (Blackhawk WC) won by fall over Ky`ren Johnson (Lionheart Intense Wrestling) Fall 1:52</li>\n<li>Champ. Round 1 - Matthew Medina (St. Charles WC) won by fall over Jai Gomez (Bulldog Elite WC) Fall 1:27</li>\n<li>Champ. Round 1 - Danzel Newell (Astro WC) won by fall over Samir Hall (Englewood Live Wire WC) Fall 2:22</li>\n<li>Champ. Round 1 - Jayden Chavez (Blackhawk WC) won by decision over Huthaifa Issa (Astro WC) Dec 4-0</li>\n<li>Champ. Round 1 - Jeremy Marshall (Evanston School of Wrestling) won by decision over Bryan Perez (Guerrero`s Garage Wrestling) Dec 3-1</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Davin Torza (Team 1006 Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Brody Sanders (Unity Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Matteo Vitro (Lemont Bears WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Steven Uden (Storm Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jakob Geestman (River Bend WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Zoey Dodgers (Wolfpak WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Elijah Sawyers (Harvey Twisters) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Landon Cornwell (Crawford County WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Garrett Pohl (Lions WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Leland Pepper (Bulls WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Trentin Odachowski (Elk Grove Junior Grens WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Luke Pappalas (Mustang WC) won by decision over Nolan Scholl (Team 1006 Wrestling) Dec 5-2</li>\n<li>Champ. Round 1 - Kaleb Pratt (Arlington Cardinals WC) won by fall over Weston Lange (Metamora Kids WC) Fall 2:04</li>\n<li>Champ. Round 1 - Aedan Dillow (Beat the Streets-Chicago) received a bye   () Bye</li>\n<li>Champ. Round 1 - Dylan Weber (Elevate Wrestling Academy) won by decision over Michael Olson (Sycamore WC) Dec 5-0</li>\n<li>Champ. Round 1 - Nixon Knapp (Aces WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Eric Hoselton (Lincoln-Way WC) won by fall over Ulises Vega (Guerrero`s Garage Wrestling) Fall 1:12</li>\n<li>Champ. Round 1 - Brandon Carbone (Crystal Lake Wizards WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Champ. Round 1 - Michael Miranda (Team 312 WC) won by fall over Micah Kang (Champaign WC) Fall 1:09</li>\n<li>Champ. Round 1 - Justin Godina (Harvey Twisters) won by tech fall over Aidan Mendoza (Tinley Park Bulldogs WC) TF 15-0</li>\n<li>Champ. Round 1 - Vince Jasinski (Fox Lake WC) won by fall over Brandon White (The Law WC) Fall 2:52</li>\n<li>Champ. Round 1 - Bernardo Roque (Izzy Style Wrestling) won by decision over Joseph Bronske (Oak Forest Warriors WC) Dec 9-5</li>\n<li>Champ. Round 1 - Nelson Benesh (Hawk WC) won by fall over Aiden Healey (Crystal Lake Wizards WC) Fall 0:50</li>\n<li>Champ. Round 1 - Elijah Mabry (Vandalia Jr WC) won by fall over Patrick Nsengiyumva (Blackhawk WC) Fall 0:19</li>\n<li>Champ. Round 1 - Lily Enos (Batavia WC) won by major decision over Lou Jensen (Dundee Highlanders WC) Maj 10-0</li>\n<li>Champ. Round 1 - Austin Hagevold (ISI WC) won by fall over Levi Ochs (Olney Cubs WC) Fall 1:54</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Champ. Round 1 - Michael Malizzio (Team El1te Wrestling) won by fall over Bobby Stoudt (Dwight WC) Fall 0:29</li>\n<li>Champ. Round 1 - Jackson Graff (Murphysboro Wrestling) won by fall over Emanuel Rangel (Guerrero`s Garage Wrestling) Fall 0:42</li>\n<li>Champ. Round 1 - Larry Quirk (Fox Lake WC) won by fall over Jackson Schadegg (Belleville Little Devils WC) Fall 2:45</li>\n<li>Champ. Round 1 - Charlie Flores (Hoopeston Area WC) won by fall over Brady Podracky (Fox Valley WC) Fall 2:38</li>\n<li>Champ. Round 1 - Harrison Dea (TJ Trained Wrestling) won by decision over Jack Hogan (G2 WC) Dec 4-1</li>\n<li>Champ. Round 1 - Jackson Olson (Hononegah WC) won by decision over Anthony Sutton (Lockport Junior Porters WC) Dec 7-5</li>\n<li>Champ. Round 1 - Liam Fenoglio (Yorkville WC) won by fall over Kristian Declercq (ISI WC) Fall 3:56</li>\n<li>Champ. Round 1 - Tommy Fidler (Panther WC) won by decision over Ryan Alaimo (Bolingbrook Junior Raiders WC) Dec 4-0</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Alvarez (Izzy Style Wrestling) won by decision over Griff Powell (Lions WC) Dec 4-2</li>\n<li>Champ. Round 1 - Tyler Huchel (Storm Youth WC) won by major decision over Jonathon Garantziotis (Crystal Lake Wizards WC) Maj 8-0</li>\n<li>Champ. Round 1 - George Hollendoner (Tinley Park Bulldogs WC) won by fall over Brendan Prince (Mattoon Youth WC) Fall 0:33</li>\n<li>Champ. Round 1 - Nicholas Merola (Team El1te Wrestling) won by decision over Josiah Perez (Alber Athletics WC) Dec 4-2</li>\n<li>Champ. Round 1 - Grady Hull (Blue Line Training Academy) won by decision over Ian Trauernicht (Edwardsville WC) Dec 3-1</li>\n<li>Champ. Round 1 - Jaxon Jorgensen (HPL Wrestling) won by major decision over Vincent Perucho (Scorpion WC) Maj 9-1</li>\n<li>Champ. Round 1 - Evan Matkovich (Batavia WC) won by major decision over Landon Blanton (Clipper WC) Maj 9-0</li>\n<li>Champ. Round 1 - Broady Kelly (Crawford County WC) won by fall over Sean Michels (Frankfort Wildcats Wrestling) Fall 0:51</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Champ. Round 1 - Malachi Hutchinson (Urbana Tigers WC) won by major decision over Taylor Finley (Herrin Junior WC) Maj 9-1</li>\n<li>Champ. Round 1 - Nolan Vogel (Callan Wrestling Academy) won by decision over Jackson Hanselman (Southside Outlaws WC) Dec 9-5</li>\n<li>Champ. Round 1 - Zev Koransky (Little Huskies WC) won by fall over Jack Ajster (Storm Youth WC) Fall 2:11</li>\n<li>Champ. Round 1 - Haden Anderson (Frankfort Wildcats Wrestling) won by fall over Brody Smith (Triad Knights WC) Fall 1:27</li>\n<li>Champ. Round 1 - Chase Krantz (Blue Line Training Academy) won by decision over Andrew Salmieri (Red Raiders Wrestling Team) Dec 10-6</li>\n<li>Champ. Round 1 - Chase Nobiling (Team Poeta) won by fall over Nicholas Spirek (Downers Grove WC) Fall 2:40</li>\n<li>Champ. Round 1 - Bryson Teunissen (Belvidere Bandits WC) won by decision over Tyler Jones (Mat Rat WC) Dec 8-3</li>\n<li>Champ. Round 1 - Grayson Garcia (Fitz Wrestling Academy) won by tech fall over Jason Brewer (Clipper WC) TF 16-0</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Champ. Round 1 - Isaac Mayora (Stampede WC) won by major decision over Josiah Williams (Storm Youth WC) Maj 12-0</li>\n<li>Champ. Round 1 - Luke Grindstaff (Team 1006 Wrestling) won by decision over Austin Perez (Oak Forest Warriors WC) Dec 5-1</li>\n<li>Champ. Round 1 - Robye Williams (Harvey Twisters) won by tech fall over Aiden Bell (Hoopeston Area WC) TF 18-3</li>\n<li>Champ. Round 1 - Ashton Hobson (Batavia WC) won by tech fall over Bradlee Ellis (Stingers WC) TF 15-0</li>\n<li>Champ. Round 1 - Erik Rodriguez (Fox Lake WC) won by fall over Ryne Pearson (Frankfort Wildcats Wrestling) Fall 4:28</li>\n<li>Champ. Round 1 - Jalen Byrd (Lincoln-Way WC) won by fall over Dylan Ramsey (Crystal Lake Wizards WC) Fall 1:56</li>\n<li>Champ. Round 1 - Vincent Skedel (Callan Wrestling Academy) won by fall over Jonathan Witzman (Murphysboro Wrestling) Fall 2:17</li>\n<li>Champ. Round 1 - Antonio Hinojosa (Toss Em Up Wrestling Academy) won by fall over Jace Vincent (Stockton Renegades WC) Fall 4:07</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Champ. Round 1 - Aric Abbott (ISI WC) won by decision over Benjamin Czarnowski (Southside Outlaws WC) Dec 10-4</li>\n<li>Champ. Round 1 - Daniel Gonzalez (Aurora WC) won by fall over Ra-Siah Jones (Hoopeston Area WC) Fall 2:17</li>\n<li>Champ. Round 1 - John Mensendike (Stockton Renegades WC) won by fall over Maximus Strader (Cumberland Youth WC) Fall 0:45</li>\n<li>Champ. Round 1 - Dayne Serio (Fitz Wrestling Academy) won by fall over Tristin King (Harvey Twisters) Fall 2:28</li>\n<li>Champ. Round 1 - Luis Flores (Team El1te Wrestling) won by decision over Aiden Jedlowski (Frankfort Wildcats Wrestling) Dec 9-2</li>\n<li>Champ. Round 1 - Caleb Viscogliosi (Team 1006 Wrestling) won by fall over Logan Hiller (Edwardsville WC) Fall 3:36</li>\n<li>Champ. Round 1 - Frankie Nitti (Izzy Style Wrestling) won by decision over Keagan Turner (Vandalia Jr WC) Dec 2-0</li>\n<li>Champ. Round 1 - Colton Zvonar (Lincoln-Way WC) won by fall over Jack Platt (Team 1006 Wrestling) Fall 1:26</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Champ. Round 1 - Douglas Gemberling (Sycamore WC) won by fall over Eric Anderson (RWC) Fall 1:15</li>\n<li>Champ. Round 1 - Reily Leifheit (Team 1006 Wrestling) won by decision over Justin Langford (Lincoln-Way WC) Dec 10-3</li>\n<li>Champ. Round 1 - Kevin Bartolotta (Elevate Wrestling Academy) won by fall over Ethan Lowe (SOT-C) Fall 1:57</li>\n<li>Champ. Round 1 - Oliver McPeek (Stockton Renegades WC) won by decision over Donovan Rosauer (Yorkville WC) Dec 6-0</li>\n<li>Champ. Round 1 - Alexander Tack (Stampede WC) won by fall over Aiden Brown (Harvey Twisters) Fall 4:22</li>\n<li>Champ. Round 1 - Pierre Walton (East St. Louis WC) won by decision over Joseph Michelini (Mat Rat WC) Dec 6-5</li>\n<li>Champ. Round 1 - Leonardo Rosas (Team El1te Wrestling) won by major decision over Andrew Koc (Batavia WC) Maj 9-1</li>\n<li>Champ. Round 1 - Gunner Hefley (Hillsboro Jr Toppers WC) won by major decision over Samuel Chigaros (Mustang WC) Maj 12-3</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Champ. Round 1 - Marcus Schreiner (Hoopeston Area WC) won by fall over Nicolas Astacio (ISI WC) Fall 2:25</li>\n<li>Champ. Round 1 - Keagan Tuel (Crawford County WC) won by decision over Martin Noth (Izzy Style Wrestling) Dec 6-0</li>\n<li>Champ. Round 1 - Eli Larson (Stockton Renegades WC) won by decision over Vincenzo Testa (Team El1te Wrestling) Dec 10-6</li>\n<li>Champ. Round 1 - Graham Taylor (Edwardsville WC) won in tie breaker - 1 over Michael Jones (Storm Youth WC) TB-1 5-4</li>\n<li>Champ. Round 1 - Declan Dircks (Frankfort Wildcats Wrestling) won by fall over Malaki Jackson (Blue Line Training Academy) Fall 2:32</li>\n<li>Champ. Round 1 - Sergio Calleros (Beat the Streets-Chicago) won by fall over Maddox Hale (Naperville WC) Fall 0:48</li>\n<li>Champ. Round 1 - Tyler Gleason (Team 1006 Wrestling) won by fall over Garrett Patnoudes (Oswego WC) Fall 2:09</li>\n<li>Champ. Round 1 - Trevon Williams (Springs Elite WC) won by decision over James Talley Jr (Lincoln-Way WC) Dec 8-2</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Champ. Round 1 - Julian Flores (Mat Rat WC) won by fall over Zakary Sullivan (Little Falcons WC) Fall 2:39</li>\n<li>Champ. Round 1 - Jeremiah Luke (Stockton Renegades WC) won by fall over Joshua Heath (Unity Youth WC) Fall 4:16</li>\n<li>Champ. Round 1 - Trae Jackson Griffiths (Champaign WC) won by decision over Tyler Scroggins (Blackhawk WC) Dec 7-3</li>\n<li>Champ. Round 1 - Samuel Higgins (Maine Eagles WC) won by fall over Malik Mosley (Urbana Tigers WC) Fall 3:25</li>\n<li>Champ. Round 1 - Carter Hintz (Red Raiders Wrestling Team) won by fall over Jeremiah Hernandez (Little Huskies WC) Fall 0:49</li>\n<li>Champ. Round 1 - Elijah Carter (Astro WC) won by fall over Anthony Michelon (Bulls WC) Fall 0:37</li>\n<li>Champ. Round 1 - Trevor Fath (Sparta Junior Bulldogs WC) won by decision over David Miranda (Crystal Lake Wizards WC) Dec 7-5</li>\n<li>Champ. Round 1 - Noah Cohen (Lincoln-Way WC) won by decision over Ismael Martinez (Beat the Streets-Chicago) Dec 6-5</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Champ. Round 1 - Orlando Hoye Iii (Glenbard East Jr Rams WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jake Jennings (Blackhawk WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Harrison Kinney (Hononegah WC) won by fall over Westin Fenton (Hillsboro Jr Toppers WC) Fall 0:55</li>\n<li>Champ. Round 1 - Jack English (Murphysboro Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jordan Bair (Peoria Wizards WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Leo Hughes (Murphysboro Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Adam Carrick (Sycamore WC) won by fall over Austin Webb (Peoria Wizards WC) Fall 3:59</li>\n<li>Champ. Round 1 - Nikola O`Connor (Fox Valley WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>Champ. Round 2 - Michael Hardin (Danville Chargers WC) won by fall over Caleb Popp (MadDog Wrestling Academy) Fall 0:11</li>\n<li>Champ. Round 2 - Daniel Costello (Mustang WC) won by fall over Luka Rankovic (Naperville WC) Fall 0:26</li>\n<li>Champ. Round 2 - Bradyn Haynes (Pekin Boys &amp; Girls Club) won by fall over Kalvin Brazzell (Mattoon Youth WC) Fall 2:03</li>\n<li>Champ. Round 2 - Shane Falasca (Richmond WC) won by fall over Blake Pohlman (Glenbard East Jr Rams WC) Fall 0:28</li>\n<li>Champ. Round 2 - Christopher Easley (Force Elite WC) won by decision over Frankie Solis (Marengo Youth WC) Dec 2-1</li>\n<li>Champ. Round 2 - Aj Forst (Fox Valley WC) won by fall over Travis Ellis (Harvey Twisters) Fall 1:18</li>\n<li>Champ. Round 2 - Gregory Heavey (Wheaton Tigers WC) won by decision over Gentry Michels (Olney Cubs WC) Dec 10-4</li>\n<li>Champ. Round 2 - Amillian Beasley (Urbana Tigers WC) won by decision over Hayden Wheeler (Yorkville WC) Dec 5-3</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Evan Flanagan (Clipper WC) won by fall over Donovan Olmstead (Belleville Little Devils WC) Fall 1:16</li>\n<li>Champ. Round 2 - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Josuel Ramirez (Dundee Highlanders WC) Fall 0:32</li>\n<li>Champ. Round 2 - Jonathon Caudle (O`Fallon Little Panthers WC) won by fall over Remington Bryant (Charleston WC) Fall 1:30</li>\n<li>Champ. Round 2 - Samuel Swais (Elk Grove Junior Grens WC) won by fall over Chase Paduch (Scorpion WC) Fall 2:07</li>\n<li>Champ. Round 2 - Nolan Lopez (Toss Em Up Wrestling Academy) won by fall over Dennis Rottmann (Highland Bulldog Jr. WC) Fall 0:21</li>\n<li>Champ. Round 2 - Hunter Wahtola (Beat the Streets-Chicago) won by fall over William Reyes (MadDog Wrestling Academy) Fall 0:17</li>\n<li>Champ. Round 2 - Dominic Swyers (Vandalia Jr WC) won by fall over Bane Wulf (Lions WC) Fall 0:47</li>\n<li>Champ. Round 2 - Alex Tucker (Timber Wolves WC) won by fall over Carson Sexton (SOT-C) Fall 1:06</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Champ. Round 2 - Grayson Anderton (Nomad Wrestling Academy) won by fall over Jackson Collins (Falcon Youth WC) Fall 2:42</li>\n<li>Champ. Round 2 - Jimmy Roach (Panther WC) won by decision over Miles Davis (Spartan WC) Dec 7-5</li>\n<li>Champ. Round 2 - Aden Spinelli (nWo WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Grady Glowacki (Lakeland Predators WC) won by major decision over Julian Godina (Harvey Twisters) Maj 14-0</li>\n<li>Champ. Round 2 - Nolan Renz (Metamora Kids WC) won by decision over Mason Beattie (Spartan WC) Dec 10-8</li>\n<li>Champ. Round 2 - Kamari Tate (Englewood Live Wire WC) won by fall over Kaden Cox (Murphysboro Wrestling) Fall 0:44</li>\n<li>Champ. Round 2 - Camden Chapman (Gladiator Elite WC) won by decision over Anthony Hansen (River Bend WC) Dec 7-1</li>\n<li>Champ. Round 2 - Drake Reed (Storm Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Champ. Round 2 - Clark Goodwin (Lincoln-Way WC) won by decision over Santino Scardina (Lions WC) Dec 7-0</li>\n<li>Champ. Round 2 - Treyden Diduch (Alber Athletics WC) won by tech fall over Coltin Hartman (River Bend WC) TF 16-0</li>\n<li>Champ. Round 2 - Julian Medina (Bolingbrook Junior Raiders WC) won by decision over Thomas Blanke (Barrington Broncos WC) Dec 7-1</li>\n<li>Champ. Round 2 - Reese Babcock (St. Charles WC) won by tech fall over Maddox Lawrence (Yorkville WC) TF 15-0</li>\n<li>Champ. Round 2 - Cale Dauber (Junior Raiders West WC) won by fall over Gage Enos (Batavia WC) Fall 2:48</li>\n<li>Champ. Round 2 - Noah Thomas (Granite City Wrestling Association) won by fall over Travis Wilgosiewicz (ISI WC) Fall 1:27</li>\n<li>Champ. Round 2 - Carter Noonan (Bolingbrook Junior Raiders WC) won by tech fall over Donovan Johnson (Blackhawk WC) TF 25-10</li>\n<li>Champ. Round 2 - Ian Rotramel (Falcon Youth WC) won by fall over Jace Scribner (Rockford WC) Fall 0:38</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Champ. Round 2 - Landon Near (nWo WC) won in sudden victory - 1 over Connor Collins (Olympia WC) SV-1 9-7</li>\n<li>Champ. Round 2 - Colin Crouch (Triad Knights WC) won in sudden victory - 1 over Jeffrey Dunaway (St. Charles WC) SV-1 8-6</li>\n<li>Champ. Round 2 - Crue Hatchell (Southside Outlaws WC) won by fall over Zayne Salah (Elevate Wrestling Academy) Fall 4:28</li>\n<li>Champ. Round 2 - Erik Klichurov (Izzy Style Wrestling) won by fall over Luthor Rajcevich (Crystal Lake Wizards WC) Fall 0:54</li>\n<li>Champ. Round 2 - Michael Rundell (Arlington Cardinals WC) won by fall over Riley Smith (Granite City Wrestling Association) Fall 3:20</li>\n<li>Champ. Round 2 - Hogan Rice (St. Charles WC) won by tech fall over Hudson Price (River Bend WC) TF 17-2</li>\n<li>Champ. Round 2 - Liam Kissane (Tinley Park Bulldogs WC) won by decision over Brandon Kalman (Elevate Wrestling Academy) Dec 7-2</li>\n<li>Champ. Round 2 - Weston Frazier (Storm Youth WC) won by decision over Brycen Fahnestock (Junior Raiders West WC) Dec 8-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Jayce Glauser (Fox Lake WC) won by tech fall over Maddux Rabczak (Alber Athletics WC) TF 17-0</li>\n<li>Champ. Round 2 - Kaden Potter (St. Charles WC) won by major decision over Colton Drinkwine (nWo WC) Maj 13-4</li>\n<li>Champ. Round 2 - Jaden Washington (Harvey Twisters) won by fall over Landon Rhodes (Storm Youth WC) Fall 2:11</li>\n<li>Champ. Round 2 - Kiernan Delaney (Toss Em Up Wrestling Academy) won by fall over Wesley Smith (Granite City Wrestling Association) Fall 4:28</li>\n<li>Champ. Round 2 - Vannak Khiev (Mat Rat WC) won by fall over Adonis Washington (Harvey Twisters) Fall 0:50</li>\n<li>Champ. Round 2 - Colton Wyller (Force Elite WC) won by fall over Dominic Angileri (Hononegah WC) Fall 1:44</li>\n<li>Champ. Round 2 - Rhyis Polenske (Blue Line Training Academy) won by decision over Obadiah Willis (Beat the Streets-Chicago) Dec 9-4</li>\n<li>Champ. Round 2 - Alec Daly (Storm Youth WC) won by major decision over Charlie Olson (Sycamore WC) Maj 11-1</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Champ. Round 2 - Nikolas Duarte (Arlington Cardinals WC) won by decision over Pedro Alberto Rangel (Storm Youth WC) Dec 6-1</li>\n<li>Champ. Round 2 - Lukas Foster (Callan Wrestling Academy) won by tech fall over Santiago Trejo (Southside Outlaws WC) TF 17-1</li>\n<li>Champ. Round 2 - Rain Scott (Springs Elite WC) won by decision over Isaiah Perez (Alber Athletics WC) Dec 8-3</li>\n<li>Champ. Round 2 - Nick Dilallo (St. Charles WC) won by tech fall over Aidan Lopez (nWo WC) TF 16-0</li>\n<li>Champ. Round 2 - Ethan Hamilton (Harvey Twisters) won by decision over Archer Biag (Naperville WC) Dec 11-4</li>\n<li>Champ. Round 2 - Shane Stream (Lincoln-Way WC) won in sudden victory - 1 over Matthew Deutch (Waterloo Bulldog Wrestling) SV-1 10-4</li>\n<li>Champ. Round 2 - Brady Glynn (Lincoln-Way WC) won by fall over Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) Fall 1:19</li>\n<li>Champ. Round 2 - Jacob Smith (Lakeland Predators WC) won by decision over Hunter Brandon (SOT-C) Dec 2-0</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Champ. Round 2 - Robert Ruscitti (Arlington Cardinals WC) won by tech fall over Kai Enos (Batavia WC) TF 18-2</li>\n<li>Champ. Round 2 - Dawson Hawthorne (Granite City Wrestling Association) won by tech fall over Louie King (Lions WC) TF 15-0</li>\n<li>Champ. Round 2 - Alexander Osborne (Team Poeta) won by major decision over Lelan Nelson (Richmond WC) Maj 8-0</li>\n<li>Champ. Round 2 - Colton Schultz (Callan Wrestling Academy) won by fall over Kannon Judycki (Southside Outlaws WC) Fall 1:21</li>\n<li>Champ. Round 2 - Adante Washington (Harvey Twisters) won by decision over Oscar Kalman (Elevate Wrestling Academy) Dec 4-0</li>\n<li>Champ. Round 2 - Kane Dauber (Junior Raiders West WC) won by fall over Carl Cody Weidner (Highland Bulldog Jr. WC) Fall 0:45</li>\n<li>Champ. Round 2 - Ryan Dorn (Barrington Broncos WC) won by decision over Nolan Chrisse (Bolingbrook Junior Raiders WC) Dec 4-0</li>\n<li>Champ. Round 2 - Devin Ehler (Storm Youth WC) won by major decision over Christopher Talbert (Crystal Lake Wizards WC) Maj 9-0</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Champ. Round 2 - Caden Campo (Vittum Cats WC) won by major decision over Jesse Swiney (Champaign WC) Maj 10-0</li>\n<li>Champ. Round 2 - Ethan Sonne (Lincoln-Way WC) won by major decision over Charlie Connors (Dixon WC) Maj 8-0</li>\n<li>Champ. Round 2 - Aidan McClure (St. Charles WC) won by decision over Cameron Young (Belvidere Bandits WC) Dec 1-0</li>\n<li>Champ. Round 2 - Avery Jaime (Bulls WC) won by major decision over Max Mandac (Lincoln-Way WC) Maj 8-0</li>\n<li>Champ. Round 2 - Benjamin Nadig (Alber Athletics WC) won by fall over Cole Forsyth (Junior Bronco WC) Fall 1:30</li>\n<li>Champ. Round 2 - Aiden Arnett (Lincoln-Way WC) won by fall over Robert Williams (Harvey Twisters) Fall 2:40</li>\n<li>Champ. Round 2 - John Hanrahan (Arlington Cardinals WC) won by tech fall over Lucas Zhao (Downers Grove WC) TF 17-1</li>\n<li>Champ. Round 2 - Mason Swartz (Storm Youth WC) won by fall over Andrew Lehman (Beat the Streets-Chicago) Fall 0:41</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Champ. Round 2 - Cole Yarbrough (Vandalia Jr WC) won by major decision over Anthony Brown (Proviso Township Gladiators WC) Maj 11-2</li>\n<li>Champ. Round 2 - Dawson Mack (Bolingbrook Junior Raiders WC) won by fall over Zachary Johnson (Rochelle WC) Fall 0:28</li>\n<li>Champ. Round 2 - Beau Walker (Elmhurst Titans Wrestling Academy) won by fall over Khalid Eid (Astro WC) Fall 2:16</li>\n<li>Champ. Round 2 - Christian Bass (Team 1006 Wrestling) won by decision over Wyatt Franckowiak (Richmond WC) Dec 10-4</li>\n<li>Champ. Round 2 - Sawyer Valdez (Sycamore WC) won by decision over Landen Vincent (Junior Pioneer WC) Dec 7-3</li>\n<li>Champ. Round 2 - Jadon Zimmer (Lincoln-Way WC) won by decision over Cade Vazquez (Izzy Style Wrestling) Dec 7-2</li>\n<li>Champ. Round 2 - Eddie Astorga (Mustang WC) won by fall over Devon Swope (DC WC) Fall 0:48</li>\n<li>Champ. Round 2 - Joshua Harkey (Bulls WC) won by fall over Logan Aaron (Cumberland Youth WC) Fall 2:17</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Brendan Nardin (Alber Athletics WC) won by fall over Cael Perry (Batavia WC) Fall 3:30</li>\n<li>Champ. Round 2 - Aiden Quevedo (MadDog Wrestling Academy) won by decision over Dawson Hull (Blue Line Training Academy) Dec 4-3</li>\n<li>Champ. Round 2 - Cohen Sweely (Benton WC) won by major decision over Kardeon Glover (Proviso Township Gladiators WC) Maj 14-2</li>\n<li>Champ. Round 2 - Thomas Banas (Demolition WC) won by fall over Colton Mosack (DC WC) Fall 1:59</li>\n<li>Champ. Round 2 - Gavin Woodmancy (St. Charles WC) won by fall over Samuel Cushman (Barrington Broncos WC) Fall 4:07</li>\n<li>Champ. Round 2 - Tyler Lachenberg (Lincoln-Way WC) won by fall over Owen Middleton (Yorkville WC) Fall 3:16</li>\n<li>Champ. Round 2 - Brady Ritter (Bolingbrook Junior Raiders WC) won in tie breaker - 1 over Davian Hall (Englewood Live Wire WC) TB-1 7-5</li>\n<li>Champ. Round 2 - William Julian (Xtreme WC) won by major decision over Harley Pierce (Cumberland Youth WC) Maj 12-2</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Champ. Round 2 - Daniel Lynch (Tinley Park Bulldogs WC) won by decision over Ethan Harvey (Lincoln-Way WC) Dec 5-4</li>\n<li>Champ. Round 2 - Brysen Manly (nWo WC) won by fall over Yariah Shaw (Lionheart Intense Wrestling) Fall 3:53</li>\n<li>Champ. Round 2 - Gavin Watson (Sparta Junior Bulldogs WC) won by fall over Max Mulhearn (Whips WC) Fall 0:50</li>\n<li>Champ. Round 2 - Malan Njumbe-Hatfield (Blackhawk WC) won by decision over Fares Tahri (Fenton Jr. Bison WC) Dec 7-3</li>\n<li>Champ. Round 2 - Ameer Khalil (St. Charles WC) won by fall over Ricky Leukhardt (Lakeland Predators WC) Fall 0:36</li>\n<li>Champ. Round 2 - Brayden McKay (Tinley Park Bulldogs WC) won by fall over Maximus Delgado (Yorkville WC) Fall 3:47</li>\n<li>Champ. Round 2 - Jayden Dohogne (Sycamore WC) won by fall over Isaac Johnson (Junior Titans Wrestling) Fall 1:58</li>\n<li>Champ. Round 2 - Izaac Gaines (Blue Line Training Academy) won by decision over Avery Crouch (Pontiac WC) Dec 3-2</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Champ. Round 2 - Chase Siguenza (Tribe WC) won by decision over Nathan Kozlowski (Crystal Lake Wizards WC) Dec 12-5</li>\n<li>Champ. Round 2 - John McGinnis (Oak Forest Warriors WC) won by fall over Tyler Nolan (Granite City Wrestling Association) Fall 1:46</li>\n<li>Champ. Round 2 - Owen Hurd (Red Raiders Wrestling Team) won by fall over Xavier Pratt (Crosstown Spartan Elite WC) Fall 2:57</li>\n<li>Champ. Round 2 - Brock Janeczko (Yorkville WC) won by decision over Leann Cory (O`Fallon Little Panthers WC) Dec 5-0</li>\n<li>Champ. Round 2 - Benjamin Mullins (Crawford County WC) won by major decision over Drew Williams (Peoria Razorbacks WC) Maj 15-1</li>\n<li>Champ. Round 2 - Nicholas Hermsen (Toss Em Up Wrestling Academy) won by decision over Nicholas Rociola (G2 WC) Dec 11-4</li>\n<li>Champ. Round 2 - Isiah Harris (North Boone WC) won by fall over Justin Skryd (Naperville WC) Fall 2:58</li>\n<li>Champ. Round 2 - Zion Silvestre (Harvey Twisters) won by major decision over Liam Hughes (Storm Youth WC) Maj 12-1</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Champ. Round 2 - Jose Lopez (Clipper WC) won by fall over Rex Chavez-Jimenez (Downers Grove WC) Fall 4:15</li>\n<li>Champ. Round 2 - Aiden Larson (Stockton Renegades WC) won by fall over Allison Garbacz (MadDog Wrestling Academy) Fall 2:15</li>\n<li>Champ. Round 2 - Daniel Jackson (Waterloo Bulldog Wrestling) won by decision over Logan DeMarco (Demolition WC) Dec 10-4</li>\n<li>Champ. Round 2 - Kevin May (Southside Outlaws WC) won by decision over Karter Pollock (Golden Eagles WC) Dec 15-10</li>\n<li>Champ. Round 2 - Rage Henderson (Gladiator Elite WC) won by fall over Anthony Senese (Vittum Cats WC) Fall 0:34</li>\n<li>Champ. Round 2 - Radic Dvorak (ISI WC) won by fall over Sean Martinez (Peoria Razorbacks WC) Fall 2:31</li>\n<li>Champ. Round 2 - Ronin Brom (Fox Valley WC) won by fall over Dylan McKeown (Lockport Junior Porters WC) Fall 2:13</li>\n<li>Champ. Round 2 - Dillon Viscogliosi (Team 1006 Wrestling) won by fall over Sergio Baity (Urbana Tigers WC) Fall 1:49</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>Champ. Round 2 - Jaxson Mathenia (Waterloo Bulldog Wrestling) won by fall over Brayden Felice (Oswego WC) Fall 0:23</li>\n<li>Champ. Round 2 - Knox Homola (Whips WC) won by fall over Jacob Crawford (Mustang WC) Fall 1:59</li>\n<li>Champ. Round 2 - Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) won by fall over Gabriel Del Toro (TJ Trained Wrestling) Fall 0:22</li>\n<li>Champ. Round 2 - Isaiah Garcia (Blackhawk WC) won by fall over Aleksander Knapik (Team 312 WC) Fall 0:57</li>\n<li>Champ. Round 2 - Evan Grove (Metamora Kids WC) won by fall over Cash Wetenkamp (Lincoln-Way WC) Fall 3:00</li>\n<li>Champ. Round 2 - Julian Moon (Effingham Youth WC) won by fall over Isaiah Robinson (Proviso Township Gladiators WC) Fall 2:19</li>\n<li>Champ. Round 2 - Isaac Barrientos (Fitz Wrestling Academy) won by fall over Michael Kimbrough (Limestone Blue Crew WC) Fall 0:25</li>\n<li>Champ. Round 2 - Eli Miller (Granite City Wrestling Association) won by fall over Summer Nichols (Cumberland Youth WC) Fall 1:56</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Champ. Round 2 - Jeremiah Watters (Edwardsville WC) won by fall over Erick Esquivel (Mat Rat WC) Fall 0:54</li>\n<li>Champ. Round 2 - Foley Calcagno (Southside Outlaws WC) won by fall over Jacob Sharrock (Waterloo Bulldog Wrestling) Fall 0:55</li>\n<li>Champ. Round 2 - Justin Koch (RWC) won by fall over Damien Stoller (Peoria Heights Minutemen WC) Fall 3:49</li>\n<li>Champ. Round 2 - Johnny Strauss (Golden Eagles WC) won by fall over Colin Murphy (Downers Grove WC) Fall 1:06</li>\n<li>Champ. Round 2 - Maximus Vela (Callan Wrestling Academy) won by fall over Caden Schladt (Crystal Lake Wizards WC) Fall 0:57</li>\n<li>Champ. Round 2 - Joseph Torres (Junior Titans Wrestling) won by decision over Lucas Yates (Little Falcons WC) Dec 9-5</li>\n<li>Champ. Round 2 - Charles Jacquez (Trico WC) won by fall over Jorge Morales (Team El1te Wrestling) Fall 2:35</li>\n<li>Champ. Round 2 - Landynn Balla (Storm Youth WC) won by fall over Isaac Brown (Fox Valley WC) Fall 0:40</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Champ. Round 2 - Gannon Dunker (The Law WC) won by fall over Raymond Morales (Lion`s Den Wrestling Academy) Fall 1:22</li>\n<li>Champ. Round 2 - Roman Janek (Lion`s Den Wrestling Academy) won by decision over Gage LaDere (Lincoln-Way WC) Dec 2-1</li>\n<li>Champ. Round 2 - Tommy O`Brien (Panther WC) won by fall over Jonathan Ramaker (Trico WC) Fall 2:41</li>\n<li>Champ. Round 2 - Alan Tauscher (Belvidere Bandits WC) won by major decision over Ezekiel Bridgeman (Peoria Razorbacks WC) Maj 14-5</li>\n<li>Champ. Round 2 - Joseph Favia (Fitz Wrestling Academy) won by fall over Daniel Mahoney (Panther WC) Fall 0:44</li>\n<li>Champ. Round 2 - Simon Schulte (Edwardsville WC) won by fall over Jack Parker (Kaneland Knights WC) Fall 2:53</li>\n<li>Champ. Round 2 - Logan Abrams (Crystal Lake Wizards WC) won by fall over Jaiden Williams (Elevate Wrestling Academy) Fall 0:14</li>\n<li>Champ. Round 2 - King Liggins (Harvey Twisters) won by fall over Chason Daly (Unity Youth WC) Fall 2:33</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Teigen Moreno (Dundee Highlanders WC) won by fall over Phoenix Molina (Unity Youth WC) Fall 0:33</li>\n<li>Champ. Round 2 - Zander Schrader (Olney Cubs WC) won by fall over Emmett Easton (Lil` Coalers WC) Fall 0:37</li>\n<li>Champ. Round 2 - Xavier Bitner (Panther WC) won by fall over Marcel Debski (Maine Eagles WC) Fall 1:03</li>\n<li>Champ. Round 2 - John Turner (Sycamore WC) won by fall over Timothy Lyon (Peoria Heights Minutemen WC) Fall 3:54</li>\n<li>Champ. Round 2 - Jack Miller (St. Charles WC) won by fall over Jacob Palucki (Tinley Park Bulldogs WC) Fall 2:00</li>\n<li>Champ. Round 2 - Connor Uhler (Dundee Highlanders WC) won by fall over Cole Pritchett (Junior Kahoks WC) Fall 3:25</li>\n<li>Champ. Round 2 - Jaxon Penovich (Arlington Cardinals WC) won by fall over Randy McPeek (Dakota WC) Fall 1:10</li>\n<li>Champ. Round 2 - Wyatt Hochgraber (Panther WC) won by fall over Ethan Miller (Storm Youth WC) Fall 1:29</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Zion Carter (Astro WC) won by decision over Raul Martinez (Rantoul Youth Wrestling) Dec 5-0</li>\n<li>Champ. Round 2 - Austin Kunz (Edwardsville WC) won by fall over Mason Manning (Marengo Youth WC) Fall 1:29</li>\n<li>Champ. Round 2 - Kai Calcutt (Toss Em Up Wrestling Academy) won by fall over Ever Ceniceros (Aurora WC) Fall 0:25</li>\n<li>Champ. Round 2 - Jaylen Torres (Tribe WC) won by tech fall over Fernando Anaya (Blackhawk WC) TF 21-5</li>\n<li>Champ. Round 2 - Matthew Medina (St. Charles WC) won by decision over Keegan Barnes (Peoria Heights Minutemen WC) Dec 6-2</li>\n<li>Champ. Round 2 - Lucas Kunz (Edwardsville WC) won by fall over Danzel Newell (Astro WC) Fall 2:50</li>\n<li>Champ. Round 2 - Ryan Stingliy (Frankfort Wildcats Wrestling) won by fall over Jayden Chavez (Blackhawk WC) Fall 1:24</li>\n<li>Champ. Round 2 - Dakari Hawthorne (Urbana Tigers WC) won by fall over Jeremy Marshall (Evanston School of Wrestling) Fall 1:48</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Champ. Round 2 - Ramsey Barton (Yorkville WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Hudson Anderton (Nomad Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 2 - Benjamin Jurkovic (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Taryn Heather (Polo WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Niko Odiotti (Arlington Cardinals WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Carson West (St. Charles WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Christian Corcoran (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Pippino Campo (Williamsville WC) won by fall over Davin Torza (Team 1006 Wrestling) Fall 0:09</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Diego Martinez (Belvidere Bandits WC) won by major decision over Brody Sanders (Unity Youth WC) Maj 13-2</li>\n<li>Champ. Round 2 - Logan Conover (Batavia WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Elio Gil (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Chace Matheny (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Marty Towey (Notre Dame WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Tanner Stone (Bolingbrook Junior Raiders WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Matteo Vitro (Lemont Bears WC) won in tie breaker - 1 over Kaleb Fuchs (Limestone Blue Crew WC) TB-1 3-2</li>\n<li>Champ. Round 2 - Benjamin Wells (Champaign WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Declan Sons (St. Charles WC) won by decision over Steven Uden (Storm Youth WC) Dec 3-2</li>\n<li>Champ. Round 2 - Shane Seip (Triad Knights WC) won by fall over Jakob Geestman (River Bend WC) Fall 2:36</li>\n<li>Champ. Round 2 - Roberto Rangel (Oak Forest Warriors WC) won by fall over Zoey Dodgers (Wolfpak WC) Fall 3:39</li>\n<li>Champ. Round 2 - Max Munn (Lincoln-Way WC) won by major decision over Elijah Sawyers (Harvey Twisters) Maj 9-0</li>\n<li>Champ. Round 2 - Morgan Turner (Harvey Twisters) received a bye   () Bye</li>\n<li>Champ. Round 2 - Landon Cornwell (Crawford County WC) won by decision over Blair Grennan (Sauk Valley WC) Dec 13-9</li>\n<li>Champ. Round 2 - Daniel Myint (Arlington Cardinals WC) won by fall over Garrett Pohl (Lions WC) Fall 1:13</li>\n<li>Champ. Round 2 - Zayden Mansfield (Unity Youth WC) won by tech fall over Leland Pepper (Bulls WC) TF 15-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Trentin Odachowski (Elk Grove Junior Grens WC) won by fall over Sean Serbinski (Naperville WC) Fall 2:22</li>\n<li>Champ. Round 2 - Max Philpot (Vandalia Jr WC) won by fall over Luke Pappalas (Mustang WC) Fall 1:20</li>\n<li>Champ. Round 2 - Kaleb Pratt (Arlington Cardinals WC) won by decision over Deegan Kirschke (ISI WC) Dec 7-2</li>\n<li>Champ. Round 2 - Nadeem Haleem (Lincoln-Way WC) won by fall over Aedan Dillow (Beat the Streets-Chicago) Fall 0:59</li>\n<li>Champ. Round 2 - Jamiel Castleberry (Proviso Township Gladiators WC) won by major decision over Dylan Weber (Elevate Wrestling Academy) Maj 13-3</li>\n<li>Champ. Round 2 - Dakoda Hentz (Fighting Farmers WC) won by fall over Nixon Knapp (Aces WC) Fall 2:36</li>\n<li>Champ. Round 2 - Allen Woo (Izzy Style Wrestling) won by fall over Eric Hoselton (Lincoln-Way WC) Fall 1:03</li>\n<li>Champ. Round 2 - Rocco Macellaio (Little Falcons WC) won in sudden victory - 1 over Brandon Carbone (Crystal Lake Wizards WC) SV-1 7-5</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Champ. Round 2 - Nicholas Garcia (Fitz Wrestling Academy) won by decision over Michael Miranda (Team 312 WC) Dec 12-6</li>\n<li>Champ. Round 2 - Bryson Nuttall (Edwardsville WC) won by fall over Justin Godina (Harvey Twisters) Fall 0:17</li>\n<li>Champ. Round 2 - Vince Jasinski (Fox Lake WC) won in tie breaker - 1 over Nicholas Marchese (Crystal Lake Wizards WC) TB-1 3-2</li>\n<li>Champ. Round 2 - Bernardo Roque (Izzy Style Wrestling) won by fall over Javier Flores (Force Elite WC) Fall 2:22</li>\n<li>Champ. Round 2 - Chazz Robinson (Harvey Twisters) won by tech fall over Nelson Benesh (Hawk WC) TF 18-3</li>\n<li>Champ. Round 2 - Elijah Mabry (Vandalia Jr WC) won by fall over Nolan O`Grady (Team 1006 Wrestling) Fall 1:21</li>\n<li>Champ. Round 2 - Maxwell Cumbee (Izzy Style Wrestling) won by fall over Lily Enos (Batavia WC) Fall 0:45</li>\n<li>Champ. Round 2 - Austin Hagevold (ISI WC) won by fall over Jason Glosser (Champaign WC) Fall 1:11</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Champ. Round 2 - Michael Malizzio (Team El1te Wrestling) won by decision over Tyler Lockhart (Sycamore WC) Dec 7-0</li>\n<li>Champ. Round 2 - Isaac Zimmerman (Lockport Junior Porters WC) won by major decision over Jackson Graff (Murphysboro Wrestling) Maj 14-2</li>\n<li>Champ. Round 2 - Cory Zator (Lemont Bears WC) won by decision over Larry Quirk (Fox Lake WC) Dec 7-0</li>\n<li>Champ. Round 2 - Demetrios Carrera (Yorkville WC) won by fall over Charlie Flores (Hoopeston Area WC) Fall 2:38</li>\n<li>Champ. Round 2 - Harrison Dea (TJ Trained Wrestling) won by decision over Cameron Engels (Scorpion WC) Dec 10-4</li>\n<li>Champ. Round 2 - Preston Waughtel (Bulls WC) won by major decision over Jackson Olson (Hononegah WC) Maj 12-0</li>\n<li>Champ. Round 2 - Domenic Munaretto (Toss Em Up Wrestling Academy) won by fall over Liam Fenoglio (Yorkville WC) Fall 0:59</li>\n<li>Champ. Round 2 - Clinton VerHeecke (Mt. Zion Kids WC) won by decision over Tommy Fidler (Panther WC) Dec 7-0</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Champ. Round 2 - Ryan Richie (Edwardsville WC) won by tech fall over Jacob Alvarez (Izzy Style Wrestling) TF 16-1</li>\n<li>Champ. Round 2 - Max Mularz (Frankfort Wildcats Wrestling) won by decision over Tyler Huchel (Storm Youth WC) Dec 7-4</li>\n<li>Champ. Round 2 - George Hollendoner (Tinley Park Bulldogs WC) won by decision over Logan Tatar (St. Charles WC) Dec 8-7</li>\n<li>Champ. Round 2 - Marcus Quintana (Team 1006 Wrestling) won by decision over Nicholas Merola (Team El1te Wrestling) Dec 2-1</li>\n<li>Champ. Round 2 - Rocco Cassioppi (Hononegah WC) won by tech fall over Grady Hull (Blue Line Training Academy) TF 18-3</li>\n<li>Champ. Round 2 - Jaxon Jorgensen (HPL Wrestling) won by decision over Daniel Blanke (Barrington Broncos WC) Dec 2-0</li>\n<li>Champ. Round 2 - Jason Hampton (Harvey Twisters) won by fall over Evan Matkovich (Batavia WC) Fall 2:51</li>\n<li>Champ. Round 2 - Garrett VerHeecke (Mt. Zion Kids WC) won by fall over Broady Kelly (Crawford County WC) Fall 2:12</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Champ. Round 2 - Lincoln Hoger (Fox Valley WC) won by fall over Malachi Hutchinson (Urbana Tigers WC) Fall 3:41</li>\n<li>Champ. Round 2 - Nolan Vogel (Callan Wrestling Academy) won by fall over Dillon Griffin (Team 1006 Wrestling) Fall 3:27</li>\n<li>Champ. Round 2 - Arrison Bauer (Stockton Renegades WC) won in sudden victory - 1 over Zev Koransky (Little Huskies WC) SV-1 8-6</li>\n<li>Champ. Round 2 - Kameron Luif (Team El1te Wrestling) won by major decision over Haden Anderson (Frankfort Wildcats Wrestling) Maj 10-2</li>\n<li>Champ. Round 2 - Maxwell Wade (Gladiator Elite WC) won by fall over Chase Krantz (Blue Line Training Academy) Fall 1:14</li>\n<li>Champ. Round 2 - Kaidreaus Richardson (Lincoln-Way WC) won by decision over Chase Nobiling (Team Poeta) Dec 6-1</li>\n<li>Champ. Round 2 - Justin Wardlow (Harvey Twisters) won by major decision over Bryson Teunissen (Belvidere Bandits WC) Maj 9-0</li>\n<li>Champ. Round 2 - Aden Rangel (Storm Youth WC) won by decision over Grayson Garcia (Fitz Wrestling Academy) Dec 3-0</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Champ. Round 2 - Isaac Mayora (Stampede WC) won by major decision over Brody Stien (Alber Athletics WC) Maj 10-0</li>\n<li>Champ. Round 2 - Jeremy Huf (Arlington Cardinals WC) won by fall over Luke Grindstaff (Team 1006 Wrestling) Fall 1:54</li>\n<li>Champ. Round 2 - Knox Verbais (Combative Sports Athletic Center) won by fall over Robye Williams (Harvey Twisters) Fall 0:46</li>\n<li>Champ. Round 2 - Aaron Camacho (Bolingbrook Junior Raiders WC) won by fall over Ashton Hobson (Batavia WC) Fall 4:05</li>\n<li>Champ. Round 2 - Zachary Stewart (Fitz Wrestling Academy) won by tech fall over Erik Rodriguez (Fox Lake WC) TF 19-4</li>\n<li>Champ. Round 2 - Wyatt Medlin (Super Soldiers WC) won by major decision over Jalen Byrd (Lincoln-Way WC) Maj 10-2</li>\n<li>Champ. Round 2 - David Ogunsanya (Harvey Twisters) won by fall over Vincent Skedel (Callan Wrestling Academy) Fall 2:43</li>\n<li>Champ. Round 2 - Hunter Shike (Unity Youth WC) won by fall over Antonio Hinojosa (Toss Em Up Wrestling Academy) Fall 2:39</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Champ. Round 2 - Thomas Mcdermott (Force Elite WC) won by fall over Aric Abbott (ISI WC) Fall 1:05</li>\n<li>Champ. Round 2 - Adam Jacks (Junior Pioneer WC) won by major decision over Daniel Gonzalez (Aurora WC) Maj 10-2</li>\n<li>Champ. Round 2 - Dillon Hinton (Vandalia Jr WC) won by major decision over John Mensendike (Stockton Renegades WC) Maj 11-2</li>\n<li>Champ. Round 2 - Dayne Serio (Fitz Wrestling Academy) won by decision over Van Grasser (Team 312 WC) Dec 8-5</li>\n<li>Champ. Round 2 - Brody Kelly (Fitz Wrestling Academy) won by fall over Luis Flores (Team El1te Wrestling) Fall 4:23</li>\n<li>Champ. Round 2 - Liam Kelly (Tinley Park Bulldogs WC) won by decision over Caleb Viscogliosi (Team 1006 Wrestling) Dec 7-1</li>\n<li>Champ. Round 2 - Jimmy Mastny (Alber Athletics WC) won by tech fall over Frankie Nitti (Izzy Style Wrestling) TF 15-0</li>\n<li>Champ. Round 2 - Colton Zvonar (Lincoln-Way WC) won by fall over Nehemie Mbangi (Champaign WC) Fall 3:49</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Champ. Round 2 - Killian Rauch (Belleville Little Devils WC) won by major decision over Douglas Gemberling (Sycamore WC) Maj 12-0</li>\n<li>Champ. Round 2 - Aaron Stewart (Toss Em Up Wrestling Academy) won by fall over Reily Leifheit (Team 1006 Wrestling) Fall 0:37</li>\n<li>Champ. Round 2 - Ian Hawkins (Junior Bronco WC) won by fall over Kevin Bartolotta (Elevate Wrestling Academy) Fall 0:36</li>\n<li>Champ. Round 2 - Oliver McPeek (Stockton Renegades WC) won by decision over Anthony Iaquinta (Lemont Bears WC) Dec 8-4</li>\n<li>Champ. Round 2 - Aiden Hennings (Lincoln-Way WC) won by fall over Alexander Tack (Stampede WC) Fall 2:14</li>\n<li>Champ. Round 2 - Kye Weinzierl (Blue Line Training Academy) won by major decision over Pierre Walton (East St. Louis WC) Maj 9-1</li>\n<li>Champ. Round 2 - Brody Sendele (Hononegah WC) won by major decision over Leonardo Rosas (Team El1te Wrestling) Maj 10-2</li>\n<li>Champ. Round 2 - Cooper Miller (Storm Youth WC) won by fall over Gunner Hefley (Hillsboro Jr Toppers WC) Fall 2:46</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Champ. Round 2 - Jake Rhymes (Scorpion WC) won by decision over Marcus Schreiner (Hoopeston Area WC) Dec 9-2</li>\n<li>Champ. Round 2 - Kenyonte Louis (Englewood Live Wire WC) won by fall over Keagan Tuel (Crawford County WC) Fall 0:55</li>\n<li>Champ. Round 2 - Eli Larson (Stockton Renegades WC) won by fall over Tristin Golden (Brawlers WC) Fall 2:03</li>\n<li>Champ. Round 2 - Brenden Voight (nWo WC) won by major decision over Graham Taylor (Edwardsville WC) Maj 11-1</li>\n<li>Champ. Round 2 - Declan Dircks (Frankfort Wildcats Wrestling) won by major decision over Luke McCoy (Bulls WC) Maj 12-3</li>\n<li>Champ. Round 2 - Royce Lopez (Toss Em Up Wrestling Academy) won by decision over Sergio Calleros (Beat the Streets-Chicago) Dec 6-2</li>\n<li>Champ. Round 2 - Cooper Bode (Sycamore WC) won by fall over Tyler Gleason (Team 1006 Wrestling) Fall 0:53</li>\n<li>Champ. Round 2 - Trevon Williams (Springs Elite WC) won in sudden victory - 1 over Jamison Chambliss (Storm Youth WC) SV-1 5-3</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Champ. Round 2 - Xander Keslin (Force Elite WC) won by decision over Julian Flores (Mat Rat WC) Dec 6-3</li>\n<li>Champ. Round 2 - Jeremiah Luke (Stockton Renegades WC) won by major decision over Colin Goggin (Panther WC) Maj 11-0</li>\n<li>Champ. Round 2 - John Cloud (Edwardsville WC) won by fall over Trae Jackson Griffiths (Champaign WC) Fall 3:45</li>\n<li>Champ. Round 2 - Michael Brannigan (Red Raiders Wrestling Team) won by fall over Samuel Higgins (Maine Eagles WC) Fall 1:43</li>\n<li>Champ. Round 2 - Carter Hintz (Red Raiders Wrestling Team) won by fall over John Rowzee (Sauk Valley WC) Fall 1:29</li>\n<li>Champ. Round 2 - Santino Tenuta (Team El1te Wrestling) won by fall over Elijah Carter (Astro WC) Fall 2:53</li>\n<li>Champ. Round 2 - Matthew Plumb (SCN Youth WC) won by major decision over Trevor Fath (Sparta Junior Bulldogs WC) Maj 9-1</li>\n<li>Champ. Round 2 - Owen McGinnis (Cumberland Youth WC) won by decision over Noah Cohen (Lincoln-Way WC) Dec 4-0</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Champ. Round 2 - Triston Manrique (O`Fallon Little Panthers WC) won by fall over Orlando Hoye Iii (Glenbard East Jr Rams WC) Fall 0:27</li>\n<li>Champ. Round 2 - Connor Sacco (Marengo Youth WC) won by fall over Jake Jennings (Blackhawk WC) Fall 0:38</li>\n<li>Champ. Round 2 - Roman Villalobos (nWo WC) won by fall over Harrison Kinney (Hononegah WC) Fall 0:27</li>\n<li>Champ. Round 2 - Jack English (Murphysboro Wrestling) won by decision over Diego Diaz (Aurora WC) Dec 6-5</li>\n<li>Champ. Round 2 - Duncan Nevel (The Law WC) won by decision over Jordan Bair (Peoria Wizards WC) Dec 7-1</li>\n<li>Champ. Round 2 - Malik Warren (Harvey Twisters) won by fall over Leo Hughes (Murphysboro Wrestling) Fall 3:17</li>\n<li>Champ. Round 2 - Adam Carrick (Sycamore WC) won by fall over Foster Yarbrough (Wheaton Tigers WC) Fall 0:42</li>\n<li>Champ. Round 2 - Lonnez Smith (East St. Louis WC) won by major decision over Nikola O`Connor (Fox Valley WC) Maj 9-0</li>\n</ul>\n</section>",
  "1st WB": "<section class=\"tw-list\">\n<h1>1st WB</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>Cons. Round 2 - Hayden Wheeler (Yorkville WC) won by tech fall over Rylee McClellan (Bulls WC) TF 16-0</li>\n<li>Cons. Round 2 - Gentry Michels (Olney Cubs WC) won by tech fall over Garrett Ziller (Lockport Junior Porters WC) TF 15-0</li>\n<li>Cons. Round 2 - Travis Ellis (Harvey Twisters) won by fall over Anthony Samanich (Lockport Junior Porters WC) Fall 0:30</li>\n<li>Cons. Round 2 - Frankie Solis (Marengo Youth WC) won by fall over Drake Boucher (Murphysboro Wrestling) Fall 1:15</li>\n<li>Cons. Round 2 - Blake Pohlman (Glenbard East Jr Rams WC) won by fall over Levi Armstrong (Peoria Razorbacks WC) Fall 1:06</li>\n<li>Cons. Round 2 - Kalvin Brazzell (Mattoon Youth WC) won by fall over Jacksyn Windham (Hawk WC) Fall 1:17</li>\n<li>Cons. Round 2 - Luka Rankovic (Naperville WC) won by fall over Ryan Hess (Marengo Youth WC) Fall 4:12</li>\n<li>Cons. Round 2 - Christopher Korduplewski (Tinley Park Bulldogs WC) won by fall over Caleb Popp (MadDog Wrestling Academy) Fall 0:24</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Carson Sexton (SOT-C) won by fall over Nathan Marshall (Champaign WC) Fall 1:30</li>\n<li>Cons. Round 2 - Bane Wulf (Lions WC) won by fall over Nathaniel Dorado (Wolfpak WC) Fall 2:15</li>\n<li>Cons. Round 2 - Cayden Berryhill (G2 WC) won by fall over William Reyes (MadDog Wrestling Academy) Fall 1:00</li>\n<li>Cons. Round 2 - Dennis Rottmann (Highland Bulldog Jr. WC) won by fall over Keagen Schneider (Metamora Kids WC) Fall 1:25</li>\n<li>Cons. Round 2 - Chase Paduch (Scorpion WC) won by fall over Vaughn Schmidt (Glenbard East Jr Rams WC) Fall 2:55</li>\n<li>Cons. Round 2 - Remington Bryant (Charleston WC) won by fall over Andrew Abernathie (Morton Youth WC) Fall 3:32</li>\n<li>Cons. Round 2 - Josuel Ramirez (Dundee Highlanders WC) won by fall over Jose Octavio Velazquez (Scorpion WC) Fall 2:37</li>\n<li>Cons. Round 2 - Donovan Olmstead (Belleville Little Devils WC) won by fall over Nicholas Kackert (Guerrero`s Garage Wrestling) Fall 0:42</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Anthony Hansen (River Bend WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Kaden Cox (Murphysboro Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 2 - Mason Beattie (Spartan WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Julian Godina (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Miles Davis (Spartan WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jackson Collins (Falcon Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Cons. Round 2 - Damon Glenn (Unity Youth WC) won by fall over Jace Scribner (Rockford WC) Fall 0:21</li>\n<li>Cons. Round 2 - Zander Johnson (Granite City Wrestling Association) won by decision over Donovan Johnson (Blackhawk WC) Dec 6-1</li>\n<li>Cons. Round 2 - Zachary Cooley (Granite City Wrestling Association) won by fall over Travis Wilgosiewicz (ISI WC) Fall 1:20</li>\n<li>Cons. Round 2 - Gage Enos (Batavia WC) won by decision over Kason Cramer (Storm Youth WC) Dec 3-0</li>\n<li>Cons. Round 2 - Maddox Lawrence (Yorkville WC) won by fall over Liam Mcgovern (Fox Lake WC) Fall 0:28</li>\n<li>Cons. Round 2 - Thomas Blanke (Barrington Broncos WC) won by fall over Rocco Maheras (Vittum Cats WC) Fall 4:23</li>\n<li>Cons. Round 2 - Kevin Bisonaya (Panther WC) won by fall over Coltin Hartman (River Bend WC) Fall 3:18</li>\n<li>Cons. Round 2 - Santino Scardina (Lions WC) won by tech fall over Mateo Odiotti (Arlington Cardinals WC) TF 19-3</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Cons. Round 2 - Brycen Fahnestock (Junior Raiders West WC) won by fall over Dominic Melody (Mat Rat WC) Fall 2:57</li>\n<li>Cons. Round 2 - Ayden Winchell (Callan Wrestling Academy) won in tie breaker - 1 over Brandon Kalman (Elevate Wrestling Academy) TB-1 6-5</li>\n<li>Cons. Round 2 - Hudson Price (River Bend WC) won by decision over Rhett Wilson (Williamsville WC) Dec 5-0</li>\n<li>Cons. Round 2 - Riley Smith (Granite City Wrestling Association) won in sudden victory - 1 over Rocco Valvano (Tribe WC) SV-1 4-2</li>\n<li>Cons. Round 2 - Luthor Rajcevich (Crystal Lake Wizards WC) won by fall over Lincoln Carlson (Oak Forest Warriors WC) Fall 0:34</li>\n<li>Cons. Round 2 - Zayne Salah (Elevate Wrestling Academy) won by fall over John Chappell (Bulls WC) Fall 1:03</li>\n<li>Cons. Round 2 - Jeffrey Dunaway (St. Charles WC) won by major decision over Daniel Macatangay (Force Elite WC) Maj 14-5</li>\n<li>Cons. Round 2 - Connor Collins (Olympia WC) won by decision over Michael McNamara (Edwardsville WC) Dec 4-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Jase Edrington (Storm Youth WC) won by decision over Charlie Olson (Sycamore WC) Dec 6-2</li>\n<li>Cons. Round 2 - Obadiah Willis (Beat the Streets-Chicago) won by fall over Nolan Glynn (Lincoln-Way WC) Fall 2:26</li>\n<li>Cons. Round 2 - Dominic Angileri (Hononegah WC) won by decision over Gabriel Bass (Team 1006 Wrestling) Dec 6-4</li>\n<li>Cons. Round 2 - Adonis Washington (Harvey Twisters) won by major decision over Aiden Weber (Elevate Wrestling Academy) Maj 12-1</li>\n<li>Cons. Round 2 - Jackson Marlett (St. Charles WC) won by tech fall over Wesley Smith (Granite City Wrestling Association) TF 15-0</li>\n<li>Cons. Round 2 - Landon Rhodes (Storm Youth WC) won by decision over Chace Hall (Murphysboro Wrestling) Dec 6-2</li>\n<li>Cons. Round 2 - Colton Drinkwine (nWo WC) won by fall over Maddox Williams (Alton Little Redbirds WC) Fall 1:15</li>\n<li>Cons. Round 2 - Maddux Rabczak (Alber Athletics WC) won by tech fall over Joseph Calvillo (Batavia WC) TF 16-0</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Cons. Round 2 - Hunter Brandon (SOT-C) won by fall over Kazmyn Barber (Dixon WC) Fall 0:45</li>\n<li>Cons. Round 2 - Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) won by major decision over Aiden Evans (Vandalia Jr WC) Maj 8-0</li>\n<li>Cons. Round 2 - Matthew Deutch (Waterloo Bulldog Wrestling) won by fall over Bentley Fields (Falcon Youth WC) Fall 1:05</li>\n<li>Cons. Round 2 - Archer Biag (Naperville WC) won by decision over Griffin Diehl (Murphysboro Wrestling) Dec 7-2</li>\n<li>Cons. Round 2 - Aidan Lopez (nWo WC) won by fall over Landon Jaski (Alber Athletics WC) Fall 2:10</li>\n<li>Cons. Round 2 - Ray Long (Team El1te Wrestling) won by fall over Isaiah Perez (Alber Athletics WC) Fall 4:22</li>\n<li>Cons. Round 2 - Santiago Trejo (Southside Outlaws WC) won by tech fall over Brogan Sendele (Hononegah WC) TF 17-1</li>\n<li>Cons. Round 2 - Pedro Alberto Rangel (Storm Youth WC) won by fall over James Kowalkski (Scorpion WC) Fall 1:27</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Cons. Round 2 - Talin Baker (Champaign WC) won by decision over Christopher Talbert (Crystal Lake Wizards WC) Dec 10-4</li>\n<li>Cons. Round 2 - Nolan Chrisse (Bolingbrook Junior Raiders WC) won by fall over Max Moreno (LaSalle Peru Crunching Cavs Youth WC) Fall 3:54</li>\n<li>Cons. Round 2 - Carl Cody Weidner (Highland Bulldog Jr. WC) won by decision over Rocky Delgado (Yorkville WC) Dec 4-2</li>\n<li>Cons. Round 2 - Oscar Kalman (Elevate Wrestling Academy) won by fall over Weston Church (Storm Youth WC) Fall 3:11</li>\n<li>Cons. Round 2 - Kannon Judycki (Southside Outlaws WC) won by fall over Carson Benesh (Hawk WC) Fall 0:41</li>\n<li>Cons. Round 2 - Lelan Nelson (Richmond WC) won by fall over Quinn Vitek (St. Charles WC) Fall 0:46</li>\n<li>Cons. Round 2 - Michael Riggs (Wheaton Tigers WC) won by decision over Louie King (Lions WC) Dec 13-8</li>\n<li>Cons. Round 2 - Kai Enos (Batavia WC) won by decision over Kanton Richards (Murphysboro Wrestling) Dec 7-0</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Cons. Round 2 - Andrew Lehman (Beat the Streets-Chicago) won by tech fall over Trotter Titus (Mattoon Youth WC) TF 17-2</li>\n<li>Cons. Round 2 - Logan Woodbury (ISI WC) won by major decision over Lucas Zhao (Downers Grove WC) Maj 8-0</li>\n<li>Cons. Round 2 - Robert Williams (Harvey Twisters) won by fall over Rylan Poeta (Champaign WC) Fall 0:45</li>\n<li>Cons. Round 2 - Michael Goolish (MadDog Wrestling Academy) won by decision over Cole Forsyth (Junior Bronco WC) Dec 4-1</li>\n<li>Cons. Round 2 - Max Mandac (Lincoln-Way WC) won by fall over Jase Holshouser (AJ Jr. Wildcats WC) Fall 2:34</li>\n<li>Cons. Round 2 - Brody Page (Yorkville WC) won by major decision over Cameron Young (Belvidere Bandits WC) Maj 9-0</li>\n<li>Cons. Round 2 - Charlie Connors (Dixon WC) won by major decision over Chase Frye (Fighting Farmers WC) Maj 8-0</li>\n<li>Cons. Round 2 - Kaeden Davis (Olney Cubs WC) won in tie breaker - 1 over Jesse Swiney (Champaign WC) TB-1 6-4</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Cons. Round 2 - John Gough (MadDog Wrestling Academy) won by decision over Logan Aaron (Cumberland Youth WC) Dec 6-4</li>\n<li>Cons. Round 2 - Devon Swope (DC WC) won by fall over Colton Johnson (Falcon Youth WC) Fall 0:40</li>\n<li>Cons. Round 2 - Cade Vazquez (Izzy Style Wrestling) won by major decision over Jeremy Judd (Williamsville WC) Maj 9-1</li>\n<li>Cons. Round 2 - Landen Vincent (Junior Pioneer WC) won by fall over Jack Hills (Team Poeta) Fall 3:54</li>\n<li>Cons. Round 2 - Wyatt Franckowiak (Richmond WC) won by decision over Myles Greenfield (Belleville Little Devils WC) Dec 2-1</li>\n<li>Cons. Round 2 - Khalid Eid (Astro WC) won by major decision over Jace Serpa (Tribe WC) Maj 13-1</li>\n<li>Cons. Round 2 - Ashton Glisson (St. Charles WC) won by fall over Zachary Johnson (Rochelle WC) Fall 0:57</li>\n<li>Cons. Round 2 - Matthew Laird (Callan Wrestling Academy) won by decision over Anthony Brown (Proviso Township Gladiators WC) Dec 5-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Harley Pierce (Cumberland Youth WC) won by fall over Keandre Towns (Champaign WC) Fall 0:34</li>\n<li>Cons. Round 2 - Davian Hall (Englewood Live Wire WC) won by fall over Malek Jaber (Beat the Streets-Chicago) Fall 0:55</li>\n<li>Cons. Round 2 - Owen Middleton (Yorkville WC) won by fall over Cody Culbertson (Rantoul Youth Wrestling) Fall 0:20</li>\n<li>Cons. Round 2 - Samuel Cushman (Barrington Broncos WC) won by tech fall over Deziree Azar (Naperville WC) TF 17-1</li>\n<li>Cons. Round 2 - Colton Mosack (DC WC) won by fall over Titan Henderson (Gladiator Elite WC) Fall 3:36</li>\n<li>Cons. Round 2 - Dylan Knaus (ISI WC) won by decision over Kardeon Glover (Proviso Township Gladiators WC) Dec 7-5</li>\n<li>Cons. Round 2 - Antoine Shaw (Gladiator Elite WC) won by decision over Dawson Hull (Blue Line Training Academy) Dec 5-0</li>\n<li>Cons. Round 2 - Cael Perry (Batavia WC) won by fall over Dominic Sponsel (Arlington Cardinals WC) Fall 4:26</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Cons. Round 2 - Avery Crouch (Pontiac WC) won by major decision over Alexander Vega (Red Raiders Wrestling Team) Maj 12-0</li>\n<li>Cons. Round 2 - Jack Brown (Batavia WC) won by major decision over Isaac Johnson (Junior Titans Wrestling) Maj 12-2</li>\n<li>Cons. Round 2 - Maximus Delgado (Yorkville WC) won by major decision over Lucas Maier (Pontiac WC) Maj 11-2</li>\n<li>Cons. Round 2 - Frank Miceli (Mustang WC) won by fall over Ricky Leukhardt (Lakeland Predators WC) Fall 2:21</li>\n<li>Cons. Round 2 - Fares Tahri (Fenton Jr. Bison WC) won by major decision over Jaidyn Antosh (Fox Lake WC) Maj 17-3</li>\n<li>Cons. Round 2 - Max Mulhearn (Whips WC) won by decision over Desi Wade (Team Mascoutah WC) Dec 3-2</li>\n<li>Cons. Round 2 - Cole Littlejohn (Crawford County WC) won by injury default over Yariah Shaw (Lionheart Intense Wrestling) Inj. 0:00</li>\n<li>Cons. Round 2 - Ethan Harvey (Lincoln-Way WC) won by fall over Jordyn Jackson (Crosstown Spartan Elite WC) Fall 4:02</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Cons. Round 2 - Liam Hughes (Storm Youth WC) won by fall over Naijier Morris (Urbana Tigers WC) Fall 4:09</li>\n<li>Cons. Round 2 - Justin Skryd (Naperville WC) won by major decision over Nolan Zuniga (MadDog Wrestling Academy) Maj 9-0</li>\n<li>Cons. Round 2 - Nicholas Rociola (G2 WC) won by fall over Antonio Reyes (Wolfpak WC) Fall 0:27</li>\n<li>Cons. Round 2 - Drew Williams (Peoria Razorbacks WC) won by fall over William Ellis (Murphysboro Wrestling) Fall 0:20</li>\n<li>Cons. Round 2 - Leann Cory (O`Fallon Little Panthers WC) won by major decision over Austin Solis (Force Elite WC) Maj 10-0</li>\n<li>Cons. Round 2 - Xavier Pratt (Crosstown Spartan Elite WC) won by fall over Blake Vande Loo (Batavia WC) Fall 2:58</li>\n<li>Cons. Round 2 - Tyler Nolan (Granite City Wrestling Association) won by fall over Jackson Witt (Team 1006 Wrestling) Fall 1:14</li>\n<li>Cons. Round 2 - Nathan Kozlowski (Crystal Lake Wizards WC) won by fall over Austin Bielski (Elevate Wrestling Academy) Fall 1:03</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Cons. Round 2 - Sergio Baity (Urbana Tigers WC) won by fall over Piper McGinnis (Cumberland Youth WC) Fall 0:17</li>\n<li>Cons. Round 2 - Omar Mendez (Benton WC) won by fall over Dylan McKeown (Lockport Junior Porters WC) Fall 0:31</li>\n<li>Cons. Round 2 - Sean Martinez (Peoria Razorbacks WC) won by fall over Owen Alderson (Williamsville WC) Fall 2:59</li>\n<li>Cons. Round 2 - Anthony Senese (Vittum Cats WC) won by fall over Anthony Zeno (Oswego WC) Fall 2:25</li>\n<li>Cons. Round 2 - Karter Pollock (Golden Eagles WC) won by fall over Maxwell Carroll (Lockport Junior Porters WC) Fall 2:06</li>\n<li>Cons. Round 2 - Logan DeMarco (Demolition WC) won by injury default over Daniel Duran (MadDog Wrestling Academy) Inj. 0:00</li>\n<li>Cons. Round 2 - Jeramy Hamm (Notre Dame WC) won by fall over Allison Garbacz (MadDog Wrestling Academy) Fall 1:23</li>\n<li>Cons. Round 2 - Rex Chavez-Jimenez (Downers Grove WC) won by decision over Nathan Vogler (Oak Forest Warriors WC) Dec 8-4</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>Cons. Round 2 - Iy`Jah Grant (Urbana Tigers WC) won by fall over Summer Nichols (Cumberland Youth WC) Fall 4:29</li>\n<li>Cons. Round 2 - Michael Kimbrough (Limestone Blue Crew WC) won by fall over Jeziah Campos (Blackhawk WC) Fall 0:40</li>\n<li>Cons. Round 2 - Isaiah Robinson (Proviso Township Gladiators WC) won by injury default over Aiden Brito (Unity Youth WC) Inj. 0:13</li>\n<li>Cons. Round 2 - Jake Luedtke (Tinley Park Bulldogs WC) won by major decision over Cash Wetenkamp (Lincoln-Way WC) Maj 12-0</li>\n<li>Cons. Round 2 - Art Bytyqi (Evanston School of Wrestling) won by decision over Aleksander Knapik (Team 312 WC) Dec 4-1</li>\n<li>Cons. Round 2 - Gabriel Del Toro (TJ Trained Wrestling) won in sudden victory - 1 over Jesus Reyes Jr. (Dundee Highlanders WC) SV-1 9-8</li>\n<li>Cons. Round 2 - Jacob Crawford (Mustang WC) won by fall over Brandin Kirk (Rochelle WC) Fall 1:11</li>\n<li>Cons. Round 2 - Brayden Felice (Oswego WC) won by fall over Zachary Myers (MadDog Wrestling Academy) Fall 0:10</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Cons. Round 2 - Khaden Hallowell (SJO Youth WC) won by fall over Isaac Brown (Fox Valley WC) Fall 0:47</li>\n<li>Cons. Round 2 - Gavin Ericson (Junior Bronco WC) won by fall over Jorge Morales (Team El1te Wrestling) Fall 1:14</li>\n<li>Cons. Round 2 - Bela Jackson (Lincoln-Way WC) won by decision over Lucas Yates (Little Falcons WC) Dec 5-4</li>\n<li>Cons. Round 2 - Caden Schladt (Crystal Lake Wizards WC) won by fall over Peyton Robinson (Benton WC) Fall 1:44</li>\n<li>Cons. Round 2 - Colin Murphy (Downers Grove WC) won by decision over Eathan Stallings (Glenbard East Jr Rams WC) Dec 7-6</li>\n<li>Cons. Round 2 - Damien Stoller (Peoria Heights Minutemen WC) won by fall over Connor Evans (Lions WC) Fall 0:22</li>\n<li>Cons. Round 2 - Jacob Sharrock (Waterloo Bulldog Wrestling) won by fall over Jesus Ayon (Bulldog Elite WC) Fall 1:09</li>\n<li>Cons. Round 2 - Erick Esquivel (Mat Rat WC) won by fall over Joseph Mercadante (Mat Rat WC) Fall 1:53</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Cons. Round 2 - Chason Daly (Unity Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jaiden Williams (Elevate Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jack Parker (Kaneland Knights WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Daniel Mahoney (Panther WC) won by fall over Caine Straus (Blackhawk WC) Fall 0:15</li>\n<li>Cons. Round 2 - Ezekiel Bridgeman (Peoria Razorbacks WC) won by decision over Logan Baker (West Hancock WC) Dec 12-8</li>\n<li>Cons. Round 2 - Jonathan Ramaker (Trico WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Gage LaDere (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Raymond Morales (Lion`s Den Wrestling Academy) won by fall over Aaron Grotefendt (Edwardsville WC) Fall 1:22</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Ethan Miller (Storm Youth WC) won by fall over Malachi Heath (Belvidere Bandits WC) Fall 2:40</li>\n<li>Cons. Round 2 - Randy McPeek (Dakota WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Cole Pritchett (Junior Kahoks WC) won by fall over Caybren Hubbard (Murphysboro Wrestling) Fall 1:12</li>\n<li>Cons. Round 2 - Jacob Palucki (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Timothy Lyon (Peoria Heights Minutemen WC) won by fall over Garan Brown (East St. Louis WC) Fall 1:18</li>\n<li>Cons. Round 2 - Marcel Debski (Maine Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Emmett Easton (Lil` Coalers WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Phoenix Molina (Unity Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Jeremy Marshall (Evanston School of Wrestling) won by fall over Lucas Crown (Granite City Wrestling Association) Fall 2:44</li>\n<li>Cons. Round 2 - Jayden Chavez (Blackhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Danzel Newell (Astro WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Keegan Barnes (Peoria Heights Minutemen WC) won by fall over Ky`ren Johnson (Lionheart Intense Wrestling) Fall 0:43</li>\n<li>Cons. Round 2 - Jai Gomez (Bulldog Elite WC) won by fall over Fernando Anaya (Blackhawk WC) Fall 2:16</li>\n<li>Cons. Round 2 - Ever Ceniceros (Aurora WC) won by decision over Samir Hall (Englewood Live Wire WC) Dec 7-0</li>\n<li>Cons. Round 2 - Huthaifa Issa (Astro WC) won by decision over Mason Manning (Marengo Youth WC) Dec 5-4</li>\n<li>Cons. Round 2 - Raul Martinez (Rantoul Youth Wrestling) won by fall over Bryan Perez (Guerrero`s Garage Wrestling) Fall 1:21</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Cons. Round 2 - Davin Torza (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Kaleb Fuchs (Limestone Blue Crew WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Brody Sanders (Unity Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Leland Pepper (Bulls WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Garrett Pohl (Lions WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Blair Grennan (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 2 -   () received a bye   () Bye</li>\n<li>Cons. Round 2 - Elijah Sawyers (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 2 - Zoey Dodgers (Wolfpak WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Jakob Geestman (River Bend WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Steven Uden (Storm Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Brandon Carbone (Crystal Lake Wizards WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Eric Hoselton (Lincoln-Way WC) won by fall over Nolan Scholl (Team 1006 Wrestling) Fall 4:16</li>\n<li>Cons. Round 2 - Weston Lange (Metamora Kids WC) won by fall over Nixon Knapp (Aces WC) Fall 3:27</li>\n<li>Cons. Round 2 - Dylan Weber (Elevate Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 2 - Michael Olson (Sycamore WC) won by fall over Aedan Dillow (Beat the Streets-Chicago) Fall 1:19</li>\n<li>Cons. Round 2 - Deegan Kirschke (ISI WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Luke Pappalas (Mustang WC) won by fall over Ulises Vega (Guerrero`s Garage Wrestling) Fall 1:23</li>\n<li>Cons. Round 2 - Sean Serbinski (Naperville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Cons. Round 2 - Jason Glosser (Champaign WC) won by decision over Micah Kang (Champaign WC) Dec 3-0</li>\n<li>Cons. Round 2 - Lily Enos (Batavia WC) won by fall over Aidan Mendoza (Tinley Park Bulldogs WC) Fall 3:51</li>\n<li>Cons. Round 2 - Brandon White (The Law WC) won by fall over Nolan O`Grady (Team 1006 Wrestling) Fall 1:11</li>\n<li>Cons. Round 2 - Joseph Bronske (Oak Forest Warriors WC) won in tie breaker - 1 over Nelson Benesh (Hawk WC) TB-1 5-4</li>\n<li>Cons. Round 2 - Javier Flores (Force Elite WC) won by fall over Aiden Healey (Crystal Lake Wizards WC) Fall 1:03</li>\n<li>Cons. Round 2 - Nicholas Marchese (Crystal Lake Wizards WC) won by fall over Patrick Nsengiyumva (Blackhawk WC) Fall 0:16</li>\n<li>Cons. Round 2 - Justin Godina (Harvey Twisters) won by fall over Lou Jensen (Dundee Highlanders WC) Fall 0:49</li>\n<li>Cons. Round 2 - Michael Miranda (Team 312 WC) won by fall over Levi Ochs (Olney Cubs WC) Fall 0:27</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Cons. Round 2 - Tommy Fidler (Panther WC) won by tech fall over Bobby Stoudt (Dwight WC) TF 17-0</li>\n<li>Cons. Round 2 - Liam Fenoglio (Yorkville WC) won by fall over Emanuel Rangel (Guerrero`s Garage Wrestling) Fall 1:51</li>\n<li>Cons. Round 2 - Jackson Olson (Hononegah WC) won by tech fall over Jackson Schadegg (Belleville Little Devils WC) TF 15-0</li>\n<li>Cons. Round 2 - Cameron Engels (Scorpion WC) won by fall over Brady Podracky (Fox Valley WC) Fall 3:00</li>\n<li>Cons. Round 2 - Jack Hogan (G2 WC) won by fall over Charlie Flores (Hoopeston Area WC) Fall 4:01</li>\n<li>Cons. Round 2 - Anthony Sutton (Lockport Junior Porters WC) won by major decision over Larry Quirk (Fox Lake WC) Maj 15-1</li>\n<li>Cons. Round 2 - Kristian Declercq (ISI WC) won by tech fall over Jackson Graff (Murphysboro Wrestling) TF 15-0</li>\n<li>Cons. Round 2 - Tyler Lockhart (Sycamore WC) won by decision over Ryan Alaimo (Bolingbrook Junior Raiders WC) Dec 4-3</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Cons. Round 2 - Griff Powell (Lions WC) won by major decision over Broady Kelly (Crawford County WC) Maj 12-3</li>\n<li>Cons. Round 2 - Evan Matkovich (Batavia WC) won by fall over Jonathon Garantziotis (Crystal Lake Wizards WC) Fall 2:16</li>\n<li>Cons. Round 2 - Daniel Blanke (Barrington Broncos WC) won by fall over Brendan Prince (Mattoon Youth WC) Fall 1:08</li>\n<li>Cons. Round 2 - Grady Hull (Blue Line Training Academy) won by fall over Josiah Perez (Alber Athletics WC) Fall 2:20</li>\n<li>Cons. Round 2 - Nicholas Merola (Team El1te Wrestling) won by decision over Ian Trauernicht (Edwardsville WC) Dec 3-2</li>\n<li>Cons. Round 2 - Logan Tatar (St. Charles WC) won by fall over Vincent Perucho (Scorpion WC) Fall 2:20</li>\n<li>Cons. Round 2 - Tyler Huchel (Storm Youth WC) won by decision over Landon Blanton (Clipper WC) Dec 4-3</li>\n<li>Cons. Round 2 - Jacob Alvarez (Izzy Style Wrestling) won by fall over Sean Michels (Frankfort Wildcats Wrestling) Fall 1:28</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Cons. Round 2 - Taylor Finley (Herrin Junior WC) won by fall over Grayson Garcia (Fitz Wrestling Academy) Fall 0:43</li>\n<li>Cons. Round 2 - Jackson Hanselman (Southside Outlaws WC) won by decision over Bryson Teunissen (Belvidere Bandits WC) Dec 2-0</li>\n<li>Cons. Round 2 - Chase Nobiling (Team Poeta) won by decision over Jack Ajster (Storm Youth WC) Dec 7-3</li>\n<li>Cons. Round 2 - Chase Krantz (Blue Line Training Academy) won by fall over Brody Smith (Triad Knights WC) Fall 1:16</li>\n<li>Cons. Round 2 - Haden Anderson (Frankfort Wildcats Wrestling) won by decision over Andrew Salmieri (Red Raiders Wrestling Team) Dec 4-2</li>\n<li>Cons. Round 2 - Zev Koransky (Little Huskies WC) won by major decision over Nicholas Spirek (Downers Grove WC) Maj 12-1</li>\n<li>Cons. Round 2 - Dillon Griffin (Team 1006 Wrestling) won by decision over Tyler Jones (Mat Rat WC) Dec 6-1</li>\n<li>Cons. Round 2 - Malachi Hutchinson (Urbana Tigers WC) won by fall over Jason Brewer (Clipper WC) Fall 1:21</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Cons. Round 2 - Antonio Hinojosa (Toss Em Up Wrestling Academy) won by decision over Josiah Williams (Storm Youth WC) Dec 5-4</li>\n<li>Cons. Round 2 - Austin Perez (Oak Forest Warriors WC) won by decision over Vincent Skedel (Callan Wrestling Academy) Dec 5-0</li>\n<li>Cons. Round 2 - Jalen Byrd (Lincoln-Way WC) won by fall over Aiden Bell (Hoopeston Area WC) Fall 4:26</li>\n<li>Cons. Round 2 - Erik Rodriguez (Fox Lake WC) won by decision over Bradlee Ellis (Stingers WC) Dec 12-5</li>\n<li>Cons. Round 2 - Ashton Hobson (Batavia WC) won by tech fall over Ryne Pearson (Frankfort Wildcats Wrestling) TF 15-0</li>\n<li>Cons. Round 2 - Robye Williams (Harvey Twisters) won by fall over Dylan Ramsey (Crystal Lake Wizards WC) Fall 0:59</li>\n<li>Cons. Round 2 - Luke Grindstaff (Team 1006 Wrestling) won by decision over Jonathan Witzman (Murphysboro Wrestling) Dec 5-1</li>\n<li>Cons. Round 2 - Jace Vincent (Stockton Renegades WC) won by decision over Brody Stien (Alber Athletics WC) Dec 7-3</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Cons. Round 2 - Benjamin Czarnowski (Southside Outlaws WC) won by decision over Nehemie Mbangi (Champaign WC) Dec 9-6</li>\n<li>Cons. Round 2 - Frankie Nitti (Izzy Style Wrestling) won by fall over Ra-Siah Jones (Hoopeston Area WC) Fall 1:01</li>\n<li>Cons. Round 2 - Caleb Viscogliosi (Team 1006 Wrestling) won by fall over Maximus Strader (Cumberland Youth WC) Fall 4:18</li>\n<li>Cons. Round 2 - Luis Flores (Team El1te Wrestling) won by fall over Tristin King (Harvey Twisters) Fall 3:26</li>\n<li>Cons. Round 2 - Aiden Jedlowski (Frankfort Wildcats Wrestling) won by fall over Van Grasser (Team 312 WC) Fall 2:22</li>\n<li>Cons. Round 2 - Logan Hiller (Edwardsville WC) won by fall over John Mensendike (Stockton Renegades WC) Fall 1:15</li>\n<li>Cons. Round 2 - Keagan Turner (Vandalia Jr WC) won by fall over Daniel Gonzalez (Aurora WC) Fall 2:09</li>\n<li>Cons. Round 2 - Aric Abbott (ISI WC) won by decision over Jack Platt (Team 1006 Wrestling) Dec 9-5</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Cons. Round 2 - Gunner Hefley (Hillsboro Jr Toppers WC) won by fall over Eric Anderson (RWC) Fall 0:45</li>\n<li>Cons. Round 2 - Leonardo Rosas (Team El1te Wrestling) won by major decision over Justin Langford (Lincoln-Way WC) Maj 10-0</li>\n<li>Cons. Round 2 - Pierre Walton (East St. Louis WC) won by fall over Ethan Lowe (SOT-C) Fall 2:21</li>\n<li>Cons. Round 2 - Donovan Rosauer (Yorkville WC) won by decision over Alexander Tack (Stampede WC) Dec 8-3</li>\n<li>Cons. Round 2 - Anthony Iaquinta (Lemont Bears WC) won by fall over Aiden Brown (Harvey Twisters) Fall 2:16</li>\n<li>Cons. Round 2 - Joseph Michelini (Mat Rat WC) won by fall over Kevin Bartolotta (Elevate Wrestling Academy) Fall 2:20</li>\n<li>Cons. Round 2 - Reily Leifheit (Team 1006 Wrestling) won in sudden victory - 1 over Andrew Koc (Batavia WC) SV-1 6-4</li>\n<li>Cons. Round 2 - Samuel Chigaros (Mustang WC) won by decision over Douglas Gemberling (Sycamore WC) Dec 12-6</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Cons. Round 2 - Jamison Chambliss (Storm Youth WC) won by decision over Nicolas Astacio (ISI WC) Dec 4-3</li>\n<li>Cons. Round 2 - Tyler Gleason (Team 1006 Wrestling) won by fall over Martin Noth (Izzy Style Wrestling) Fall 1:14</li>\n<li>Cons. Round 2 - Vincenzo Testa (Team El1te Wrestling) won by decision over Sergio Calleros (Beat the Streets-Chicago) Dec 5-3</li>\n<li>Cons. Round 2 - Luke McCoy (Bulls WC) won by fall over Michael Jones (Storm Youth WC) Fall 3:15</li>\n<li>Cons. Round 2 - Graham Taylor (Edwardsville WC) won by decision over Malaki Jackson (Blue Line Training Academy) Dec 8-2</li>\n<li>Cons. Round 2 - Tristin Golden (Brawlers WC) won by fall over Maddox Hale (Naperville WC) Fall 1:00</li>\n<li>Cons. Round 2 - Garrett Patnoudes (Oswego WC) won by fall over Keagan Tuel (Crawford County WC) Fall 0:44</li>\n<li>Cons. Round 2 - James Talley Jr (Lincoln-Way WC) won by decision over Marcus Schreiner (Hoopeston Area WC) Dec 8-5</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Cons. Round 2 - Noah Cohen (Lincoln-Way WC) won by major decision over Zakary Sullivan (Little Falcons WC) Maj 14-1</li>\n<li>Cons. Round 2 - Joshua Heath (Unity Youth WC) won in tie breaker - 1 over Trevor Fath (Sparta Junior Bulldogs WC) TB-1 5-4</li>\n<li>Cons. Round 2 - Elijah Carter (Astro WC) won by major decision over Tyler Scroggins (Blackhawk WC) Maj 9-0</li>\n<li>Cons. Round 2 - Malik Mosley (Urbana Tigers WC) won by fall over John Rowzee (Sauk Valley WC) Fall 3:43</li>\n<li>Cons. Round 2 - Samuel Higgins (Maine Eagles WC) won by fall over Jeremiah Hernandez (Little Huskies WC) Fall 1:42</li>\n<li>Cons. Round 2 - Trae Jackson Griffiths (Champaign WC) won by fall over Anthony Michelon (Bulls WC) Fall 0:28</li>\n<li>Cons. Round 2 - David Miranda (Crystal Lake Wizards WC) won by fall over Colin Goggin (Panther WC) Fall 4:14</li>\n<li>Cons. Round 2 - Julian Flores (Mat Rat WC) won by decision over Ismael Martinez (Beat the Streets-Chicago) Dec 7-0</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Cons. Round 2 - Nikola O`Connor (Fox Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Foster Yarbrough (Wheaton Tigers WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Leo Hughes (Murphysboro Wrestling) won by major decision over Westin Fenton (Hillsboro Jr Toppers WC) Maj 10-1</li>\n<li>Cons. Round 2 - Jordan Bair (Peoria Wizards WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Diego Diaz (Aurora WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Harrison Kinney (Hononegah WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Austin Webb (Peoria Wizards WC) won by fall over Jake Jennings (Blackhawk WC) Fall 1:11</li>\n<li>Cons. Round 2 - Orlando Hoye Iii (Glenbard East Jr Rams WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Quarters & 2nd WB": "<section class=\"tw-list\">\n<h1>Quarters &amp; 2nd WB</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>Quarterfinal - Daniel Costello (Mustang WC) won by fall over Michael Hardin (Danville Chargers WC) Fall 0:26</li>\n<li>Quarterfinal - Shane Falasca (Richmond WC) won by fall over Bradyn Haynes (Pekin Boys &amp; Girls Club) Fall 2:22</li>\n<li>Quarterfinal - Christopher Easley (Force Elite WC) won by decision over Aj Forst (Fox Valley WC) Dec 4-2</li>\n<li>Quarterfinal - Amillian Beasley (Urbana Tigers WC) won by fall over Gregory Heavey (Wheaton Tigers WC) Fall 1:12</li>\n<li>Cons. Round 3 - Hayden Wheeler (Yorkville WC) won by major decision over Gentry Michels (Olney Cubs WC) Maj 14-0</li>\n<li>Cons. Round 3 - Travis Ellis (Harvey Twisters) won by fall over Frankie Solis (Marengo Youth WC) Fall 0:34</li>\n<li>Cons. Round 3 - Blake Pohlman (Glenbard East Jr Rams WC) won by fall over Kalvin Brazzell (Mattoon Youth WC) Fall 3:21</li>\n<li>Cons. Round 3 - Christopher Korduplewski (Tinley Park Bulldogs WC) won by fall over Luka Rankovic (Naperville WC) Fall 3:57</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Evan Flanagan (Clipper WC) Fall 1:26</li>\n<li>Quarterfinal - Jonathon Caudle (O`Fallon Little Panthers WC) won by fall over Samuel Swais (Elk Grove Junior Grens WC) Fall 3:40</li>\n<li>Quarterfinal - Nolan Lopez (Toss Em Up Wrestling Academy) won by fall over Hunter Wahtola (Beat the Streets-Chicago) Fall 1:15</li>\n<li>Quarterfinal - Dominic Swyers (Vandalia Jr WC) won by decision over Alex Tucker (Timber Wolves WC) Dec 7-0</li>\n<li>Cons. Round 3 - Carson Sexton (SOT-C) won by decision over Bane Wulf (Lions WC) Dec 4-3</li>\n<li>Cons. Round 3 - Cayden Berryhill (G2 WC) won by fall over Dennis Rottmann (Highland Bulldog Jr. WC) Fall 2:49</li>\n<li>Cons. Round 3 - Chase Paduch (Scorpion WC) won by fall over Remington Bryant (Charleston WC) Fall 0:57</li>\n<li>Cons. Round 3 - Donovan Olmstead (Belleville Little Devils WC) won by fall over Josuel Ramirez (Dundee Highlanders WC) Fall 3:59</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Quarterfinal - Grayson Anderton (Nomad Wrestling Academy) won by decision over Jimmy Roach (Panther WC) Dec 2-1</li>\n<li>Quarterfinal - Grady Glowacki (Lakeland Predators WC) won by tech fall over Aden Spinelli (nWo WC) TF 17-1</li>\n<li>Quarterfinal - Kamari Tate (Englewood Live Wire WC) won by fall over Nolan Renz (Metamora Kids WC) Fall 3:34</li>\n<li>Quarterfinal - Drake Reed (Storm Youth WC) won by fall over Camden Chapman (Gladiator Elite WC) Fall 2:38</li>\n<li>Cons. Round 3 - Anthony Hansen (River Bend WC) received a bye   () Bye</li>\n<li>Cons. Round 3 - Mason Beattie (Spartan WC) won by fall over Kaden Cox (Murphysboro Wrestling) Fall 2:00</li>\n<li>Cons. Round 3 - Julian Godina (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 3 - Miles Davis (Spartan WC) won by decision over Jackson Collins (Falcon Youth WC) Dec 4-0</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Quarterfinal - Treyden Diduch (Alber Athletics WC) won by decision over Clark Goodwin (Lincoln-Way WC) Dec 5-0</li>\n<li>Quarterfinal - Reese Babcock (St. Charles WC) won by decision over Julian Medina (Bolingbrook Junior Raiders WC) Dec 5-0</li>\n<li>Quarterfinal - Noah Thomas (Granite City Wrestling Association) won by fall over Cale Dauber (Junior Raiders West WC) Fall 1:30</li>\n<li>Quarterfinal - Carter Noonan (Bolingbrook Junior Raiders WC) won by fall over Ian Rotramel (Falcon Youth WC) Fall 1:19</li>\n<li>Cons. Round 3 - Damon Glenn (Unity Youth WC) won by decision over Zander Johnson (Granite City Wrestling Association) Dec 7-5</li>\n<li>Cons. Round 3 - Zachary Cooley (Granite City Wrestling Association) won by fall over Gage Enos (Batavia WC) Fall 1:23</li>\n<li>Cons. Round 3 - Thomas Blanke (Barrington Broncos WC) won by major decision over Maddox Lawrence (Yorkville WC) Maj 10-0</li>\n<li>Cons. Round 3 - Kevin Bisonaya (Panther WC) won by decision over Santino Scardina (Lions WC) Dec 6-5</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Quarterfinal - Colin Crouch (Triad Knights WC) won by decision over Landon Near (nWo WC) Dec 7-2</li>\n<li>Quarterfinal - Erik Klichurov (Izzy Style Wrestling) won by decision over Crue Hatchell (Southside Outlaws WC) Dec 8-2</li>\n<li>Quarterfinal - Hogan Rice (St. Charles WC) won by decision over Michael Rundell (Arlington Cardinals WC) Dec 5-1</li>\n<li>Quarterfinal - Liam Kissane (Tinley Park Bulldogs WC) won by decision over Weston Frazier (Storm Youth WC) Dec 1-0</li>\n<li>Cons. Round 3 - Ayden Winchell (Callan Wrestling Academy) won in sudden victory - 1 over Brycen Fahnestock (Junior Raiders West WC) SV-1 8-6</li>\n<li>Cons. Round 3 - Hudson Price (River Bend WC) won by decision over Riley Smith (Granite City Wrestling Association) Dec 9-4</li>\n<li>Cons. Round 3 - Zayne Salah (Elevate Wrestling Academy) won in sudden victory - 1 over Luthor Rajcevich (Crystal Lake Wizards WC) SV-1 4-2</li>\n<li>Cons. Round 3 - Jeffrey Dunaway (St. Charles WC) won by decision over Connor Collins (Olympia WC) Dec 6-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Kaden Potter (St. Charles WC) won by decision over Jayce Glauser (Fox Lake WC) Dec 5-0</li>\n<li>Quarterfinal - Jaden Washington (Harvey Twisters) won by fall over Kiernan Delaney (Toss Em Up Wrestling Academy) Fall 4:13</li>\n<li>Quarterfinal - Colton Wyller (Force Elite WC) won by major decision over Vannak Khiev (Mat Rat WC) Maj 12-2</li>\n<li>Quarterfinal - Rhyis Polenske (Blue Line Training Academy) won by fall over Alec Daly (Storm Youth WC) Fall 4:08</li>\n<li>Cons. Round 3 - Jase Edrington (Storm Youth WC) won by decision over Obadiah Willis (Beat the Streets-Chicago) Dec 7-0</li>\n<li>Cons. Round 3 - Adonis Washington (Harvey Twisters) won by fall over Dominic Angileri (Hononegah WC) Fall 2:41</li>\n<li>Cons. Round 3 - Jackson Marlett (St. Charles WC) won by fall over Landon Rhodes (Storm Youth WC) Fall 2:02</li>\n<li>Cons. Round 3 - Maddux Rabczak (Alber Athletics WC) won by major decision over Colton Drinkwine (nWo WC) Maj 12-1</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Quarterfinal - Lukas Foster (Callan Wrestling Academy) won by decision over Nikolas Duarte (Arlington Cardinals WC) Dec 7-2</li>\n<li>Quarterfinal - Nick Dilallo (St. Charles WC) won by major decision over Rain Scott (Springs Elite WC) Maj 12-2</li>\n<li>Quarterfinal - Ethan Hamilton (Harvey Twisters) won by decision over Shane Stream (Lincoln-Way WC) Dec 9-7</li>\n<li>Quarterfinal - Brady Glynn (Lincoln-Way WC) won by decision over Jacob Smith (Lakeland Predators WC) Dec 1-0</li>\n<li>Cons. Round 3 - Hunter Brandon (SOT-C) won by decision over Griffin Kellett (LaSalle Peru Crunching Cavs Youth WC) Dec 11-4</li>\n<li>Cons. Round 3 - Matthew Deutch (Waterloo Bulldog Wrestling) won by fall over Archer Biag (Naperville WC) Fall 3:36</li>\n<li>Cons. Round 3 - Ray Long (Team El1te Wrestling) won by major decision over Aidan Lopez (nWo WC) Maj 11-3</li>\n<li>Cons. Round 3 - Pedro Alberto Rangel (Storm Youth WC) won by decision over Santiago Trejo (Southside Outlaws WC) Dec 6-2</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Quarterfinal - Robert Ruscitti (Arlington Cardinals WC) won by decision over Dawson Hawthorne (Granite City Wrestling Association) Dec 4-0</li>\n<li>Quarterfinal - Colton Schultz (Callan Wrestling Academy) won by fall over Alexander Osborne (Team Poeta) Fall 1:17</li>\n<li>Quarterfinal - Adante Washington (Harvey Twisters) won by tech fall over Kane Dauber (Junior Raiders West WC) TF 16-0</li>\n<li>Quarterfinal - Ryan Dorn (Barrington Broncos WC) won by major decision over Devin Ehler (Storm Youth WC) Maj 17-5</li>\n<li>Cons. Round 3 - Talin Baker (Champaign WC) won by major decision over Nolan Chrisse (Bolingbrook Junior Raiders WC) Maj 10-2</li>\n<li>Cons. Round 3 - Oscar Kalman (Elevate Wrestling Academy) won by fall over Carl Cody Weidner (Highland Bulldog Jr. WC) Fall 1:11</li>\n<li>Cons. Round 3 - Kannon Judycki (Southside Outlaws WC) won by decision over Lelan Nelson (Richmond WC) Dec 1-0</li>\n<li>Cons. Round 3 - Kai Enos (Batavia WC) won by fall over Michael Riggs (Wheaton Tigers WC) Fall 2:31</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Quarterfinal - Ethan Sonne (Lincoln-Way WC) won by major decision over Caden Campo (Vittum Cats WC) Maj 9-0</li>\n<li>Quarterfinal - Aidan McClure (St. Charles WC) won by decision over Avery Jaime (Bulls WC) Dec 5-0</li>\n<li>Quarterfinal - Aiden Arnett (Lincoln-Way WC) won by decision over Benjamin Nadig (Alber Athletics WC) Dec 3-2</li>\n<li>Quarterfinal - Mason Swartz (Storm Youth WC) won by fall over John Hanrahan (Arlington Cardinals WC) Fall 0:42</li>\n<li>Cons. Round 3 - Logan Woodbury (ISI WC) won by major decision over Andrew Lehman (Beat the Streets-Chicago) Maj 9-0</li>\n<li>Cons. Round 3 - Robert Williams (Harvey Twisters) won by major decision over Michael Goolish (MadDog Wrestling Academy) Maj 15-2</li>\n<li>Cons. Round 3 - Max Mandac (Lincoln-Way WC) won in sudden victory - 1 over Brody Page (Yorkville WC) SV-1 4-2</li>\n<li>Cons. Round 3 - Charlie Connors (Dixon WC) won by fall over Kaeden Davis (Olney Cubs WC) Fall 3:42</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Quarterfinal - Dawson Mack (Bolingbrook Junior Raiders WC) won by fall over Cole Yarbrough (Vandalia Jr WC) Fall 2:43</li>\n<li>Quarterfinal - Christian Bass (Team 1006 Wrestling) won by fall over Beau Walker (Elmhurst Titans Wrestling Academy) Fall 1:18</li>\n<li>Quarterfinal - Sawyer Valdez (Sycamore WC) won by decision over Jadon Zimmer (Lincoln-Way WC) Dec 6-0</li>\n<li>Quarterfinal - Eddie Astorga (Mustang WC) won by decision over Joshua Harkey (Bulls WC) Dec 9-4</li>\n<li>Cons. Round 3 - Devon Swope (DC WC) won by fall over John Gough (MadDog Wrestling Academy) Fall 0:27</li>\n<li>Cons. Round 3 - Landen Vincent (Junior Pioneer WC) won by decision over Cade Vazquez (Izzy Style Wrestling) Dec 7-2</li>\n<li>Cons. Round 3 - Wyatt Franckowiak (Richmond WC) won by decision over Khalid Eid (Astro WC) Dec 5-2</li>\n<li>Cons. Round 3 - Matthew Laird (Callan Wrestling Academy) won by decision over Ashton Glisson (St. Charles WC) Dec 2-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Brendan Nardin (Alber Athletics WC) won by fall over Aiden Quevedo (MadDog Wrestling Academy) Fall 4:07</li>\n<li>Quarterfinal - Thomas Banas (Demolition WC) won by decision over Cohen Sweely (Benton WC) Dec 6-2</li>\n<li>Quarterfinal - Tyler Lachenberg (Lincoln-Way WC) won by fall over Gavin Woodmancy (St. Charles WC) Fall 1:17</li>\n<li>Quarterfinal - Brady Ritter (Bolingbrook Junior Raiders WC) won by decision over William Julian (Xtreme WC) Dec 5-0</li>\n<li>Cons. Round 3 - Davian Hall (Englewood Live Wire WC) won by decision over Harley Pierce (Cumberland Youth WC) Dec 7-6</li>\n<li>Cons. Round 3 - Owen Middleton (Yorkville WC) won by fall over Samuel Cushman (Barrington Broncos WC) Fall 3:51</li>\n<li>Cons. Round 3 - Colton Mosack (DC WC) won by decision over Dylan Knaus (ISI WC) Dec 8-4</li>\n<li>Cons. Round 3 - Antoine Shaw (Gladiator Elite WC) won by fall over Cael Perry (Batavia WC) Fall 0:55</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Quarterfinal - Daniel Lynch (Tinley Park Bulldogs WC) won by decision over Brysen Manly (nWo WC) Dec 6-0</li>\n<li>Quarterfinal - Malan Njumbe-Hatfield (Blackhawk WC) won by decision over Gavin Watson (Sparta Junior Bulldogs WC) Dec 6-4</li>\n<li>Quarterfinal - Brayden McKay (Tinley Park Bulldogs WC) won by fall over Ameer Khalil (St. Charles WC) Fall 1:25</li>\n<li>Quarterfinal - Izaac Gaines (Blue Line Training Academy) won by decision over Jayden Dohogne (Sycamore WC) Dec 11-5</li>\n<li>Cons. Round 3 - Avery Crouch (Pontiac WC) won by fall over Jack Brown (Batavia WC) Fall 1:06</li>\n<li>Cons. Round 3 - Maximus Delgado (Yorkville WC) won by decision over Frank Miceli (Mustang WC) Dec 6-2</li>\n<li>Cons. Round 3 - Max Mulhearn (Whips WC) won by decision over Fares Tahri (Fenton Jr. Bison WC) Dec 4-0</li>\n<li>Cons. Round 3 - Ethan Harvey (Lincoln-Way WC) won by decision over Cole Littlejohn (Crawford County WC) Dec 5-0</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Quarterfinal - John McGinnis (Oak Forest Warriors WC) won by fall over Chase Siguenza (Tribe WC) Fall 1:28</li>\n<li>Quarterfinal - Owen Hurd (Red Raiders Wrestling Team) won by decision over Brock Janeczko (Yorkville WC) Dec 6-2</li>\n<li>Quarterfinal - Nicholas Hermsen (Toss Em Up Wrestling Academy) won by decision over Benjamin Mullins (Crawford County WC) Dec 4-0</li>\n<li>Quarterfinal - Isiah Harris (North Boone WC) won by decision over Zion Silvestre (Harvey Twisters) Dec 6-3</li>\n<li>Cons. Round 3 - Justin Skryd (Naperville WC) won by decision over Liam Hughes (Storm Youth WC) Dec 4-0</li>\n<li>Cons. Round 3 - Nicholas Rociola (G2 WC) won by fall over Drew Williams (Peoria Razorbacks WC) Fall 1:25</li>\n<li>Cons. Round 3 - Leann Cory (O`Fallon Little Panthers WC) won by fall over Xavier Pratt (Crosstown Spartan Elite WC) Fall 2:48</li>\n<li>Cons. Round 3 - Nathan Kozlowski (Crystal Lake Wizards WC) won by fall over Tyler Nolan (Granite City Wrestling Association) Fall 4:08</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Quarterfinal - Aiden Larson (Stockton Renegades WC) won by decision over Jose Lopez (Clipper WC) Dec 6-0</li>\n<li>Quarterfinal - Kevin May (Southside Outlaws WC) won by decision over Daniel Jackson (Waterloo Bulldog Wrestling) Dec 10-4</li>\n<li>Quarterfinal - Radic Dvorak (ISI WC) won by major decision over Rage Henderson (Gladiator Elite WC) Maj 9-0</li>\n<li>Quarterfinal - Ronin Brom (Fox Valley WC) won by fall over Dillon Viscogliosi (Team 1006 Wrestling) Fall 4:06</li>\n<li>Cons. Round 3 - Sergio Baity (Urbana Tigers WC) won by fall over Omar Mendez (Benton WC) Fall 1:20</li>\n<li>Cons. Round 3 - Anthony Senese (Vittum Cats WC) won by fall over Sean Martinez (Peoria Razorbacks WC) Fall 1:24</li>\n<li>Cons. Round 3 - Karter Pollock (Golden Eagles WC) won by fall over Logan DeMarco (Demolition WC) Fall 2:29</li>\n<li>Cons. Round 3 - Jeramy Hamm (Notre Dame WC) won by fall over Rex Chavez-Jimenez (Downers Grove WC) Fall 2:31</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>Quarterfinal - Jaxson Mathenia (Waterloo Bulldog Wrestling) won by fall over Knox Homola (Whips WC) Fall 0:10</li>\n<li>Quarterfinal - Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) won by fall over Isaiah Garcia (Blackhawk WC) Fall 3:13</li>\n<li>Quarterfinal - Julian Moon (Effingham Youth WC) won by fall over Evan Grove (Metamora Kids WC) Fall 0:58</li>\n<li>Quarterfinal - Isaac Barrientos (Fitz Wrestling Academy) won by fall over Eli Miller (Granite City Wrestling Association) Fall 0:55</li>\n<li>Cons. Round 3 - Michael Kimbrough (Limestone Blue Crew WC) won by fall over Iy`Jah Grant (Urbana Tigers WC) Fall 0:25</li>\n<li>Cons. Round 3 - Isaiah Robinson (Proviso Township Gladiators WC) won by fall over Jake Luedtke (Tinley Park Bulldogs WC) Fall 0:40</li>\n<li>Cons. Round 3 - Art Bytyqi (Evanston School of Wrestling) won by decision over Gabriel Del Toro (TJ Trained Wrestling) Dec 3-2</li>\n<li>Cons. Round 3 - Jacob Crawford (Mustang WC) won by fall over Brayden Felice (Oswego WC) Fall 0:36</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Quarterfinal - Foley Calcagno (Southside Outlaws WC) won by fall over Jeremiah Watters (Edwardsville WC) Fall 1:06</li>\n<li>Quarterfinal - Johnny Strauss (Golden Eagles WC) won by decision over Justin Koch (RWC) Dec 8-4</li>\n<li>Quarterfinal - Maximus Vela (Callan Wrestling Academy) won by fall over Joseph Torres (Junior Titans Wrestling) Fall 2:12</li>\n<li>Quarterfinal - Landynn Balla (Storm Youth WC) won by fall over Charles Jacquez (Trico WC) Fall 3:31</li>\n<li>Cons. Round 3 - Khaden Hallowell (SJO Youth WC) won by fall over Gavin Ericson (Junior Bronco WC) Fall 3:15</li>\n<li>Cons. Round 3 - Caden Schladt (Crystal Lake Wizards WC) won by fall over Bela Jackson (Lincoln-Way WC) Fall 1:25</li>\n<li>Cons. Round 3 - Damien Stoller (Peoria Heights Minutemen WC) won by fall over Colin Murphy (Downers Grove WC) Fall 0:22</li>\n<li>Cons. Round 3 - Erick Esquivel (Mat Rat WC) won in sudden victory - 1 over Jacob Sharrock (Waterloo Bulldog Wrestling) SV-1 6-4</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Quarterfinal - Roman Janek (Lion`s Den Wrestling Academy) won by fall over Gannon Dunker (The Law WC) Fall 4:03</li>\n<li>Quarterfinal - Tommy O`Brien (Panther WC) won by fall over Alan Tauscher (Belvidere Bandits WC) Fall 2:31</li>\n<li>Quarterfinal - Joseph Favia (Fitz Wrestling Academy) won by fall over Simon Schulte (Edwardsville WC) Fall 0:58</li>\n<li>Quarterfinal - Logan Abrams (Crystal Lake Wizards WC) won by fall over King Liggins (Harvey Twisters) Fall 3:41</li>\n<li>Cons. Round 3 - Chason Daly (Unity Youth WC) won by fall over Jaiden Williams (Elevate Wrestling Academy) Fall 0:39</li>\n<li>Cons. Round 3 - Daniel Mahoney (Panther WC) won by fall over Jack Parker (Kaneland Knights WC) Fall 3:37</li>\n<li>Cons. Round 3 - Jonathan Ramaker (Trico WC) won by fall over Ezekiel Bridgeman (Peoria Razorbacks WC) Fall 2:59</li>\n<li>Cons. Round 3 - Gage LaDere (Lincoln-Way WC) won by fall over Raymond Morales (Lion`s Den Wrestling Academy) Fall 0:12</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Teigen Moreno (Dundee Highlanders WC) won by fall over Zander Schrader (Olney Cubs WC) Fall 1:06</li>\n<li>Quarterfinal - Xavier Bitner (Panther WC) won by fall over John Turner (Sycamore WC) Fall 1:42</li>\n<li>Quarterfinal - Jack Miller (St. Charles WC) won by decision over Connor Uhler (Dundee Highlanders WC) Dec 5-4</li>\n<li>Quarterfinal - Jaxon Penovich (Arlington Cardinals WC) won by fall over Wyatt Hochgraber (Panther WC) Fall 0:35</li>\n<li>Cons. Round 3 - Ethan Miller (Storm Youth WC) won by decision over Randy McPeek (Dakota WC) Dec 5-1</li>\n<li>Cons. Round 3 - Jacob Palucki (Tinley Park Bulldogs WC) won by fall over Cole Pritchett (Junior Kahoks WC) Fall 3:57</li>\n<li>Cons. Round 3 - Timothy Lyon (Peoria Heights Minutemen WC) won by fall over Marcel Debski (Maine Eagles WC) Fall 2:31</li>\n<li>Cons. Round 3 - Emmett Easton (Lil` Coalers WC) won by fall over Phoenix Molina (Unity Youth WC) Fall 2:16</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Zion Carter (Astro WC) won by fall over Austin Kunz (Edwardsville WC) Fall 2:05</li>\n<li>Quarterfinal - Kai Calcutt (Toss Em Up Wrestling Academy) won by fall over Jaylen Torres (Tribe WC) Fall 2:34</li>\n<li>Quarterfinal - Matthew Medina (St. Charles WC) won by fall over Lucas Kunz (Edwardsville WC) Fall 0:31</li>\n<li>Quarterfinal - Ryan Stingliy (Frankfort Wildcats Wrestling) won by decision over Dakari Hawthorne (Urbana Tigers WC) Dec 3-2</li>\n<li>Cons. Round 3 - Jeremy Marshall (Evanston School of Wrestling) won by major decision over Jayden Chavez (Blackhawk WC) Maj 8-0</li>\n<li>Cons. Round 3 - Keegan Barnes (Peoria Heights Minutemen WC) won by fall over Danzel Newell (Astro WC) Fall 3:39</li>\n<li>Cons. Round 3 - Jai Gomez (Bulldog Elite WC) won by decision over Ever Ceniceros (Aurora WC) Dec 6-3</li>\n<li>Cons. Round 3 - Raul Martinez (Rantoul Youth Wrestling) won by fall over Huthaifa Issa (Astro WC) Fall 0:54</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Quarterfinal - Ramsey Barton (Yorkville WC) won by major decision over Hudson Anderton (Nomad Wrestling Academy) Maj 9-0</li>\n<li>Quarterfinal - Benjamin Jurkovic (Tinley Park Bulldogs WC) won by fall over Taryn Heather (Polo WC) Fall 2:23</li>\n<li>Quarterfinal - Carson West (St. Charles WC) won by disqualification over Niko Odiotti (Arlington Cardinals WC) DQ</li>\n<li>Quarterfinal - Christian Corcoran (Lincoln-Way WC) won by fall over Pippino Campo (Williamsville WC) Fall 0:30</li>\n<li>Cons. Round 3 - Davin Torza (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Logan Conover (Batavia WC) won by fall over Diego Martinez (Belvidere Bandits WC) Fall 0:58</li>\n<li>Quarterfinal - Elio Gil (Tinley Park Bulldogs WC) won by decision over Chace Matheny (Edwardsville WC) Dec 7-1</li>\n<li>Quarterfinal - Tanner Stone (Bolingbrook Junior Raiders WC) won by tech fall over Marty Towey (Notre Dame WC) TF 15-0</li>\n<li>Quarterfinal - Matteo Vitro (Lemont Bears WC) won by decision over Benjamin Wells (Champaign WC) Dec 5-1</li>\n<li>Cons. Round 3 - Kaleb Fuchs (Limestone Blue Crew WC) received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 -   () received a bye   () Bye</li>\n<li>Cons. Round 3 - Brody Sanders (Unity Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Declan Sons (St. Charles WC) won by major decision over Shane Seip (Triad Knights WC) Maj 9-1</li>\n<li>Quarterfinal - Max Munn (Lincoln-Way WC) won by decision over Roberto Rangel (Oak Forest Warriors WC) Dec 2-0</li>\n<li>Quarterfinal - Morgan Turner (Harvey Twisters) won by fall over Landon Cornwell (Crawford County WC) Fall 0:46</li>\n<li>Quarterfinal - Daniel Myint (Arlington Cardinals WC) won by fall over Zayden Mansfield (Unity Youth WC) Fall 4:28</li>\n<li>Cons. Round 3 - Garrett Pohl (Lions WC) won by fall over Leland Pepper (Bulls WC) Fall 0:38</li>\n<li>Cons. Round 3 - Blair Grennan (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 3 - Elijah Sawyers (Harvey Twisters) won by fall over Zoey Dodgers (Wolfpak WC) Fall 3:27</li>\n<li>Cons. Round 3 - Steven Uden (Storm Youth WC) won by major decision over Jakob Geestman (River Bend WC) Maj 11-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Max Philpot (Vandalia Jr WC) won by fall over Trentin Odachowski (Elk Grove Junior Grens WC) Fall 0:45</li>\n<li>Quarterfinal - Nadeem Haleem (Lincoln-Way WC) won by decision over Kaleb Pratt (Arlington Cardinals WC) Dec 4-0</li>\n<li>Quarterfinal - Jamiel Castleberry (Proviso Township Gladiators WC) won by tech fall over Dakoda Hentz (Fighting Farmers WC) TF 20-4</li>\n<li>Quarterfinal - Allen Woo (Izzy Style Wrestling) won by tech fall over Rocco Macellaio (Little Falcons WC) TF 22-5</li>\n<li>Cons. Round 3 - Brandon Carbone (Crystal Lake Wizards WC) won by decision over Eric Hoselton (Lincoln-Way WC) Dec 2-0</li>\n<li>Cons. Round 3 - Dylan Weber (Elevate Wrestling Academy) won by fall over Weston Lange (Metamora Kids WC) Fall 0:32</li>\n<li>Cons. Round 3 - Deegan Kirschke (ISI WC) won by decision over Michael Olson (Sycamore WC) Dec 5-1</li>\n<li>Cons. Round 3 - Luke Pappalas (Mustang WC) won by decision over Sean Serbinski (Naperville WC) Dec 9-4</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Quarterfinal - Nicholas Garcia (Fitz Wrestling Academy) won by fall over Bryson Nuttall (Edwardsville WC) Fall 0:42</li>\n<li>Quarterfinal - Vince Jasinski (Fox Lake WC) won by major decision over Bernardo Roque (Izzy Style Wrestling) Maj 11-2</li>\n<li>Quarterfinal - Chazz Robinson (Harvey Twisters) won by major decision over Elijah Mabry (Vandalia Jr WC) Maj 17-4</li>\n<li>Quarterfinal - Maxwell Cumbee (Izzy Style Wrestling) won by decision over Austin Hagevold (ISI WC) Dec 7-2</li>\n<li>Cons. Round 3 - Lily Enos (Batavia WC) won by fall over Jason Glosser (Champaign WC) Fall 1:03</li>\n<li>Cons. Round 3 - Brandon White (The Law WC) won in tie breaker - 1 over Joseph Bronske (Oak Forest Warriors WC) TB-1 5-3</li>\n<li>Cons. Round 3 - Nicholas Marchese (Crystal Lake Wizards WC) won by fall over Javier Flores (Force Elite WC) Fall 0:53</li>\n<li>Cons. Round 3 - Michael Miranda (Team 312 WC) won by tech fall over Justin Godina (Harvey Twisters) TF 16-0</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Quarterfinal - Michael Malizzio (Team El1te Wrestling) won by decision over Isaac Zimmerman (Lockport Junior Porters WC) Dec 6-5</li>\n<li>Quarterfinal - Demetrios Carrera (Yorkville WC) won by decision over Cory Zator (Lemont Bears WC) Dec 9-2</li>\n<li>Quarterfinal - Preston Waughtel (Bulls WC) won by major decision over Harrison Dea (TJ Trained Wrestling) Maj 12-1</li>\n<li>Quarterfinal - Domenic Munaretto (Toss Em Up Wrestling Academy) won by fall over Clinton VerHeecke (Mt. Zion Kids WC) Fall 1:14</li>\n<li>Cons. Round 3 - Tommy Fidler (Panther WC) won by major decision over Liam Fenoglio (Yorkville WC) Maj 10-2</li>\n<li>Cons. Round 3 - Jackson Olson (Hononegah WC) won by decision over Cameron Engels (Scorpion WC) Dec 7-4</li>\n<li>Cons. Round 3 - Jack Hogan (G2 WC) won by decision over Anthony Sutton (Lockport Junior Porters WC) Dec 7-6</li>\n<li>Cons. Round 3 - Tyler Lockhart (Sycamore WC) won by fall over Kristian Declercq (ISI WC) Fall 2:42</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Quarterfinal - Ryan Richie (Edwardsville WC) won by major decision over Max Mularz (Frankfort Wildcats Wrestling) Maj 12-0</li>\n<li>Quarterfinal - George Hollendoner (Tinley Park Bulldogs WC) won by decision over Marcus Quintana (Team 1006 Wrestling) Dec 7-2</li>\n<li>Quarterfinal - Rocco Cassioppi (Hononegah WC) won by fall over Jaxon Jorgensen (HPL Wrestling) Fall 1:23</li>\n<li>Quarterfinal - Jason Hampton (Harvey Twisters) won by decision over Garrett VerHeecke (Mt. Zion Kids WC) Dec 2-1</li>\n<li>Cons. Round 3 - Evan Matkovich (Batavia WC) won by decision over Griff Powell (Lions WC) Dec 6-4</li>\n<li>Cons. Round 3 - Daniel Blanke (Barrington Broncos WC) won by tech fall over Grady Hull (Blue Line Training Academy) TF 15-0</li>\n<li>Cons. Round 3 - Logan Tatar (St. Charles WC) won by decision over Nicholas Merola (Team El1te Wrestling) Dec 1-0</li>\n<li>Cons. Round 3 - Jacob Alvarez (Izzy Style Wrestling) won by decision over Tyler Huchel (Storm Youth WC) Dec 5-0</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Quarterfinal - Nolan Vogel (Callan Wrestling Academy) won by decision over Lincoln Hoger (Fox Valley WC) Dec 4-2</li>\n<li>Quarterfinal - Kameron Luif (Team El1te Wrestling) won by fall over Arrison Bauer (Stockton Renegades WC) Fall 1:04</li>\n<li>Quarterfinal - Kaidreaus Richardson (Lincoln-Way WC) won by decision over Maxwell Wade (Gladiator Elite WC) Dec 5-1</li>\n<li>Quarterfinal - Justin Wardlow (Harvey Twisters) won by fall over Aden Rangel (Storm Youth WC) Fall 0:26</li>\n<li>Cons. Round 3 - Jackson Hanselman (Southside Outlaws WC) won by major decision over Taylor Finley (Herrin Junior WC) Maj 13-2</li>\n<li>Cons. Round 3 - Chase Nobiling (Team Poeta) won by decision over Chase Krantz (Blue Line Training Academy) Dec 9-4</li>\n<li>Cons. Round 3 - Zev Koransky (Little Huskies WC) won by decision over Haden Anderson (Frankfort Wildcats Wrestling) Dec 8-2</li>\n<li>Cons. Round 3 - Dillon Griffin (Team 1006 Wrestling) won by fall over Malachi Hutchinson (Urbana Tigers WC) Fall 0:28</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Quarterfinal - Jeremy Huf (Arlington Cardinals WC) won by major decision over Isaac Mayora (Stampede WC) Maj 10-0</li>\n<li>Quarterfinal - Aaron Camacho (Bolingbrook Junior Raiders WC) won by decision over Knox Verbais (Combative Sports Athletic Center) Dec 7-3</li>\n<li>Quarterfinal - Zachary Stewart (Fitz Wrestling Academy) won by decision over Wyatt Medlin (Super Soldiers WC) Dec 7-2</li>\n<li>Quarterfinal - David Ogunsanya (Harvey Twisters) won by fall over Hunter Shike (Unity Youth WC) Fall 4:07</li>\n<li>Cons. Round 3 - Austin Perez (Oak Forest Warriors WC) won by decision over Antonio Hinojosa (Toss Em Up Wrestling Academy) Dec 7-0</li>\n<li>Cons. Round 3 - Jalen Byrd (Lincoln-Way WC) won by decision over Erik Rodriguez (Fox Lake WC) Dec 10-4</li>\n<li>Cons. Round 3 - Ashton Hobson (Batavia WC) won by tech fall over Robye Williams (Harvey Twisters) TF 15-0</li>\n<li>Cons. Round 3 - Luke Grindstaff (Team 1006 Wrestling) won by decision over Jace Vincent (Stockton Renegades WC) Dec 8-1</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Quarterfinal - Thomas Mcdermott (Force Elite WC) won by fall over Adam Jacks (Junior Pioneer WC) Fall 0:39</li>\n<li>Quarterfinal - Dillon Hinton (Vandalia Jr WC) won by decision over Dayne Serio (Fitz Wrestling Academy) Dec 5-2</li>\n<li>Quarterfinal - Liam Kelly (Tinley Park Bulldogs WC) won by decision over Brody Kelly (Fitz Wrestling Academy) Dec 5-2</li>\n<li>Quarterfinal - Jimmy Mastny (Alber Athletics WC) won by fall over Colton Zvonar (Lincoln-Way WC) Fall 4:24</li>\n<li>Cons. Round 3 - Frankie Nitti (Izzy Style Wrestling) won by decision over Benjamin Czarnowski (Southside Outlaws WC) Dec 6-2</li>\n<li>Cons. Round 3 - Caleb Viscogliosi (Team 1006 Wrestling) won by decision over Luis Flores (Team El1te Wrestling) Dec 8-2</li>\n<li>Cons. Round 3 - Logan Hiller (Edwardsville WC) won by fall over Aiden Jedlowski (Frankfort Wildcats Wrestling) Fall 3:53</li>\n<li>Cons. Round 3 - Aric Abbott (ISI WC) won by decision over Keagan Turner (Vandalia Jr WC) Dec 5-4</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Quarterfinal - Aaron Stewart (Toss Em Up Wrestling Academy) won by fall over Killian Rauch (Belleville Little Devils WC) Fall 0:20</li>\n<li>Quarterfinal - Ian Hawkins (Junior Bronco WC) won by decision over Oliver McPeek (Stockton Renegades WC) Dec 6-2</li>\n<li>Quarterfinal - Kye Weinzierl (Blue Line Training Academy) won by major decision over Aiden Hennings (Lincoln-Way WC) Maj 15-1</li>\n<li>Quarterfinal - Brody Sendele (Hononegah WC) won by tech fall over Cooper Miller (Storm Youth WC) TF 20-5</li>\n<li>Cons. Round 3 - Leonardo Rosas (Team El1te Wrestling) won by fall over Gunner Hefley (Hillsboro Jr Toppers WC) Fall 0:57</li>\n<li>Cons. Round 3 - Pierre Walton (East St. Louis WC) won by decision over Donovan Rosauer (Yorkville WC) Dec 7-3</li>\n<li>Cons. Round 3 - Anthony Iaquinta (Lemont Bears WC) won by fall over Joseph Michelini (Mat Rat WC) Fall 2:48</li>\n<li>Cons. Round 3 - Reily Leifheit (Team 1006 Wrestling) won by fall over Samuel Chigaros (Mustang WC) Fall 4:11</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Quarterfinal - Kenyonte Louis (Englewood Live Wire WC) won by fall over Jake Rhymes (Scorpion WC) Fall 2:29</li>\n<li>Quarterfinal - Eli Larson (Stockton Renegades WC) won by decision over Brenden Voight (nWo WC) Dec 1-0</li>\n<li>Quarterfinal - Royce Lopez (Toss Em Up Wrestling Academy) won by decision over Declan Dircks (Frankfort Wildcats Wrestling) Dec 9-3</li>\n<li>Quarterfinal - Trevon Williams (Springs Elite WC) won in SV-1 by fall over Cooper Bode (Sycamore WC) SV-1 (Fall) 5:08</li>\n<li>Cons. Round 3 - Jamison Chambliss (Storm Youth WC) won by decision over Tyler Gleason (Team 1006 Wrestling) Dec 11-4</li>\n<li>Cons. Round 3 - Vincenzo Testa (Team El1te Wrestling) won by decision over Luke McCoy (Bulls WC) Dec 4-0</li>\n<li>Cons. Round 3 - Tristin Golden (Brawlers WC) won by fall over Graham Taylor (Edwardsville WC) Fall 2:55</li>\n<li>Cons. Round 3 - James Talley Jr (Lincoln-Way WC) won by fall over Garrett Patnoudes (Oswego WC) Fall 0:21</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Quarterfinal - Jeremiah Luke (Stockton Renegades WC) won in sudden victory - 1 over Xander Keslin (Force Elite WC) SV-1 9-4</li>\n<li>Quarterfinal - Michael Brannigan (Red Raiders Wrestling Team) won by decision over John Cloud (Edwardsville WC) Dec 2-1</li>\n<li>Quarterfinal - Santino Tenuta (Team El1te Wrestling) won by fall over Carter Hintz (Red Raiders Wrestling Team) Fall 3:41</li>\n<li>Quarterfinal - Owen McGinnis (Cumberland Youth WC) won by decision over Matthew Plumb (SCN Youth WC) Dec 4-2</li>\n<li>Cons. Round 3 - Joshua Heath (Unity Youth WC) won by decision over Noah Cohen (Lincoln-Way WC) Dec 10-9</li>\n<li>Cons. Round 3 - Elijah Carter (Astro WC) won by decision over Malik Mosley (Urbana Tigers WC) Dec 7-5</li>\n<li>Cons. Round 3 - Trae Jackson Griffiths (Champaign WC) won by fall over Samuel Higgins (Maine Eagles WC) Fall 0:31</li>\n<li>Cons. Round 3 - Julian Flores (Mat Rat WC) won by fall over David Miranda (Crystal Lake Wizards WC) Fall 3:27</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Quarterfinal - Connor Sacco (Marengo Youth WC) won by fall over Triston Manrique (O`Fallon Little Panthers WC) Fall 1:54</li>\n<li>Quarterfinal - Roman Villalobos (nWo WC) won by fall over Jack English (Murphysboro Wrestling) Fall 0:54</li>\n<li>Quarterfinal - Malik Warren (Harvey Twisters) won by fall over Duncan Nevel (The Law WC) Fall 3:53</li>\n<li>Quarterfinal - Adam Carrick (Sycamore WC) won by decision over Lonnez Smith (East St. Louis WC) Dec 6-4</li>\n<li>Cons. Round 3 - Foster Yarbrough (Wheaton Tigers WC) won by fall over Nikola O`Connor (Fox Valley WC) Fall 0:19</li>\n<li>Cons. Round 3 - Jordan Bair (Peoria Wizards WC) won by major decision over Leo Hughes (Murphysboro Wrestling) Maj 13-3</li>\n<li>Cons. Round 3 - Harrison Kinney (Hononegah WC) won by fall over Diego Diaz (Aurora WC) Fall 1:59</li>\n<li>Cons. Round 3 - Austin Webb (Peoria Wizards WC) won by decision over Orlando Hoye Iii (Glenbard East Jr Rams WC) Dec 3-0</li>\n</ul>\n</section>",
  "3rd WB": "<section class=\"tw-list\">\n<h1>3rd WB</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>Cons. Round 4 - Hayden Wheeler (Yorkville WC) won by fall over Aj Forst (Fox Valley WC) Fall 4:21</li>\n<li>Cons. Round 4 - Travis Ellis (Harvey Twisters) won by fall over Gregory Heavey (Wheaton Tigers WC) Fall 1:07</li>\n<li>Cons. Round 4 - Michael Hardin (Danville Chargers WC) won by fall over Blake Pohlman (Glenbard East Jr Rams WC) Fall 0:12</li>\n<li>Cons. Round 4 - Bradyn Haynes (Pekin Boys &amp; Girls Club) won by fall over Christopher Korduplewski (Tinley Park Bulldogs WC) Fall 1:04</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 4 - Hunter Wahtola (Beat the Streets-Chicago) won by decision over Carson Sexton (SOT-C) Dec 3-0</li>\n<li>Cons. Round 4 - Alex Tucker (Timber Wolves WC) won by fall over Cayden Berryhill (G2 WC) Fall 0:58</li>\n<li>Cons. Round 4 - Evan Flanagan (Clipper WC) won by fall over Chase Paduch (Scorpion WC) Fall 1:15</li>\n<li>Cons. Round 4 - Samuel Swais (Elk Grove Junior Grens WC) won by fall over Donovan Olmstead (Belleville Little Devils WC) Fall 1:09</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Cons. Round 4 - Nolan Renz (Metamora Kids WC) won by decision over Anthony Hansen (River Bend WC) Dec 5-4</li>\n<li>Cons. Round 4 - Mason Beattie (Spartan WC) won by decision over Camden Chapman (Gladiator Elite WC) Dec 4-2</li>\n<li>Cons. Round 4 - Jimmy Roach (Panther WC) won by major decision over Julian Godina (Harvey Twisters) Maj 8-0</li>\n<li>Cons. Round 4 - Aden Spinelli (nWo WC) won by decision over Miles Davis (Spartan WC) Dec 9-7</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Cons. Round 4 - Cale Dauber (Junior Raiders West WC) won by fall over Damon Glenn (Unity Youth WC) Fall 3:47</li>\n<li>Cons. Round 4 - Zachary Cooley (Granite City Wrestling Association) won by major decision over Ian Rotramel (Falcon Youth WC) Maj 10-0</li>\n<li>Cons. Round 4 - Thomas Blanke (Barrington Broncos WC) won by decision over Clark Goodwin (Lincoln-Way WC) Dec 8-4</li>\n<li>Cons. Round 4 - Julian Medina (Bolingbrook Junior Raiders WC) won by fall over Kevin Bisonaya (Panther WC) Fall 2:41</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Cons. Round 4 - Michael Rundell (Arlington Cardinals WC) won by tech fall over Ayden Winchell (Callan Wrestling Academy) TF 17-2</li>\n<li>Cons. Round 4 - Weston Frazier (Storm Youth WC) won by major decision over Hudson Price (River Bend WC) Maj 13-5</li>\n<li>Cons. Round 4 - Landon Near (nWo WC) won by fall over Zayne Salah (Elevate Wrestling Academy) Fall 2:48</li>\n<li>Cons. Round 4 - Crue Hatchell (Southside Outlaws WC) won by major decision over Jeffrey Dunaway (St. Charles WC) Maj 18-4</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 4 - Vannak Khiev (Mat Rat WC) won by decision over Jase Edrington (Storm Youth WC) Dec 13-8</li>\n<li>Cons. Round 4 - Adonis Washington (Harvey Twisters) won by fall over Alec Daly (Storm Youth WC) Fall 1:27</li>\n<li>Cons. Round 4 - Jayce Glauser (Fox Lake WC) won by decision over Jackson Marlett (St. Charles WC) Dec 5-1</li>\n<li>Cons. Round 4 - Maddux Rabczak (Alber Athletics WC) won by decision over Kiernan Delaney (Toss Em Up Wrestling Academy) Dec 5-4</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Cons. Round 4 - Shane Stream (Lincoln-Way WC) won by decision over Hunter Brandon (SOT-C) Dec 6-2</li>\n<li>Cons. Round 4 - Matthew Deutch (Waterloo Bulldog Wrestling) won by decision over Jacob Smith (Lakeland Predators WC) Dec 5-4</li>\n<li>Cons. Round 4 - Nikolas Duarte (Arlington Cardinals WC) won by fall over Ray Long (Team El1te Wrestling) Fall 3:53</li>\n<li>Cons. Round 4 - Pedro Alberto Rangel (Storm Youth WC) won by decision over Rain Scott (Springs Elite WC) Dec 6-2</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Cons. Round 4 - Kane Dauber (Junior Raiders West WC) won by fall over Talin Baker (Champaign WC) Fall 3:58</li>\n<li>Cons. Round 4 - Devin Ehler (Storm Youth WC) won by decision over Oscar Kalman (Elevate Wrestling Academy) Dec 4-0</li>\n<li>Cons. Round 4 - Dawson Hawthorne (Granite City Wrestling Association) won by fall over Kannon Judycki (Southside Outlaws WC) Fall 3:37</li>\n<li>Cons. Round 4 - Alexander Osborne (Team Poeta) won by fall over Kai Enos (Batavia WC) Fall 2:43</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Cons. Round 4 - Benjamin Nadig (Alber Athletics WC) won by major decision over Logan Woodbury (ISI WC) Maj 10-0</li>\n<li>Cons. Round 4 - John Hanrahan (Arlington Cardinals WC) won by decision over Robert Williams (Harvey Twisters) Dec 8-3</li>\n<li>Cons. Round 4 - Caden Campo (Vittum Cats WC) won by decision over Max Mandac (Lincoln-Way WC) Dec 6-0</li>\n<li>Cons. Round 4 - Avery Jaime (Bulls WC) won by major decision over Charlie Connors (Dixon WC) Maj 9-0</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Cons. Round 4 - Jadon Zimmer (Lincoln-Way WC) won by decision over Devon Swope (DC WC) Dec 11-4</li>\n<li>Cons. Round 4 - Landen Vincent (Junior Pioneer WC) won by major decision over Joshua Harkey (Bulls WC) Maj 14-3</li>\n<li>Cons. Round 4 - Wyatt Franckowiak (Richmond WC) won by decision over Cole Yarbrough (Vandalia Jr WC) Dec 7-5</li>\n<li>Cons. Round 4 - Beau Walker (Elmhurst Titans Wrestling Academy) won by decision over Matthew Laird (Callan Wrestling Academy) Dec 8-6</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 4 - Gavin Woodmancy (St. Charles WC) won by decision over Davian Hall (Englewood Live Wire WC) Dec 9-2</li>\n<li>Cons. Round 4 - Owen Middleton (Yorkville WC) won by decision over William Julian (Xtreme WC) Dec 8-2</li>\n<li>Cons. Round 4 - Aiden Quevedo (MadDog Wrestling Academy) won by fall over Colton Mosack (DC WC) Fall 1:09</li>\n<li>Cons. Round 4 - Antoine Shaw (Gladiator Elite WC) won by decision over Cohen Sweely (Benton WC) Dec 2-1</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Cons. Round 4 - Ameer Khalil (St. Charles WC) won by decision over Avery Crouch (Pontiac WC) Dec 3-2</li>\n<li>Cons. Round 4 - Jayden Dohogne (Sycamore WC) won by fall over Maximus Delgado (Yorkville WC) Fall 0:32</li>\n<li>Cons. Round 4 - Brysen Manly (nWo WC) won by decision over Max Mulhearn (Whips WC) Dec 7-2</li>\n<li>Cons. Round 4 - Gavin Watson (Sparta Junior Bulldogs WC) won by fall over Ethan Harvey (Lincoln-Way WC) Fall 4:02</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Cons. Round 4 - Benjamin Mullins (Crawford County WC) won by fall over Justin Skryd (Naperville WC) Fall 3:45</li>\n<li>Cons. Round 4 - Nicholas Rociola (G2 WC) won by decision over Zion Silvestre (Harvey Twisters) Dec 5-2</li>\n<li>Cons. Round 4 - Chase Siguenza (Tribe WC) won by decision over Leann Cory (O`Fallon Little Panthers WC) Dec 10-4</li>\n<li>Cons. Round 4 - Nathan Kozlowski (Crystal Lake Wizards WC) won by fall over Brock Janeczko (Yorkville WC) Fall 2:19</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Cons. Round 4 - Sergio Baity (Urbana Tigers WC) won by fall over Rage Henderson (Gladiator Elite WC) Fall 2:26</li>\n<li>Cons. Round 4 - Anthony Senese (Vittum Cats WC) won by decision over Dillon Viscogliosi (Team 1006 Wrestling) Dec 13-6</li>\n<li>Cons. Round 4 - Karter Pollock (Golden Eagles WC) won by fall over Jose Lopez (Clipper WC) Fall 2:54</li>\n<li>Cons. Round 4 - Daniel Jackson (Waterloo Bulldog Wrestling) won by major decision over Jeramy Hamm (Notre Dame WC) Maj 8-0</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>Cons. Round 4 - Michael Kimbrough (Limestone Blue Crew WC) won by decision over Evan Grove (Metamora Kids WC) Dec 5-1</li>\n<li>Cons. Round 4 - Eli Miller (Granite City Wrestling Association) won by fall over Isaiah Robinson (Proviso Township Gladiators WC) Fall 2:41</li>\n<li>Cons. Round 4 - Knox Homola (Whips WC) won by fall over Art Bytyqi (Evanston School of Wrestling) Fall 0:58</li>\n<li>Cons. Round 4 - Jacob Crawford (Mustang WC) won by fall over Isaiah Garcia (Blackhawk WC) Fall 0:55</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Cons. Round 4 - Khaden Hallowell (SJO Youth WC) won by fall over Joseph Torres (Junior Titans Wrestling) Fall 0:24</li>\n<li>Cons. Round 4 - Caden Schladt (Crystal Lake Wizards WC) won by injury default over Charles Jacquez (Trico WC) Inj. 0:00</li>\n<li>Cons. Round 4 - Jeremiah Watters (Edwardsville WC) won by fall over Damien Stoller (Peoria Heights Minutemen WC) Fall 1:27</li>\n<li>Cons. Round 4 - Erick Esquivel (Mat Rat WC) won by fall over Justin Koch (RWC) Fall 3:53</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Cons. Round 4 - Simon Schulte (Edwardsville WC) won by fall over Chason Daly (Unity Youth WC) Fall 0:42</li>\n<li>Cons. Round 4 - King Liggins (Harvey Twisters) won by decision over Daniel Mahoney (Panther WC) Dec 7-1</li>\n<li>Cons. Round 4 - Gannon Dunker (The Law WC) won by fall over Jonathan Ramaker (Trico WC) Fall 1:12</li>\n<li>Cons. Round 4 - Gage LaDere (Lincoln-Way WC) won by fall over Alan Tauscher (Belvidere Bandits WC) Fall 2:01</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 4 - Connor Uhler (Dundee Highlanders WC) won by major decision over Ethan Miller (Storm Youth WC) Maj 9-1</li>\n<li>Cons. Round 4 - Wyatt Hochgraber (Panther WC) won by fall over Jacob Palucki (Tinley Park Bulldogs WC) Fall 1:19</li>\n<li>Cons. Round 4 - Zander Schrader (Olney Cubs WC) won by fall over Timothy Lyon (Peoria Heights Minutemen WC) Fall 1:21</li>\n<li>Cons. Round 4 - Emmett Easton (Lil` Coalers WC) won by major decision over John Turner (Sycamore WC) Maj 12-3</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 4 - Jeremy Marshall (Evanston School of Wrestling) won in sudden victory - 1 over Lucas Kunz (Edwardsville WC) SV-1 5-3</li>\n<li>Cons. Round 4 - Dakari Hawthorne (Urbana Tigers WC) won by fall over Keegan Barnes (Peoria Heights Minutemen WC) Fall 2:35</li>\n<li>Cons. Round 4 - Austin Kunz (Edwardsville WC) won by fall over Jai Gomez (Bulldog Elite WC) Fall 1:00</li>\n<li>Cons. Round 4 - Jaylen Torres (Tribe WC) won by fall over Raul Martinez (Rantoul Youth Wrestling) Fall 3:48</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Cons. Round 4 - Davin Torza (Team 1006 Wrestling) won by forfeit over Niko Odiotti (Arlington Cardinals WC) FF</li>\n<li>Cons. Round 4 - Pippino Campo (Williamsville WC) received a bye   () Bye</li>\n<li>Cons. Round 4 - Hudson Anderton (Nomad Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 4 - Taryn Heather (Polo WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 4 - Kaleb Fuchs (Limestone Blue Crew WC) won by major decision over Marty Towey (Notre Dame WC) Maj 12-0</li>\n<li>Cons. Round 4 - Benjamin Wells (Champaign WC) received a bye   () Bye</li>\n<li>Cons. Round 4 - Diego Martinez (Belvidere Bandits WC) received a bye   () Bye</li>\n<li>Cons. Round 4 - Chace Matheny (Edwardsville WC) won by fall over Brody Sanders (Unity Youth WC) Fall 0:46</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 4 - Landon Cornwell (Crawford County WC) won by decision over Garrett Pohl (Lions WC) Dec 4-3</li>\n<li>Cons. Round 4 - Zayden Mansfield (Unity Youth WC) won by major decision over Blair Grennan (Sauk Valley WC) Maj 12-3</li>\n<li>Cons. Round 4 - Elijah Sawyers (Harvey Twisters) won by major decision over Shane Seip (Triad Knights WC) Maj 11-3</li>\n<li>Cons. Round 4 - Roberto Rangel (Oak Forest Warriors WC) won by decision over Steven Uden (Storm Youth WC) Dec 3-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 4 - Brandon Carbone (Crystal Lake Wizards WC) won by major decision over Dakoda Hentz (Fighting Farmers WC) Maj 9-0</li>\n<li>Cons. Round 4 - Dylan Weber (Elevate Wrestling Academy) won by fall over Rocco Macellaio (Little Falcons WC) Fall 2:52</li>\n<li>Cons. Round 4 - Trentin Odachowski (Elk Grove Junior Grens WC) won by major decision over Deegan Kirschke (ISI WC) Maj 17-4</li>\n<li>Cons. Round 4 - Kaleb Pratt (Arlington Cardinals WC) won by fall over Luke Pappalas (Mustang WC) Fall 0:26</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Cons. Round 4 - Elijah Mabry (Vandalia Jr WC) won by fall over Lily Enos (Batavia WC) Fall 3:44</li>\n<li>Cons. Round 4 - Austin Hagevold (ISI WC) won by fall over Brandon White (The Law WC) Fall 0:43</li>\n<li>Cons. Round 4 - Nicholas Marchese (Crystal Lake Wizards WC) won by decision over Bryson Nuttall (Edwardsville WC) Dec 4-0</li>\n<li>Cons. Round 4 - Michael Miranda (Team 312 WC) won by major decision over Bernardo Roque (Izzy Style Wrestling) Maj 10-2</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Cons. Round 4 - Harrison Dea (TJ Trained Wrestling) won by decision over Tommy Fidler (Panther WC) Dec 4-1</li>\n<li>Cons. Round 4 - Clinton VerHeecke (Mt. Zion Kids WC) won by fall over Jackson Olson (Hononegah WC) Fall 1:24</li>\n<li>Cons. Round 4 - Isaac Zimmerman (Lockport Junior Porters WC) won by fall over Jack Hogan (G2 WC) Fall 1:13</li>\n<li>Cons. Round 4 - Cory Zator (Lemont Bears WC) won by decision over Tyler Lockhart (Sycamore WC) Dec 4-3</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Cons. Round 4 - Jaxon Jorgensen (HPL Wrestling) won by decision over Evan Matkovich (Batavia WC) Dec 4-0</li>\n<li>Cons. Round 4 - Garrett VerHeecke (Mt. Zion Kids WC) won by major decision over Daniel Blanke (Barrington Broncos WC) Maj 9-0</li>\n<li>Cons. Round 4 - Max Mularz (Frankfort Wildcats Wrestling) won by fall over Logan Tatar (St. Charles WC) Fall 4:26</li>\n<li>Cons. Round 4 - Marcus Quintana (Team 1006 Wrestling) won by decision over Jacob Alvarez (Izzy Style Wrestling) Dec 4-3</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Cons. Round 4 - Maxwell Wade (Gladiator Elite WC) won by fall over Jackson Hanselman (Southside Outlaws WC) Fall 0:29</li>\n<li>Cons. Round 4 - Aden Rangel (Storm Youth WC) won by decision over Chase Nobiling (Team Poeta) Dec 2-0</li>\n<li>Cons. Round 4 - Lincoln Hoger (Fox Valley WC) won by decision over Zev Koransky (Little Huskies WC) Dec 3-1</li>\n<li>Cons. Round 4 - Dillon Griffin (Team 1006 Wrestling) won by fall over Arrison Bauer (Stockton Renegades WC) Fall 1:18</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Cons. Round 4 - Wyatt Medlin (Super Soldiers WC) won by decision over Austin Perez (Oak Forest Warriors WC) Dec 8-4</li>\n<li>Cons. Round 4 - Jalen Byrd (Lincoln-Way WC) won by fall over Hunter Shike (Unity Youth WC) Fall 2:27</li>\n<li>Cons. Round 4 - Ashton Hobson (Batavia WC) won by decision over Isaac Mayora (Stampede WC) Dec 8-2</li>\n<li>Cons. Round 4 - Knox Verbais (Combative Sports Athletic Center) won by decision over Luke Grindstaff (Team 1006 Wrestling) Dec 6-2</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Cons. Round 4 - Brody Kelly (Fitz Wrestling Academy) won by major decision over Frankie Nitti (Izzy Style Wrestling) Maj 11-2</li>\n<li>Cons. Round 4 - Colton Zvonar (Lincoln-Way WC) won by decision over Caleb Viscogliosi (Team 1006 Wrestling) Dec 3-0</li>\n<li>Cons. Round 4 - Logan Hiller (Edwardsville WC) won by decision over Adam Jacks (Junior Pioneer WC) Dec 3-2</li>\n<li>Cons. Round 4 - Dayne Serio (Fitz Wrestling Academy) won by decision over Aric Abbott (ISI WC) Dec 6-0</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Cons. Round 4 - Leonardo Rosas (Team El1te Wrestling) won by fall over Aiden Hennings (Lincoln-Way WC) Fall 4:17</li>\n<li>Cons. Round 4 - Pierre Walton (East St. Louis WC) won by decision over Cooper Miller (Storm Youth WC) Dec 5-4</li>\n<li>Cons. Round 4 - Anthony Iaquinta (Lemont Bears WC) won by fall over Killian Rauch (Belleville Little Devils WC) Fall 3:49</li>\n<li>Cons. Round 4 - Reily Leifheit (Team 1006 Wrestling) won by decision over Oliver McPeek (Stockton Renegades WC) Dec 6-5</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Cons. Round 4 - Jamison Chambliss (Storm Youth WC) won by decision over Declan Dircks (Frankfort Wildcats Wrestling) Dec 7-5</li>\n<li>Cons. Round 4 - Vincenzo Testa (Team El1te Wrestling) won by decision over Cooper Bode (Sycamore WC) Dec 4-2</li>\n<li>Cons. Round 4 - Tristin Golden (Brawlers WC) won by fall over Jake Rhymes (Scorpion WC) Fall 2:22</li>\n<li>Cons. Round 4 - Brenden Voight (nWo WC) won by decision over James Talley Jr (Lincoln-Way WC) Dec 6-1</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Cons. Round 4 - Joshua Heath (Unity Youth WC) won by fall over Carter Hintz (Red Raiders Wrestling Team) Fall 4:04</li>\n<li>Cons. Round 4 - Matthew Plumb (SCN Youth WC) won by decision over Elijah Carter (Astro WC) Dec 8-5</li>\n<li>Cons. Round 4 - Xander Keslin (Force Elite WC) won by major decision over Trae Jackson Griffiths (Champaign WC) Maj 13-4</li>\n<li>Cons. Round 4 - Julian Flores (Mat Rat WC) won by decision over John Cloud (Edwardsville WC) Dec 7-2</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Cons. Round 4 - Duncan Nevel (The Law WC) won by fall over Foster Yarbrough (Wheaton Tigers WC) Fall 1:23</li>\n<li>Cons. Round 4 - Lonnez Smith (East St. Louis WC) won by fall over Jordan Bair (Peoria Wizards WC) Fall 3:43</li>\n<li>Cons. Round 4 - Triston Manrique (O`Fallon Little Panthers WC) won by fall over Harrison Kinney (Hononegah WC) Fall 0:46</li>\n<li>Cons. Round 4 - Austin Webb (Peoria Wizards WC) won by fall over Jack English (Murphysboro Wrestling) Fall 2:02</li>\n</ul>\n</section>",
  "Semis & 4th WB": "<section class=\"tw-list\">\n<h1>Semis &amp; 4th WB</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>Semifinal - Daniel Costello (Mustang WC) won by fall over Shane Falasca (Richmond WC) Fall 4:29</li>\n<li>Semifinal - Christopher Easley (Force Elite WC) won by decision over Amillian Beasley (Urbana Tigers WC) Dec 5-2</li>\n<li>Cons. Round 5 - Travis Ellis (Harvey Twisters) won by fall over Hayden Wheeler (Yorkville WC) Fall 4:26</li>\n<li>Cons. Round 5 - Bradyn Haynes (Pekin Boys &amp; Girls Club) won by fall over Michael Hardin (Danville Chargers WC) Fall 1:48</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Jonathon Caudle (O`Fallon Little Panthers WC) Fall 2:14</li>\n<li>Semifinal - Nolan Lopez (Toss Em Up Wrestling Academy) won by fall over Dominic Swyers (Vandalia Jr WC) Fall 2:25</li>\n<li>Cons. Round 5 - Hunter Wahtola (Beat the Streets-Chicago) won by fall over Alex Tucker (Timber Wolves WC) Fall 2:27</li>\n<li>Cons. Round 5 - Samuel Swais (Elk Grove Junior Grens WC) won by decision over Evan Flanagan (Clipper WC) Dec 3-2</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Semifinal - Grady Glowacki (Lakeland Predators WC) won by fall over Grayson Anderton (Nomad Wrestling Academy) Fall 0:59</li>\n<li>Semifinal - Kamari Tate (Englewood Live Wire WC) won by fall over Drake Reed (Storm Youth WC) Fall 4:19</li>\n<li>Cons. Round 5 - Mason Beattie (Spartan WC) won by decision over Nolan Renz (Metamora Kids WC) Dec 12-6</li>\n<li>Cons. Round 5 - Jimmy Roach (Panther WC) won by decision over Aden Spinelli (nWo WC) Dec 4-0</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Semifinal - Reese Babcock (St. Charles WC) won by decision over Treyden Diduch (Alber Athletics WC) Dec 10-3</li>\n<li>Semifinal - Carter Noonan (Bolingbrook Junior Raiders WC) won by decision over Noah Thomas (Granite City Wrestling Association) Dec 7-1</li>\n<li>Cons. Round 5 - Cale Dauber (Junior Raiders West WC) won by decision over Zachary Cooley (Granite City Wrestling Association) Dec 11-5</li>\n<li>Cons. Round 5 - Julian Medina (Bolingbrook Junior Raiders WC) won by decision over Thomas Blanke (Barrington Broncos WC) Dec 4-0</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Semifinal - Erik Klichurov (Izzy Style Wrestling) won by major decision over Colin Crouch (Triad Knights WC) Maj 10-0</li>\n<li>Semifinal - Hogan Rice (St. Charles WC) won in sudden victory - 1 over Liam Kissane (Tinley Park Bulldogs WC) SV-1 3-1</li>\n<li>Cons. Round 5 - Michael Rundell (Arlington Cardinals WC) won by fall over Weston Frazier (Storm Youth WC) Fall 0:31</li>\n<li>Cons. Round 5 - Crue Hatchell (Southside Outlaws WC) won by major decision over Landon Near (nWo WC) Maj 14-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Jaden Washington (Harvey Twisters) won by fall over Kaden Potter (St. Charles WC) Fall 3:20</li>\n<li>Semifinal - Colton Wyller (Force Elite WC) won by fall over Rhyis Polenske (Blue Line Training Academy) Fall 2:16</li>\n<li>Cons. Round 5 - Vannak Khiev (Mat Rat WC) won by fall over Adonis Washington (Harvey Twisters) Fall 0:25</li>\n<li>Cons. Round 5 - Jayce Glauser (Fox Lake WC) won by tech fall over Maddux Rabczak (Alber Athletics WC) TF 15-0</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Semifinal - Lukas Foster (Callan Wrestling Academy) won by major decision over Nick Dilallo (St. Charles WC) Maj 14-2</li>\n<li>Semifinal - Brady Glynn (Lincoln-Way WC) won by decision over Ethan Hamilton (Harvey Twisters) Dec 3-2</li>\n<li>Cons. Round 5 - Shane Stream (Lincoln-Way WC) won by major decision over Matthew Deutch (Waterloo Bulldog Wrestling) Maj 12-0</li>\n<li>Cons. Round 5 - Nikolas Duarte (Arlington Cardinals WC) won by major decision over Pedro Alberto Rangel (Storm Youth WC) Maj 8-0</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Semifinal - Colton Schultz (Callan Wrestling Academy) won by major decision over Robert Ruscitti (Arlington Cardinals WC) Maj 10-2</li>\n<li>Semifinal - Adante Washington (Harvey Twisters) won by decision over Ryan Dorn (Barrington Broncos WC) Dec 4-3</li>\n<li>Cons. Round 5 - Devin Ehler (Storm Youth WC) won by fall over Kane Dauber (Junior Raiders West WC) Fall 2:29</li>\n<li>Cons. Round 5 - Dawson Hawthorne (Granite City Wrestling Association) won by decision over Alexander Osborne (Team Poeta) Dec 7-2</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Semifinal - Aidan McClure (St. Charles WC) won by decision over Ethan Sonne (Lincoln-Way WC) Dec 3-0</li>\n<li>Semifinal - Aiden Arnett (Lincoln-Way WC) won by decision over Mason Swartz (Storm Youth WC) Dec 3-0</li>\n<li>Cons. Round 5 - Benjamin Nadig (Alber Athletics WC) won by major decision over John Hanrahan (Arlington Cardinals WC) Maj 10-2</li>\n<li>Cons. Round 5 - Avery Jaime (Bulls WC) won by decision over Caden Campo (Vittum Cats WC) Dec 4-1</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Semifinal - Dawson Mack (Bolingbrook Junior Raiders WC) won by fall over Christian Bass (Team 1006 Wrestling) Fall 0:30</li>\n<li>Semifinal - Sawyer Valdez (Sycamore WC) won by decision over Eddie Astorga (Mustang WC) Dec 8-2</li>\n<li>Cons. Round 5 - Jadon Zimmer (Lincoln-Way WC) won by fall over Landen Vincent (Junior Pioneer WC) Fall 1:55</li>\n<li>Cons. Round 5 - Beau Walker (Elmhurst Titans Wrestling Academy) won by fall over Wyatt Franckowiak (Richmond WC) Fall 0:31</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Thomas Banas (Demolition WC) won by fall over Brendan Nardin (Alber Athletics WC) Fall 1:59</li>\n<li>Semifinal - Tyler Lachenberg (Lincoln-Way WC) won by decision over Brady Ritter (Bolingbrook Junior Raiders WC) Dec 3-2</li>\n<li>Cons. Round 5 - Gavin Woodmancy (St. Charles WC) won by decision over Owen Middleton (Yorkville WC) Dec 10-3</li>\n<li>Cons. Round 5 - Aiden Quevedo (MadDog Wrestling Academy) won by decision over Antoine Shaw (Gladiator Elite WC) Dec 1-0</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Semifinal - Daniel Lynch (Tinley Park Bulldogs WC) won by decision over Malan Njumbe-Hatfield (Blackhawk WC) Dec 5-1</li>\n<li>Semifinal - Brayden McKay (Tinley Park Bulldogs WC) won by decision over Izaac Gaines (Blue Line Training Academy) Dec 6-1</li>\n<li>Cons. Round 5 - Jayden Dohogne (Sycamore WC) won by fall over Ameer Khalil (St. Charles WC) Fall 1:08</li>\n<li>Cons. Round 5 - Gavin Watson (Sparta Junior Bulldogs WC) won by fall over Brysen Manly (nWo WC) Fall 0:38</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Semifinal - John McGinnis (Oak Forest Warriors WC) won by decision over Owen Hurd (Red Raiders Wrestling Team) Dec 6-2</li>\n<li>Semifinal - Nicholas Hermsen (Toss Em Up Wrestling Academy) won by tech fall over Isiah Harris (North Boone WC) TF 19-4</li>\n<li>Cons. Round 5 - Nicholas Rociola (G2 WC) won by decision over Benjamin Mullins (Crawford County WC) Dec 8-7</li>\n<li>Cons. Round 5 - Chase Siguenza (Tribe WC) won by decision over Nathan Kozlowski (Crystal Lake Wizards WC) Dec 8-3</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Semifinal - Kevin May (Southside Outlaws WC) won by major decision over Aiden Larson (Stockton Renegades WC) Maj 13-5</li>\n<li>Semifinal - Radic Dvorak (ISI WC) won by fall over Ronin Brom (Fox Valley WC) Fall 0:49</li>\n<li>Cons. Round 5 - Sergio Baity (Urbana Tigers WC) won by fall over Anthony Senese (Vittum Cats WC) Fall 0:49</li>\n<li>Cons. Round 5 - Daniel Jackson (Waterloo Bulldog Wrestling) won by decision over Karter Pollock (Golden Eagles WC) Dec 9-7</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>Semifinal - Jaxson Mathenia (Waterloo Bulldog Wrestling) won by decision over Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) Dec 4-2</li>\n<li>Semifinal - Isaac Barrientos (Fitz Wrestling Academy) won by tech fall over Julian Moon (Effingham Youth WC) TF 17-0</li>\n<li>Cons. Round 5 - Michael Kimbrough (Limestone Blue Crew WC) won by decision over Eli Miller (Granite City Wrestling Association) Dec 7-4</li>\n<li>Cons. Round 5 - Knox Homola (Whips WC) won by fall over Jacob Crawford (Mustang WC) Fall 1:56</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Semifinal - Foley Calcagno (Southside Outlaws WC) won by fall over Johnny Strauss (Golden Eagles WC) Fall 0:51</li>\n<li>Semifinal - Maximus Vela (Callan Wrestling Academy) won by tech fall over Landynn Balla (Storm Youth WC) TF 20-4</li>\n<li>Cons. Round 5 - Khaden Hallowell (SJO Youth WC) won by fall over Caden Schladt (Crystal Lake Wizards WC) Fall 1:10</li>\n<li>Cons. Round 5 - Jeremiah Watters (Edwardsville WC) won by fall over Erick Esquivel (Mat Rat WC) Fall 2:31</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Semifinal - Roman Janek (Lion`s Den Wrestling Academy) won by decision over Tommy O`Brien (Panther WC) Dec 7-2</li>\n<li>Semifinal - Joseph Favia (Fitz Wrestling Academy) won by major decision over Logan Abrams (Crystal Lake Wizards WC) Maj 14-3</li>\n<li>Cons. Round 5 - Simon Schulte (Edwardsville WC) won by fall over King Liggins (Harvey Twisters) Fall 3:30</li>\n<li>Cons. Round 5 - Gage LaDere (Lincoln-Way WC) won by decision over Gannon Dunker (The Law WC) Dec 4-2</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Teigen Moreno (Dundee Highlanders WC) won by fall over Xavier Bitner (Panther WC) Fall 2:13</li>\n<li>Semifinal - Jaxon Penovich (Arlington Cardinals WC) won by fall over Jack Miller (St. Charles WC) Fall 0:39</li>\n<li>Cons. Round 5 - Wyatt Hochgraber (Panther WC) won by decision over Connor Uhler (Dundee Highlanders WC) Dec 1-0</li>\n<li>Cons. Round 5 - Zander Schrader (Olney Cubs WC) won by fall over Emmett Easton (Lil` Coalers WC) Fall 2:35</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Kai Calcutt (Toss Em Up Wrestling Academy) won by fall over Zion Carter (Astro WC) Fall 1:04</li>\n<li>Semifinal - Ryan Stingliy (Frankfort Wildcats Wrestling) won by fall over Matthew Medina (St. Charles WC) Fall 4:04</li>\n<li>Cons. Round 5 - Dakari Hawthorne (Urbana Tigers WC) won by fall over Jeremy Marshall (Evanston School of Wrestling) Fall 3:32</li>\n<li>Cons. Round 5 - Jaylen Torres (Tribe WC) won by fall over Austin Kunz (Edwardsville WC) Fall 2:46</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Semifinal - Ramsey Barton (Yorkville WC) won by major decision over Benjamin Jurkovic (Tinley Park Bulldogs WC) Maj 11-1</li>\n<li>Semifinal - Christian Corcoran (Lincoln-Way WC) won by decision over Carson West (St. Charles WC) Dec 8-2</li>\n<li>Cons. Round 5 - Pippino Campo (Williamsville WC) won by fall over Davin Torza (Team 1006 Wrestling) Fall 0:09</li>\n<li>Cons. Round 5 - Hudson Anderton (Nomad Wrestling Academy) won by fall over Taryn Heather (Polo WC) Fall 2:44</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Logan Conover (Batavia WC) won by fall over Elio Gil (Tinley Park Bulldogs WC) Fall 3:00</li>\n<li>Semifinal - Tanner Stone (Bolingbrook Junior Raiders WC) won by fall over Matteo Vitro (Lemont Bears WC) Fall 3:39</li>\n<li>Cons. Round 5 - Kaleb Fuchs (Limestone Blue Crew WC) won by decision over Benjamin Wells (Champaign WC) Dec 7-1</li>\n<li>Cons. Round 5 - Chace Matheny (Edwardsville WC) won by fall over Diego Martinez (Belvidere Bandits WC) Fall 3:00</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Declan Sons (St. Charles WC) won in sudden victory - 1 over Max Munn (Lincoln-Way WC) SV-1 5-3</li>\n<li>Semifinal - Morgan Turner (Harvey Twisters) won by major decision over Daniel Myint (Arlington Cardinals WC) Maj 14-0</li>\n<li>Cons. Round 5 - Zayden Mansfield (Unity Youth WC) won by decision over Landon Cornwell (Crawford County WC) Dec 10-3</li>\n<li>Cons. Round 5 - Elijah Sawyers (Harvey Twisters) won by decision over Roberto Rangel (Oak Forest Warriors WC) Dec 12-8</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Nadeem Haleem (Lincoln-Way WC) won in sudden victory - 1 over Max Philpot (Vandalia Jr WC) SV-1 10-8</li>\n<li>Semifinal - Allen Woo (Izzy Style Wrestling) won in sudden victory - 1 over Jamiel Castleberry (Proviso Township Gladiators WC) SV-1 2-1</li>\n<li>Cons. Round 5 - Dylan Weber (Elevate Wrestling Academy) won by major decision over Brandon Carbone (Crystal Lake Wizards WC) Maj 12-1</li>\n<li>Cons. Round 5 - Kaleb Pratt (Arlington Cardinals WC) won by fall over Trentin Odachowski (Elk Grove Junior Grens WC) Fall 2:47</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Semifinal - Nicholas Garcia (Fitz Wrestling Academy) won by major decision over Vince Jasinski (Fox Lake WC) Maj 8-0</li>\n<li>Semifinal - Chazz Robinson (Harvey Twisters) won in tie breaker - 1 over Maxwell Cumbee (Izzy Style Wrestling) TB-1 6-5</li>\n<li>Cons. Round 5 - Austin Hagevold (ISI WC) won by fall over Elijah Mabry (Vandalia Jr WC) Fall 4:02</li>\n<li>Cons. Round 5 - Michael Miranda (Team 312 WC) won by injury default over Nicholas Marchese (Crystal Lake Wizards WC) Inj. 0:36</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Semifinal - Demetrios Carrera (Yorkville WC) won by decision over Michael Malizzio (Team El1te Wrestling) Dec 4-0</li>\n<li>Semifinal - Domenic Munaretto (Toss Em Up Wrestling Academy) won by fall over Preston Waughtel (Bulls WC) Fall 2:16</li>\n<li>Cons. Round 5 - Clinton VerHeecke (Mt. Zion Kids WC) won by decision over Harrison Dea (TJ Trained Wrestling) Dec 5-2</li>\n<li>Cons. Round 5 - Isaac Zimmerman (Lockport Junior Porters WC) won by major decision over Cory Zator (Lemont Bears WC) Maj 10-2</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Semifinal - Ryan Richie (Edwardsville WC) won by decision over George Hollendoner (Tinley Park Bulldogs WC) Dec 7-0</li>\n<li>Semifinal - Rocco Cassioppi (Hononegah WC) won by major decision over Jason Hampton (Harvey Twisters) Maj 12-0</li>\n<li>Cons. Round 5 - Garrett VerHeecke (Mt. Zion Kids WC) won by decision over Jaxon Jorgensen (HPL Wrestling) Dec 4-0</li>\n<li>Cons. Round 5 - Marcus Quintana (Team 1006 Wrestling) won by fall over Max Mularz (Frankfort Wildcats Wrestling) Fall 2:36</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Semifinal - Kameron Luif (Team El1te Wrestling) won by decision over Nolan Vogel (Callan Wrestling Academy) Dec 4-2</li>\n<li>Semifinal - Justin Wardlow (Harvey Twisters) won by decision over Kaidreaus Richardson (Lincoln-Way WC) Dec 5-2</li>\n<li>Cons. Round 5 - Maxwell Wade (Gladiator Elite WC) won by fall over Aden Rangel (Storm Youth WC) Fall 3:43</li>\n<li>Cons. Round 5 - Lincoln Hoger (Fox Valley WC) won by decision over Dillon Griffin (Team 1006 Wrestling) Dec 6-2</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Semifinal - Aaron Camacho (Bolingbrook Junior Raiders WC) won by decision over Jeremy Huf (Arlington Cardinals WC) Dec 4-0</li>\n<li>Semifinal - Zachary Stewart (Fitz Wrestling Academy) won by major decision over David Ogunsanya (Harvey Twisters) Maj 13-2</li>\n<li>Cons. Round 5 - Wyatt Medlin (Super Soldiers WC) won by decision over Jalen Byrd (Lincoln-Way WC) Dec 9-5</li>\n<li>Cons. Round 5 - Ashton Hobson (Batavia WC) won by fall over Knox Verbais (Combative Sports Athletic Center) Fall 2:52</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Semifinal - Dillon Hinton (Vandalia Jr WC) won in sudden victory - 1 over Thomas Mcdermott (Force Elite WC) SV-1 2-0</li>\n<li>Semifinal - Jimmy Mastny (Alber Athletics WC) won by decision over Liam Kelly (Tinley Park Bulldogs WC) Dec 3-1</li>\n<li>Cons. Round 5 - Brody Kelly (Fitz Wrestling Academy) won by decision over Colton Zvonar (Lincoln-Way WC) Dec 3-2</li>\n<li>Cons. Round 5 - Dayne Serio (Fitz Wrestling Academy) won by decision over Logan Hiller (Edwardsville WC) Dec 9-7</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Semifinal - Aaron Stewart (Toss Em Up Wrestling Academy) won by major decision over Ian Hawkins (Junior Bronco WC) Maj 10-1</li>\n<li>Semifinal - Brody Sendele (Hononegah WC) won by major decision over Kye Weinzierl (Blue Line Training Academy) Maj 12-3</li>\n<li>Cons. Round 5 - Leonardo Rosas (Team El1te Wrestling) won by decision over Pierre Walton (East St. Louis WC) Dec 7-0</li>\n<li>Cons. Round 5 - Anthony Iaquinta (Lemont Bears WC) won by decision over Reily Leifheit (Team 1006 Wrestling) Dec 7-3</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Semifinal - Eli Larson (Stockton Renegades WC) won by decision over Kenyonte Louis (Englewood Live Wire WC) Dec 7-0</li>\n<li>Semifinal - Royce Lopez (Toss Em Up Wrestling Academy) won by major decision over Trevon Williams (Springs Elite WC) Maj 13-2</li>\n<li>Cons. Round 5 - Vincenzo Testa (Team El1te Wrestling) won by fall over Jamison Chambliss (Storm Youth WC) Fall 3:34</li>\n<li>Cons. Round 5 - Brenden Voight (nWo WC) won by decision over Tristin Golden (Brawlers WC) Dec 5-4</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Semifinal - Michael Brannigan (Red Raiders Wrestling Team) won by fall over Jeremiah Luke (Stockton Renegades WC) Fall 2:52</li>\n<li>Semifinal - Santino Tenuta (Team El1te Wrestling) won by fall over Owen McGinnis (Cumberland Youth WC) Fall 4:15</li>\n<li>Cons. Round 5 - Matthew Plumb (SCN Youth WC) won by fall over Joshua Heath (Unity Youth WC) Fall 1:16</li>\n<li>Cons. Round 5 - Julian Flores (Mat Rat WC) won by fall over Xander Keslin (Force Elite WC) Fall 3:15</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Semifinal - Connor Sacco (Marengo Youth WC) won by decision over Roman Villalobos (nWo WC) Dec 9-2</li>\n<li>Semifinal - Malik Warren (Harvey Twisters) won by fall over Adam Carrick (Sycamore WC) Fall 3:38</li>\n<li>Cons. Round 5 - Duncan Nevel (The Law WC) won by major decision over Lonnez Smith (East St. Louis WC) Maj 10-2</li>\n<li>Cons. Round 5 - Triston Manrique (O`Fallon Little Panthers WC) won by major decision over Austin Webb (Peoria Wizards WC) Maj 11-2</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>Cons. Semi - Shane Falasca (Richmond WC) won by fall over Travis Ellis (Harvey Twisters) Fall 0:38</li>\n<li>Cons. Semi - Amillian Beasley (Urbana Tigers WC) won by fall over Bradyn Haynes (Pekin Boys &amp; Girls Club) Fall 0:43</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Jonathon Caudle (O`Fallon Little Panthers WC) won by fall over Hunter Wahtola (Beat the Streets-Chicago) Fall 1:16</li>\n<li>Cons. Semi - Dominic Swyers (Vandalia Jr WC) won by fall over Samuel Swais (Elk Grove Junior Grens WC) Fall 0:24</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>Cons. Semi - Grayson Anderton (Nomad Wrestling Academy) won by fall over Mason Beattie (Spartan WC) Fall 4:25</li>\n<li>Cons. Semi - Jimmy Roach (Panther WC) won by decision over Drake Reed (Storm Youth WC) Dec 7-1</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>Cons. Semi - Treyden Diduch (Alber Athletics WC) won by decision over Cale Dauber (Junior Raiders West WC) Dec 10-5</li>\n<li>Cons. Semi - Noah Thomas (Granite City Wrestling Association) won by decision over Julian Medina (Bolingbrook Junior Raiders WC) Dec 3-2</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>Cons. Semi - Michael Rundell (Arlington Cardinals WC) won by tech fall over Colin Crouch (Triad Knights WC) TF 16-0</li>\n<li>Cons. Semi - Crue Hatchell (Southside Outlaws WC) won by decision over Liam Kissane (Tinley Park Bulldogs WC) Dec 3-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Kaden Potter (St. Charles WC) won by decision over Vannak Khiev (Mat Rat WC) Dec 1-0</li>\n<li>Cons. Semi - Jayce Glauser (Fox Lake WC) won by tech fall over Rhyis Polenske (Blue Line Training Academy) TF 16-1</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>Cons. Semi - Nick Dilallo (St. Charles WC) won by decision over Shane Stream (Lincoln-Way WC) Dec 9-3</li>\n<li>Cons. Semi - Nikolas Duarte (Arlington Cardinals WC) won by decision over Ethan Hamilton (Harvey Twisters) Dec 8-2</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>Cons. Semi - Devin Ehler (Storm Youth WC) won by decision over Robert Ruscitti (Arlington Cardinals WC) Dec 5-2</li>\n<li>Cons. Semi - Dawson Hawthorne (Granite City Wrestling Association) won by decision over Ryan Dorn (Barrington Broncos WC) Dec 6-1</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>Cons. Semi - Ethan Sonne (Lincoln-Way WC) won by decision over Benjamin Nadig (Alber Athletics WC) Dec 5-4</li>\n<li>Cons. Semi - Mason Swartz (Storm Youth WC) won by decision over Avery Jaime (Bulls WC) Dec 6-2</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>Cons. Semi - Jadon Zimmer (Lincoln-Way WC) won by decision over Christian Bass (Team 1006 Wrestling) Dec 2-0</li>\n<li>Cons. Semi - Eddie Astorga (Mustang WC) won by fall over Beau Walker (Elmhurst Titans Wrestling Academy) Fall 2:31</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Brendan Nardin (Alber Athletics WC) won by decision over Gavin Woodmancy (St. Charles WC) Dec 4-0</li>\n<li>Cons. Semi - Brady Ritter (Bolingbrook Junior Raiders WC) won by decision over Aiden Quevedo (MadDog Wrestling Academy) Dec 6-2</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>Cons. Semi - Malan Njumbe-Hatfield (Blackhawk WC) won by decision over Jayden Dohogne (Sycamore WC) Dec 3-2</li>\n<li>Cons. Semi - Gavin Watson (Sparta Junior Bulldogs WC) won by decision over Izaac Gaines (Blue Line Training Academy) Dec 5-2</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>Cons. Semi - Nicholas Rociola (G2 WC) won by fall over Owen Hurd (Red Raiders Wrestling Team) Fall 0:23</li>\n<li>Cons. Semi - Isiah Harris (North Boone WC) won by major decision over Chase Siguenza (Tribe WC) Maj 9-0</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>Cons. Semi - Sergio Baity (Urbana Tigers WC) won by fall over Aiden Larson (Stockton Renegades WC) Fall 2:06</li>\n<li>Cons. Semi - Ronin Brom (Fox Valley WC) won by decision over Daniel Jackson (Waterloo Bulldog Wrestling) Dec 6-3</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>Cons. Semi - Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) won by decision over Michael Kimbrough (Limestone Blue Crew WC) Dec 6-1</li>\n<li>Cons. Semi - Julian Moon (Effingham Youth WC) won by fall over Knox Homola (Whips WC) Fall 0:59</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>Cons. Semi - Khaden Hallowell (SJO Youth WC) won by fall over Johnny Strauss (Golden Eagles WC) Fall 0:58</li>\n<li>Cons. Semi - Landynn Balla (Storm Youth WC) won by fall over Jeremiah Watters (Edwardsville WC) Fall 2:52</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>Cons. Semi - Tommy O`Brien (Panther WC) won by fall over Simon Schulte (Edwardsville WC) Fall 2:46</li>\n<li>Cons. Semi - Logan Abrams (Crystal Lake Wizards WC) won by decision over Gage LaDere (Lincoln-Way WC) Dec 1-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Xavier Bitner (Panther WC) won by fall over Wyatt Hochgraber (Panther WC) Fall 2:07</li>\n<li>Cons. Semi - Jack Miller (St. Charles WC) won by fall over Zander Schrader (Olney Cubs WC) Fall 2:10</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Dakari Hawthorne (Urbana Tigers WC) won in tie breaker - 1 over Zion Carter (Astro WC) TB-1 2-1</li>\n<li>Cons. Semi - Jaylen Torres (Tribe WC) won by fall over Matthew Medina (St. Charles WC) Fall 3:29</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>Cons. Semi - Pippino Campo (Williamsville WC) won by fall over Benjamin Jurkovic (Tinley Park Bulldogs WC) Fall 0:00</li>\n<li>Cons. Semi - Carson West (St. Charles WC) won by major decision over Hudson Anderton (Nomad Wrestling Academy) Maj 10-1</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Elio Gil (Tinley Park Bulldogs WC) won by fall over Kaleb Fuchs (Limestone Blue Crew WC) Fall 2:18</li>\n<li>Cons. Semi - Chace Matheny (Edwardsville WC) won by decision over Matteo Vitro (Lemont Bears WC) Dec 3-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Max Munn (Lincoln-Way WC) won by fall over Zayden Mansfield (Unity Youth WC) Fall 1:09</li>\n<li>Cons. Semi - Daniel Myint (Arlington Cardinals WC) won by tech fall over Elijah Sawyers (Harvey Twisters) TF 20-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Dylan Weber (Elevate Wrestling Academy) won by decision over Max Philpot (Vandalia Jr WC) Dec 3-2</li>\n<li>Cons. Semi - Jamiel Castleberry (Proviso Township Gladiators WC) won by fall over Kaleb Pratt (Arlington Cardinals WC) Fall 2:02</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>Cons. Semi - Vince Jasinski (Fox Lake WC) won by fall over Austin Hagevold (ISI WC) Fall 0:40</li>\n<li>Cons. Semi - Maxwell Cumbee (Izzy Style Wrestling) won by major decision over Michael Miranda (Team 312 WC) Maj 10-2</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>Cons. Semi - Clinton VerHeecke (Mt. Zion Kids WC) won by major decision over Michael Malizzio (Team El1te Wrestling) Maj 10-0</li>\n<li>Cons. Semi - Preston Waughtel (Bulls WC) won by major decision over Isaac Zimmerman (Lockport Junior Porters WC) Maj 9-0</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>Cons. Semi - Garrett VerHeecke (Mt. Zion Kids WC) won by decision over George Hollendoner (Tinley Park Bulldogs WC) Dec 4-2</li>\n<li>Cons. Semi - Jason Hampton (Harvey Twisters) won by fall over Marcus Quintana (Team 1006 Wrestling) Fall 1:05</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>Cons. Semi - Nolan Vogel (Callan Wrestling Academy) won by decision over Maxwell Wade (Gladiator Elite WC) Dec 10-6</li>\n<li>Cons. Semi - Kaidreaus Richardson (Lincoln-Way WC) won by decision over Lincoln Hoger (Fox Valley WC) Dec 5-3</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>Cons. Semi - Wyatt Medlin (Super Soldiers WC) won by decision over Jeremy Huf (Arlington Cardinals WC) Dec 6-4</li>\n<li>Cons. Semi - Ashton Hobson (Batavia WC) won by decision over David Ogunsanya (Harvey Twisters) Dec 5-0</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>Cons. Semi - Brody Kelly (Fitz Wrestling Academy) won by decision over Thomas Mcdermott (Force Elite WC) Dec 6-4</li>\n<li>Cons. Semi - Liam Kelly (Tinley Park Bulldogs WC) won by fall over Dayne Serio (Fitz Wrestling Academy) Fall 2:29</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>Cons. Semi - Ian Hawkins (Junior Bronco WC) won by decision over Leonardo Rosas (Team El1te Wrestling) Dec 3-2</li>\n<li>Cons. Semi - Kye Weinzierl (Blue Line Training Academy) won by fall over Anthony Iaquinta (Lemont Bears WC) Fall 2:45</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>Cons. Semi - Vincenzo Testa (Team El1te Wrestling) won by decision over Kenyonte Louis (Englewood Live Wire WC) Dec 3-2</li>\n<li>Cons. Semi - Trevon Williams (Springs Elite WC) won by fall over Brenden Voight (nWo WC) Fall 3:24</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>Cons. Semi - Matthew Plumb (SCN Youth WC) won by decision over Jeremiah Luke (Stockton Renegades WC) Dec 11-5</li>\n<li>Cons. Semi - Julian Flores (Mat Rat WC) won by decision over Owen McGinnis (Cumberland Youth WC) Dec 2-1</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>Cons. Semi - Roman Villalobos (nWo WC) won by fall over Duncan Nevel (The Law WC) Fall 0:53</li>\n<li>Cons. Semi - Triston Manrique (O`Fallon Little Panthers WC) won by fall over Adam Carrick (Sycamore WC) Fall 0:34</li>\n</ul>\n</section>",
  "3rd, 5th, & 7th": "<section class=\"tw-list\">\n<h1>3rd, 5th, &amp; 7th</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>3rd Place Match - Amillian Beasley (Urbana Tigers WC) won by fall over Shane Falasca (Richmond WC) Fall 2:02</li>\n<li>5th Place Match - Travis Ellis (Harvey Twisters) won by fall over Bradyn Haynes (Pekin Boys &amp; Girls Club) Fall 2:24</li>\n<li>7th Place Match - Hayden Wheeler (Yorkville WC) won by decision over Michael Hardin (Danville Chargers WC) Dec 8-4</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Dominic Swyers (Vandalia Jr WC) won by fall over Jonathon Caudle (O`Fallon Little Panthers WC) Fall 2:05</li>\n<li>5th Place Match - Hunter Wahtola (Beat the Streets-Chicago) won by fall over Samuel Swais (Elk Grove Junior Grens WC) Fall 1:53</li>\n<li>7th Place Match - Evan Flanagan (Clipper WC) won by decision over Alex Tucker (Timber Wolves WC) Dec 5-0</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>3rd Place Match - Grayson Anderton (Nomad Wrestling Academy) won by decision over Jimmy Roach (Panther WC) Dec 3-2</li>\n<li>5th Place Match - Drake Reed (Storm Youth WC) won by major decision over Mason Beattie (Spartan WC) Maj 11-3</li>\n<li>7th Place Match - Aden Spinelli (nWo WC) won by fall over Nolan Renz (Metamora Kids WC) Fall 1:08</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>3rd Place Match - Treyden Diduch (Alber Athletics WC) won in sudden victory - 1 over Noah Thomas (Granite City Wrestling Association) SV-1 4-2</li>\n<li>5th Place Match - Julian Medina (Bolingbrook Junior Raiders WC) won by decision over Cale Dauber (Junior Raiders West WC) Dec 6-2</li>\n<li>7th Place Match - Thomas Blanke (Barrington Broncos WC) won by decision over Zachary Cooley (Granite City Wrestling Association) Dec 7-5</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>3rd Place Match - Michael Rundell (Arlington Cardinals WC) won by fall over Crue Hatchell (Southside Outlaws WC) Fall 1:14</li>\n<li>5th Place Match - Colin Crouch (Triad Knights WC) won by fall over Liam Kissane (Tinley Park Bulldogs WC) Fall 2:05</li>\n<li>7th Place Match - Weston Frazier (Storm Youth WC) won by decision over Landon Near (nWo WC) Dec 3-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Kaden Potter (St. Charles WC) won by decision over Jayce Glauser (Fox Lake WC) Dec 7-4</li>\n<li>5th Place Match - Rhyis Polenske (Blue Line Training Academy) won by fall over Vannak Khiev (Mat Rat WC) Fall 4:27</li>\n<li>7th Place Match - Adonis Washington (Harvey Twisters) won by decision over Maddux Rabczak (Alber Athletics WC) Dec 8-1</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>3rd Place Match - Nikolas Duarte (Arlington Cardinals WC) won by decision over Nick Dilallo (St. Charles WC) Dec 6-0</li>\n<li>5th Place Match - Shane Stream (Lincoln-Way WC) won in tie breaker - 1 over Ethan Hamilton (Harvey Twisters) TB-1 3-2</li>\n<li>7th Place Match - Pedro Alberto Rangel (Storm Youth WC) won by major decision over Matthew Deutch (Waterloo Bulldog Wrestling) Maj 10-2</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>3rd Place Match - Dawson Hawthorne (Granite City Wrestling Association) won by fall over Devin Ehler (Storm Youth WC) Fall 4:17</li>\n<li>5th Place Match - Robert Ruscitti (Arlington Cardinals WC) won by decision over Ryan Dorn (Barrington Broncos WC) Dec 6-4</li>\n<li>7th Place Match - Kane Dauber (Junior Raiders West WC) won by decision over Alexander Osborne (Team Poeta) Dec 14-10</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>3rd Place Match - Mason Swartz (Storm Youth WC) won by decision over Ethan Sonne (Lincoln-Way WC) Dec 3-1</li>\n<li>5th Place Match - Benjamin Nadig (Alber Athletics WC) won by decision over Avery Jaime (Bulls WC) Dec 7-2</li>\n<li>7th Place Match - Caden Campo (Vittum Cats WC) won by fall over John Hanrahan (Arlington Cardinals WC) Fall 0:51</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>3rd Place Match - Jadon Zimmer (Lincoln-Way WC) won by decision over Eddie Astorga (Mustang WC) Dec 5-0</li>\n<li>5th Place Match - Christian Bass (Team 1006 Wrestling) won by major decision over Beau Walker (Elmhurst Titans Wrestling Academy) Maj 16-5</li>\n<li>7th Place Match - Landen Vincent (Junior Pioneer WC) won by major decision over Wyatt Franckowiak (Richmond WC) Maj 8-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Brendan Nardin (Alber Athletics WC) won by major decision over Brady Ritter (Bolingbrook Junior Raiders WC) Maj 9-0</li>\n<li>5th Place Match - Gavin Woodmancy (St. Charles WC) won by major decision over Aiden Quevedo (MadDog Wrestling Academy) Maj 9-0</li>\n<li>7th Place Match - Antoine Shaw (Gladiator Elite WC) won by fall over Owen Middleton (Yorkville WC) Fall 0:26</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>3rd Place Match - Gavin Watson (Sparta Junior Bulldogs WC) won by decision over Malan Njumbe-Hatfield (Blackhawk WC) Dec 5-1</li>\n<li>5th Place Match - Izaac Gaines (Blue Line Training Academy) won by major decision over Jayden Dohogne (Sycamore WC) Maj 11-0</li>\n<li>7th Place Match - Ameer Khalil (St. Charles WC) won by fall over Brysen Manly (nWo WC) Fall 3:00</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>3rd Place Match - Isiah Harris (North Boone WC) won by major decision over Nicholas Rociola (G2 WC) Maj 12-2</li>\n<li>5th Place Match - Owen Hurd (Red Raiders Wrestling Team) won by fall over Chase Siguenza (Tribe WC) Fall 0:38</li>\n<li>7th Place Match - Benjamin Mullins (Crawford County WC) won by tech fall over Nathan Kozlowski (Crystal Lake Wizards WC) TF 15-0</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>3rd Place Match - Ronin Brom (Fox Valley WC) won by decision over Sergio Baity (Urbana Tigers WC) Dec 8-4</li>\n<li>5th Place Match - Daniel Jackson (Waterloo Bulldog Wrestling) won by decision over Aiden Larson (Stockton Renegades WC) Dec 5-3</li>\n<li>7th Place Match - Karter Pollock (Golden Eagles WC) won by fall over Anthony Senese (Vittum Cats WC) Fall 4:02</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>3rd Place Match - Julian Moon (Effingham Youth WC) won by fall over Landyn McEmery (LaSalle Peru Crunching Cavs Youth WC) Fall 0:42</li>\n<li>5th Place Match - Michael Kimbrough (Limestone Blue Crew WC) won by decision over Knox Homola (Whips WC) Dec 5-1</li>\n<li>7th Place Match - Eli Miller (Granite City Wrestling Association) won by fall over Jacob Crawford (Mustang WC) Fall 0:52</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>3rd Place Match - Khaden Hallowell (SJO Youth WC) won by fall over Landynn Balla (Storm Youth WC) Fall 1:01</li>\n<li>5th Place Match - Johnny Strauss (Golden Eagles WC) won by decision over Jeremiah Watters (Edwardsville WC) Dec 9-5</li>\n<li>7th Place Match - Erick Esquivel (Mat Rat WC) won by decision over Caden Schladt (Crystal Lake Wizards WC) Dec 7-3</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>3rd Place Match - Tommy O`Brien (Panther WC) won in sudden victory - 1 over Logan Abrams (Crystal Lake Wizards WC) SV-1 4-2</li>\n<li>5th Place Match - Simon Schulte (Edwardsville WC) won by fall over Gage LaDere (Lincoln-Way WC) Fall 1:49</li>\n<li>7th Place Match - Gannon Dunker (The Law WC) won by decision over King Liggins (Harvey Twisters) Dec 3-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Xavier Bitner (Panther WC) won by fall over Jack Miller (St. Charles WC) Fall 2:34</li>\n<li>5th Place Match - Wyatt Hochgraber (Panther WC) won by fall over Zander Schrader (Olney Cubs WC) Fall 0:40</li>\n<li>7th Place Match - Connor Uhler (Dundee Highlanders WC) won by fall over Emmett Easton (Lil` Coalers WC) Fall 1:46</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Jaylen Torres (Tribe WC) won by decision over Dakari Hawthorne (Urbana Tigers WC) Dec 8-1</li>\n<li>5th Place Match - Zion Carter (Astro WC) won by decision over Matthew Medina (St. Charles WC) Dec 4-1</li>\n<li>7th Place Match - Jeremy Marshall (Evanston School of Wrestling) won by decision over Austin Kunz (Edwardsville WC) Dec 3-0</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>3rd Place Match - Carson West (St. Charles WC) won by tech fall over Pippino Campo (Williamsville WC) TF 16-0</li>\n<li>5th Place Match - Hudson Anderton (Nomad Wrestling Academy) won by decision over Benjamin Jurkovic (Tinley Park Bulldogs WC) Dec 9-6</li>\n<li>7th Place Match - Davin Torza (Team 1006 Wrestling) won by fall over Taryn Heather (Polo WC) Fall 2:38</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Elio Gil (Tinley Park Bulldogs WC) won by fall over Chace Matheny (Edwardsville WC) Fall 2:50</li>\n<li>5th Place Match - Kaleb Fuchs (Limestone Blue Crew WC) won in tie breaker - 1 over Matteo Vitro (Lemont Bears WC) TB-1 4-3</li>\n<li>7th Place Match - Benjamin Wells (Champaign WC) won by major decision over Diego Martinez (Belvidere Bandits WC) Maj 13-3</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Max Munn (Lincoln-Way WC) won by decision over Daniel Myint (Arlington Cardinals WC) Dec 6-3</li>\n<li>5th Place Match - Zayden Mansfield (Unity Youth WC) won by major decision over Elijah Sawyers (Harvey Twisters) Maj 12-0</li>\n<li>7th Place Match - Roberto Rangel (Oak Forest Warriors WC) won by fall over Landon Cornwell (Crawford County WC) Fall 1:08</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Jamiel Castleberry (Proviso Township Gladiators WC) won by major decision over Dylan Weber (Elevate Wrestling Academy) Maj 12-4</li>\n<li>5th Place Match - Max Philpot (Vandalia Jr WC) won by fall over Kaleb Pratt (Arlington Cardinals WC) Fall 2:12</li>\n<li>7th Place Match - Brandon Carbone (Crystal Lake Wizards WC) won by decision over Trentin Odachowski (Elk Grove Junior Grens WC) Dec 8-7</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>3rd Place Match - Maxwell Cumbee (Izzy Style Wrestling) won by decision over Vince Jasinski (Fox Lake WC) Dec 8-1</li>\n<li>5th Place Match - Austin Hagevold (ISI WC) won by major decision over Michael Miranda (Team 312 WC) Maj 13-3</li>\n<li>7th Place Match - Elijah Mabry (Vandalia Jr WC) won by injury default over Nicholas Marchese (Crystal Lake Wizards WC) Inj. 0:00</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>3rd Place Match - Preston Waughtel (Bulls WC) won by major decision over Clinton VerHeecke (Mt. Zion Kids WC) Maj 10-2</li>\n<li>5th Place Match - Isaac Zimmerman (Lockport Junior Porters WC) won by decision over Michael Malizzio (Team El1te Wrestling) Dec 6-2</li>\n<li>7th Place Match - Harrison Dea (TJ Trained Wrestling) won in tie breaker - 1 over Cory Zator (Lemont Bears WC) TB-1 3-2</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>3rd Place Match - Jason Hampton (Harvey Twisters) won by decision over Garrett VerHeecke (Mt. Zion Kids WC) Dec 6-5</li>\n<li>5th Place Match - George Hollendoner (Tinley Park Bulldogs WC) won by decision over Marcus Quintana (Team 1006 Wrestling) Dec 5-2</li>\n<li>7th Place Match - Jaxon Jorgensen (HPL Wrestling) won by decision over Max Mularz (Frankfort Wildcats Wrestling) Dec 2-1</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>3rd Place Match - Kaidreaus Richardson (Lincoln-Way WC) won by decision over Nolan Vogel (Callan Wrestling Academy) Dec 7-3</li>\n<li>5th Place Match - Lincoln Hoger (Fox Valley WC) won by fall over Maxwell Wade (Gladiator Elite WC) Fall 3:38</li>\n<li>7th Place Match - Aden Rangel (Storm Youth WC) won by decision over Dillon Griffin (Team 1006 Wrestling) Dec 11-5</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>3rd Place Match - Wyatt Medlin (Super Soldiers WC) won by decision over Ashton Hobson (Batavia WC) Dec 4-3</li>\n<li>5th Place Match - David Ogunsanya (Harvey Twisters) won by decision over Jeremy Huf (Arlington Cardinals WC) Dec 4-3</li>\n<li>7th Place Match - Jalen Byrd (Lincoln-Way WC) won by decision over Knox Verbais (Combative Sports Athletic Center) Dec 9-2</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>3rd Place Match - Liam Kelly (Tinley Park Bulldogs WC) won by decision over Brody Kelly (Fitz Wrestling Academy) Dec 5-0</li>\n<li>5th Place Match - Thomas Mcdermott (Force Elite WC) won by decision over Dayne Serio (Fitz Wrestling Academy) Dec 9-4</li>\n<li>7th Place Match - Colton Zvonar (Lincoln-Way WC) won in sudden victory - 1 over Logan Hiller (Edwardsville WC) SV-1 6-4</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>3rd Place Match - Ian Hawkins (Junior Bronco WC) won by decision over Kye Weinzierl (Blue Line Training Academy) Dec 7-4</li>\n<li>5th Place Match - Leonardo Rosas (Team El1te Wrestling) won by decision over Anthony Iaquinta (Lemont Bears WC) Dec 2-0</li>\n<li>7th Place Match - Reily Leifheit (Team 1006 Wrestling) won by major decision over Pierre Walton (East St. Louis WC) Maj 13-3</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>3rd Place Match - Vincenzo Testa (Team El1te Wrestling) won by decision over Trevon Williams (Springs Elite WC) Dec 6-0</li>\n<li>5th Place Match - Kenyonte Louis (Englewood Live Wire WC) won in sudden victory - 1 over Brenden Voight (nWo WC) SV-1 9-5</li>\n<li>7th Place Match - Jamison Chambliss (Storm Youth WC) won by fall over Tristin Golden (Brawlers WC) Fall 0:32</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>3rd Place Match - Matthew Plumb (SCN Youth WC) won in tie breaker - 1 over Julian Flores (Mat Rat WC) TB-1 2-0</li>\n<li>5th Place Match - Jeremiah Luke (Stockton Renegades WC) won in tie breaker - 1 over Owen McGinnis (Cumberland Youth WC) TB-1 2-1</li>\n<li>7th Place Match - Xander Keslin (Force Elite WC) won by fall over Joshua Heath (Unity Youth WC) Fall 2:24</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>3rd Place Match - Roman Villalobos (nWo WC) won by fall over Triston Manrique (O`Fallon Little Panthers WC) Fall 2:12</li>\n<li>5th Place Match - Duncan Nevel (The Law WC) won by decision over Adam Carrick (Sycamore WC) Dec 8-4</li>\n<li>7th Place Match - Austin Webb (Peoria Wizards WC) won by decision over Lonnez Smith (East St. Louis WC) Dec 6-4</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 178</h2>\n<ul>\n<li>1st Place Match - Daniel Costello (Mustang WC) won by fall over Christopher Easley (Force Elite WC) Fall 1:26</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Luke Boersma (Tinley Park Bulldogs WC) won by fall over Nolan Lopez (Toss Em Up Wrestling Academy) Fall 2:03</li>\n</ul>\n<h2>Novice 60</h2>\n<ul>\n<li>1st Place Match - Grady Glowacki (Lakeland Predators WC) won by major decision over Kamari Tate (Englewood Live Wire WC) Maj 11-2</li>\n</ul>\n<h2>Novice 64</h2>\n<ul>\n<li>1st Place Match - Carter Noonan (Bolingbrook Junior Raiders WC) won by decision over Reese Babcock (St. Charles WC) Dec 5-2</li>\n</ul>\n<h2>Novice 69</h2>\n<ul>\n<li>1st Place Match - Erik Klichurov (Izzy Style Wrestling) won by decision over Hogan Rice (St. Charles WC) Dec 5-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Jaden Washington (Harvey Twisters) won by decision over Colton Wyller (Force Elite WC) Dec 6-2</li>\n</ul>\n<h2>Novice 80</h2>\n<ul>\n<li>1st Place Match - Lukas Foster (Callan Wrestling Academy) won by decision over Brady Glynn (Lincoln-Way WC) Dec 3-0</li>\n</ul>\n<h2>Novice 86</h2>\n<ul>\n<li>1st Place Match - Colton Schultz (Callan Wrestling Academy) won in sudden victory - 1 over Adante Washington (Harvey Twisters) SV-1 4-2</li>\n</ul>\n<h2>Novice 93</h2>\n<ul>\n<li>1st Place Match - Aiden Arnett (Lincoln-Way WC) won in tie breaker - 1 over Aidan McClure (St. Charles WC) TB-1 1-0</li>\n</ul>\n<h2>Novice 100</h2>\n<ul>\n<li>1st Place Match - Dawson Mack (Bolingbrook Junior Raiders WC) won by decision over Sawyer Valdez (Sycamore WC) Dec 6-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Thomas Banas (Demolition WC) won by decision over Tyler Lachenberg (Lincoln-Way WC) Dec 6-0</li>\n</ul>\n<h2>Novice 116</h2>\n<ul>\n<li>1st Place Match - Brayden McKay (Tinley Park Bulldogs WC) won by decision over Daniel Lynch (Tinley Park Bulldogs WC) Dec 1-0</li>\n</ul>\n<h2>Novice 125</h2>\n<ul>\n<li>1st Place Match - Nicholas Hermsen (Toss Em Up Wrestling Academy) won by major decision over John McGinnis (Oak Forest Warriors WC) Maj 10-2</li>\n</ul>\n<h2>Novice 134</h2>\n<ul>\n<li>1st Place Match - Radic Dvorak (ISI WC) won by fall over Kevin May (Southside Outlaws WC) Fall 1:59</li>\n</ul>\n<h2>Novice 154</h2>\n<ul>\n<li>1st Place Match - Isaac Barrientos (Fitz Wrestling Academy) won by decision over Jaxson Mathenia (Waterloo Bulldog Wrestling) Dec 3-0</li>\n</ul>\n<h2>Senior 176</h2>\n<ul>\n<li>1st Place Match - Foley Calcagno (Southside Outlaws WC) won by fall over Maximus Vela (Callan Wrestling Academy) Fall 1:30</li>\n</ul>\n<h2>Senior 188</h2>\n<ul>\n<li>1st Place Match - Joseph Favia (Fitz Wrestling Academy) won by fall over Roman Janek (Lion`s Den Wrestling Academy) Fall 0:25</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Jaxon Penovich (Arlington Cardinals WC) won by fall over Teigen Moreno (Dundee Highlanders WC) Fall 3:21</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Kai Calcutt (Toss Em Up Wrestling Academy) won by fall over Ryan Stingliy (Frankfort Wildcats Wrestling) Fall 0:33</li>\n</ul>\n<h2>Senior 70</h2>\n<ul>\n<li>1st Place Match - Christian Corcoran (Lincoln-Way WC) won by fall over Ramsey Barton (Yorkville WC) Fall 3:44</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Logan Conover (Batavia WC) won by decision over Tanner Stone (Bolingbrook Junior Raiders WC) Dec 4-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Morgan Turner (Harvey Twisters) won by fall over Declan Sons (St. Charles WC) Fall 0:21</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Nadeem Haleem (Lincoln-Way WC) won by decision over Allen Woo (Izzy Style Wrestling) Dec 2-1</li>\n</ul>\n<h2>Senior 90</h2>\n<ul>\n<li>1st Place Match - Nicholas Garcia (Fitz Wrestling Academy) won by decision over Chazz Robinson (Harvey Twisters) Dec 2-0</li>\n</ul>\n<h2>Senior 96</h2>\n<ul>\n<li>1st Place Match - Domenic Munaretto (Toss Em Up Wrestling Academy) won by tech fall over Demetrios Carrera (Yorkville WC) TF 19-4</li>\n</ul>\n<h2>Senior 103</h2>\n<ul>\n<li>1st Place Match - Rocco Cassioppi (Hononegah WC) won by fall over Ryan Richie (Edwardsville WC) Fall 2:31</li>\n</ul>\n<h2>Senior 110</h2>\n<ul>\n<li>1st Place Match - Kameron Luif (Team El1te Wrestling) won by decision over Justin Wardlow (Harvey Twisters) Dec 4-2</li>\n</ul>\n<h2>Senior 118</h2>\n<ul>\n<li>1st Place Match - Aaron Camacho (Bolingbrook Junior Raiders WC) won by decision over Zachary Stewart (Fitz Wrestling Academy) Dec 7-4</li>\n</ul>\n<h2>Senior 126</h2>\n<ul>\n<li>1st Place Match - Jimmy Mastny (Alber Athletics WC) won by major decision over Dillon Hinton (Vandalia Jr WC) Maj 12-1</li>\n</ul>\n<h2>Senior 135</h2>\n<ul>\n<li>1st Place Match - Aaron Stewart (Toss Em Up Wrestling Academy) won by decision over Brody Sendele (Hononegah WC) Dec 7-3</li>\n</ul>\n<h2>Senior 144</h2>\n<ul>\n<li>1st Place Match - Royce Lopez (Toss Em Up Wrestling Academy) won by decision over Eli Larson (Stockton Renegades WC) Dec 3-1</li>\n</ul>\n<h2>Senior 154</h2>\n<ul>\n<li>1st Place Match - Santino Tenuta (Team El1te Wrestling) won by fall over Michael Brannigan (Red Raiders Wrestling Team) Fall 3:35</li>\n</ul>\n<h2>Senior 164</h2>\n<ul>\n<li>1st Place Match - Malik Warren (Harvey Twisters) won in tie breaker - 1 over Connor Sacco (Marengo Youth WC) TB-1 2-1</li>\n</ul>\n</section>"
}
