{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Cole Peters (TJ Trained-Springfield) won by major decision over Tommy Porter (Naperville WC) Maj 8-0</li>\n<li>Champ. Round 1 - Arojae Hart (Murphysboro WC) won in sudden victory - 1 over Scott Burke (Crystal Lake Wizards) SV-1 6-2</li>\n<li>Champ. Round 1 - Jason Shaw (Roxana Outlaws) won by decision over Maxwell Sztuk (St. Charles WC) Dec 8-2</li>\n<li>Champ. Round 1 - Garrett Luke (Stockton Renegades) won by fall over Jeante Tate (Lionheart Intense Wrestling) Fall 3:00</li>\n<li>Champ. Round 1 - Jack McClimon (Celtic Elite) won by decision over Vincent Robinson (Harvey Twisters WC) Dec 5-4</li>\n<li>Champ. Round 1 - Joe Mushinsky (TJ Trained) won by decision over Jayden Colon (Gomez Wrestling Academy) Dec 11-5</li>\n<li>Champ. Round 1 - Andrew Lizak (Lincoln-Way Vittum Cats) won by decision over Phillip Chapa (Barrington Broncos WC) Dec 5-1</li>\n<li>Champ. Round 1 - Joseph Fernau (Team 1006 Wrestling) won by fall over Nate Pacetti (Redhawk WC) Fall 2:57</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Gage Reed (Storm Youth WC) won by decision over Connor Thompson (SCN Youth WC) Dec 3-0</li>\n<li>Champ. Round 1 - Jack Barracca (Gomez Wrestling Academy) won by fall over Alec Mihelic (TJ Trained) Fall 2:31</li>\n<li>Champ. Round 1 - Drew Kested (Sauk Valley WC) won by major decision over Isaiah Hayes (Warrior Wrestling) Maj 11-1</li>\n<li>Champ. Round 1 - Michael Cestone (Gomez Wrestling Academy) won by fall over Ryan Gilligan (Martinez Fox Valley Elite) Fall 3:00</li>\n<li>Champ. Round 1 - Caleb Tyus (Bulls WC) won by major decision over Andrew Hopkins (Z`s Team Pena) Maj 9-0</li>\n<li>Champ. Round 1 - James Gardner (Contender Wrestling) won in sudden victory - 1 over Colin Kelly (Tinley Park Bulldogs WC) SV-1 7-5</li>\n<li>Champ. Round 1 - Emmett Connolly (Mustang/SKT WC) won by fall over Donovan Crumpacker (Stillman Valley WC) Fall 1:25</li>\n<li>Champ. Round 1 - Blain Christie (Brawlers WC) won by major decision over Austin Bauer (Edwardsville WC) Maj 14-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Cooper Schodrof (Contender Wrestling) won by major decision over Tyrin Newsome (Urbana Tigers WC) Maj 9-0</li>\n<li>Champ. Round 1 - Korina Blades (Martinez Fox Valley Elite) won by decision over Anthony Montez (Junior Pioneer WC) Dec 3-1</li>\n<li>Champ. Round 1 - Kaden Bray (Celtic Elite) won by decision over Jack Lesher (SCN Youth WC) Dec 12-8</li>\n<li>Champ. Round 1 - Dominick Reddish (Charleston WC) won by fall over Bryce Claypool (Little Redskins WC) Fall 3:24</li>\n<li>Champ. Round 1 - Matthew Nevdal (Xtreme WC) won by fall over Thomas Boland (Redhawk WC) Fall 2:38</li>\n<li>Champ. Round 1 - Caine Tyus (Bulls WC) won by decision over Will Collins (North Shore Edge) Dec 7-5</li>\n<li>Champ. Round 1 - Will Carlile (Mt. Olive Cats Kids Wrestling) won by decision over Marcel Bitner (Little Rams Wrestling) Dec 9-4</li>\n<li>Champ. Round 1 - Marko Hennin (Barrington Broncos WC) won by decision over Zackary Crawford (Sycamore WC) Dec 7-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Milani (Lincoln-Way Vittum Cats) won by decision over Braden Stauffenberg (Izzy Style Wrestling) Dec 10-7</li>\n<li>Champ. Round 1 - Rashon Allen (Urbana Tigers WC) won by major decision over Colton Carlisle (Bulls WC) Maj 12-0</li>\n<li>Champ. Round 1 - Zach Bateman (Lincoln-Way Vittum Cats) won by fall over Brennan Houser (Champaign WC) Fall 3:55</li>\n<li>Champ. Round 1 - Logan Balosky (Gomez Wrestling Academy) won by major decision over Jarrod Karnes (Edwardsville WC) Maj 12-2</li>\n<li>Champ. Round 1 - Damien Lopez (Martinez Fox Valley Elite) won by major decision over Wade Abrams (Cary Matmen WC) Maj 14-5</li>\n<li>Champ. Round 1 - Aj Heeg (Lemont Bears) won by fall over Donnie Hidden (TJ Trained) Fall 1:22</li>\n<li>Champ. Round 1 - Michael Caliendo (Batavia WC) won by major decision over Zach Sato (Team 1006 Wrestling) Maj 12-1</li>\n<li>Champ. Round 1 - Lucas Sutherland (Dakota WC) won by fall over Andre Giurini (Little Huskies WC) Fall 4:13</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Rayce Zike (Cumberland Youth WC) won by fall over Ryan Peters (Cary Matmen WC) Fall 2:58</li>\n<li>Champ. Round 1 - Jacob Liberatore (Bolingbrook Junior Raiders) won by fall over Parker Terronez (Moline WC) Fall 1:24</li>\n<li>Champ. Round 1 - Nathan Kraus (Yorkville WC) won by decision over Eliseo Perez (Lionheart Intense Wrestling) Dec 4-2</li>\n<li>Champ. Round 1 - Raymond Arebalo (Crosstown Wrestling) won by decision over Quinton Heilemeier (Dakota WC) Dec 5-3</li>\n<li>Champ. Round 1 - Owen Jacobson (Epic Wrestling) won by fall over Dayton Hoffman (Murphysboro WC) Fall 1:50</li>\n<li>Champ. Round 1 - Bryce Boumans (Fox Valley WC) won by major decision over Joseph Rattin (Palatine Cobras WC) Maj 9-1</li>\n<li>Champ. Round 1 - Blake Varga (SCN Youth WC) won by decision over Shawn Minick (O`Fallon Little Panthers WC) Dec 13-6</li>\n<li>Champ. Round 1 - Cooper Wettig (Izzy Style Wrestling) won by fall over Timothy Taylor (Tinley Park Bulldogs WC) Fall 0:53</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Matthew Stanley (Tinley Park Bulldogs WC) won by decision over Hunter Janeczko (Yorkville WC) Dec 3-2</li>\n<li>Champ. Round 1 - Grant Hansen (Maddog Wrestling Academy) won by fall over Jesse Stewart (Springfield Capitals Kids WC) Fall 1:08</li>\n<li>Champ. Round 1 - Anthony Cantu (Team 1006 Wrestling) won by major decision over Danny Lack (St. Joseph Ogden Youth WC) Maj 10-2</li>\n<li>Champ. Round 1 - Isaiah Lopez (Fox Lake WC) won by fall over Colin Ashley (Redhawk WC) Fall 2:55</li>\n<li>Champ. Round 1 - Alexander Tagler (Lincoln-Way Vittum Cats) won by fall over Austin Payne (Edwardsville WC) Fall 1:26</li>\n<li>Champ. Round 1 - Alex Picchi (Crystal Lake Wizards) won by decision over Jack Villarreal (Downers Grove Cougars) Dec 5-2</li>\n<li>Champ. Round 1 - Case Harmston (Stockton Renegades) won by decision over Dominic Adamo (Celtic Elite) Dec 11-6</li>\n<li>Champ. Round 1 - Micheal Anderson (Villa Park Young Warriors) won by fall over Mason Wilke (Edwardsville WC) Fall 3:23</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Robert Gonzalez (Team 1006 Wrestling) won by fall over Craig Johnson (Danville Chargers Wrestling) Fall 2:44</li>\n<li>Champ. Round 1 - Anthony Chiaro (SCN Youth WC) won by fall over Grayson Cook (Saukee Youth WC) Fall 2:27</li>\n<li>Champ. Round 1 - Esther Han (Carbondale WC) won by fall over Gabriel Orosco (Springfield Capitals Kids WC) Fall 2:58</li>\n<li>Champ. Round 1 - Zak Kozlowski (Wheaton Warrenville Tiger WC) won by decision over John Ford (Peoria Heights Minutemen WC) Dec 6-1</li>\n<li>Champ. Round 1 - Stacey Terry (Harvey Twisters WC) won by fall over Caden Votruba (Headlock Wrestling Academy) Fall 3:09</li>\n<li>Champ. Round 1 - Mason Spivey (Minooka Indians Elite) won by fall over Cody Clauson (Crystal Lake Wizards) Fall 3:57</li>\n<li>Champ. Round 1 - Braeden Tosterud (Elk Grove Junior Grens) won by decision over Liam McDermott (Celtic Elite) Dec 4-0</li>\n<li>Champ. Round 1 - Evan Stubblefield (Maywood Bucs/Powerhouse) won by fall over Wyatt Raab (The Law) Fall 3:41</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Eathin Diveley (Lil Bucs WC) won by fall over Michael Koenig (Pontiac WC) Fall 1:07</li>\n<li>Champ. Round 1 - Connor Brooker (Thundercat Wrestling) won by decision over Dustin Roberts (Carlinville WC) Dec 6-3</li>\n<li>Champ. Round 1 - Jason Hermann (Stockton Renegades) won by fall over Tyler Haynes (Pekin Boys &amp; Girls Club) Fall 2:47</li>\n<li>Champ. Round 1 - Gavin Seymour (Jacksonville Area Wrestling) won in sudden victory - 1 over Joseph Kisting (Saber WC) SV-1 7-5</li>\n<li>Champ. Round 1 - Evan Roper (Barrington Broncos WC) won by fall over Justin Lechelt (Minooka Indians Elite) Fall 3:00</li>\n<li>Champ. Round 1 - Buddy Evangelista (Greg Gomez Trained Wrestling) won by major decision over Connor Nelligan (Mustang/SKT WC) Maj 10-1</li>\n<li>Champ. Round 1 - Jadon Mims (Maywood Bucs/Powerhouse) won by decision over Ethan Pitts (Lincoln-Way Vittum Cats) Dec 7-5</li>\n<li>Champ. Round 1 - Christopher Carr (Izzy Style Wrestling) won by fall over Daniel Surges (SCN Youth WC) Fall 0:21</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Rylee Edwards (Storm Youth WC) won by decision over Jonathan Urbieta (Belvidere Bandits WC) Dec 5-2</li>\n<li>Champ. Round 1 - Colin Kohler (Celtic Elite) won by fall over Kieran Pavlat (Chicago Park District) Fall 0:49</li>\n<li>Champ. Round 1 - Michael Mosier (Barrington Broncos WC) won by fall over Colby Loftsgaard (Urbana Tigers WC) Fall 1:28</li>\n<li>Champ. Round 1 - Mathieu Arsenault (Celtic Elite) won by decision over Joseph Swanson (Cary Matmen WC) Dec 5-4</li>\n<li>Champ. Round 1 - Justin Muller (Downers Grove Cougars) won by major decision over Tyler Wilms (Lemont Bears) Maj 9-1</li>\n<li>Champ. Round 1 - Ethan Sperry (Crusaders` Elite) won by major decision over Karson Lamb (Pekin Boys &amp; Girls Club) Maj 9-0</li>\n<li>Champ. Round 1 - Braden Hunter (Team 1006 Wrestling) won by decision over Kevin Gilhooly (Redhawk WC) Dec 11-4</li>\n<li>Champ. Round 1 - Chase Michaelis (Carlinville WC) won by fall over Charlie Neidballa (Falcon Elite WC) Fall 2:03</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Gavin Keeffer (Stockton Renegades) won by fall over Jramuel Holman (Junior Comanche WC) Fall 1:57</li>\n<li>Champ. Round 1 - Colin O`Neill (Wolfpak WC) won by fall over Dakota Ritter (Riverton Youth Wrestling) Fall 1:20</li>\n<li>Champ. Round 1 - Nicholas Eby (Crawford County WC) won by major decision over Micah Smith (Lionheart Intense Wrestling) Maj 9-1</li>\n<li>Champ. Round 1 - Brandon Navarro (Izzy Style Wrestling) won by fall over Michael Macias (Marengo Youth WC) Fall 0:24</li>\n<li>Champ. Round 1 - Connor Lorden (LP Crunching Cavs) won by fall over Jerred Durian (Wheaton Warrenville Tiger WC) Fall 1:05</li>\n<li>Champ. Round 1 - Michael Groen (Crosstown Wrestling) won by decision over Cristian Puentes (Badger WC) Dec 6-1</li>\n<li>Champ. Round 1 - Rolando Ochoa (Badger WC) won by fall over Brock Parker (Junior Pioneer WC) Fall 0:57</li>\n<li>Champ. Round 1 - Jacob Sergen (Fuel WC) won by fall over Morley Coval (Martinez Fox Valley Elite) Fall 1:26</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Adil Lokhandwala (Fox Valley WC) won by decision over John Rathbun (Olympia WC) Dec 9-6</li>\n<li>Champ. Round 1 - Vicente Arebalo (Crosstown Wrestling) won by fall over Ivan Jones (Carterville Jr WC) Fall 2:56</li>\n<li>Champ. Round 1 - Isaac Proctor (Roxana Outlaws) won by fall over Noah Reinhart (Champaign WC) Fall 2:14</li>\n<li>Champ. Round 1 - Noah Ross (Rockets Youth WC) won by fall over Jacob Plohr (Team No Ego WC) Fall 3:23</li>\n<li>Champ. Round 1 - Jacob Morel (Pitbull Wrestling Alliance) won in sudden victory - 1 over Jonas Ortiz (Champbuilders Wrestling) SV-1 6-4</li>\n<li>Champ. Round 1 - Paulie Robertson (Villa-Lombard Cougars) won by decision over Dylan Shuman (Sycamore WC) Dec 6-3</li>\n<li>Champ. Round 1 - Nathan Wemstrom (Arlington Cardinals WC) won by fall over Gene Stringini (The Law) Fall 1:58</li>\n<li>Champ. Round 1 - Brenden Watkins (Team 1006 Wrestling) won by fall over Luke Grage (Oak Forest Warriors) Fall 2:40</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Evan Christison (Chatham WC) won by fall over Kyle Boughan (Olney Cubs WC) Fall 2:13</li>\n<li>Champ. Round 1 - Gabriel Taylor (Mt. Vernon Lions WC) won by fall over Lucas Smith (Super Soldiers WC) Fall 4:20</li>\n<li>Champ. Round 1 - Gavin Mouser (Vandalia Jr WC) won by fall over Andre Hunt (Urbana Tigers WC) Fall 0:20</li>\n<li>Champ. Round 1 - Lucas Armstrong (Peoria Razorbacks WC) won by fall over Rodolfo Flores (Little Rams Wrestling) Fall 0:58</li>\n<li>Champ. Round 1 - Carsten Menzer (Sycamore WC) won by fall over Martreyvon Smith (Lionheart Intense Wrestling) Fall 0:45</li>\n<li>Champ. Round 1 - Charlie Jagusah (Junior Pioneer WC) won by fall over Brian Straight (Dundee Highlanders WC) Fall 1:18</li>\n<li>Champ. Round 1 - Jimmy Liston (Martinez Fox Valley Elite) won by decision over Joey Ochoa (Red Raiders Wrestling Team) Dec 7-0</li>\n<li>Champ. Round 1 - Zander Guttridge (Rockford WC) won by fall over Evan Cottingham (Roxana Outlaws) Fall 0:39</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Aiden Taylor (Carbondale WC) won by fall over Steven Lookis (Riverton Youth Wrestling) Fall 1:51</li>\n<li>Champ. Round 1 - Oran Varela (Hoopeston Area WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Laron Reed (Danville Chargers Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Zachary Griffith (Bulls WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Robert Schneider (Celtic Elite) won by fall over Kyjuan Brumfield (Urbana Tigers WC) Fall 3:56</li>\n<li>Champ. Round 1 - Simon Wilson (Champbuilders Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Noah Carl (Cumberland Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jason Johnston (Metamora Kids WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Saul Trejo (Gomez Wrestling Academy) won by tech fall over Valerie Hamilton (Prairie Central Hawks) TF 16-0</li>\n<li>Champ. Round 1 - Dominic Ducato (Golden Eagles WC) won by fall over Kameron Weddle (SCN Youth WC) Fall 2:28</li>\n<li>Champ. Round 1 - Bryce Durlacher (The Wrestling Factory) won by fall over David-Joseph Rice (Belvidere Bandits WC) Fall 2:02</li>\n<li>Champ. Round 1 - Chase Hampton (Greg Gomez Trained Wrestling) won by decision over Jace Judson (Cumberland Youth WC) Dec 6-1</li>\n<li>Champ. Round 1 - Payton Murphy (TJ Trained) won by decision over Jackson Jeck (Brawlers WC) Dec 8-3</li>\n<li>Champ. Round 1 - Chance Arlt-Seip (Triad Little Knights WC) won by fall over Jesse Herrera (Mustang/SKT WC) Fall 1:05</li>\n<li>Champ. Round 1 - Aaron Meenen (Sauk Valley WC) won by major decision over Carter Mikolajczak (Lemont Bears) Maj 12-2</li>\n<li>Champ. Round 1 - Shay Korhorn (Force WC) won by fall over Caleb Scott (Granite City Wrestling Association) Fall 4:07</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Robert Bonilla (Mustang/SKT WC) won by decision over Jujuan Williams Jr (Lionheart Intense Wrestling) Dec 12-7</li>\n<li>Champ. Round 1 - Henry Locker (Downers Grove Cougars) won by decision over Jacob Crandall (Arlington Cardinals WC) Dec 8-3</li>\n<li>Champ. Round 1 - Collin Carrigan (Naperville WC) won by decision over Anthony Ruzic (Springfield Capitals Kids WC) Dec 6-2</li>\n<li>Champ. Round 1 - Trevor Reed (Harvey Twisters WC) won by decision over Michael DiBenedetto (Gomez Wrestling Academy) Dec 9-4</li>\n<li>Champ. Round 1 - Joseph McDermott (Force WC) won by major decision over Jackson Summers (Edwardsville WC) Maj 8-0</li>\n<li>Champ. Round 1 - Phoenix Mordick (Dakota WC) won by fall over Curtis Steinkamp (Quincy Cyclones Wrestling) Fall 2:48</li>\n<li>Champ. Round 1 - Joey Malito (Celtic Elite) won by major decision over Devin Lozdoski (Harlem Cougars WC) Maj 10-0</li>\n<li>Champ. Round 1 - Avery Speck (TJ Trained) won by fall over David Deuanephenh (Edwardsville WC) Fall 4:05</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Edmund Enright (Mustang/SKT WC) won by fall over Ryan Koelblinger (Wolves WC) Fall 1:23</li>\n<li>Champ. Round 1 - Samuel Ohl (Metamora Kids WC) won by decision over Brady Foster (Mattoon Youth WC) Dec 6-1</li>\n<li>Champ. Round 1 - Caden Muselman (Tinley Park Bulldogs WC) won by fall over Charlene Hamilton (Prairie Central Hawks) Fall 2:00</li>\n<li>Champ. Round 1 - Colin Young (Belvidere Bandits WC) won by fall over Micah Bergen (Super Soldiers WC) Fall 1:02</li>\n<li>Champ. Round 1 - Jacob Macatangay (Force WC) won by fall over Sean Conway (Team 312) Fall 2:53</li>\n<li>Champ. Round 1 - Aaron Niemeyer (Roxana Outlaws) won by decision over Angel Mendez (Martinez Fox Valley Elite) Dec 6-1</li>\n<li>Champ. Round 1 - Tyler Guerra (Gomez Wrestling Academy) won by fall over J Guido Pigoni (SCN Youth WC) Fall 1:49</li>\n<li>Champ. Round 1 - Logan Kuhel-Trimmer (Force WC) won by decision over Colby Crouch (Triad Little Knights WC) Dec 5-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Kenyon Boyce (Harvey Twisters WC) won by decision over Reef Pacot (Storm Youth WC) Dec 9-3</li>\n<li>Champ. Round 1 - Mason Alessio (Celtic Elite) won by decision over Brock Barrows (Bulls WC) Dec 3-2</li>\n<li>Champ. Round 1 - Seth Larson (Force WC) won by decision over Aj Wagner (Champaign WC) Dec 6-0</li>\n<li>Champ. Round 1 - Chase Hall (Triad Little Knights WC) won by fall over David Mayora (Epic Wrestling) Fall 2:41</li>\n<li>Champ. Round 1 - Christopher Moore (Crystal Lake Wizards) won by fall over Paul Ishikawa (TJ Trained) Fall 4:17</li>\n<li>Champ. Round 1 - Connor Munn (Pitbull Wrestling Alliance) won by decision over Joseph Chiarelli (Downers Grove Cougars) Dec 7-6</li>\n<li>Champ. Round 1 - Noah Manuel Tapia (Young Guns Wrestling) won by tech fall over Jaden Peterson (Arlington Cardinals WC) TF 15-0</li>\n<li>Champ. Round 1 - Zachary White (The Law) won by fall over Santino Scolaro (SCN Youth WC) Fall 0:49</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Aidan Waszak (Greg Gomez Trained Wrestling) won by fall over Kristian Wiles (Pontiac WC) Fall 0:40</li>\n<li>Champ. Round 1 - Terrance Snapp (Will County Warriors) won by decision over Michael Archer (Mean Green Machine) Dec 4-2</li>\n<li>Champ. Round 1 - Kyle Schickel (Celtic Elite) won by fall over Shawn Griffin (East St. Louis Wrestling) Fall 0:32</li>\n<li>Champ. Round 1 - Michael D`Orazio (SCN Youth WC) won by major decision over Zack Rotkvich (Mustang/SKT WC) Maj 9-1</li>\n<li>Champ. Round 1 - Cameron Domke (The Wrestling Factory) won by fall over Grant Peterson (Central Illinois Wrestling Academy) Fall 0:40</li>\n<li>Champ. Round 1 - Ben Lunn (Edwardsville WC) won by tech fall over Logan Reed (Marengo Youth WC) TF 15-0</li>\n<li>Champ. Round 1 - Sean Crump (Izzy Style Wrestling) won by major decision over Cooper Adams (Crystal Lake Wizards) Maj 14-4</li>\n<li>Champ. Round 1 - Grant Woodruff (TJ Trained) won by decision over Gaige Owens (SIWA) Dec 1-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Matthew Cozzi (Elmhurst Jr Dukes) won by fall over Natris Morris (Urbana Tigers WC) Fall 3:43</li>\n<li>Champ. Round 1 - Colin Suyko (Cary Matmen WC) won by decision over Chevvy Wood (Aces WC) Dec 5-0</li>\n<li>Champ. Round 1 - Isaiah Bernal (Crusaders` Elite) won by decision over Elon Rodriguez (Martinez Fox Valley Elite) Dec 9-4</li>\n<li>Champ. Round 1 - Jacob Milliman (Hawk WC Ltd.) won by tech fall over Connor Hutson (Storm Youth WC) TF 15-0</li>\n<li>Champ. Round 1 - John McDermott (Force WC) won by fall over Patrick Houston (Tinley Park Bulldogs WC) Fall 4:05</li>\n<li>Champ. Round 1 - Billy Taylor (Junior Pioneer WC) won by major decision over Kevin Naughton (Maine Eagles WC) Maj 12-0</li>\n<li>Champ. Round 1 - Alex Villar (Bolingbrook Junior Raiders) won by fall over Liam Cummins (North Shore Edge) Fall 0:40</li>\n<li>Champ. Round 1 - Kyle Tunink (Sauk Valley WC) won by major decision over Thomas Egan (Mustang/SKT WC) Maj 14-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Austin McConaha (Champaign WC) won by fall over Anthony Vilchis (Geneva Junior Vikings) Fall 3:39</li>\n<li>Champ. Round 1 - Aric Nieves (Team 1006 Wrestling) won by decision over Daniel Mcpherson (Lakeland Predators WC) Dec 4-1</li>\n<li>Champ. Round 1 - Tristan Daugherty (Central Illinois Wrestling Academy) won by fall over Jaiden Cooper (Urbana Tigers WC) Fall 1:15</li>\n<li>Champ. Round 1 - Christian Valadez (Waukegan Youth WC) won by major decision over Riley Woods (Batavia WC) Maj 12-0</li>\n<li>Champ. Round 1 - Melvin Rogers (East St. Louis Wrestling) won by decision over Dathan Wickson (Harlem Cougars WC) Dec 2-1</li>\n<li>Champ. Round 1 - Jack Coyle (Mustang/SKT WC) won by decision over Garrett Geigner (Lincoln-Way Vittum Cats) Dec 6-1</li>\n<li>Champ. Round 1 - Bryce Shelton (Crystal Lake Wizards) won by decision over Jimmy Ferguson (Tinley Park Bulldogs WC) Dec 7-0</li>\n<li>Champ. Round 1 - Sam Emery (Celtic Elite) won by tech fall over Timothy Capps (SIWA) TF 17-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Donovan Golden (Brawlers WC) won by decision over Zachary Seymore (Izzy Style Wrestling) Dec 7-1</li>\n<li>Champ. Round 1 - Anthony Federico (O`Fallon Little Panthers WC) won by tech fall over Blayne Donsbach (Cumberland Youth WC) TF 18-2</li>\n<li>Champ. Round 1 - Rocco Iannantone (Lincoln-Way Vittum Cats) won by fall over Auston Rollings (Unity Youth WC) Fall 0:12</li>\n<li>Champ. Round 1 - Tuvshinjargal Zuunbayan (Pitbull Wrestling Alliance) won by decision over Garrett Bakarich (Triad Little Knights WC) Dec 9-6</li>\n<li>Champ. Round 1 - Jacob Tinajero (SCN Youth WC) won by major decision over Parker Suyko (Cary Matmen WC) Maj 11-2</li>\n<li>Champ. Round 1 - Raymond Hernandez (Mustang/SKT WC) won by major decision over Cole Wright (Super Soldiers WC) Maj 12-2</li>\n<li>Champ. Round 1 - Reese Martin (Glenbard East Jr Rams) won by major decision over Tristen Fitz (Metamora Kids WC) Maj 13-2</li>\n<li>Champ. Round 1 - Alex Epstein (Golden Eagles WC) won by decision over Trevor Griffin (Tinley Park Bulldogs WC) Dec 4-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Luke Bennett (Stillman Valley WC) won by decision over Peyton Holt (St. Joseph Ogden Youth WC) Dec 5-4</li>\n<li>Champ. Round 1 - Jake Viloria (Little Huskies WC) won by decision over Daniel Jezik (Celtic Elite) Dec 7-4</li>\n<li>Champ. Round 1 - Dane Thorne (Brawlers WC) won by decision over Colt Guyon (Cumberland Youth WC) Dec 8-2</li>\n<li>Champ. Round 1 - Drew Nash (Lemont Bears) won by decision over Bryce Faworski (Xtreme WC) Dec 7-0</li>\n<li>Champ. Round 1 - Jackson Certa (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Champ. Round 1 - Christopher Worcester (Villa-Lombard Cougars) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jack Riemer (Pitbull Wrestling Alliance) won by decision over Lucas Daly (Carbondale WC) Dec 5-2</li>\n<li>Champ. Round 1 - Adam Meenen (Sauk Valley WC) won by fall over Mark Skokna (Hinsdale Red Devil WC) Fall 2:38</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Winston McPeek (Stockton Renegades) won by tech fall over Michael Carpenter (Cumberland Youth WC) TF 18-1</li>\n<li>Champ. Round 1 - Jake Mensik (Bolingbrook Junior Raiders) won by fall over Minani Allin (Rock Island WC) Fall 1:20</li>\n<li>Champ. Round 1 - Cole Pradel (Team 1006 Wrestling) won by decision over Storm Washburn (Cumberland Youth WC) Dec 7-4</li>\n<li>Champ. Round 1 - Ashton Breen (Bolingbrook Junior Raiders) won by fall over Austin Abitua (Hononegah WC) Fall 4:15</li>\n<li>Champ. Round 1 - Caleb Snoddy (Harvey Twisters WC) won by decision over Jeff Hermann (Crawford County WC) Dec 9-4</li>\n<li>Champ. Round 1 - Brian Stacy (The Wrestling Factory) won by major decision over Justin Rupnow (SCN Youth WC) Maj 12-2</li>\n<li>Champ. Round 1 - Peyton Bechtold (Bulls WC) won by fall over Peyton Lomenick (Falcon Elite WC) Fall 0:56</li>\n<li>Champ. Round 1 - Daemyen Middlebrooks (Little Huskies WC) won by fall over Daniel Alaniz (Waukegan Youth WC) Fall 2:39</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Anthony Bitner (Little Rams Wrestling) won by major decision over Luke Peacock (Tiger Town Tanglers WC) Maj 13-3</li>\n<li>Champ. Round 1 - Alejandro Mejia (Pitbull Wrestling Alliance) won by decision over Joel Sarver (Champaign WC) Dec 7-0</li>\n<li>Champ. Round 1 - Griffin Watts (Midwest Central Youth WC) won by major decision over Traeton Woods (Saber WC) Maj 12-3</li>\n<li>Champ. Round 1 - Isaiah Parker (The Wrestling Factory) won by major decision over Joe Chapman (Little Huskies WC) Maj 13-2</li>\n<li>Champ. Round 1 - Zeke Waltz (Jersey Junior Panthers Wrestling) won by decision over Alex Carrillo (Force WC) Dec 9-7</li>\n<li>Champ. Round 1 - Sean Larkin (Fox Valley WC) won by fall over Ian Palzkill (Xtreme WC) Fall 0:29</li>\n<li>Champ. Round 1 - Jakob Wheeler (Celtic Elite) won by decision over Zak Kozumplik (Sycamore WC) Dec 7-1</li>\n<li>Champ. Round 1 - Joseph Franke (Naperville WC) won by decision over Aron Taylor (Carbondale WC) Dec 9-6</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Brandon Lawver (Rock Island WC) won by fall over Ethan Fifield (Pitbull Wrestling Alliance) Fall 1:46</li>\n<li>Champ. Round 1 - Brady Christeson (Bulls WC) won by fall over Luke Pyle (Hinsdale Red Devil WC) Fall 0:51</li>\n<li>Champ. Round 1 - Simon Weakley (Edwardsville WC) won in overtime over Jonathan Finley (Crusaders` Elite) OT 8-6</li>\n<li>Champ. Round 1 - Elias Richardson (Team TopNotch Wrestling) won by fall over Kaleb Vahle (Champions WC) Fall 4:20</li>\n<li>Champ. Round 1 - Mustafa St. Clair (Harvey Twisters WC) won by fall over Noah Ross (Izzy Style Wrestling) Fall 4:18</li>\n<li>Champ. Round 1 - Kaydon Norkus (Force WC) won by decision over Aidan Nardin (Dakota WC) Dec 4-0</li>\n<li>Champ. Round 1 - Luke Rasmussen (Barrington Broncos WC) won by decision over Kyle Berg (Lincoln-Way Vittum Cats) Dec 4-2</li>\n<li>Champ. Round 1 - Bradley Peters (Cary Matmen WC) won by decision over Andrew Mulay (Tinley Park Bulldogs WC) Dec 3-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Grant Ripperda (Springfield Capitals Kids WC) won by fall over Cadence Hecox (Hecox Team Benaiah) Fall 2:56</li>\n<li>Champ. Round 1 - Joey Rowan (Somonauk Wrestlers Club) won by fall over Mason Ahlers (Edwardsville WC) Fall 4:21</li>\n<li>Champ. Round 1 - Brenden Parks (Crystal Lake Wizards) won by fall over Brendon Williams (Super Soldiers WC) Fall 2:07</li>\n<li>Champ. Round 1 - Jeffrey Tyler (Granite City Wrestling Association) won by decision over John Sexton (Saber WC) Dec 4-1</li>\n<li>Champ. Round 1 - Thomas Luedke (Celtic Elite) won by fall over Jacob Fitzsimmons (Windy City Wrestling of Notre Dame) Fall 3:44</li>\n<li>Champ. Round 1 - Josh Labarbera (Martinez Fox Valley Elite) won by fall over Arturo Acevedo (Morton Little Mustangs) Fall 2:56</li>\n<li>Champ. Round 1 - Tyler Filippini (Lemont Bears) won by decision over Daniel Hipolito (Force WC) Dec 6-1</li>\n<li>Champ. Round 1 - Baltazar Cabrales (Sharks WC) won by decision over John Leftwich (Greg Gomez Trained Wrestling) Dec 8-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Cole Baumgartner (Sycamore WC) won by decision over Ian Hofferkamp (Riverton Youth Wrestling) Dec 10-3</li>\n<li>Champ. Round 1 - Jose Nunez (Peoria Razorbacks WC) won by fall over Justin Brown (Fox Lake WC) Fall 2:36</li>\n<li>Champ. Round 1 - Xavier Sierra (Headlock Wrestling Academy) won by fall over Richard Rebeles (Caravan Kids WC) Fall 2:02</li>\n<li>Champ. Round 1 - Wyatt Griggel (Red Raiders Wrestling Team) won by fall over Jimmy Paniuski (Harlem Cougars WC) Fall 1:29</li>\n<li>Champ. Round 1 - Shawn Fichtel (Batavia WC) won by fall over Najeh Ashkar (Oak Forest Warriors) Fall 1:45</li>\n<li>Champ. Round 1 - River Flute (West Frankfort Jr. Redbirds) won by fall over Immanuel Cervantes (Yorkville WC) Fall 3:25</li>\n<li>Champ. Round 1 - Anthony Tovar (Moline WC) won by fall over James Hart (Tinley Park Bulldogs WC) Fall 1:23</li>\n<li>Champ. Round 1 - Hunter Boyd (Triad Little Knights WC) won by fall over Alexander Aguirre (Martinez Fox Valley Elite) Fall 0:28</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Tyler McCracken (Edwardsville WC) won by fall over Joshua Crandall (Wolves WC) Fall 2:37</li>\n<li>Champ. Round 1 - Robert Guss (Pitbull Wrestling Alliance) won by fall over Caleb Boyer (Champbuilders Wrestling) Fall 2:33</li>\n<li>Champ. Round 1 - Reide Wilson (Granite City Wrestling Association) won by fall over Cesar Sanchez (Caravan Kids WC) Fall 0:55</li>\n<li>Champ. Round 1 - Josiah Kerney (Waukegan Youth WC) won by fall over Drake Bunger (Belvidere Bandits WC) Fall 2:06</li>\n<li>Champ. Round 1 - Jason Bridgewater (Midwest Central Youth WC) won by fall over Brock Donati (St. Charles WC) Fall 1:30</li>\n<li>Champ. Round 1 - Apollo Gothard (Lemont Bears) won by fall over Noah Zukauskas (Team No Ego WC) Fall 0:35</li>\n<li>Champ. Round 1 - Julian Ramirez (Tinley Park Bulldogs WC) won by fall over Jeffrey Wallace (Champbuilders Wrestling) Fall 1:01</li>\n<li>Champ. Round 1 - Brian Salinas (DuPage WC) won by fall over William Griffin (Dakota WC) Fall 2:53</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Justin Allen (Prairie Central Hawks) received a bye   () Bye</li>\n<li>Champ. Round 1 - Thomas Doyle (Lincoln-Way Vittum Cats) won by fall over James Young (East St. Louis Wrestling) Fall 1:39</li>\n<li>Champ. Round 1 - Rewn Stearns (Murphysboro WC) won by fall over Connor Eastin (Unity Youth WC) Fall 2:46</li>\n<li>Champ. Round 1 - Jacob Perez (Martinez Fox Valley Elite) won by decision over James Allen (Celtic Elite) Dec 5-3</li>\n<li>Champ. Round 1 - Jared Dowell (Pekin Boys &amp; Girls Club) won by decision over Clay Cichowski (Team 312) Dec 1-0</li>\n<li>Champ. Round 1 - Garret Moser (Hawk WC Ltd.) won by injury default over Alexis Aguirre (Martinez Fox Valley Elite) Inj. 3:46</li>\n<li>Champ. Round 1 - Jaylin Garay (Villa-Lombard Cougars) won by decision over Nick Nygaard (Golden Eagles WC) Dec 10-3</li>\n<li>Champ. Round 1 - Joey Wolny (Sycamore WC) won by fall over Sharell Johnson (Maywood Bucs/Powerhouse) Fall 0:38</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Basilo Betancourt (Harvey Twisters WC) won by decision over Ghassan Salah (Tinley Park Bulldogs WC) Dec 8-6</li>\n<li>Champ. Round 1 - Jesse Helfrich (West Frankfort Jr. Redbirds) won by fall over Kelly Marten (Downers Grove Cougars) Fall 2:00</li>\n<li>Champ. Round 1 - Ryan Norwood (Team Mascoutah WC) won by fall over Kyle Amodia (Grayslake WC) Fall 3:57</li>\n<li>Champ. Round 1 - John Bergman (Lions WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Alex Bernardino (Villa Park Young Warriors) won by tech fall over Zach Renken (Jersey Junior Panthers Wrestling) TF 17-2</li>\n<li>Champ. Round 1 - Jonathan Lopez (Waukegan Youth WC) won by fall over Sheldon Cherry (Will County Warriors) Fall 0:26</li>\n<li>Champ. Round 1 - Jalen Farmer (St. Charles WC) won by fall over Nicholas Escobar (Force WC) Fall 1:00</li>\n<li>Champ. Round 1 - Franco Fontela (Maddog Wrestling Academy) won by fall over Trey Boyd (Edwardsville WC) Fall 2:11</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Lloyd Reynolds (Edwardsville WC) won by decision over Michael Stockton (Carbondale WC) Dec 11-5</li>\n<li>Champ. Round 1 - Blake Kunkel (Geneva Junior Vikings) won by fall over Julius Garrett (Urbana Tigers WC) Fall 2:01</li>\n<li>Champ. Round 1 - Peter Gianaris (Maine Eagles WC) won by fall over Dreyden Pitts (Urbana Tigers WC) Fall 1:19</li>\n<li>Champ. Round 1 - Stephen Ostresh (Granite City Wrestling Association) won by fall over William Fuller (Harlem Cougars WC) Fall 0:27</li>\n<li>Champ. Round 1 - Evan Hissong (Cary Matmen WC) won by fall over Omar Paredes (Celtic Elite) Fall 1:59</li>\n<li>Champ. Round 1 - Nicolas Munoz (Team TopNotch Wrestling) won by fall over Eli Denton (Junior Pioneer WC) Fall 4:18</li>\n<li>Champ. Round 1 - Angel Jaimes (Martinez Fox Valley Elite) won by fall over Matthew Hood (Richmond WC) Fall 0:36</li>\n<li>Champ. Round 1 - Xavier Jean-Simon (HF Spartan Elite WC) won by fall over Ethan Girdler (Peoria Heights Minutemen WC) Fall 0:08</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Farouk Shaaban (Barrington Broncos WC) won by fall over Nicholas Mattran (Wolves WC) Fall 2:28</li>\n<li>Champ. Round 1 - Derick Platt (Team 1006 Wrestling) won by fall over Donny McGee (Little Boilers WC) Fall 1:49</li>\n<li>Champ. Round 1 - Patrick Turner (Force WC) won by injury default over Graham Heilman (Roxana Outlaws) Inj. 0:00</li>\n<li>Champ. Round 1 - Payton Piraino (LP Crunching Cavs) won by fall over Theodore Hickey (Maine Eagles WC) Fall 4:29</li>\n<li>Champ. Round 1 - Andrew Kaltmeyer (Edwardsville WC) won by fall over Skyler Sutton (Olney Cubs WC) Fall 4:06</li>\n<li>Champ. Round 1 - Michael Dubanowski (Rockets Youth WC) won by major decision over Jake Rider (Carmi Bulldog WC) Maj 10-0</li>\n<li>Champ. Round 1 - Amner Bustos (Z`s Team Pena) won by fall over Thomas Munoz (Redhawk WC) Fall 0:50</li>\n<li>Champ. Round 1 - Randy Turner (Team Mascoutah WC) won by fall over Caleb Uczen (Elmhurst Jr Dukes) Fall 0:28</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Cooper Mikolajczak (Lemont Bears) won by fall over Cory Kinnunen (Downers Grove Cougars) Fall 1:03</li>\n<li>Champ. Round 1 - James Marre (Gomez Wrestling Academy) won by major decision over Jack Vulich (Redhawk WC) Maj 18-4</li>\n<li>Champ. Round 1 - Cameron Varner (Junior Kahoks) won by tech fall over Israel Quintanilla (Team TopNotch Wrestling) TF 16-1</li>\n<li>Champ. Round 1 - Ronan Schuelke (Maddog Wrestling Academy) won by decision over Tyler Bentley (Lemont Bears) Dec 3-0</li>\n<li>Champ. Round 1 - Joseph Knapp (Brawlers WC) won by tech fall over Brayden Cobine (Roxana Outlaws) TF 16-0</li>\n<li>Champ. Round 1 - Drew Lehn (The Wrestling Factory) won in tie breaker - 1 over Bryce Fiegel (Crystal Lake Wizards) TB-1 1-0</li>\n<li>Champ. Round 1 - Dylan Amico (Force WC) won by fall over Austin Jensen (Harlem Cougars WC) Fall 0:34</li>\n<li>Champ. Round 1 - Patrick Hug (Force WC) won by fall over Joseph Ferguson (Rock Island WC) Fall 0:51</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Michael Crawford (Sycamore WC) won by decision over Jake Tanquilut (Tinley Park Bulldogs WC) Dec 8-1</li>\n<li>Champ. Round 1 - Isaac Tabels (Hoopeston Area WC) won by decision over Ethan Hanaman (Mendota Mat Masters) Dec 8-2</li>\n<li>Champ. Round 1 - Brandon Edelen (Oak Forest Warriors) won by decision over Conner Elmer (Dakota WC) Dec 6-4</li>\n<li>Champ. Round 1 - Malakye Rodriguez (Red Raiders Wrestling Team) won by fall over Caleb Bradle (Super Soldiers WC) Fall 2:48</li>\n<li>Champ. Round 1 - Gabriel Hinkle (Celtic Elite) won by fall over Joey Marino (Maine Eagles WC) Fall 2:04</li>\n<li>Champ. Round 1 - Jarek Wehrle (Vandalia Jr WC) won by decision over Danny Curran (Martinez Fox Valley Elite) Dec 3-1</li>\n<li>Champ. Round 1 - Jake Penzato (St. Charles WC) won by fall over Lauden Edwards (Villa-Lombard Cougars) Fall 3:55</li>\n<li>Champ. Round 1 - Matthew Minick (O`Fallon Little Panthers WC) won by major decision over Dominic Iannantone (Lincoln-Way Vittum Cats) Maj 14-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Michael Kass (Mean Green Machine) won by fall over Michael Humphrey (Murphysboro WC) Fall 1:16</li>\n<li>Champ. Round 1 - Khai Stephens (Manteno Jr Panthers WC) won by decision over Justin Campbell (Edwardsville WC) Dec 14-7</li>\n<li>Champ. Round 1 - Javen Estrada (Bolingbrook Junior Raiders) won by fall over Trey Conroy (Orland Park Pioneers) Fall 1:47</li>\n<li>Champ. Round 1 - Joey Chirillo (Tinley Park Bulldogs WC) won by major decision over Felippe Willis (Crusaders` Elite) Maj 11-0</li>\n<li>Champ. Round 1 - Nick Lockhart (Sycamore WC) won by major decision over Cera Jones (TJ Trained) Maj 11-0</li>\n<li>Champ. Round 1 - Robert Pizarro (Martinez Fox Valley Elite) won by major decision over Anthony Fioravanti (Junior Cougar WC) Maj 10-0</li>\n<li>Champ. Round 1 - Cole Ferguson (Yorkville WC) won by fall over Parker Spritz (North Shore Edge) Fall 0:58</li>\n<li>Champ. Round 1 - Tommy Curran (Martinez Fox Valley Elite) won by fall over Jack Harman (Golden Eagles WC) Fall 0:47</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Kannon Webster (Super Soldiers WC) won by fall over Cole Peters (TJ Trained-Springfield) Fall 3:45</li>\n<li>Champ. Round 2 - Justin Warmowski (Fox Lake WC) won by decision over Arojae Hart (Murphysboro WC) Dec 3-0</li>\n<li>Champ. Round 2 - Jordan Blew (Force WC) won by fall over Jason Shaw (Roxana Outlaws) Fall 3:00</li>\n<li>Champ. Round 2 - Damari Reed (Harvey Twisters WC) won by tech fall over Garrett Luke (Stockton Renegades) TF 16-1</li>\n<li>Champ. Round 2 - Jack McClimon (Celtic Elite) won by decision over Tyler Simmer (Dakota WC) Dec 9-4</li>\n<li>Champ. Round 2 - Grover Mays (AJ Junior Wildcats WC) won by fall over Joe Mushinsky (TJ Trained) Fall 1:08</li>\n<li>Champ. Round 2 - Andrew Lizak (Lincoln-Way Vittum Cats) won by fall over David Jaffe (SCN Youth WC) Fall 1:21</li>\n<li>Champ. Round 2 - Joseph Fernau (Team 1006 Wrestling) won by decision over Brac Hooper (Champaign WC) Dec 4-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Owen Gerdes (Celtic Elite) won by decision over Gage Reed (Storm Youth WC) Dec 6-3</li>\n<li>Champ. Round 2 - Mia Palumbo (Mean Green Machine) won in tie breaker - 1 over Jack Barracca (Gomez Wrestling Academy) TB-1 1-0</li>\n<li>Champ. Round 2 - Samuel Henkle (Crystal Lake Wizards) won by decision over Drew Kested (Sauk Valley WC) Dec 5-0</li>\n<li>Champ. Round 2 - Grant Matarelli (Edwardsville WC) won by fall over Michael Cestone (Gomez Wrestling Academy) Fall 0:49</li>\n<li>Champ. Round 2 - Luke Barron (Team 1006 Wrestling) won by decision over Caleb Tyus (Bulls WC) Dec 6-4</li>\n<li>Champ. Round 2 - Ethan Stiles (Izzy Style Wrestling) won by fall over James Gardner (Contender Wrestling) Fall 2:25</li>\n<li>Champ. Round 2 - Alex Ventimilla (Martinez Fox Valley Elite) won by fall over Emmett Connolly (Mustang/SKT WC) Fall 2:15</li>\n<li>Champ. Round 2 - Blain Christie (Brawlers WC) won by decision over Hunter Travis (Pontiac WC) Dec 7-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Dayton Hall (Aces WC) won by fall over Cooper Schodrof (Contender Wrestling) Fall 2:54</li>\n<li>Champ. Round 2 - Jack Milos (Arlington Cardinals WC) won by decision over Korina Blades (Martinez Fox Valley Elite) Dec 3-1</li>\n<li>Champ. Round 2 - Ryder Hunkins (Golden Eagles WC) won by decision over Kaden Bray (Celtic Elite) Dec 4-3</li>\n<li>Champ. Round 2 - Mateen Taylor (Harvey Twisters WC) won by major decision over Dominick Reddish (Charleston WC) Maj 13-2</li>\n<li>Champ. Round 2 - Joey Cape (Super Soldiers WC) won by tech fall over Matthew Nevdal (Xtreme WC) TF 15-0</li>\n<li>Champ. Round 2 - Dean Hamiti (Martinez Fox Valley Elite) won by major decision over Caine Tyus (Bulls WC) Maj 13-2</li>\n<li>Champ. Round 2 - Mitchell Rudsinski (Lincoln-Way Vittum Cats) won by fall over Will Carlile (Mt. Olive Cats Kids Wrestling) Fall 4:05</li>\n<li>Champ. Round 2 - Marko Hennin (Barrington Broncos WC) won by decision over Isaiah Immke (Champaign WC) Dec 7-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Tyler Milani (Lincoln-Way Vittum Cats) won by decision over Chase Duffy (Stillman Valley WC) Dec 5-4</li>\n<li>Champ. Round 2 - Michael Rodriguez (Mean Green Machine) won by major decision over Rashon Allen (Urbana Tigers WC) Maj 15-5</li>\n<li>Champ. Round 2 - Zach Bateman (Lincoln-Way Vittum Cats) won by decision over Andrew Johnson (Yorkville WC) Dec 4-1</li>\n<li>Champ. Round 2 - Nain Vazquez (Martinez Fox Valley Elite) won by tech fall over Logan Balosky (Gomez Wrestling Academy) TF 16-1</li>\n<li>Champ. Round 2 - Damien Lopez (Martinez Fox Valley Elite) won by decision over Adam Thebeau (East St. Louis Wrestling) Dec 10-6</li>\n<li>Champ. Round 2 - Jeremy Jakowitsch (Barrington Broncos WC) won by decision over Aj Heeg (Lemont Bears) Dec 5-1</li>\n<li>Champ. Round 2 - Robert Major (Bolingbrook Junior Raiders) won by decision over Michael Caliendo (Batavia WC) Dec 2-1</li>\n<li>Champ. Round 2 - Tavius Hosley (Unity Youth WC) won by fall over Lucas Sutherland (Dakota WC) Fall 1:14</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Brayden Thompson (Izzy Style Wrestling) won by fall over Rayce Zike (Cumberland Youth WC) Fall 3:37</li>\n<li>Champ. Round 2 - Michael Kelly (Tinley Park Bulldogs WC) won by decision over Jacob Liberatore (Bolingbrook Junior Raiders) Dec 2-0</li>\n<li>Champ. Round 2 - Abraham Wojcikiewicz (Bulls WC) won by decision over Nathan Kraus (Yorkville WC) Dec 4-2</li>\n<li>Champ. Round 2 - Bradley Gillum (Martinez Fox Valley Elite) won by decision over Raymond Arebalo (Crosstown Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Brody Hallin (Crystal Lake Wizards) won by decision over Owen Jacobson (Epic Wrestling) Dec 5-2</li>\n<li>Champ. Round 2 - Bryce Boumans (Fox Valley WC) won by decision over Amir Johnson (Lincoln-Way Vittum Cats) Dec 4-1</li>\n<li>Champ. Round 2 - Blake Varga (SCN Youth WC) won by fall over Jackson Creasy (Champions WC) Fall 3:00</li>\n<li>Champ. Round 2 - Cooper Wettig (Izzy Style Wrestling) won by decision over Cory West (Springfield Capitals Kids WC) Dec 6-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Dillon Dublo (Bulls WC) won by tech fall over Matthew Stanley (Tinley Park Bulldogs WC) TF 16-1</li>\n<li>Champ. Round 2 - Grant Hansen (Maddog Wrestling Academy) won by decision over Elijah Chiaro (SCN Youth WC) Dec 3-2</li>\n<li>Champ. Round 2 - Caden Ernd (Crystal Lake Wizards) won by tech fall over Anthony Cantu (Team 1006 Wrestling) TF 15-0</li>\n<li>Champ. Round 2 - Jared Gumila (Force WC) won by fall over Isaiah Lopez (Fox Lake WC) Fall 0:25</li>\n<li>Champ. Round 2 - Jake Matthews (Headlock Wrestling Academy) won by fall over Alexander Tagler (Lincoln-Way Vittum Cats) Fall 4:26</li>\n<li>Champ. Round 2 - Alex Picchi (Crystal Lake Wizards) won by fall over Ivan Corral (Oak Forest Warriors) Fall 2:45</li>\n<li>Champ. Round 2 - Case Harmston (Stockton Renegades) won by major decision over Tom Culp (Champions WC) Maj 10-2</li>\n<li>Champ. Round 2 - Micheal Anderson (Villa Park Young Warriors) won by decision over Iysten Syfert (Cumberland Youth WC) Dec 7-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Marshal Cunz (Harlem Cougars WC) won by fall over Robert Gonzalez (Team 1006 Wrestling) Fall 3:25</li>\n<li>Champ. Round 2 - Anthony Chiaro (SCN Youth WC) won by decision over Kevin Zimmer (Lincoln-Way Vittum Cats) Dec 7-0</li>\n<li>Champ. Round 2 - Jack Hartman (Barrington Broncos WC) won by tech fall over Esther Han (Carbondale WC) TF 16-0</li>\n<li>Champ. Round 2 - Mario Tormey (Tinley Park Bulldogs WC) won by major decision over Zak Kozlowski (Wheaton Warrenville Tiger WC) Maj 13-1</li>\n<li>Champ. Round 2 - Stacey Terry (Harvey Twisters WC) won by fall over Nathan Critchfield (Aces WC) Fall 2:40</li>\n<li>Champ. Round 2 - Kennedy Blades (Martinez Fox Valley Elite) won by tech fall over Mason Spivey (Minooka Indians Elite) TF 15-0</li>\n<li>Champ. Round 2 - Braeden Tosterud (Elk Grove Junior Grens) won by decision over Jayrid Stoltz (Peoria Razorbacks WC) Dec 7-5</li>\n<li>Champ. Round 2 - Evan Stubblefield (Maywood Bucs/Powerhouse) won by decision over Ty Reeter (Springfield Capitals Kids WC) Dec 7-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Robert Gaylord (Redhawk WC) won in overtime over Eathin Diveley (Lil Bucs WC) OT 6-4</li>\n<li>Champ. Round 2 - Joshua Dorr (Greg Gomez Trained Wrestling) won by decision over Connor Brooker (Thundercat Wrestling) Dec 4-3</li>\n<li>Champ. Round 2 - Jason Hermann (Stockton Renegades) won by decision over Angel Guzman (Waukegan Youth WC) Dec 5-2</li>\n<li>Champ. Round 2 - Jacob Mumm (Bolingbrook Junior Raiders) won by fall over Gavin Seymour (Jacksonville Area Wrestling) Fall 0:36</li>\n<li>Champ. Round 2 - William White (Mt. Vernon Lions WC) won by decision over Evan Roper (Barrington Broncos WC) Dec 5-4</li>\n<li>Champ. Round 2 - Buddy Evangelista (Greg Gomez Trained Wrestling) won by decision over Noah Setser (Ottawa Crushers Kids WC) Dec 11-5</li>\n<li>Champ. Round 2 - Andrew Wenzel (Dakota WC) won by fall over Jadon Mims (Maywood Bucs/Powerhouse) Fall 0:58</li>\n<li>Champ. Round 2 - Christopher Carr (Izzy Style Wrestling) won by fall over Grant Albaugh (Champaign WC) Fall 3:00</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Barry Johnson (AJ Junior Wildcats WC) won by decision over Rylee Edwards (Storm Youth WC) Dec 6-2</li>\n<li>Champ. Round 2 - Colin Kohler (Celtic Elite) won by major decision over Connor Barnes (Peoria Heights Minutemen WC) Maj 9-0</li>\n<li>Champ. Round 2 - Michael Mosier (Barrington Broncos WC) won by major decision over Leno Campbell (Harvey Twisters WC) Maj 8-0</li>\n<li>Champ. Round 2 - Mathieu Arsenault (Celtic Elite) won by decision over Michael Roath (SCN Youth WC) Dec 3-1</li>\n<li>Champ. Round 2 - Joey Vinson (Villa-Lombard Cougars) won by decision over Justin Muller (Downers Grove Cougars) Dec 6-0</li>\n<li>Champ. Round 2 - Donald Dorich (Minooka Indians Elite) won by tech fall over Ethan Sperry (Crusaders` Elite) TF 16-0</li>\n<li>Champ. Round 2 - Aidan Roberts (Golden Eagles WC) won by fall over Braden Hunter (Team 1006 Wrestling) Fall 3:51</li>\n<li>Champ. Round 2 - Pate Eastin (Unity Youth WC) won by fall over Chase Michaelis (Carlinville WC) Fall 1:13</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Gavin Keeffer (Stockton Renegades) won by fall over Gabriel Herrera (Martinez Fox Valley Elite) Fall 1:17</li>\n<li>Champ. Round 2 - Colin O`Neill (Wolfpak WC) won by decision over Dillan Johnson (Force WC) Dec 4-0</li>\n<li>Champ. Round 2 - Elliott Lewis (Tinley Park Bulldogs WC) won by fall over Nicholas Eby (Crawford County WC) Fall 2:54</li>\n<li>Champ. Round 2 - Brandon Navarro (Izzy Style Wrestling) won by fall over Luke Childers (Team 1006 Wrestling) Fall 1:00</li>\n<li>Champ. Round 2 - Sean Alletto (Villa-Lombard Cougars) won by fall over Connor Lorden (LP Crunching Cavs) Fall 0:12</li>\n<li>Champ. Round 2 - Sydney Manos (Lil Bucs WC) won by fall over Michael Groen (Crosstown Wrestling) Fall 0:56</li>\n<li>Champ. Round 2 - Joey Braunagel (Crusaders` Elite) won by fall over Rolando Ochoa (Badger WC) Fall 0:40</li>\n<li>Champ. Round 2 - Abel Colunga (Hoopeston Area WC) won by decision over Jacob Sergen (Fuel WC) Dec 5-4</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Ghee Rachal (Harvey Twisters WC) won by fall over Adil Lokhandwala (Fox Valley WC) Fall 0:50</li>\n<li>Champ. Round 2 - Julian Navarro (Team 1006 Wrestling) won by fall over Vicente Arebalo (Crosstown Wrestling) Fall 1:07</li>\n<li>Champ. Round 2 - Benjamin Uribe (Wolfpak WC) won by fall over Isaac Proctor (Roxana Outlaws) Fall 0:38</li>\n<li>Champ. Round 2 - Xander Schnake (Hononegah WC) won by fall over Noah Ross (Rockets Youth WC) Fall 1:11</li>\n<li>Champ. Round 2 - Jacob Morel (Pitbull Wrestling Alliance) won by decision over Aidan Avilez (Martinez Fox Valley Elite) Dec 3-0</li>\n<li>Champ. Round 2 - Ison Robinson (Bolingbrook Junior Raiders) won by fall over Paulie Robertson (Villa-Lombard Cougars) Fall 0:47</li>\n<li>Champ. Round 2 - Nathan Wemstrom (Arlington Cardinals WC) won by fall over Brandon Simmonds (Triad Little Knights WC) Fall 0:55</li>\n<li>Champ. Round 2 - Camren Stinespring (Storm Youth WC) won in tie breaker - 1 over Brenden Watkins (Team 1006 Wrestling) TB-1 1-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Isaiah Gonzalez (Izzy Style Wrestling) won by decision over Evan Christison (Chatham WC) Dec 3-2</li>\n<li>Champ. Round 2 - Luis Cretsinger (Xtreme WC) won by fall over Gabriel Taylor (Mt. Vernon Lions WC) Fall 0:32</li>\n<li>Champ. Round 2 - Brody Goodspeed (Geneva Junior Vikings) won by fall over Gavin Mouser (Vandalia Jr WC) Fall 1:46</li>\n<li>Champ. Round 2 - Kody Mongan (Tiger Town Tanglers WC) won by fall over Lucas Armstrong (Peoria Razorbacks WC) Fall 0:52</li>\n<li>Champ. Round 2 - Ryan Boersma (Tinley Park Bulldogs WC) won by major decision over Carsten Menzer (Sycamore WC) Maj 10-2</li>\n<li>Champ. Round 2 - Aydan Trueblood (TJ Trained) won by fall over Charlie Jagusah (Junior Pioneer WC) Fall 3:42</li>\n<li>Champ. Round 2 - William Penrod (Mt. Vernon Lions WC) won by fall over Jimmy Liston (Martinez Fox Valley Elite) Fall 2:31</li>\n<li>Champ. Round 2 - Tyler Williams (Riverton Youth Wrestling) won by fall over Zander Guttridge (Rockford WC) Fall 0:14</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Malachi Jennings (Manteno Jr Panthers WC) won by fall over Aiden Taylor (Carbondale WC) Fall 0:28</li>\n<li>Champ. Round 2 - Brock Neill (LP Crunching Cavs) won by fall over Oran Varela (Hoopeston Area WC) Fall 0:20</li>\n<li>Champ. Round 2 - Laron Reed (Danville Chargers Wrestling) won by fall over Zach Benson (Batavia WC) Fall 0:30</li>\n<li>Champ. Round 2 - Juan Alvarado (Caravan Kids WC) won by fall over Zachary Griffith (Bulls WC) Fall 0:19</li>\n<li>Champ. Round 2 - Robert Schneider (Celtic Elite) won by fall over Robert Vick (Harvey Twisters WC) Fall 2:19</li>\n<li>Champ. Round 2 - Simon Wilson (Champbuilders Wrestling) won by fall over Colin Sheldon (Sparta Junior Bulldogs) Fall 2:56</li>\n<li>Champ. Round 2 - Joey Graham (Celtic Elite) won by fall over Noah Carl (Cumberland Youth WC) Fall 0:40</li>\n<li>Champ. Round 2 - Hayden Copass (Storm Youth WC) won by fall over Jason Johnston (Metamora Kids WC) Fall 2:05</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Saul Trejo (Gomez Wrestling Academy) won by decision over Trevor Silzer (Tinley Park Bulldogs WC) Dec 4-0</li>\n<li>Champ. Round 2 - Dominic Ducato (Golden Eagles WC) won by major decision over Isaac Middendorf (Benton WC) Maj 10-0</li>\n<li>Champ. Round 2 - Inocencio Garcia (Force WC) won by decision over Bryce Durlacher (The Wrestling Factory) Dec 2-1</li>\n<li>Champ. Round 2 - Connor Kidd (TJ Trained) won by fall over Chase Hampton (Greg Gomez Trained Wrestling) Fall 3:37</li>\n<li>Champ. Round 2 - Tyler Aters (Martinez Fox Valley Elite) won by decision over Payton Murphy (TJ Trained) Dec 6-0</li>\n<li>Champ. Round 2 - Chance Arlt-Seip (Triad Little Knights WC) won by decision over Joshua Glover (Crystal Lake Wizards) Dec 8-6</li>\n<li>Champ. Round 2 - Jameson Garcia (Gomez Wrestling Academy) won by major decision over Aaron Meenen (Sauk Valley WC) Maj 12-4</li>\n<li>Champ. Round 2 - Shay Korhorn (Force WC) won by decision over Korbin Bateman (Mattoon Youth WC) Dec 2-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Carter Rude (Sauk Valley WC) won by fall over Robert Bonilla (Mustang/SKT WC) Fall 0:38</li>\n<li>Champ. Round 2 - Antonio Alvarado (Belvidere Bandits WC) won by tech fall over Henry Locker (Downers Grove Cougars) TF 15-0</li>\n<li>Champ. Round 2 - Samuel Hayes (Contender Wrestling) won by fall over Collin Carrigan (Naperville WC) Fall 1:58</li>\n<li>Champ. Round 2 - Maurice Dotson (Junior Comanche WC) won by decision over Trevor Reed (Harvey Twisters WC) Dec 3-1</li>\n<li>Champ. Round 2 - Joseph McDermott (Force WC) won by decision over Brandon Krier (Martinez Fox Valley Elite) Dec 6-4</li>\n<li>Champ. Round 2 - Phoenix Mordick (Dakota WC) won by fall over Alexander Marre (Gomez Wrestling Academy) Fall 0:58</li>\n<li>Champ. Round 2 - Joey Malito (Celtic Elite) won in tie breaker - 1 over Pierre Baldwin (Maywood Bucs/Powerhouse) TB-1 9-8</li>\n<li>Champ. Round 2 - Avery Speck (TJ Trained) won in sudden victory - 1 over Marquan Shaw (Lionheart Intense Wrestling) SV-1 9-7</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Billy Meiszner (Lincoln-Way Vittum Cats) won by decision over Edmund Enright (Mustang/SKT WC) Dec 7-3</li>\n<li>Champ. Round 2 - Jesse Hahs (SIWA) won by tech fall over Samuel Ohl (Metamora Kids WC) TF 16-0</li>\n<li>Champ. Round 2 - Caden Muselman (Tinley Park Bulldogs WC) won by fall over Cody Tavoso (Martinez Fox Valley Elite) Fall 1:56</li>\n<li>Champ. Round 2 - Daniel Sheen (Izzy Style Wrestling) won by decision over Colin Young (Belvidere Bandits WC) Dec 5-0</li>\n<li>Champ. Round 2 - Jacob Macatangay (Force WC) won by fall over Isaac Thomas (Midwest Central Youth WC) Fall 0:53</li>\n<li>Champ. Round 2 - Maddux Mordick (Dakota WC) won by fall over Aaron Niemeyer (Roxana Outlaws) Fall 0:20</li>\n<li>Champ. Round 2 - Tyler Guerra (Gomez Wrestling Academy) won by major decision over Owen Dunlap (Tinley Park Bulldogs WC) Maj 12-4</li>\n<li>Champ. Round 2 - Carter Hall (Champaign WC) won by decision over Logan Kuhel-Trimmer (Force WC) Dec 9-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Kenyon Boyce (Harvey Twisters WC) won by fall over Matthew Poniatowski (Martinez Fox Valley Elite) Fall 4:09</li>\n<li>Champ. Round 2 - Nicholas Gonzalez (Gomez Wrestling Academy) won by fall over Mason Alessio (Celtic Elite) Fall 3:39</li>\n<li>Champ. Round 2 - Charlie Farmer (Young Guns Wrestling) won by major decision over Seth Larson (Force WC) Maj 11-0</li>\n<li>Champ. Round 2 - Chase Hall (Triad Little Knights WC) won by decision over Joel Mylin (Golden Eagles WC) Dec 1-0</li>\n<li>Champ. Round 2 - Christopher Moore (Crystal Lake Wizards) won by decision over Keegan Roberson (Lincoln-Way Vittum Cats) Dec 3-1</li>\n<li>Champ. Round 2 - Santino Robinson (Wrestling 365) won by decision over Connor Munn (Pitbull Wrestling Alliance) Dec 10-3</li>\n<li>Champ. Round 2 - Nasir Bailey (Harvey Twisters WC) won by tech fall over Noah Manuel Tapia (Young Guns Wrestling) TF 21-6</li>\n<li>Champ. Round 2 - Cajaun Johnson (Urbana Tigers WC) won by fall over Zachary White (The Law) Fall 4:25</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Presley Beasley (Crystal Lake Wizards) won by fall over Aidan Waszak (Greg Gomez Trained Wrestling) Fall 0:57</li>\n<li>Champ. Round 2 - Vincent Zerban (Bulls WC) won by fall over Terrance Snapp (Will County Warriors) Fall 4:04</li>\n<li>Champ. Round 2 - Kyle Schickel (Celtic Elite) won by decision over Ryan Haynes (Pekin Boys &amp; Girls Club) Dec 7-0</li>\n<li>Champ. Round 2 - Kai Conway (Gomez Wrestling Academy) won by decision over Michael D`Orazio (SCN Youth WC) Dec 7-0</li>\n<li>Champ. Round 2 - Kaleb Thompson (Bolingbrook Junior Raiders) won by decision over Cameron Domke (The Wrestling Factory) Dec 8-1</li>\n<li>Champ. Round 2 - Ben Lunn (Edwardsville WC) won by decision over Jimmy Ruston (Lions WC) Dec 7-1</li>\n<li>Champ. Round 2 - Cameron Johnson (Martinez Fox Valley Elite) won by decision over Sean Crump (Izzy Style Wrestling) Dec 3-0</li>\n<li>Champ. Round 2 - Trey Pearcy (Charleston WC) won by decision over Grant Woodruff (TJ Trained) Dec 4-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Ezekiel Hulet (Super Soldiers WC) won by fall over Matthew Cozzi (Elmhurst Jr Dukes) Fall 1:25</li>\n<li>Champ. Round 2 - Joel Vandervere (The Wrestling Factory) won by fall over Colin Suyko (Cary Matmen WC) Fall 0:45</li>\n<li>Champ. Round 2 - Payton Geigner (Lincoln-Way Vittum Cats) won by major decision over Isaiah Bernal (Crusaders` Elite) Maj 9-0</li>\n<li>Champ. Round 2 - Joshua Ogunsanya (Harvey Twisters WC) won by fall over Jacob Milliman (Hawk WC Ltd.) Fall 2:04</li>\n<li>Champ. Round 2 - John McDermott (Force WC) won by fall over Andrew Lira (Crystal Lake Wizards) Fall 3:49</li>\n<li>Champ. Round 2 - Luke Odom (Edwardsville WC) won by fall over Billy Taylor (Junior Pioneer WC) Fall 0:56</li>\n<li>Champ. Round 2 - Alex Villar (Bolingbrook Junior Raiders) won by major decision over Peyton Schroeder (SCN Youth WC) Maj 8-0</li>\n<li>Champ. Round 2 - Kyle Tunink (Sauk Valley WC) won by fall over Tomas Reed (Lionheart Intense Wrestling) Fall 3:00</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Grant Laduke (Celtic Elite) won by major decision over Austin McConaha (Champaign WC) Maj 11-0</li>\n<li>Champ. Round 2 - Connor Gaynor (Tinley Park Bulldogs WC) won by fall over Aric Nieves (Team 1006 Wrestling) Fall 0:36</li>\n<li>Champ. Round 2 - Tristan Daugherty (Central Illinois Wrestling Academy) won in tie breaker - 1 over Jake Harrier (Golden Eagles WC) TB-1 4-2</li>\n<li>Champ. Round 2 - Christian Valadez (Waukegan Youth WC) won by decision over Jacob Bornemann (Team Mascoutah WC) Dec 6-3</li>\n<li>Champ. Round 2 - Christian Goin (Super Soldiers WC) won by fall over Melvin Rogers (East St. Louis Wrestling) Fall 1:22</li>\n<li>Champ. Round 2 - Nicholas Bolivar (Gomez Wrestling Academy) won by tech fall over Jack Coyle (Mustang/SKT WC) TF 18-3</li>\n<li>Champ. Round 2 - Zeke Marshall (Martinez Fox Valley Elite) won by decision over Bryce Shelton (Crystal Lake Wizards) Dec 7-2</li>\n<li>Champ. Round 2 - Sam Emery (Celtic Elite) won by fall over Logan Peters (TJ Trained-Springfield) Fall 4:27</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Donovan Golden (Brawlers WC) won by decision over Carlos Sanchez (Lil Bucs WC) Dec 5-1</li>\n<li>Champ. Round 2 - Anthony Federico (O`Fallon Little Panthers WC) won by decision over Matthew Zuber (Redhawk WC) Dec 3-1</li>\n<li>Champ. Round 2 - Rocco Iannantone (Lincoln-Way Vittum Cats) won by tech fall over Jacob Sollberger (Super Soldiers WC) TF 15-0</li>\n<li>Champ. Round 2 - Fabian Lopez (Martinez Fox Valley Elite) won by fall over Tuvshinjargal Zuunbayan (Pitbull Wrestling Alliance) Fall 3:52</li>\n<li>Champ. Round 2 - Jacob Tinajero (SCN Youth WC) won in overtime over William Hillard (Triad Little Knights WC) OT 5-3</li>\n<li>Champ. Round 2 - Dylan Rinkenberger (Fox Lake WC) won by fall over Raymond Hernandez (Mustang/SKT WC) Fall 3:37</li>\n<li>Champ. Round 2 - James Pierandozzi (Bolingbrook Junior Raiders) won by major decision over Reese Martin (Glenbard East Jr Rams) Maj 14-5</li>\n<li>Champ. Round 2 - Logan Deacetis (Prairie Central Hawks) won by major decision over Alex Epstein (Golden Eagles WC) Maj 13-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Cole Watkins (Super Soldiers WC) won by decision over Luke Bennett (Stillman Valley WC) Dec 9-3</li>\n<li>Champ. Round 2 - Noah Villarreal (Martinez Fox Valley Elite) won by fall over Jake Viloria (Little Huskies WC) Fall 1:05</li>\n<li>Champ. Round 2 - Jacob Averett (Team Mascoutah WC) won by decision over Dane Thorne (Brawlers WC) Dec 3-1</li>\n<li>Champ. Round 2 - Danny Pucino (The Wrestling Factory) won by decision over Drew Nash (Lemont Bears) Dec 10-8</li>\n<li>Champ. Round 2 - Jackson Certa (Martinez Fox Valley Elite) won by decision over Rukkus Hunkins (Golden Eagles WC) Dec 4-2</li>\n<li>Champ. Round 2 - Sincere Bailey (Harvey Twisters WC) won by tech fall over Christopher Worcester (Villa-Lombard Cougars) TF 18-3</li>\n<li>Champ. Round 2 - Zachary Kolb (Force WC) won by fall over Jack Riemer (Pitbull Wrestling Alliance) Fall 1:08</li>\n<li>Champ. Round 2 - Ryan Gardner (Iguana WC) won by fall over Adam Meenen (Sauk Valley WC) Fall 0:22</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Dylan Connell (The Wrestling Factory) won by fall over Winston McPeek (Stockton Renegades) Fall 2:00</li>\n<li>Champ. Round 2 - Jake Mensik (Bolingbrook Junior Raiders) won by decision over Kyle Zator (Lemont Bears) Dec 6-1</li>\n<li>Champ. Round 2 - Kaden Beeler (Edwardsville WC) won by decision over Cole Pradel (Team 1006 Wrestling) Dec 6-1</li>\n<li>Champ. Round 2 - Ashton Breen (Bolingbrook Junior Raiders) won by major decision over Qayin Dabney (Martinez Fox Valley Elite) Maj 10-2</li>\n<li>Champ. Round 2 - Chad Richards (Harlem Cougars WC) won by fall over Caleb Snoddy (Harvey Twisters WC) Fall 1:45</li>\n<li>Champ. Round 2 - Kevin Countryman (Celtic Elite) won by major decision over Brian Stacy (The Wrestling Factory) Maj 10-1</li>\n<li>Champ. Round 2 - Jack Patting (Young Guns Wrestling) won by decision over Peyton Bechtold (Bulls WC) Dec 7-6</li>\n<li>Champ. Round 2 - Daemyen Middlebrooks (Little Huskies WC) won by fall over Daniel Stewart (Springfield Capitals Kids WC) Fall 3:47</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Bitner (Little Rams Wrestling) won by decision over William Zupanci (Edwardsville WC) Dec 9-2</li>\n<li>Champ. Round 2 - Preston Berry (Greg Gomez Trained Wrestling) won in sudden victory - 1 over Alejandro Mejia (Pitbull Wrestling Alliance) SV-1 6-4</li>\n<li>Champ. Round 2 - Logan Lagerhausen (Stillman Valley WC) won by fall over Griffin Watts (Midwest Central Youth WC) Fall 3:34</li>\n<li>Champ. Round 2 - Isaiah Parker (The Wrestling Factory) won by decision over Alexander Lalezas (Bolingbrook Junior Raiders) Dec 5-3</li>\n<li>Champ. Round 2 - Zeke Waltz (Jersey Junior Panthers Wrestling) won by decision over Alonzo Smiley (Gomez Wrestling Academy) Dec 7-4</li>\n<li>Champ. Round 2 - Noah Alsguson (Harvey Twisters WC) won by fall over Sean Larkin (Fox Valley WC) Fall 0:39</li>\n<li>Champ. Round 2 - Victor Guzman (Rock Island WC) won by fall over Jakob Wheeler (Celtic Elite) Fall 2:58</li>\n<li>Champ. Round 2 - Cole Gaddis (Hoopeston Area WC) won by decision over Joseph Franke (Naperville WC) Dec 6-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Antonio Figueroa (Hononegah WC) won by tech fall over Brandon Lawver (Rock Island WC) TF 15-0</li>\n<li>Champ. Round 2 - Ian Swidergal (Celtic Elite) won by decision over Brady Christeson (Bulls WC) Dec 13-12</li>\n<li>Champ. Round 2 - Jordan Chisum (Zee-Bee Stingers WC) won by major decision over Simon Weakley (Edwardsville WC) Maj 14-3</li>\n<li>Champ. Round 2 - Fidel Mayora (Epic Wrestling) won by fall over Elias Richardson (Team TopNotch Wrestling) Fall 1:51</li>\n<li>Champ. Round 2 - Eric Epenesa (Edwardsville WC) won by decision over Mustafa St. Clair (Harvey Twisters WC) Dec 12-6</li>\n<li>Champ. Round 2 - Nathan Love (Greg Gomez Trained Wrestling) won in overtime over Kaydon Norkus (Force WC) OT 5-3</li>\n<li>Champ. Round 2 - Luke Rasmussen (Barrington Broncos WC) won by major decision over Jaiden Vancoillie (Rock Island WC) Maj 14-3</li>\n<li>Champ. Round 2 - Bradley Peters (Cary Matmen WC) won by fall over Wyatt Wright (Cumberland Youth WC) Fall 2:29</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Grant Ripperda (Springfield Capitals Kids WC) won by fall over Donovan Dolittle (Badger WC) Fall 0:41</li>\n<li>Champ. Round 2 - Joseph Parrish (Fox Valley WC) won by fall over Joey Rowan (Somonauk Wrestlers Club) Fall 4:23</li>\n<li>Champ. Round 2 - Sean Swinkle (St. Tarcissus WC) won by decision over Brenden Parks (Crystal Lake Wizards) Dec 4-0</li>\n<li>Champ. Round 2 - Jeffrey Tyler (Granite City Wrestling Association) won by decision over Blair Diefenbach (Force WC) Dec 5-2</li>\n<li>Champ. Round 2 - Caleb Grau (Team Mascoutah WC) won by major decision over Thomas Luedke (Celtic Elite) Maj 13-2</li>\n<li>Champ. Round 2 - Josh Labarbera (Martinez Fox Valley Elite) won by fall over Robert Bates (Little Redskins WC) Fall 2:28</li>\n<li>Champ. Round 2 - Tommy Evans (Wolves WC) won by fall over Tyler Filippini (Lemont Bears) Fall 3:42</li>\n<li>Champ. Round 2 - Dalton Hall (Champaign WC) won by fall over Baltazar Cabrales (Sharks WC) Fall 0:50</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Blake Moss (Edwardsville WC) won by fall over Cole Baumgartner (Sycamore WC) Fall 1:15</li>\n<li>Champ. Round 2 - Vincent Querciagrossa (Metamora Kids WC) won by decision over Jose Nunez (Peoria Razorbacks WC) Dec 5-0</li>\n<li>Champ. Round 2 - Mikey Bosco (Tinley Park Bulldogs WC) won by fall over Xavier Sierra (Headlock Wrestling Academy) Fall 2:12</li>\n<li>Champ. Round 2 - Carter Maggio (St. Charles WC) won by fall over Wyatt Griggel (Red Raiders Wrestling Team) Fall 2:07</li>\n<li>Champ. Round 2 - Quintin Hamilton (Evanston School of Wrestling) won by fall over Shawn Fichtel (Batavia WC) Fall 1:02</li>\n<li>Champ. Round 2 - Nick Stemmet (Bolingbrook Junior Raiders) won by tech fall over River Flute (West Frankfort Jr. Redbirds) TF 16-1</li>\n<li>Champ. Round 2 - Vincent Clinite (Z`s Team Pena) won by decision over Anthony Tovar (Moline WC) Dec 7-1</li>\n<li>Champ. Round 2 - Logan Wilson (Champaign WC) won by fall over Hunter Boyd (Triad Little Knights WC) Fall 0:51</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Tyler McCracken (Edwardsville WC) won by decision over Dane McMahon (Scorpion WC) Dec 9-2</li>\n<li>Champ. Round 2 - Robert Guss (Pitbull Wrestling Alliance) won by decision over Dominic Sherman (Lincoln-Way Vittum Cats) Dec 7-4</li>\n<li>Champ. Round 2 - Reide Wilson (Granite City Wrestling Association) won by decision over Santino Blanco (Morton Little Mustangs) Dec 3-0</li>\n<li>Champ. Round 2 - Tyson Heerman (TJ Trained) won by fall over Josiah Kerney (Waukegan Youth WC) Fall 2:03</li>\n<li>Champ. Round 2 - Anthony Glauser (The Wrestling Factory) won by tech fall over Jason Bridgewater (Midwest Central Youth WC) TF 18-3</li>\n<li>Champ. Round 2 - Peyton Lind (Xtreme WC) won by fall over Apollo Gothard (Lemont Bears) Fall 0:39</li>\n<li>Champ. Round 2 - Connor Eaton (West Frankfort Jr. Redbirds) won by decision over Julian Ramirez (Tinley Park Bulldogs WC) Dec 6-3</li>\n<li>Champ. Round 2 - Cade Scott (Unity Youth WC) won by fall over Brian Salinas (DuPage WC) Fall 1:21</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Justin Allen (Prairie Central Hawks) won by fall over Kyle Devitt (Lemont Bears) Fall 0:21</li>\n<li>Champ. Round 2 - Thomas Doyle (Lincoln-Way Vittum Cats) won by major decision over Tyler Berhenke (Champbuilders Wrestling) Maj 11-0</li>\n<li>Champ. Round 2 - Nicholas Skamra (Headlock Wrestling Academy) won by fall over Rewn Stearns (Murphysboro WC) Fall 0:51</li>\n<li>Champ. Round 2 - Alvin Maten (Harlem Cougars WC) won by fall over Jacob Perez (Martinez Fox Valley Elite) Fall 1:26</li>\n<li>Champ. Round 2 - Cesar Resendiz (DuPage WC) won in overtime over Jared Dowell (Pekin Boys &amp; Girls Club) OT 3-2</li>\n<li>Champ. Round 2 - Trevor Swier (Force WC) won by fall over Garret Moser (Hawk WC Ltd.) Fall 0:41</li>\n<li>Champ. Round 2 - Jaylin Garay (Villa-Lombard Cougars) won by fall over Dayton Baue (Sparta Junior Bulldogs) Fall 2:29</li>\n<li>Champ. Round 2 - Brandon Hoselton (Prairie Central Hawks) won by fall over Joey Wolny (Sycamore WC) Fall 0:40</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Victor Rodriguez (Villa-Lombard Cougars) won by fall over Basilo Betancourt (Harvey Twisters WC) Fall 1:08</li>\n<li>Champ. Round 2 - Jesse Helfrich (West Frankfort Jr. Redbirds) won by fall over Tyler Ray (Belvidere Bandits WC) Fall 2:15</li>\n<li>Champ. Round 2 - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Ryan Norwood (Team Mascoutah WC) Fall 0:40</li>\n<li>Champ. Round 2 - Jacob Shipla (Minooka Indians Elite) won by major decision over John Bergman (Lions WC) Maj 15-2</li>\n<li>Champ. Round 2 - Partick Peters (Tinley Park Bulldogs WC) won by fall over Alex Bernardino (Villa Park Young Warriors) Fall 3:32</li>\n<li>Champ. Round 2 - Jonathan Lopez (Waukegan Youth WC) won by fall over Nathan Tomaso (Villa-Lombard Cougars) Fall 1:10</li>\n<li>Champ. Round 2 - Dustin Olmstead (Belleville Little Devils WC) won by fall over Jalen Farmer (St. Charles WC) Fall 4:21</li>\n<li>Champ. Round 2 - Caleb Pforr (Charleston WC) won by fall over Franco Fontela (Maddog Wrestling Academy) Fall 0:18</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Drew Gutknecht (Minooka Indians Elite) won by major decision over Lloyd Reynolds (Edwardsville WC) Maj 8-0</li>\n<li>Champ. Round 2 - Zachary Wallace (Moline WC) won by decision over Blake Kunkel (Geneva Junior Vikings) Dec 5-4</li>\n<li>Champ. Round 2 - Colin Baker (Downers Grove Cougars) won by decision over Peter Gianaris (Maine Eagles WC) Dec 2-1</li>\n<li>Champ. Round 2 - Luke Schwarze (Dakota WC) won by fall over Stephen Ostresh (Granite City Wrestling Association) Fall 4:11</li>\n<li>Champ. Round 2 - Nikolas Mishka (Tinley Park Bulldogs WC) won by fall over Evan Hissong (Cary Matmen WC) Fall 0:44</li>\n<li>Champ. Round 2 - Mason Baker (O`Fallon Little Panthers WC) won by fall over Nicolas Munoz (Team TopNotch Wrestling) Fall 1:07</li>\n<li>Champ. Round 2 - Cody Goodman (The Wrestling Factory) won by fall over Angel Jaimes (Martinez Fox Valley Elite) Fall 3:40</li>\n<li>Champ. Round 2 - Dawson Pruitt (Storm Youth WC) won by fall over Xavier Jean-Simon (HF Spartan Elite WC) Fall 2:22</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Andrew Velazquez (St. Charles WC) won by fall over Farouk Shaaban (Barrington Broncos WC) Fall 0:31</li>\n<li>Champ. Round 2 - Tyler Elsbury (Xtreme WC) won by fall over Derick Platt (Team 1006 Wrestling) Fall 0:25</li>\n<li>Champ. Round 2 - Patrick Turner (Force WC) won by fall over Ryan Hannah (Maywood Bucs/Powerhouse) Fall 4:05</li>\n<li>Champ. Round 2 - Anthony Enlow (Vandalia Jr WC) won by fall over Payton Piraino (LP Crunching Cavs) Fall 0:34</li>\n<li>Champ. Round 2 - Martin Cortina (Force WC) won by fall over Andrew Kaltmeyer (Edwardsville WC) Fall 4:13</li>\n<li>Champ. Round 2 - Michael Dubanowski (Rockets Youth WC) won by fall over Cobie Underwood (Moline WC) Fall 4:01</li>\n<li>Champ. Round 2 - Pedro Castanon (Villa-Lombard Cougars) won by fall over Amner Bustos (Z`s Team Pena) Fall 1:20</li>\n<li>Champ. Round 2 - Randy Turner (Team Mascoutah WC) won by fall over Bradlee Kinney (Hoopeston Area WC) Fall 1:57</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Cameron Clark (TJ Trained) won by tech fall over Cooper Mikolajczak (Lemont Bears) TF 15-0</li>\n<li>Champ. Round 2 - Christian Olsen (Crystal Lake Wizards) won by fall over James Marre (Gomez Wrestling Academy) Fall 2:19</li>\n<li>Champ. Round 2 - Jack Finnegan (Force WC) won by fall over Cameron Varner (Junior Kahoks) Fall 2:00</li>\n<li>Champ. Round 2 - Ronan Schuelke (Maddog Wrestling Academy) won by decision over Brennden Cobine (Roxana Outlaws) Dec 3-2</li>\n<li>Champ. Round 2 - Joseph Knapp (Brawlers WC) won by fall over Colin Sons (SCN Youth WC) Fall 3:52</li>\n<li>Champ. Round 2 - John Asiuras (Headlock Wrestling Academy) won by fall over Drew Lehn (The Wrestling Factory) Fall 4:05</li>\n<li>Champ. Round 2 - Dylan Amico (Force WC) won by major decision over Marco Nash (Harvey Twisters WC) Maj 10-0</li>\n<li>Champ. Round 2 - Benjamin Mitchell (O`Fallon Little Panthers WC) won by fall over Patrick Hug (Force WC) Fall 1:14</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Joe Roti (Lincoln-Way Vittum Cats) won by decision over Michael Crawford (Sycamore WC) Dec 4-2</li>\n<li>Champ. Round 2 - Joshua Koderhandt (Crusaders` Elite) won by fall over Isaac Tabels (Hoopeston Area WC) Fall 0:23</li>\n<li>Champ. Round 2 - Alex Randell (Greg Gomez Trained Wrestling) won by fall over Brandon Edelen (Oak Forest Warriors) Fall 4:11</li>\n<li>Champ. Round 2 - Malakye Rodriguez (Red Raiders Wrestling Team) won by tech fall over Gavin Ranquist (Headlock Wrestling Academy) TF 15-0</li>\n<li>Champ. Round 2 - Gabriel Hinkle (Celtic Elite) won in overtime over Matthew Harris (Tiger Town Tanglers WC) OT 4-2</li>\n<li>Champ. Round 2 - Andrew Herbst (Hawk WC Ltd.) won by decision over Jarek Wehrle (Vandalia Jr WC) Dec 6-0</li>\n<li>Champ. Round 2 - Jacob Rundell (Little Huskies WC) won by fall over Jake Penzato (St. Charles WC) Fall 1:01</li>\n<li>Champ. Round 2 - Matthew Minick (O`Fallon Little Panthers WC) won by major decision over Nick Kotiw (Champaign WC) Maj 14-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Diego Sotelo (Martinez Fox Valley Elite) won by fall over Michael Kass (Mean Green Machine) Fall 1:16</li>\n<li>Champ. Round 2 - Khai Stephens (Manteno Jr Panthers WC) won by major decision over Jonathan Chaidez (Headlock Wrestling Academy) Maj 11-1</li>\n<li>Champ. Round 2 - Javen Estrada (Bolingbrook Junior Raiders) won by major decision over Connor Speck (TJ Trained) Maj 16-2</li>\n<li>Champ. Round 2 - Joey Chirillo (Tinley Park Bulldogs WC) won by decision over Peyton Timmons (Red Raiders Wrestling Team) Dec 3-0</li>\n<li>Champ. Round 2 - Nicholas Matthias (Celtic Elite) won by tech fall over Nick Lockhart (Sycamore WC) TF 15-0</li>\n<li>Champ. Round 2 - Jalen May (Crusaders` Elite) won by decision over Robert Pizarro (Martinez Fox Valley Elite) Dec 5-0</li>\n<li>Champ. Round 2 - Kendall Norfleet (Harvey Twisters WC) won by decision over Cole Ferguson (Yorkville WC) Dec 6-3</li>\n<li>Champ. Round 2 - Kaeden Kinison (Springfield Capitals Kids WC) won by decision over Tommy Curran (Martinez Fox Valley Elite) Dec 2-0</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Kannon Webster (Super Soldiers WC) won by decision over Justin Warmowski (Fox Lake WC) Dec 6-2</li>\n<li>Quarterfinal - Jordan Blew (Force WC) won by decision over Damari Reed (Harvey Twisters WC) Dec 5-2</li>\n<li>Quarterfinal - Grover Mays (AJ Junior Wildcats WC) won by decision over Jack McClimon (Celtic Elite) Dec 7-2</li>\n<li>Quarterfinal - Joseph Fernau (Team 1006 Wrestling) won by decision over Andrew Lizak (Lincoln-Way Vittum Cats) Dec 4-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Owen Gerdes (Celtic Elite) won by decision over Mia Palumbo (Mean Green Machine) Dec 6-5</li>\n<li>Quarterfinal - Grant Matarelli (Edwardsville WC) won by fall over Samuel Henkle (Crystal Lake Wizards) Fall 3:00</li>\n<li>Quarterfinal - Ethan Stiles (Izzy Style Wrestling) won by decision over Luke Barron (Team 1006 Wrestling) Dec 8-4</li>\n<li>Quarterfinal - Alex Ventimilla (Martinez Fox Valley Elite) won by decision over Blain Christie (Brawlers WC) Dec 11-6</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Jack Milos (Arlington Cardinals WC) won by decision over Dayton Hall (Aces WC) Dec 7-2</li>\n<li>Quarterfinal - Mateen Taylor (Harvey Twisters WC) won in sudden victory - 1 over Ryder Hunkins (Golden Eagles WC) SV-1 4-2</li>\n<li>Quarterfinal - Dean Hamiti (Martinez Fox Valley Elite) won by major decision over Joey Cape (Super Soldiers WC) Maj 16-2</li>\n<li>Quarterfinal - Marko Hennin (Barrington Broncos WC) won by decision over Mitchell Rudsinski (Lincoln-Way Vittum Cats) Dec 2-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Michael Rodriguez (Mean Green Machine) won by decision over Tyler Milani (Lincoln-Way Vittum Cats) Dec 8-2</li>\n<li>Quarterfinal - Nain Vazquez (Martinez Fox Valley Elite) won by fall over Zach Bateman (Lincoln-Way Vittum Cats) Fall 2:53</li>\n<li>Quarterfinal - Damien Lopez (Martinez Fox Valley Elite) won by decision over Jeremy Jakowitsch (Barrington Broncos WC) Dec 7-3</li>\n<li>Quarterfinal - Robert Major (Bolingbrook Junior Raiders) won by major decision over Tavius Hosley (Unity Youth WC) Maj 13-4</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Brayden Thompson (Izzy Style Wrestling) won by decision over Michael Kelly (Tinley Park Bulldogs WC) Dec 4-3</li>\n<li>Quarterfinal - Bradley Gillum (Martinez Fox Valley Elite) won by major decision over Abraham Wojcikiewicz (Bulls WC) Maj 15-3</li>\n<li>Quarterfinal - Brody Hallin (Crystal Lake Wizards) won by decision over Bryce Boumans (Fox Valley WC) Dec 6-4</li>\n<li>Quarterfinal - Cooper Wettig (Izzy Style Wrestling) won by major decision over Blake Varga (SCN Youth WC) Maj 12-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Grant Hansen (Maddog Wrestling Academy) won by fall over Dillon Dublo (Bulls WC) Fall 0:52</li>\n<li>Quarterfinal - Jared Gumila (Force WC) won by decision over Caden Ernd (Crystal Lake Wizards) Dec 6-1</li>\n<li>Quarterfinal - Jake Matthews (Headlock Wrestling Academy) won by fall over Alex Picchi (Crystal Lake Wizards) Fall 2:35</li>\n<li>Quarterfinal - Case Harmston (Stockton Renegades) won by tech fall over Micheal Anderson (Villa Park Young Warriors) TF 21-6</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Anthony Chiaro (SCN Youth WC) won by decision over Marshal Cunz (Harlem Cougars WC) Dec 6-0</li>\n<li>Quarterfinal - Jack Hartman (Barrington Broncos WC) won by decision over Mario Tormey (Tinley Park Bulldogs WC) Dec 9-6</li>\n<li>Quarterfinal - Kennedy Blades (Martinez Fox Valley Elite) won by major decision over Stacey Terry (Harvey Twisters WC) Maj 12-0</li>\n<li>Quarterfinal - Braeden Tosterud (Elk Grove Junior Grens) won by fall over Evan Stubblefield (Maywood Bucs/Powerhouse) Fall 2:26</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Robert Gaylord (Redhawk WC) won in tie breaker - 1 over Joshua Dorr (Greg Gomez Trained Wrestling) TB-1 3-2</li>\n<li>Quarterfinal - Jason Hermann (Stockton Renegades) won by major decision over Jacob Mumm (Bolingbrook Junior Raiders) Maj 12-1</li>\n<li>Quarterfinal - Buddy Evangelista (Greg Gomez Trained Wrestling) won by decision over William White (Mt. Vernon Lions WC) Dec 4-3</li>\n<li>Quarterfinal - Andrew Wenzel (Dakota WC) won by fall over Christopher Carr (Izzy Style Wrestling) Fall 2:26</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Colin Kohler (Celtic Elite) won by decision over Barry Johnson (AJ Junior Wildcats WC) Dec 1-0</li>\n<li>Quarterfinal - Mathieu Arsenault (Celtic Elite) won by fall over Michael Mosier (Barrington Broncos WC) Fall 1:53</li>\n<li>Quarterfinal - Donald Dorich (Minooka Indians Elite) won by fall over Joey Vinson (Villa-Lombard Cougars) Fall 2:32</li>\n<li>Quarterfinal - Pate Eastin (Unity Youth WC) won by decision over Aidan Roberts (Golden Eagles WC) Dec 6-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Colin O`Neill (Wolfpak WC) won by decision over Gavin Keeffer (Stockton Renegades) Dec 2-0</li>\n<li>Quarterfinal - Brandon Navarro (Izzy Style Wrestling) won by fall over Elliott Lewis (Tinley Park Bulldogs WC) Fall 2:05</li>\n<li>Quarterfinal - Sean Alletto (Villa-Lombard Cougars) won by major decision over Sydney Manos (Lil Bucs WC) Maj 12-1</li>\n<li>Quarterfinal - Joey Braunagel (Crusaders` Elite) won by decision over Abel Colunga (Hoopeston Area WC) Dec 12-6</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Julian Navarro (Team 1006 Wrestling) won by decision over Ghee Rachal (Harvey Twisters WC) Dec 4-0</li>\n<li>Quarterfinal - Xander Schnake (Hononegah WC) won by fall over Benjamin Uribe (Wolfpak WC) Fall 2:51</li>\n<li>Quarterfinal - Ison Robinson (Bolingbrook Junior Raiders) won in tie breaker - 1 over Jacob Morel (Pitbull Wrestling Alliance) TB-1 2-1</li>\n<li>Quarterfinal - Nathan Wemstrom (Arlington Cardinals WC) won by fall over Camren Stinespring (Storm Youth WC) Fall 2:28</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Luis Cretsinger (Xtreme WC) won by fall over Isaiah Gonzalez (Izzy Style Wrestling) Fall 0:57</li>\n<li>Quarterfinal - Brody Goodspeed (Geneva Junior Vikings) won by fall over Kody Mongan (Tiger Town Tanglers WC) Fall 0:59</li>\n<li>Quarterfinal - Aydan Trueblood (TJ Trained) won by decision over Ryan Boersma (Tinley Park Bulldogs WC) Dec 6-3</li>\n<li>Quarterfinal - Tyler Williams (Riverton Youth Wrestling) won by decision over William Penrod (Mt. Vernon Lions WC) Dec 8-4</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Brock Neill (LP Crunching Cavs) won by decision over Malachi Jennings (Manteno Jr Panthers WC) Dec 3-2</li>\n<li>Quarterfinal - Laron Reed (Danville Chargers Wrestling) won by fall over Juan Alvarado (Caravan Kids WC) Fall 3:46</li>\n<li>Quarterfinal - Simon Wilson (Champbuilders Wrestling) won by fall over Robert Schneider (Celtic Elite) Fall 0:24</li>\n<li>Quarterfinal - Hayden Copass (Storm Youth WC) won by fall over Joey Graham (Celtic Elite) Fall 2:08</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Dominic Ducato (Golden Eagles WC) won by decision over Saul Trejo (Gomez Wrestling Academy) Dec 10-6</li>\n<li>Quarterfinal - Connor Kidd (TJ Trained) won in sudden victory - 1 over Inocencio Garcia (Force WC) SV-1 10-5</li>\n<li>Quarterfinal - Tyler Aters (Martinez Fox Valley Elite) won by decision over Chance Arlt-Seip (Triad Little Knights WC) Dec 10-3</li>\n<li>Quarterfinal - Jameson Garcia (Gomez Wrestling Academy) won by decision over Shay Korhorn (Force WC) Dec 2-1</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Antonio Alvarado (Belvidere Bandits WC) won by decision over Carter Rude (Sauk Valley WC) Dec 4-2</li>\n<li>Quarterfinal - Samuel Hayes (Contender Wrestling) won by fall over Maurice Dotson (Junior Comanche WC) Fall 1:56</li>\n<li>Quarterfinal - Phoenix Mordick (Dakota WC) won by major decision over Joseph McDermott (Force WC) Maj 9-1</li>\n<li>Quarterfinal - Joey Malito (Celtic Elite) won by fall over Avery Speck (TJ Trained) Fall 1:57</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Billy Meiszner (Lincoln-Way Vittum Cats) won by major decision over Jesse Hahs (SIWA) Maj 13-2</li>\n<li>Quarterfinal - Daniel Sheen (Izzy Style Wrestling) won by decision over Caden Muselman (Tinley Park Bulldogs WC) Dec 6-4</li>\n<li>Quarterfinal - Jacob Macatangay (Force WC) won by fall over Maddux Mordick (Dakota WC) Fall 3:44</li>\n<li>Quarterfinal - Tyler Guerra (Gomez Wrestling Academy) won by decision over Carter Hall (Champaign WC) Dec 4-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Kenyon Boyce (Harvey Twisters WC) Dec 7-2</li>\n<li>Quarterfinal - Charlie Farmer (Young Guns Wrestling) won by decision over Chase Hall (Triad Little Knights WC) Dec 6-2</li>\n<li>Quarterfinal - Santino Robinson (Wrestling 365) won in overtime over Christopher Moore (Crystal Lake Wizards) OT 6-4</li>\n<li>Quarterfinal - Nasir Bailey (Harvey Twisters WC) won by tech fall over Cajaun Johnson (Urbana Tigers WC) TF 17-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Vincent Zerban (Bulls WC) won by major decision over Presley Beasley (Crystal Lake Wizards) Maj 12-0</li>\n<li>Quarterfinal - Kyle Schickel (Celtic Elite) won by fall over Kai Conway (Gomez Wrestling Academy) Fall 4:18</li>\n<li>Quarterfinal - Kaleb Thompson (Bolingbrook Junior Raiders) won by major decision over Ben Lunn (Edwardsville WC) Maj 12-4</li>\n<li>Quarterfinal - Cameron Johnson (Martinez Fox Valley Elite) won by fall over Trey Pearcy (Charleston WC) Fall 2:22</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Joel Vandervere (The Wrestling Factory) won by major decision over Ezekiel Hulet (Super Soldiers WC) Maj 9-0</li>\n<li>Quarterfinal - Joshua Ogunsanya (Harvey Twisters WC) won by decision over Payton Geigner (Lincoln-Way Vittum Cats) Dec 10-7</li>\n<li>Quarterfinal - Luke Odom (Edwardsville WC) won by fall over John McDermott (Force WC) Fall 0:52</li>\n<li>Quarterfinal - Kyle Tunink (Sauk Valley WC) won by decision over Alex Villar (Bolingbrook Junior Raiders) Dec 5-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Grant Laduke (Celtic Elite) won by decision over Connor Gaynor (Tinley Park Bulldogs WC) Dec 3-2</li>\n<li>Quarterfinal - Tristan Daugherty (Central Illinois Wrestling Academy) won by decision over Christian Valadez (Waukegan Youth WC) Dec 3-1</li>\n<li>Quarterfinal - Nicholas Bolivar (Gomez Wrestling Academy) won by decision over Christian Goin (Super Soldiers WC) Dec 3-1</li>\n<li>Quarterfinal - Zeke Marshall (Martinez Fox Valley Elite) won by decision over Sam Emery (Celtic Elite) Dec 7-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Donovan Golden (Brawlers WC) won by decision over Anthony Federico (O`Fallon Little Panthers WC) Dec 4-3</li>\n<li>Quarterfinal - Fabian Lopez (Martinez Fox Valley Elite) won by major decision over Rocco Iannantone (Lincoln-Way Vittum Cats) Maj 15-1</li>\n<li>Quarterfinal - Jacob Tinajero (SCN Youth WC) won by decision over Dylan Rinkenberger (Fox Lake WC) Dec 7-4</li>\n<li>Quarterfinal - James Pierandozzi (Bolingbrook Junior Raiders) won by decision over Logan Deacetis (Prairie Central Hawks) Dec 6-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Noah Villarreal (Martinez Fox Valley Elite) won by major decision over Cole Watkins (Super Soldiers WC) Maj 15-4</li>\n<li>Quarterfinal - Danny Pucino (The Wrestling Factory) won by decision over Jacob Averett (Team Mascoutah WC) Dec 12-6</li>\n<li>Quarterfinal - Sincere Bailey (Harvey Twisters WC) won by tech fall over Jackson Certa (Martinez Fox Valley Elite) TF 16-0</li>\n<li>Quarterfinal - Zachary Kolb (Force WC) won by decision over Ryan Gardner (Iguana WC) Dec 5-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Jake Mensik (Bolingbrook Junior Raiders) won by decision over Dylan Connell (The Wrestling Factory) Dec 7-0</li>\n<li>Quarterfinal - Ashton Breen (Bolingbrook Junior Raiders) won by decision over Kaden Beeler (Edwardsville WC) Dec 11-4</li>\n<li>Quarterfinal - Kevin Countryman (Celtic Elite) won by decision over Chad Richards (Harlem Cougars WC) Dec 6-0</li>\n<li>Quarterfinal - Jack Patting (Young Guns Wrestling) won by decision over Daemyen Middlebrooks (Little Huskies WC) Dec 6-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Preston Berry (Greg Gomez Trained Wrestling) won by decision over Anthony Bitner (Little Rams Wrestling) Dec 5-3</li>\n<li>Quarterfinal - Isaiah Parker (The Wrestling Factory) won by decision over Logan Lagerhausen (Stillman Valley WC) Dec 8-1</li>\n<li>Quarterfinal - Noah Alsguson (Harvey Twisters WC) won by decision over Zeke Waltz (Jersey Junior Panthers Wrestling) Dec 7-3</li>\n<li>Quarterfinal - Victor Guzman (Rock Island WC) won by major decision over Cole Gaddis (Hoopeston Area WC) Maj 14-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Antonio Figueroa (Hononegah WC) won by decision over Ian Swidergal (Celtic Elite) Dec 7-4</li>\n<li>Quarterfinal - Fidel Mayora (Epic Wrestling) won by fall over Jordan Chisum (Zee-Bee Stingers WC) Fall 4:26</li>\n<li>Quarterfinal - Eric Epenesa (Edwardsville WC) won by major decision over Nathan Love (Greg Gomez Trained Wrestling) Maj 11-2</li>\n<li>Quarterfinal - Luke Rasmussen (Barrington Broncos WC) won by decision over Bradley Peters (Cary Matmen WC) Dec 8-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Grant Ripperda (Springfield Capitals Kids WC) won by fall over Joseph Parrish (Fox Valley WC) Fall 2:06</li>\n<li>Quarterfinal - Jeffrey Tyler (Granite City Wrestling Association) won by decision over Sean Swinkle (St. Tarcissus WC) Dec 8-5</li>\n<li>Quarterfinal - Caleb Grau (Team Mascoutah WC) won by major decision over Josh Labarbera (Martinez Fox Valley Elite) Maj 14-6</li>\n<li>Quarterfinal - Dalton Hall (Champaign WC) won by major decision over Tommy Evans (Wolves WC) Maj 14-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Blake Moss (Edwardsville WC) won by decision over Vincent Querciagrossa (Metamora Kids WC) Dec 6-2</li>\n<li>Quarterfinal - Mikey Bosco (Tinley Park Bulldogs WC) won by decision over Carter Maggio (St. Charles WC) Dec 7-0</li>\n<li>Quarterfinal - Nick Stemmet (Bolingbrook Junior Raiders) won by fall over Quintin Hamilton (Evanston School of Wrestling) Fall 1:19</li>\n<li>Quarterfinal - Logan Wilson (Champaign WC) won by fall over Vincent Clinite (Z`s Team Pena) Fall 2:11</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Tyler McCracken (Edwardsville WC) won by major decision over Robert Guss (Pitbull Wrestling Alliance) Maj 10-0</li>\n<li>Quarterfinal - Reide Wilson (Granite City Wrestling Association) won by decision over Tyson Heerman (TJ Trained) Dec 5-0</li>\n<li>Quarterfinal - Anthony Glauser (The Wrestling Factory) won by tech fall over Peyton Lind (Xtreme WC) TF 20-5</li>\n<li>Quarterfinal - Connor Eaton (West Frankfort Jr. Redbirds) won by fall over Cade Scott (Unity Youth WC) Fall 1:47</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Thomas Doyle (Lincoln-Way Vittum Cats) won by fall over Justin Allen (Prairie Central Hawks) Fall 3:33</li>\n<li>Quarterfinal - Nicholas Skamra (Headlock Wrestling Academy) won by tech fall over Alvin Maten (Harlem Cougars WC) TF 17-1</li>\n<li>Quarterfinal - Trevor Swier (Force WC) won by fall over Cesar Resendiz (DuPage WC) Fall 0:34</li>\n<li>Quarterfinal - Brandon Hoselton (Prairie Central Hawks) won by fall over Jaylin Garay (Villa-Lombard Cougars) Fall 0:45</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Victor Rodriguez (Villa-Lombard Cougars) won by fall over Jesse Helfrich (West Frankfort Jr. Redbirds) Fall 2:19</li>\n<li>Quarterfinal - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Jacob Shipla (Minooka Indians Elite) Fall 0:20</li>\n<li>Quarterfinal - Partick Peters (Tinley Park Bulldogs WC) won by major decision over Jonathan Lopez (Waukegan Youth WC) Maj 13-0</li>\n<li>Quarterfinal - Dustin Olmstead (Belleville Little Devils WC) won by fall over Caleb Pforr (Charleston WC) Fall 3:43</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Drew Gutknecht (Minooka Indians Elite) won by decision over Zachary Wallace (Moline WC) Dec 3-0</li>\n<li>Quarterfinal - Colin Baker (Downers Grove Cougars) won by decision over Luke Schwarze (Dakota WC) Dec 5-0</li>\n<li>Quarterfinal - Nikolas Mishka (Tinley Park Bulldogs WC) won by decision over Mason Baker (O`Fallon Little Panthers WC) Dec 2-1</li>\n<li>Quarterfinal - Cody Goodman (The Wrestling Factory) won by fall over Dawson Pruitt (Storm Youth WC) Fall 1:55</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Tyler Elsbury (Xtreme WC) won by fall over Andrew Velazquez (St. Charles WC) Fall 1:24</li>\n<li>Quarterfinal - Anthony Enlow (Vandalia Jr WC) won by fall over Patrick Turner (Force WC) Fall 0:43</li>\n<li>Quarterfinal - Martin Cortina (Force WC) won by decision over Michael Dubanowski (Rockets Youth WC) Dec 3-0</li>\n<li>Quarterfinal - Randy Turner (Team Mascoutah WC) won by fall over Pedro Castanon (Villa-Lombard Cougars) Fall 2:11</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Christian Olsen (Crystal Lake Wizards) won by decision over Cameron Clark (TJ Trained) Dec 3-2</li>\n<li>Quarterfinal - Jack Finnegan (Force WC) won by decision over Ronan Schuelke (Maddog Wrestling Academy) Dec 6-1</li>\n<li>Quarterfinal - Joseph Knapp (Brawlers WC) won by decision over John Asiuras (Headlock Wrestling Academy) Dec 9-6</li>\n<li>Quarterfinal - Dylan Amico (Force WC) won by major decision over Benjamin Mitchell (O`Fallon Little Panthers WC) Maj 9-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Joshua Koderhandt (Crusaders` Elite) won by fall over Joe Roti (Lincoln-Way Vittum Cats) Fall 0:43</li>\n<li>Quarterfinal - Malakye Rodriguez (Red Raiders Wrestling Team) won by decision over Alex Randell (Greg Gomez Trained Wrestling) Dec 3-2</li>\n<li>Quarterfinal - Andrew Herbst (Hawk WC Ltd.) won by fall over Gabriel Hinkle (Celtic Elite) Fall 1:25</li>\n<li>Quarterfinal - Jacob Rundell (Little Huskies WC) won by major decision over Matthew Minick (O`Fallon Little Panthers WC) Maj 12-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Diego Sotelo (Martinez Fox Valley Elite) won by fall over Khai Stephens (Manteno Jr Panthers WC) Fall 0:49</li>\n<li>Quarterfinal - Javen Estrada (Bolingbrook Junior Raiders) won by decision over Joey Chirillo (Tinley Park Bulldogs WC) Dec 7-0</li>\n<li>Quarterfinal - Nicholas Matthias (Celtic Elite) won by decision over Jalen May (Crusaders` Elite) Dec 2-0</li>\n<li>Quarterfinal - Kendall Norfleet (Harvey Twisters WC) won by major decision over Kaeden Kinison (Springfield Capitals Kids WC) Maj 13-3</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Cole Peters (TJ Trained-Springfield) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jason Shaw (Roxana Outlaws) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joe Mushinsky (TJ Trained) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brac Hooper (Champaign WC) won by decision over Nate Pacetti (Redhawk WC) Dec 3-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Gage Reed (Storm Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Cestone (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - James Gardner (Contender Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Emmett Connolly (Mustang/SKT WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Korina Blades (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dominick Reddish (Charleston WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caine Tyus (Bulls WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zackary Crawford (Sycamore WC) won by fall over Isaiah Immke (Champaign WC) Fall 4:27</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Rashon Allen (Urbana Tigers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Logan Balosky (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Adam Thebeau (East St. Louis Wrestling) won by decision over Wade Abrams (Cary Matmen WC) Dec 5-4</li>\n<li>Cons. Round 1 - Michael Caliendo (Batavia WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Rayce Zike (Cumberland Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Raymond Arebalo (Crosstown Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Owen Jacobson (Epic Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cory West (Springfield Capitals Kids WC) won by decision over Timothy Taylor (Tinley Park Bulldogs WC) Dec 7-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Elijah Chiaro (SCN Youth WC) won by fall over Jesse Stewart (Springfield Capitals Kids WC) Fall 2:24</li>\n<li>Cons. Round 1 - Isaiah Lopez (Fox Lake WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alexander Tagler (Lincoln-Way Vittum Cats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tom Culp (Champions WC) won in sudden victory - 1 over Dominic Adamo (Celtic Elite) SV-1 2-1</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Kevin Zimmer (Lincoln-Way Vittum Cats) won by fall over Grayson Cook (Saukee Youth WC) Fall 0:48</li>\n<li>Cons. Round 1 - Esther Han (Carbondale WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mason Spivey (Minooka Indians Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jayrid Stoltz (Peoria Razorbacks WC) won by fall over Liam McDermott (Celtic Elite) Fall 0:43</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Eathin Diveley (Lil Bucs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Angel Guzman (Waukegan Youth WC) won by major decision over Tyler Haynes (Pekin Boys &amp; Girls Club) Maj 12-0</li>\n<li>Cons. Round 1 - Noah Setser (Ottawa Crushers Kids WC) won by major decision over Connor Nelligan (Mustang/SKT WC) Maj 14-2</li>\n<li>Cons. Round 1 - Jadon Mims (Maywood Bucs/Powerhouse) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Connor Barnes (Peoria Heights Minutemen WC) won by fall over Kieran Pavlat (Chicago Park District) Fall 1:15</li>\n<li>Cons. Round 1 - Michael Roath (SCN Youth WC) won by decision over Joseph Swanson (Cary Matmen WC) Dec 7-1</li>\n<li>Cons. Round 1 - Ethan Sperry (Crusaders` Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chase Michaelis (Carlinville WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Dillan Johnson (Force WC) won by decision over Dakota Ritter (Riverton Youth Wrestling) Dec 11-5</li>\n<li>Cons. Round 1 - Luke Childers (Team 1006 Wrestling) won by decision over Michael Macias (Marengo Youth WC) Dec 12-11</li>\n<li>Cons. Round 1 - Connor Lorden (LP Crunching Cavs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Rolando Ochoa (Badger WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Vicente Arebalo (Crosstown Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Noah Ross (Rockets Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Paulie Robertson (Villa-Lombard Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gene Stringini (The Law) won by fall over Brandon Simmonds (Triad Little Knights WC) Fall 4:13</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Gabriel Taylor (Mt. Vernon Lions WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gavin Mouser (Vandalia Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Charlie Jagusah (Junior Pioneer WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zander Guttridge (Rockford WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Oran Varela (Hoopeston Area WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zach Benson (Batavia WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colin Sheldon (Sparta Junior Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jason Johnston (Metamora Kids WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Kameron Weddle (SCN Youth WC) won by decision over Isaac Middendorf (Benton WC) Dec 3-2</li>\n<li>Cons. Round 1 - Chase Hampton (Greg Gomez Trained Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Payton Murphy (TJ Trained) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aaron Meenen (Sauk Valley WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Henry Locker (Downers Grove Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Collin Carrigan (Naperville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alexander Marre (Gomez Wrestling Academy) won by major decision over Curtis Steinkamp (Quincy Cyclones Wrestling) Maj 18-5</li>\n<li>Cons. Round 1 - Devin Lozdoski (Harlem Cougars WC) won by decision over Pierre Baldwin (Maywood Bucs/Powerhouse) Dec 8-5</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Edmund Enright (Mustang/SKT WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colin Young (Belvidere Bandits WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Isaac Thomas (Midwest Central Youth WC) won by major decision over Sean Conway (Team 312) Maj 11-2</li>\n<li>Cons. Round 1 - Owen Dunlap (Tinley Park Bulldogs WC) won by decision over J Guido Pigoni (SCN Youth WC) Dec 7-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Mason Alessio (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Seth Larson (Force WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Connor Munn (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n<li>Cons. Round 1 - Noah Manuel Tapia (Young Guns Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Terrance Snapp (Will County Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Haynes (Pekin Boys &amp; Girls Club) won by fall over Shawn Griffin (East St. Louis Wrestling) Fall 0:40</li>\n<li>Cons. Round 1 - Cameron Domke (The Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean Crump (Izzy Style Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Colin Suyko (Cary Matmen WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Milliman (Hawk WC Ltd.) received a bye   () Bye</li>\n<li>Cons. Round 1 - Billy Taylor (Junior Pioneer WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Egan (Mustang/SKT WC) won by decision over Tomas Reed (Lionheart Intense Wrestling) Dec 7-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Austin McConaha (Champaign WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Harrier (Golden Eagles WC) won by fall over Jaiden Cooper (Urbana Tigers WC) Fall 0:47</li>\n<li>Cons. Round 1 - Jack Coyle (Mustang/SKT WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bryce Shelton (Crystal Lake Wizards) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Carlos Sanchez (Lil Bucs WC) won by major decision over Zachary Seymore (Izzy Style Wrestling) Maj 11-2</li>\n<li>Cons. Round 1 - Tuvshinjargal Zuunbayan (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n<li>Cons. Round 1 - William Hillard (Triad Little Knights WC) won by major decision over Parker Suyko (Cary Matmen WC) Maj 11-0</li>\n<li>Cons. Round 1 - Reese Martin (Glenbard East Jr Rams) received a bye   () Bye</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Jake Viloria (Little Huskies WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drew Nash (Lemont Bears) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christopher Worcester (Villa-Lombard Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Riemer (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Kyle Zator (Lemont Bears) won by decision over Minani Allin (Rock Island WC) Dec 9-2</li>\n<li>Cons. Round 1 - Austin Abitua (Hononegah WC) won by decision over Qayin Dabney (Martinez Fox Valley Elite) Dec 6-4</li>\n<li>Cons. Round 1 - Brian Stacy (The Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Peyton Bechtold (Bulls WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Alejandro Mejia (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joe Chapman (Little Huskies WC) won by decision over Alexander Lalezas (Bolingbrook Junior Raiders) Dec 10-3</li>\n<li>Cons. Round 1 - Sean Larkin (Fox Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jakob Wheeler (Celtic Elite) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Brandon Lawver (Rock Island WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Elias Richardson (Team TopNotch Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mustafa St. Clair (Harvey Twisters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jaiden Vancoillie (Rock Island WC) won by decision over Kyle Berg (Lincoln-Way Vittum Cats) Dec 9-7</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Donovan Dolittle (Badger WC) won by fall over Cadence Hecox (Hecox Team Benaiah) Fall 3:58</li>\n<li>Cons. Round 1 - John Sexton (Saber WC) won by decision over Blair Diefenbach (Force WC) Dec 7-6</li>\n<li>Cons. Round 1 - Thomas Luedke (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Baltazar Cabrales (Sharks WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Cole Baumgartner (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Xavier Sierra (Headlock Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - River Flute (West Frankfort Jr. Redbirds) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hunter Boyd (Triad Little Knights WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Joshua Crandall (Wolves WC) won by decision over Dane McMahon (Scorpion WC) Dec 8-5</li>\n<li>Cons. Round 1 - Santino Blanco (Morton Little Mustangs) won by fall over Cesar Sanchez (Caravan Kids WC) Fall 2:20</li>\n<li>Cons. Round 1 - Jason Bridgewater (Midwest Central Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Julian Ramirez (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Tyler Berhenke (Champbuilders Wrestling) won by fall over James Young (East St. Louis Wrestling) Fall 3:53</li>\n<li>Cons. Round 1 - Rewn Stearns (Murphysboro WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Garret Moser (Hawk WC Ltd.) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joey Wolny (Sycamore WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Basilo Betancourt (Harvey Twisters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Norwood (Team Mascoutah WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Bernardino (Villa Park Young Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jalen Farmer (St. Charles WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Lloyd Reynolds (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Peter Gianaris (Maine Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Evan Hissong (Cary Matmen WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Angel Jaimes (Martinez Fox Valley Elite) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Derick Platt (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Payton Piraino (LP Crunching Cavs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Kaltmeyer (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bradlee Kinney (Hoopeston Area WC) won by fall over Caleb Uczen (Elmhurst Jr Dukes) Fall 0:57</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - James Marre (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cameron Varner (Junior Kahoks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brayden Cobine (Roxana Outlaws) won by decision over Colin Sons (SCN Youth WC) Dec 6-2</li>\n<li>Cons. Round 1 - Marco Nash (Harvey Twisters WC) won by fall over Austin Jensen (Harlem Cougars WC) Fall 2:53</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Isaac Tabels (Hoopeston Area WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gavin Ranquist (Headlock Wrestling Academy) won by fall over Caleb Bradle (Super Soldiers WC) Fall 3:45</li>\n<li>Cons. Round 1 - Jarek Wehrle (Vandalia Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Penzato (St. Charles WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Michael Kass (Mean Green Machine) received a bye   () Bye</li>\n<li>Cons. Round 1 - Connor Speck (TJ Trained) won by fall over Trey Conroy (Orland Park Pioneers) Fall 2:06</li>\n<li>Cons. Round 1 - Nick Lockhart (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cole Ferguson (Yorkville WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Justin Warmowski (Fox Lake WC) won by fall over Cole Peters (TJ Trained-Springfield) Fall 1:24</li>\n<li>Cons. Round 2 - Damari Reed (Harvey Twisters WC) won by major decision over Jason Shaw (Roxana Outlaws) Maj 11-1</li>\n<li>Cons. Round 2 - Jack McClimon (Celtic Elite) won by tech fall over Joe Mushinsky (TJ Trained) TF 17-0</li>\n<li>Cons. Round 2 - Brac Hooper (Champaign WC) won by decision over Andrew Lizak (Lincoln-Way Vittum Cats) Dec 1-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Mia Palumbo (Mean Green Machine) won by decision over Gage Reed (Storm Youth WC) Dec 6-1</li>\n<li>Cons. Round 2 - Samuel Henkle (Crystal Lake Wizards) won by decision over Michael Cestone (Gomez Wrestling Academy) Dec 7-1</li>\n<li>Cons. Round 2 - Luke Barron (Team 1006 Wrestling) won by fall over James Gardner (Contender Wrestling) Fall 1:19</li>\n<li>Cons. Round 2 - Blain Christie (Brawlers WC) won by fall over Emmett Connolly (Mustang/SKT WC) Fall 0:33</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Dayton Hall (Aces WC) won by decision over Korina Blades (Martinez Fox Valley Elite) Dec 7-4</li>\n<li>Cons. Round 2 - Ryder Hunkins (Golden Eagles WC) won by decision over Dominick Reddish (Charleston WC) Dec 7-1</li>\n<li>Cons. Round 2 - Joey Cape (Super Soldiers WC) won by decision over Caine Tyus (Bulls WC) Dec 6-0</li>\n<li>Cons. Round 2 - Mitchell Rudsinski (Lincoln-Way Vittum Cats) won by decision over Zackary Crawford (Sycamore WC) Dec 8-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Rashon Allen (Urbana Tigers WC) won in sudden victory - 1 over Tyler Milani (Lincoln-Way Vittum Cats) SV-1 5-3</li>\n<li>Cons. Round 2 - Logan Balosky (Gomez Wrestling Academy) won by major decision over Zach Bateman (Lincoln-Way Vittum Cats) Maj 10-2</li>\n<li>Cons. Round 2 - Jeremy Jakowitsch (Barrington Broncos WC) won by decision over Adam Thebeau (East St. Louis Wrestling) Dec 6-3</li>\n<li>Cons. Round 2 - Michael Caliendo (Batavia WC) won by decision over Tavius Hosley (Unity Youth WC) Dec 13-8</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Michael Kelly (Tinley Park Bulldogs WC) won by tech fall over Rayce Zike (Cumberland Youth WC) TF 18-2</li>\n<li>Cons. Round 2 - Raymond Arebalo (Crosstown Wrestling) won by decision over Abraham Wojcikiewicz (Bulls WC) Dec 3-2</li>\n<li>Cons. Round 2 - Bryce Boumans (Fox Valley WC) won by fall over Owen Jacobson (Epic Wrestling) Fall 3:22</li>\n<li>Cons. Round 2 - Blake Varga (SCN Youth WC) won by decision over Cory West (Springfield Capitals Kids WC) Dec 4-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Elijah Chiaro (SCN Youth WC) won by decision over Dillon Dublo (Bulls WC) Dec 5-1</li>\n<li>Cons. Round 2 - Caden Ernd (Crystal Lake Wizards) won by decision over Isaiah Lopez (Fox Lake WC) Dec 3-1</li>\n<li>Cons. Round 2 - Alexander Tagler (Lincoln-Way Vittum Cats) won by fall over Alex Picchi (Crystal Lake Wizards) Fall 1:28</li>\n<li>Cons. Round 2 - Tom Culp (Champions WC) won by injury default over Micheal Anderson (Villa Park Young Warriors) Inj. 1:56</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Kevin Zimmer (Lincoln-Way Vittum Cats) won by fall over Marshal Cunz (Harlem Cougars WC) Fall 2:48</li>\n<li>Cons. Round 2 - Mario Tormey (Tinley Park Bulldogs WC) won by major decision over Esther Han (Carbondale WC) Maj 17-3</li>\n<li>Cons. Round 2 - Stacey Terry (Harvey Twisters WC) won by decision over Mason Spivey (Minooka Indians Elite) Dec 11-7</li>\n<li>Cons. Round 2 - Jayrid Stoltz (Peoria Razorbacks WC) won by decision over Evan Stubblefield (Maywood Bucs/Powerhouse) Dec 7-5</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Eathin Diveley (Lil Bucs WC) won by fall over Joshua Dorr (Greg Gomez Trained Wrestling) Fall 1:52</li>\n<li>Cons. Round 2 - Jacob Mumm (Bolingbrook Junior Raiders) won by major decision over Angel Guzman (Waukegan Youth WC) Maj 9-1</li>\n<li>Cons. Round 2 - William White (Mt. Vernon Lions WC) won by fall over Noah Setser (Ottawa Crushers Kids WC) Fall 0:52</li>\n<li>Cons. Round 2 - Christopher Carr (Izzy Style Wrestling) won by major decision over Jadon Mims (Maywood Bucs/Powerhouse) Maj 10-1</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Barry Johnson (AJ Junior Wildcats WC) won by decision over Connor Barnes (Peoria Heights Minutemen WC) Dec 7-0</li>\n<li>Cons. Round 2 - Michael Roath (SCN Youth WC) won by fall over Michael Mosier (Barrington Broncos WC) Fall 4:20</li>\n<li>Cons. Round 2 - Ethan Sperry (Crusaders` Elite) won in tie breaker - 1 over Joey Vinson (Villa-Lombard Cougars) TB-1 3-2</li>\n<li>Cons. Round 2 - Aidan Roberts (Golden Eagles WC) won by decision over Chase Michaelis (Carlinville WC) Dec 3-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Dillan Johnson (Force WC) won by major decision over Gavin Keeffer (Stockton Renegades) Maj 8-0</li>\n<li>Cons. Round 2 - Elliott Lewis (Tinley Park Bulldogs WC) won by fall over Luke Childers (Team 1006 Wrestling) Fall 2:17</li>\n<li>Cons. Round 2 - Sydney Manos (Lil Bucs WC) won by decision over Connor Lorden (LP Crunching Cavs) Dec 9-4</li>\n<li>Cons. Round 2 - Abel Colunga (Hoopeston Area WC) won by fall over Rolando Ochoa (Badger WC) Fall 4:29</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Ghee Rachal (Harvey Twisters WC) won by fall over Vicente Arebalo (Crosstown Wrestling) Fall 4:27</li>\n<li>Cons. Round 2 - Benjamin Uribe (Wolfpak WC) won by fall over Noah Ross (Rockets Youth WC) Fall 0:38</li>\n<li>Cons. Round 2 - Jacob Morel (Pitbull Wrestling Alliance) won by decision over Paulie Robertson (Villa-Lombard Cougars) Dec 6-0</li>\n<li>Cons. Round 2 - Camren Stinespring (Storm Youth WC) won by fall over Gene Stringini (The Law) Fall 2:36</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Isaiah Gonzalez (Izzy Style Wrestling) won by decision over Gabriel Taylor (Mt. Vernon Lions WC) Dec 6-2</li>\n<li>Cons. Round 2 - Gavin Mouser (Vandalia Jr WC) won by fall over Kody Mongan (Tiger Town Tanglers WC) Fall 2:04</li>\n<li>Cons. Round 2 - Ryan Boersma (Tinley Park Bulldogs WC) won by fall over Charlie Jagusah (Junior Pioneer WC) Fall 2:01</li>\n<li>Cons. Round 2 - William Penrod (Mt. Vernon Lions WC) won by decision over Zander Guttridge (Rockford WC) Dec 6-2</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Malachi Jennings (Manteno Jr Panthers WC) won by fall over Oran Varela (Hoopeston Area WC) Fall 0:39</li>\n<li>Cons. Round 2 - Juan Alvarado (Caravan Kids WC) won by fall over Zach Benson (Batavia WC) Fall 1:53</li>\n<li>Cons. Round 2 - Robert Schneider (Celtic Elite) won in tie breaker - 1 over Colin Sheldon (Sparta Junior Bulldogs) TB-1 1-0</li>\n<li>Cons. Round 2 - Joey Graham (Celtic Elite) won by major decision over Jason Johnston (Metamora Kids WC) Maj 10-0</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Saul Trejo (Gomez Wrestling Academy) won by fall over Kameron Weddle (SCN Youth WC) Fall 1:58</li>\n<li>Cons. Round 2 - Inocencio Garcia (Force WC) won by major decision over Chase Hampton (Greg Gomez Trained Wrestling) Maj 10-0</li>\n<li>Cons. Round 2 - Payton Murphy (TJ Trained) won by decision over Chance Arlt-Seip (Triad Little Knights WC) Dec 8-4</li>\n<li>Cons. Round 2 - Shay Korhorn (Force WC) won by fall over Aaron Meenen (Sauk Valley WC) Fall 0:35</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Carter Rude (Sauk Valley WC) won by major decision over Henry Locker (Downers Grove Cougars) Maj 9-0</li>\n<li>Cons. Round 2 - Maurice Dotson (Junior Comanche WC) won by tech fall over Collin Carrigan (Naperville WC) TF 16-1</li>\n<li>Cons. Round 2 - Alexander Marre (Gomez Wrestling Academy) won by decision over Joseph McDermott (Force WC) Dec 7-5</li>\n<li>Cons. Round 2 - Devin Lozdoski (Harlem Cougars WC) won by major decision over Avery Speck (TJ Trained) Maj 17-4</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Edmund Enright (Mustang/SKT WC) won by tech fall over Jesse Hahs (SIWA) TF 17-2</li>\n<li>Cons. Round 2 - Caden Muselman (Tinley Park Bulldogs WC) won by fall over Colin Young (Belvidere Bandits WC) Fall 3:57</li>\n<li>Cons. Round 2 - Isaac Thomas (Midwest Central Youth WC) won by decision over Maddux Mordick (Dakota WC) Dec 8-4</li>\n<li>Cons. Round 2 - Carter Hall (Champaign WC) won by decision over Owen Dunlap (Tinley Park Bulldogs WC) Dec 7-3</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Mason Alessio (Celtic Elite) won by decision over Kenyon Boyce (Harvey Twisters WC) Dec 7-6</li>\n<li>Cons. Round 2 - Seth Larson (Force WC) won in tie breaker - 1 over Chase Hall (Triad Little Knights WC) TB-1 3-2</li>\n<li>Cons. Round 2 - Christopher Moore (Crystal Lake Wizards) won by decision over Connor Munn (Pitbull Wrestling Alliance) Dec 9-3</li>\n<li>Cons. Round 2 - Noah Manuel Tapia (Young Guns Wrestling) won by decision over Cajaun Johnson (Urbana Tigers WC) Dec 6-4</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Presley Beasley (Crystal Lake Wizards) won by decision over Terrance Snapp (Will County Warriors) Dec 8-5</li>\n<li>Cons. Round 2 - Ryan Haynes (Pekin Boys &amp; Girls Club) won by decision over Kai Conway (Gomez Wrestling Academy) Dec 6-0</li>\n<li>Cons. Round 2 - Ben Lunn (Edwardsville WC) won by decision over Cameron Domke (The Wrestling Factory) Dec 5-3</li>\n<li>Cons. Round 2 - Sean Crump (Izzy Style Wrestling) won by major decision over Trey Pearcy (Charleston WC) Maj 9-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Ezekiel Hulet (Super Soldiers WC) won by decision over Colin Suyko (Cary Matmen WC) Dec 6-2</li>\n<li>Cons. Round 2 - Payton Geigner (Lincoln-Way Vittum Cats) won by major decision over Jacob Milliman (Hawk WC Ltd.) Maj 12-0</li>\n<li>Cons. Round 2 - John McDermott (Force WC) won by tech fall over Billy Taylor (Junior Pioneer WC) TF 17-0</li>\n<li>Cons. Round 2 - Thomas Egan (Mustang/SKT WC) won by decision over Alex Villar (Bolingbrook Junior Raiders) Dec 2-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Connor Gaynor (Tinley Park Bulldogs WC) won by fall over Austin McConaha (Champaign WC) Fall 0:41</li>\n<li>Cons. Round 2 - Jake Harrier (Golden Eagles WC) won by major decision over Christian Valadez (Waukegan Youth WC) Maj 8-0</li>\n<li>Cons. Round 2 - Christian Goin (Super Soldiers WC) won by fall over Jack Coyle (Mustang/SKT WC) Fall 2:57</li>\n<li>Cons. Round 2 - Bryce Shelton (Crystal Lake Wizards) won by decision over Sam Emery (Celtic Elite) Dec 4-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Carlos Sanchez (Lil Bucs WC) won by decision over Anthony Federico (O`Fallon Little Panthers WC) Dec 5-1</li>\n<li>Cons. Round 2 - Rocco Iannantone (Lincoln-Way Vittum Cats) won by decision over Tuvshinjargal Zuunbayan (Pitbull Wrestling Alliance) Dec 10-8</li>\n<li>Cons. Round 2 - William Hillard (Triad Little Knights WC) won by fall over Dylan Rinkenberger (Fox Lake WC) Fall 1:03</li>\n<li>Cons. Round 2 - Reese Martin (Glenbard East Jr Rams) won by decision over Logan Deacetis (Prairie Central Hawks) Dec 4-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Cole Watkins (Super Soldiers WC) won by decision over Jake Viloria (Little Huskies WC) Dec 2-1</li>\n<li>Cons. Round 2 - Drew Nash (Lemont Bears) won by decision over Jacob Averett (Team Mascoutah WC) Dec 9-2</li>\n<li>Cons. Round 2 - Jackson Certa (Martinez Fox Valley Elite) won by decision over Christopher Worcester (Villa-Lombard Cougars) Dec 5-4</li>\n<li>Cons. Round 2 - Ryan Gardner (Iguana WC) won by fall over Jack Riemer (Pitbull Wrestling Alliance) Fall 1:02</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Dylan Connell (The Wrestling Factory) won by decision over Kyle Zator (Lemont Bears) Dec 4-2</li>\n<li>Cons. Round 2 - Austin Abitua (Hononegah WC) won in overtime over Kaden Beeler (Edwardsville WC) OT 2-1</li>\n<li>Cons. Round 2 - Chad Richards (Harlem Cougars WC) won by tech fall over Brian Stacy (The Wrestling Factory) TF 16-0</li>\n<li>Cons. Round 2 - Daemyen Middlebrooks (Little Huskies WC) won in overtime over Peyton Bechtold (Bulls WC) OT 5-3</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Alejandro Mejia (Pitbull Wrestling Alliance) won by decision over Anthony Bitner (Little Rams Wrestling) Dec 3-2</li>\n<li>Cons. Round 2 - Joe Chapman (Little Huskies WC) won by major decision over Logan Lagerhausen (Stillman Valley WC) Maj 8-0</li>\n<li>Cons. Round 2 - Zeke Waltz (Jersey Junior Panthers Wrestling) won by decision over Sean Larkin (Fox Valley WC) Dec 8-6</li>\n<li>Cons. Round 2 - Jakob Wheeler (Celtic Elite) won by decision over Cole Gaddis (Hoopeston Area WC) Dec 7-6</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Ian Swidergal (Celtic Elite) won by decision over Brandon Lawver (Rock Island WC) Dec 6-4</li>\n<li>Cons. Round 2 - Jordan Chisum (Zee-Bee Stingers WC) won by major decision over Elias Richardson (Team TopNotch Wrestling) Maj 12-1</li>\n<li>Cons. Round 2 - Mustafa St. Clair (Harvey Twisters WC) won by fall over Nathan Love (Greg Gomez Trained Wrestling) Fall 0:48</li>\n<li>Cons. Round 2 - Bradley Peters (Cary Matmen WC) won by decision over Jaiden Vancoillie (Rock Island WC) Dec 11-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Joseph Parrish (Fox Valley WC) won by fall over Donovan Dolittle (Badger WC) Fall 1:17</li>\n<li>Cons. Round 2 - John Sexton (Saber WC) won by major decision over Sean Swinkle (St. Tarcissus WC) Maj 11-0</li>\n<li>Cons. Round 2 - Thomas Luedke (Celtic Elite) won by decision over Josh Labarbera (Martinez Fox Valley Elite) Dec 3-1</li>\n<li>Cons. Round 2 - Tommy Evans (Wolves WC) won by fall over Baltazar Cabrales (Sharks WC) Fall 1:07</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Vincent Querciagrossa (Metamora Kids WC) won by major decision over Cole Baumgartner (Sycamore WC) Maj 12-1</li>\n<li>Cons. Round 2 - Carter Maggio (St. Charles WC) won by decision over Xavier Sierra (Headlock Wrestling Academy) Dec 10-3</li>\n<li>Cons. Round 2 - River Flute (West Frankfort Jr. Redbirds) won by fall over Quintin Hamilton (Evanston School of Wrestling) Fall 3:43</li>\n<li>Cons. Round 2 - Vincent Clinite (Z`s Team Pena) won by fall over Hunter Boyd (Triad Little Knights WC) Fall 2:50</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Joshua Crandall (Wolves WC) won by fall over Robert Guss (Pitbull Wrestling Alliance) Fall 4:25</li>\n<li>Cons. Round 2 - Tyson Heerman (TJ Trained) won by decision over Santino Blanco (Morton Little Mustangs) Dec 3-2</li>\n<li>Cons. Round 2 - Peyton Lind (Xtreme WC) won by fall over Jason Bridgewater (Midwest Central Youth WC) Fall 4:13</li>\n<li>Cons. Round 2 - Julian Ramirez (Tinley Park Bulldogs WC) won by fall over Cade Scott (Unity Youth WC) Fall 2:24</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Berhenke (Champbuilders Wrestling) won by fall over Justin Allen (Prairie Central Hawks) Fall 4:18</li>\n<li>Cons. Round 2 - Alvin Maten (Harlem Cougars WC) won by fall over Rewn Stearns (Murphysboro WC) Fall 1:30</li>\n<li>Cons. Round 2 - Cesar Resendiz (DuPage WC) won by fall over Garret Moser (Hawk WC Ltd.) Fall 2:38</li>\n<li>Cons. Round 2 - Jaylin Garay (Villa-Lombard Cougars) won by fall over Joey Wolny (Sycamore WC) Fall 0:38</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Basilo Betancourt (Harvey Twisters WC) won by fall over Jesse Helfrich (West Frankfort Jr. Redbirds) Fall 3:25</li>\n<li>Cons. Round 2 - Jacob Shipla (Minooka Indians Elite) won by fall over Ryan Norwood (Team Mascoutah WC) Fall 4:00</li>\n<li>Cons. Round 2 - Jonathan Lopez (Waukegan Youth WC) won by fall over Alex Bernardino (Villa Park Young Warriors) Fall 2:17</li>\n<li>Cons. Round 2 - Jalen Farmer (St. Charles WC) won by fall over Caleb Pforr (Charleston WC) Fall 3:45</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Zachary Wallace (Moline WC) won by decision over Lloyd Reynolds (Edwardsville WC) Dec 1-0</li>\n<li>Cons. Round 2 - Peter Gianaris (Maine Eagles WC) won by fall over Luke Schwarze (Dakota WC) Fall 4:24</li>\n<li>Cons. Round 2 - Mason Baker (O`Fallon Little Panthers WC) won by fall over Evan Hissong (Cary Matmen WC) Fall 2:48</li>\n<li>Cons. Round 2 - Angel Jaimes (Martinez Fox Valley Elite) won by decision over Dawson Pruitt (Storm Youth WC) Dec 5-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Derick Platt (Team 1006 Wrestling) won by decision over Andrew Velazquez (St. Charles WC) Dec 5-2</li>\n<li>Cons. Round 2 - Payton Piraino (LP Crunching Cavs) won by decision over Patrick Turner (Force WC) Dec 7-2</li>\n<li>Cons. Round 2 - Michael Dubanowski (Rockets Youth WC) won by fall over Andrew Kaltmeyer (Edwardsville WC) Fall 4:24</li>\n<li>Cons. Round 2 - Pedro Castanon (Villa-Lombard Cougars) won by fall over Bradlee Kinney (Hoopeston Area WC) Fall 2:06</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Cameron Clark (TJ Trained) won by fall over James Marre (Gomez Wrestling Academy) Fall 2:19</li>\n<li>Cons. Round 2 - Ronan Schuelke (Maddog Wrestling Academy) won by decision over Cameron Varner (Junior Kahoks) Dec 7-1</li>\n<li>Cons. Round 2 - John Asiuras (Headlock Wrestling Academy) won by fall over Brayden Cobine (Roxana Outlaws) Fall 3:29</li>\n<li>Cons. Round 2 - Marco Nash (Harvey Twisters WC) won by major decision over Benjamin Mitchell (O`Fallon Little Panthers WC) Maj 9-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Joe Roti (Lincoln-Way Vittum Cats) won by fall over Isaac Tabels (Hoopeston Area WC) Fall 4:11</li>\n<li>Cons. Round 2 - Alex Randell (Greg Gomez Trained Wrestling) won by fall over Gavin Ranquist (Headlock Wrestling Academy) Fall 0:58</li>\n<li>Cons. Round 2 - Jarek Wehrle (Vandalia Jr WC) won by decision over Gabriel Hinkle (Celtic Elite) Dec 3-0</li>\n<li>Cons. Round 2 - Matthew Minick (O`Fallon Little Panthers WC) won by major decision over Jake Penzato (St. Charles WC) Maj 14-5</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Michael Kass (Mean Green Machine) won by fall over Khai Stephens (Manteno Jr Panthers WC) Fall 2:34</li>\n<li>Cons. Round 2 - Joey Chirillo (Tinley Park Bulldogs WC) won by decision over Connor Speck (TJ Trained) Dec 6-0</li>\n<li>Cons. Round 2 - Jalen May (Crusaders` Elite) won by fall over Nick Lockhart (Sycamore WC) Fall 1:03</li>\n<li>Cons. Round 2 - Kaeden Kinison (Springfield Capitals Kids WC) won by decision over Cole Ferguson (Yorkville WC) Dec 7-1</li>\n</ul>\n</section>",
  "Champ Semi`s & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semi`s &amp; Con Quarterfinal</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Kannon Webster (Super Soldiers WC) won by decision over Jordan Blew (Force WC) Dec 9-2</li>\n<li>Semifinal - Joseph Fernau (Team 1006 Wrestling) won by fall over Grover Mays (AJ Junior Wildcats WC) Fall 2:30</li>\n<li>Cons. Round 3 - Damari Reed (Harvey Twisters WC) won by major decision over Justin Warmowski (Fox Lake WC) Maj 12-0</li>\n<li>Cons. Round 3 - Brac Hooper (Champaign WC) won by decision over Jack McClimon (Celtic Elite) Dec 6-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Grant Matarelli (Edwardsville WC) won by decision over Owen Gerdes (Celtic Elite) Dec 7-2</li>\n<li>Semifinal - Alex Ventimilla (Martinez Fox Valley Elite) won in sudden victory - 1 over Ethan Stiles (Izzy Style Wrestling) SV-1 5-3</li>\n<li>Cons. Round 3 - Mia Palumbo (Mean Green Machine) won by decision over Samuel Henkle (Crystal Lake Wizards) Dec 2-0</li>\n<li>Cons. Round 3 - Blain Christie (Brawlers WC) won by decision over Luke Barron (Team 1006 Wrestling) Dec 10-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Jack Milos (Arlington Cardinals WC) won by major decision over Mateen Taylor (Harvey Twisters WC) Maj 8-0</li>\n<li>Semifinal - Dean Hamiti (Martinez Fox Valley Elite) won by fall over Marko Hennin (Barrington Broncos WC) Fall 1:08</li>\n<li>Cons. Round 3 - Dayton Hall (Aces WC) won by decision over Ryder Hunkins (Golden Eagles WC) Dec 9-3</li>\n<li>Cons. Round 3 - Joey Cape (Super Soldiers WC) won by decision over Mitchell Rudsinski (Lincoln-Way Vittum Cats) Dec 5-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Nain Vazquez (Martinez Fox Valley Elite) won by tech fall over Michael Rodriguez (Mean Green Machine) TF 15-0</li>\n<li>Semifinal - Robert Major (Bolingbrook Junior Raiders) won by decision over Damien Lopez (Martinez Fox Valley Elite) Dec 8-2</li>\n<li>Cons. Round 3 - Logan Balosky (Gomez Wrestling Academy) won by forfeit over Rashon Allen (Urbana Tigers WC) FF</li>\n<li>Cons. Round 3 - Michael Caliendo (Batavia WC) won by decision over Jeremy Jakowitsch (Barrington Broncos WC) Dec 6-4</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Brayden Thompson (Izzy Style Wrestling) won by decision over Bradley Gillum (Martinez Fox Valley Elite) Dec 3-0</li>\n<li>Semifinal - Brody Hallin (Crystal Lake Wizards) won by fall over Cooper Wettig (Izzy Style Wrestling) Fall 4:03</li>\n<li>Cons. Round 3 - Raymond Arebalo (Crosstown Wrestling) won by decision over Michael Kelly (Tinley Park Bulldogs WC) Dec 2-0</li>\n<li>Cons. Round 3 - Bryce Boumans (Fox Valley WC) won in sudden victory - 1 over Blake Varga (SCN Youth WC) SV-1 5-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Jared Gumila (Force WC) won by decision over Grant Hansen (Maddog Wrestling Academy) Dec 10-7</li>\n<li>Semifinal - Jake Matthews (Headlock Wrestling Academy) won by decision over Case Harmston (Stockton Renegades) Dec 7-3</li>\n<li>Cons. Round 3 - Caden Ernd (Crystal Lake Wizards) won by decision over Elijah Chiaro (SCN Youth WC) Dec 6-0</li>\n<li>Cons. Round 3 - Alexander Tagler (Lincoln-Way Vittum Cats) won by injury default over Tom Culp (Champions WC) Inj. 0:00</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Jack Hartman (Barrington Broncos WC) won by fall over Anthony Chiaro (SCN Youth WC) Fall 1:17</li>\n<li>Semifinal - Kennedy Blades (Martinez Fox Valley Elite) won by fall over Braeden Tosterud (Elk Grove Junior Grens) Fall 0:17</li>\n<li>Cons. Round 3 - Mario Tormey (Tinley Park Bulldogs WC) won by decision over Kevin Zimmer (Lincoln-Way Vittum Cats) Dec 8-5</li>\n<li>Cons. Round 3 - Jayrid Stoltz (Peoria Razorbacks WC) won in sudden victory - 1 over Stacey Terry (Harvey Twisters WC) SV-1 11-9</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Jason Hermann (Stockton Renegades) won by major decision over Robert Gaylord (Redhawk WC) Maj 9-0</li>\n<li>Semifinal - Andrew Wenzel (Dakota WC) won by fall over Buddy Evangelista (Greg Gomez Trained Wrestling) Fall 1:28</li>\n<li>Cons. Round 3 - Jacob Mumm (Bolingbrook Junior Raiders) won by fall over Eathin Diveley (Lil Bucs WC) Fall 2:21</li>\n<li>Cons. Round 3 - William White (Mt. Vernon Lions WC) won by major decision over Christopher Carr (Izzy Style Wrestling) Maj 14-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Mathieu Arsenault (Celtic Elite) won by decision over Colin Kohler (Celtic Elite) Dec 9-4</li>\n<li>Semifinal - Donald Dorich (Minooka Indians Elite) won by major decision over Pate Eastin (Unity Youth WC) Maj 9-1</li>\n<li>Cons. Round 3 - Barry Johnson (AJ Junior Wildcats WC) won by decision over Michael Roath (SCN Youth WC) Dec 7-2</li>\n<li>Cons. Round 3 - Aidan Roberts (Golden Eagles WC) won by fall over Ethan Sperry (Crusaders` Elite) Fall 2:38</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Brandon Navarro (Izzy Style Wrestling) won by major decision over Colin O`Neill (Wolfpak WC) Maj 10-0</li>\n<li>Semifinal - Joey Braunagel (Crusaders` Elite) won by disqualification over Sean Alletto (Villa-Lombard Cougars) DQ</li>\n<li>Cons. Round 3 - Elliott Lewis (Tinley Park Bulldogs WC) won by fall over Dillan Johnson (Force WC) Fall 4:15</li>\n<li>Cons. Round 3 - Abel Colunga (Hoopeston Area WC) won by decision over Sydney Manos (Lil Bucs WC) Dec 9-8</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Julian Navarro (Team 1006 Wrestling) won by fall over Xander Schnake (Hononegah WC) Fall 2:42</li>\n<li>Semifinal - Ison Robinson (Bolingbrook Junior Raiders) won by major decision over Nathan Wemstrom (Arlington Cardinals WC) Maj 10-2</li>\n<li>Cons. Round 3 - Benjamin Uribe (Wolfpak WC) won by fall over Ghee Rachal (Harvey Twisters WC) Fall 2:41</li>\n<li>Cons. Round 3 - Jacob Morel (Pitbull Wrestling Alliance) won by major decision over Camren Stinespring (Storm Youth WC) Maj 10-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Luis Cretsinger (Xtreme WC) won by fall over Brody Goodspeed (Geneva Junior Vikings) Fall 1:03</li>\n<li>Semifinal - Tyler Williams (Riverton Youth Wrestling) won by fall over Aydan Trueblood (TJ Trained) Fall 2:12</li>\n<li>Cons. Round 3 - Isaiah Gonzalez (Izzy Style Wrestling) won by fall over Gavin Mouser (Vandalia Jr WC) Fall 3:55</li>\n<li>Cons. Round 3 - Ryan Boersma (Tinley Park Bulldogs WC) won in tie breaker - 1 over William Penrod (Mt. Vernon Lions WC) TB-1 1-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Brock Neill (LP Crunching Cavs) won by fall over Laron Reed (Danville Chargers Wrestling) Fall 1:06</li>\n<li>Semifinal - Hayden Copass (Storm Youth WC) won by fall over Simon Wilson (Champbuilders Wrestling) Fall 3:00</li>\n<li>Cons. Round 3 - Malachi Jennings (Manteno Jr Panthers WC) won by fall over Juan Alvarado (Caravan Kids WC) Fall 0:36</li>\n<li>Cons. Round 3 - Joey Graham (Celtic Elite) won by fall over Robert Schneider (Celtic Elite) Fall 0:26</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Dominic Ducato (Golden Eagles WC) won in sudden victory - 1 over Connor Kidd (TJ Trained) SV-1 7-5</li>\n<li>Semifinal - Jameson Garcia (Gomez Wrestling Academy) won by major decision over Tyler Aters (Martinez Fox Valley Elite) Maj 10-2</li>\n<li>Cons. Round 3 - Saul Trejo (Gomez Wrestling Academy) won by decision over Inocencio Garcia (Force WC) Dec 2-0</li>\n<li>Cons. Round 3 - Shay Korhorn (Force WC) won by decision over Payton Murphy (TJ Trained) Dec 5-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Samuel Hayes (Contender Wrestling) won by decision over Antonio Alvarado (Belvidere Bandits WC) Dec 6-2</li>\n<li>Semifinal - Phoenix Mordick (Dakota WC) won by fall over Joey Malito (Celtic Elite) Fall 0:44</li>\n<li>Cons. Round 3 - Maurice Dotson (Junior Comanche WC) won by decision over Carter Rude (Sauk Valley WC) Dec 2-0</li>\n<li>Cons. Round 3 - Alexander Marre (Gomez Wrestling Academy) won by tech fall over Devin Lozdoski (Harlem Cougars WC) TF 19-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Daniel Sheen (Izzy Style Wrestling) won by decision over Billy Meiszner (Lincoln-Way Vittum Cats) Dec 3-0</li>\n<li>Semifinal - Tyler Guerra (Gomez Wrestling Academy) won by decision over Jacob Macatangay (Force WC) Dec 6-1</li>\n<li>Cons. Round 3 - Edmund Enright (Mustang/SKT WC) won by decision over Caden Muselman (Tinley Park Bulldogs WC) Dec 12-5</li>\n<li>Cons. Round 3 - Carter Hall (Champaign WC) won by tech fall over Isaac Thomas (Midwest Central Youth WC) TF 15-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Charlie Farmer (Young Guns Wrestling) won by decision over Nicholas Gonzalez (Gomez Wrestling Academy) Dec 8-2</li>\n<li>Semifinal - Nasir Bailey (Harvey Twisters WC) won by fall over Santino Robinson (Wrestling 365) Fall 1:12</li>\n<li>Cons. Round 3 - Mason Alessio (Celtic Elite) won by decision over Seth Larson (Force WC) Dec 5-2</li>\n<li>Cons. Round 3 - Christopher Moore (Crystal Lake Wizards) won by decision over Noah Manuel Tapia (Young Guns Wrestling) Dec 5-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Vincent Zerban (Bulls WC) won by decision over Kyle Schickel (Celtic Elite) Dec 6-2</li>\n<li>Semifinal - Kaleb Thompson (Bolingbrook Junior Raiders) won in overtime over Cameron Johnson (Martinez Fox Valley Elite) OT 6-4</li>\n<li>Cons. Round 3 - Ryan Haynes (Pekin Boys &amp; Girls Club) won by fall over Presley Beasley (Crystal Lake Wizards) Fall 3:35</li>\n<li>Cons. Round 3 - Ben Lunn (Edwardsville WC) won by decision over Sean Crump (Izzy Style Wrestling) Dec 7-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Joshua Ogunsanya (Harvey Twisters WC) won by decision over Joel Vandervere (The Wrestling Factory) Dec 4-3</li>\n<li>Semifinal - Luke Odom (Edwardsville WC) won by decision over Kyle Tunink (Sauk Valley WC) Dec 6-0</li>\n<li>Cons. Round 3 - Payton Geigner (Lincoln-Way Vittum Cats) won by decision over Ezekiel Hulet (Super Soldiers WC) Dec 3-0</li>\n<li>Cons. Round 3 - John McDermott (Force WC) won by fall over Thomas Egan (Mustang/SKT WC) Fall 2:44</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Grant Laduke (Celtic Elite) won by decision over Tristan Daugherty (Central Illinois Wrestling Academy) Dec 2-0</li>\n<li>Semifinal - Nicholas Bolivar (Gomez Wrestling Academy) won by decision over Zeke Marshall (Martinez Fox Valley Elite) Dec 2-0</li>\n<li>Cons. Round 3 - Connor Gaynor (Tinley Park Bulldogs WC) won by decision over Jake Harrier (Golden Eagles WC) Dec 3-0</li>\n<li>Cons. Round 3 - Christian Goin (Super Soldiers WC) won by major decision over Bryce Shelton (Crystal Lake Wizards) Maj 12-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Fabian Lopez (Martinez Fox Valley Elite) won by tech fall over Donovan Golden (Brawlers WC) TF 17-2</li>\n<li>Semifinal - James Pierandozzi (Bolingbrook Junior Raiders) won by decision over Jacob Tinajero (SCN Youth WC) Dec 5-0</li>\n<li>Cons. Round 3 - Carlos Sanchez (Lil Bucs WC) won by fall over Rocco Iannantone (Lincoln-Way Vittum Cats) Fall 3:17</li>\n<li>Cons. Round 3 - Reese Martin (Glenbard East Jr Rams) won by fall over William Hillard (Triad Little Knights WC) Fall 4:19</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Noah Villarreal (Martinez Fox Valley Elite) won by major decision over Danny Pucino (The Wrestling Factory) Maj 9-0</li>\n<li>Semifinal - Sincere Bailey (Harvey Twisters WC) won by decision over Zachary Kolb (Force WC) Dec 6-1</li>\n<li>Cons. Round 3 - Drew Nash (Lemont Bears) won by fall over Cole Watkins (Super Soldiers WC) Fall 0:25</li>\n<li>Cons. Round 3 - Ryan Gardner (Iguana WC) won by fall over Jackson Certa (Martinez Fox Valley Elite) Fall 0:21</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Jake Mensik (Bolingbrook Junior Raiders) won by decision over Ashton Breen (Bolingbrook Junior Raiders) Dec 2-1</li>\n<li>Semifinal - Kevin Countryman (Celtic Elite) won by major decision over Jack Patting (Young Guns Wrestling) Maj 12-2</li>\n<li>Cons. Round 3 - Dylan Connell (The Wrestling Factory) won by decision over Austin Abitua (Hononegah WC) Dec 5-4</li>\n<li>Cons. Round 3 - Chad Richards (Harlem Cougars WC) won by major decision over Daemyen Middlebrooks (Little Huskies WC) Maj 11-3</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Preston Berry (Greg Gomez Trained Wrestling) won in overtime over Isaiah Parker (The Wrestling Factory) OT 6-4</li>\n<li>Semifinal - Noah Alsguson (Harvey Twisters WC) won by decision over Victor Guzman (Rock Island WC) Dec 6-0</li>\n<li>Cons. Round 3 - Joe Chapman (Little Huskies WC) won in tie breaker - 1 over Alejandro Mejia (Pitbull Wrestling Alliance) TB-1 3-1</li>\n<li>Cons. Round 3 - Zeke Waltz (Jersey Junior Panthers Wrestling) won by decision over Jakob Wheeler (Celtic Elite) Dec 5-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Fidel Mayora (Epic Wrestling) won by major decision over Antonio Figueroa (Hononegah WC) Maj 12-0</li>\n<li>Semifinal - Eric Epenesa (Edwardsville WC) won by injury default over Luke Rasmussen (Barrington Broncos WC) Inj. 3:38</li>\n<li>Cons. Round 3 - Jordan Chisum (Zee-Bee Stingers WC) won by tech fall over Ian Swidergal (Celtic Elite) TF 17-2</li>\n<li>Cons. Round 3 - Mustafa St. Clair (Harvey Twisters WC) won by fall over Bradley Peters (Cary Matmen WC) Fall 2:58</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Grant Ripperda (Springfield Capitals Kids WC) won by fall over Jeffrey Tyler (Granite City Wrestling Association) Fall 1:02</li>\n<li>Semifinal - Dalton Hall (Champaign WC) won by decision over Caleb Grau (Team Mascoutah WC) Dec 11-5</li>\n<li>Cons. Round 3 - Joseph Parrish (Fox Valley WC) won by decision over John Sexton (Saber WC) Dec 9-4</li>\n<li>Cons. Round 3 - Tommy Evans (Wolves WC) won by fall over Thomas Luedke (Celtic Elite) Fall 2:37</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Mikey Bosco (Tinley Park Bulldogs WC) won in overtime over Blake Moss (Edwardsville WC) OT 8-6</li>\n<li>Semifinal - Nick Stemmet (Bolingbrook Junior Raiders) won by decision over Logan Wilson (Champaign WC) Dec 2-0</li>\n<li>Cons. Round 3 - Vincent Querciagrossa (Metamora Kids WC) won by fall over Carter Maggio (St. Charles WC) Fall 2:37</li>\n<li>Cons. Round 3 - Vincent Clinite (Z`s Team Pena) won by decision over River Flute (West Frankfort Jr. Redbirds) Dec 13-8</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Reide Wilson (Granite City Wrestling Association) won by decision over Tyler McCracken (Edwardsville WC) Dec 7-0</li>\n<li>Semifinal - Anthony Glauser (The Wrestling Factory) won by major decision over Connor Eaton (West Frankfort Jr. Redbirds) Maj 15-4</li>\n<li>Cons. Round 3 - Tyson Heerman (TJ Trained) won by fall over Joshua Crandall (Wolves WC) Fall 4:11</li>\n<li>Cons. Round 3 - Peyton Lind (Xtreme WC) won by decision over Julian Ramirez (Tinley Park Bulldogs WC) Dec 6-4</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Thomas Doyle (Lincoln-Way Vittum Cats) won by decision over Nicholas Skamra (Headlock Wrestling Academy) Dec 9-2</li>\n<li>Semifinal - Trevor Swier (Force WC) won by fall over Brandon Hoselton (Prairie Central Hawks) Fall 1:03</li>\n<li>Cons. Round 3 - Tyler Berhenke (Champbuilders Wrestling) won by major decision over Alvin Maten (Harlem Cougars WC) Maj 15-3</li>\n<li>Cons. Round 3 - Jaylin Garay (Villa-Lombard Cougars) won by fall over Cesar Resendiz (DuPage WC) Fall 1:12</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Victor Rodriguez (Villa-Lombard Cougars) Fall 1:06</li>\n<li>Semifinal - Partick Peters (Tinley Park Bulldogs WC) won by fall over Dustin Olmstead (Belleville Little Devils WC) Fall 0:52</li>\n<li>Cons. Round 3 - Jacob Shipla (Minooka Indians Elite) won by fall over Basilo Betancourt (Harvey Twisters WC) Fall 0:47</li>\n<li>Cons. Round 3 - Jonathan Lopez (Waukegan Youth WC) won by fall over Jalen Farmer (St. Charles WC) Fall 1:29</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Drew Gutknecht (Minooka Indians Elite) won by decision over Colin Baker (Downers Grove Cougars) Dec 1-0</li>\n<li>Semifinal - Cody Goodman (The Wrestling Factory) won by decision over Nikolas Mishka (Tinley Park Bulldogs WC) Dec 5-0</li>\n<li>Cons. Round 3 - Zachary Wallace (Moline WC) won by fall over Peter Gianaris (Maine Eagles WC) Fall 4:26</li>\n<li>Cons. Round 3 - Mason Baker (O`Fallon Little Panthers WC) won by decision over Angel Jaimes (Martinez Fox Valley Elite) Dec 4-3</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Anthony Enlow (Vandalia Jr WC) won by decision over Tyler Elsbury (Xtreme WC) Dec 6-3</li>\n<li>Semifinal - Randy Turner (Team Mascoutah WC) won by fall over Martin Cortina (Force WC) Fall 3:39</li>\n<li>Cons. Round 3 - Derick Platt (Team 1006 Wrestling) won by fall over Payton Piraino (LP Crunching Cavs) Fall 2:31</li>\n<li>Cons. Round 3 - Pedro Castanon (Villa-Lombard Cougars) won by fall over Michael Dubanowski (Rockets Youth WC) Fall 2:22</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Jack Finnegan (Force WC) won in tie breaker - 1 over Christian Olsen (Crystal Lake Wizards) TB-1 3-2</li>\n<li>Semifinal - Dylan Amico (Force WC) won by decision over Joseph Knapp (Brawlers WC) Dec 8-2</li>\n<li>Cons. Round 3 - Cameron Clark (TJ Trained) won by decision over Ronan Schuelke (Maddog Wrestling Academy) Dec 5-0</li>\n<li>Cons. Round 3 - Marco Nash (Harvey Twisters WC) won by decision over John Asiuras (Headlock Wrestling Academy) Dec 10-9</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Joshua Koderhandt (Crusaders` Elite) won by fall over Malakye Rodriguez (Red Raiders Wrestling Team) Fall 0:44</li>\n<li>Semifinal - Jacob Rundell (Little Huskies WC) won by fall over Andrew Herbst (Hawk WC Ltd.) Fall 2:46</li>\n<li>Cons. Round 3 - Alex Randell (Greg Gomez Trained Wrestling) won by decision over Joe Roti (Lincoln-Way Vittum Cats) Dec 2-1</li>\n<li>Cons. Round 3 - Matthew Minick (O`Fallon Little Panthers WC) won in overtime over Jarek Wehrle (Vandalia Jr WC) OT 5-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Diego Sotelo (Martinez Fox Valley Elite) won by decision over Javen Estrada (Bolingbrook Junior Raiders) Dec 7-0</li>\n<li>Semifinal - Kendall Norfleet (Harvey Twisters WC) won by decision over Nicholas Matthias (Celtic Elite) Dec 8-6</li>\n<li>Cons. Round 3 - Joey Chirillo (Tinley Park Bulldogs WC) won in sudden victory - 1 over Michael Kass (Mean Green Machine) SV-1 2-0</li>\n<li>Cons. Round 3 - Jalen May (Crusaders` Elite) won by fall over Kaeden Kinison (Springfield Capitals Kids WC) Fall 1:06</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Jordan Blew (Force WC) won by decision over Damari Reed (Harvey Twisters WC) Dec 5-2</li>\n<li>Cons. Semi - Grover Mays (AJ Junior Wildcats WC) won by fall over Brac Hooper (Champaign WC) Fall 4:06</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Owen Gerdes (Celtic Elite) won by decision over Mia Palumbo (Mean Green Machine) Dec 6-3</li>\n<li>Cons. Semi - Ethan Stiles (Izzy Style Wrestling) won by decision over Blain Christie (Brawlers WC) Dec 11-7</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Dayton Hall (Aces WC) won by decision over Mateen Taylor (Harvey Twisters WC) Dec 6-1</li>\n<li>Cons. Semi - Joey Cape (Super Soldiers WC) won by decision over Marko Hennin (Barrington Broncos WC) Dec 9-5</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Logan Balosky (Gomez Wrestling Academy) won by fall over Michael Rodriguez (Mean Green Machine) Fall 2:19</li>\n<li>Cons. Semi - Michael Caliendo (Batavia WC) won by decision over Damien Lopez (Martinez Fox Valley Elite) Dec 7-4</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Bradley Gillum (Martinez Fox Valley Elite) won by decision over Raymond Arebalo (Crosstown Wrestling) Dec 4-2</li>\n<li>Cons. Semi - Bryce Boumans (Fox Valley WC) won by major decision over Cooper Wettig (Izzy Style Wrestling) Maj 10-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Caden Ernd (Crystal Lake Wizards) won by decision over Grant Hansen (Maddog Wrestling Academy) Dec 9-8</li>\n<li>Cons. Semi - Alexander Tagler (Lincoln-Way Vittum Cats) won by tech fall over Case Harmston (Stockton Renegades) TF 20-5</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Mario Tormey (Tinley Park Bulldogs WC) won by decision over Anthony Chiaro (SCN Youth WC) Dec 6-0</li>\n<li>Cons. Semi - Braeden Tosterud (Elk Grove Junior Grens) won by decision over Jayrid Stoltz (Peoria Razorbacks WC) Dec 7-5</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Jacob Mumm (Bolingbrook Junior Raiders) won by fall over Robert Gaylord (Redhawk WC) Fall 0:46</li>\n<li>Cons. Semi - Buddy Evangelista (Greg Gomez Trained Wrestling) won by decision over William White (Mt. Vernon Lions WC) Dec 4-3</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Colin Kohler (Celtic Elite) won by decision over Barry Johnson (AJ Junior Wildcats WC) Dec 1-0</li>\n<li>Cons. Semi - Pate Eastin (Unity Youth WC) won by decision over Aidan Roberts (Golden Eagles WC) Dec 6-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Elliott Lewis (Tinley Park Bulldogs WC) won by decision over Colin O`Neill (Wolfpak WC) Dec 9-2</li>\n<li>Cons. Semi - Sean Alletto (Villa-Lombard Cougars) won by fall over Abel Colunga (Hoopeston Area WC) Fall 0:52</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Xander Schnake (Hononegah WC) won by fall over Benjamin Uribe (Wolfpak WC) Fall 0:51</li>\n<li>Cons. Semi - Jacob Morel (Pitbull Wrestling Alliance) won by decision over Nathan Wemstrom (Arlington Cardinals WC) Dec 4-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Isaiah Gonzalez (Izzy Style Wrestling) won by fall over Brody Goodspeed (Geneva Junior Vikings) Fall 1:23</li>\n<li>Cons. Semi - Aydan Trueblood (TJ Trained) won by decision over Ryan Boersma (Tinley Park Bulldogs WC) Dec 6-3</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Malachi Jennings (Manteno Jr Panthers WC) won by fall over Laron Reed (Danville Chargers Wrestling) Fall 0:45</li>\n<li>Cons. Semi - Simon Wilson (Champbuilders Wrestling) won by decision over Joey Graham (Celtic Elite) Dec 8-2</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Saul Trejo (Gomez Wrestling Academy) won by major decision over Connor Kidd (TJ Trained) Maj 8-0</li>\n<li>Cons. Semi - Shay Korhorn (Force WC) won by decision over Tyler Aters (Martinez Fox Valley Elite) Dec 2-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Antonio Alvarado (Belvidere Bandits WC) won by fall over Maurice Dotson (Junior Comanche WC) Fall 1:48</li>\n<li>Cons. Semi - Joey Malito (Celtic Elite) won by decision over Alexander Marre (Gomez Wrestling Academy) Dec 4-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Billy Meiszner (Lincoln-Way Vittum Cats) won by decision over Edmund Enright (Mustang/SKT WC) Dec 7-3</li>\n<li>Cons. Semi - Jacob Macatangay (Force WC) won by fall over Carter Hall (Champaign WC) Fall 1:22</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Nicholas Gonzalez (Gomez Wrestling Academy) won by fall over Mason Alessio (Celtic Elite) Fall 3:39</li>\n<li>Cons. Semi - Santino Robinson (Wrestling 365) won by decision over Christopher Moore (Crystal Lake Wizards) Dec 6-4</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Kyle Schickel (Celtic Elite) won by decision over Ryan Haynes (Pekin Boys &amp; Girls Club) Dec 7-0</li>\n<li>Cons. Semi - Cameron Johnson (Martinez Fox Valley Elite) won in overtime over Ben Lunn (Edwardsville WC) OT 6-4</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Joel Vandervere (The Wrestling Factory) won by decision over Payton Geigner (Lincoln-Way Vittum Cats) Dec 9-7</li>\n<li>Cons. Semi - Kyle Tunink (Sauk Valley WC) won by major decision over John McDermott (Force WC) Maj 9-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Connor Gaynor (Tinley Park Bulldogs WC) won in overtime over Tristan Daugherty (Central Illinois Wrestling Academy) OT 3-1</li>\n<li>Cons. Semi - Zeke Marshall (Martinez Fox Valley Elite) won by major decision over Christian Goin (Super Soldiers WC) Maj 8-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Donovan Golden (Brawlers WC) won by decision over Carlos Sanchez (Lil Bucs WC) Dec 5-1</li>\n<li>Cons. Semi - Jacob Tinajero (SCN Youth WC) won by fall over Reese Martin (Glenbard East Jr Rams) Fall 4:24</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Danny Pucino (The Wrestling Factory) won by decision over Drew Nash (Lemont Bears) Dec 10-8</li>\n<li>Cons. Semi - Zachary Kolb (Force WC) won by decision over Ryan Gardner (Iguana WC) Dec 5-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Ashton Breen (Bolingbrook Junior Raiders) won by decision over Dylan Connell (The Wrestling Factory) Dec 4-0</li>\n<li>Cons. Semi - Chad Richards (Harlem Cougars WC) won by fall over Jack Patting (Young Guns Wrestling) Fall 1:24</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Isaiah Parker (The Wrestling Factory) won by major decision over Joe Chapman (Little Huskies WC) Maj 13-2</li>\n<li>Cons. Semi - Victor Guzman (Rock Island WC) won by decision over Zeke Waltz (Jersey Junior Panthers Wrestling) Dec 8-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Jordan Chisum (Zee-Bee Stingers WC) won by decision over Antonio Figueroa (Hononegah WC) Dec 6-1</li>\n<li>Cons. Semi - Mustafa St. Clair (Harvey Twisters WC) won by injury default over Luke Rasmussen (Barrington Broncos WC) Inj. 0:00</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Joseph Parrish (Fox Valley WC) won by decision over Jeffrey Tyler (Granite City Wrestling Association) Dec 8-4</li>\n<li>Cons. Semi - Caleb Grau (Team Mascoutah WC) won by major decision over Tommy Evans (Wolves WC) Maj 14-6</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Blake Moss (Edwardsville WC) won by decision over Vincent Querciagrossa (Metamora Kids WC) Dec 6-2</li>\n<li>Cons. Semi - Logan Wilson (Champaign WC) won by fall over Vincent Clinite (Z`s Team Pena) Fall 2:11</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Tyson Heerman (TJ Trained) won in overtime over Tyler McCracken (Edwardsville WC) OT 2-1</li>\n<li>Cons. Semi - Connor Eaton (West Frankfort Jr. Redbirds) won by fall over Peyton Lind (Xtreme WC) Fall 4:29</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Tyler Berhenke (Champbuilders Wrestling) won by decision over Nicholas Skamra (Headlock Wrestling Academy) Dec 4-3</li>\n<li>Cons. Semi - Brandon Hoselton (Prairie Central Hawks) won by fall over Jaylin Garay (Villa-Lombard Cougars) Fall 0:45</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Jacob Shipla (Minooka Indians Elite) won by injury default over Victor Rodriguez (Villa-Lombard Cougars) Inj. 3:00</li>\n<li>Cons. Semi - Jonathan Lopez (Waukegan Youth WC) won by fall over Dustin Olmstead (Belleville Little Devils WC) Fall 4:22</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Zachary Wallace (Moline WC) won by decision over Colin Baker (Downers Grove Cougars) Dec 4-0</li>\n<li>Cons. Semi - Nikolas Mishka (Tinley Park Bulldogs WC) won by decision over Mason Baker (O`Fallon Little Panthers WC) Dec 2-1</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Tyler Elsbury (Xtreme WC) won by fall over Derick Platt (Team 1006 Wrestling) Fall 0:25</li>\n<li>Cons. Semi - Martin Cortina (Force WC) won by fall over Pedro Castanon (Villa-Lombard Cougars) Fall 3:53</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Christian Olsen (Crystal Lake Wizards) won by decision over Cameron Clark (TJ Trained) Dec 3-2</li>\n<li>Cons. Semi - Joseph Knapp (Brawlers WC) won by decision over Marco Nash (Harvey Twisters WC) Dec 5-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Malakye Rodriguez (Red Raiders Wrestling Team) won by decision over Alex Randell (Greg Gomez Trained Wrestling) Dec 3-2</li>\n<li>Cons. Semi - Andrew Herbst (Hawk WC Ltd.) won by decision over Matthew Minick (O`Fallon Little Panthers WC) Dec 6-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Javen Estrada (Bolingbrook Junior Raiders) won by decision over Joey Chirillo (Tinley Park Bulldogs WC) Dec 7-0</li>\n<li>Cons. Semi - Nicholas Matthias (Celtic Elite) won by decision over Jalen May (Crusaders` Elite) Dec 2-0</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Jordan Blew (Force WC) won by fall over Grover Mays (AJ Junior Wildcats WC) Fall 1:14</li>\n<li>5th Place Match - Damari Reed (Harvey Twisters WC) won by decision over Brac Hooper (Champaign WC) Dec 7-5</li>\n<li>7th Place Match - Justin Warmowski (Fox Lake WC) won by fall over Jack McClimon (Celtic Elite) Fall 1:08</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Ethan Stiles (Izzy Style Wrestling) won by decision over Owen Gerdes (Celtic Elite) Dec 7-3</li>\n<li>5th Place Match - Blain Christie (Brawlers WC) won by decision over Mia Palumbo (Mean Green Machine) Dec 4-3</li>\n<li>7th Place Match - Luke Barron (Team 1006 Wrestling) won by decision over Samuel Henkle (Crystal Lake Wizards) Dec 7-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Joey Cape (Super Soldiers WC) won by decision over Dayton Hall (Aces WC) Dec 4-1</li>\n<li>5th Place Match - Marko Hennin (Barrington Broncos WC) won in sudden victory - 1 over Mateen Taylor (Harvey Twisters WC) SV-1 6-4</li>\n<li>7th Place Match - Ryder Hunkins (Golden Eagles WC) won by decision over Mitchell Rudsinski (Lincoln-Way Vittum Cats) Dec 5-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Michael Caliendo (Batavia WC) won by decision over Logan Balosky (Gomez Wrestling Academy) Dec 4-2</li>\n<li>5th Place Match - Damien Lopez (Martinez Fox Valley Elite) won by fall over Michael Rodriguez (Mean Green Machine) Fall 3:32</li>\n<li>7th Place Match - Jeremy Jakowitsch (Barrington Broncos WC) won by forfeit over Rashon Allen (Urbana Tigers WC) FF</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Bradley Gillum (Martinez Fox Valley Elite) won by major decision over Bryce Boumans (Fox Valley WC) Maj 10-2</li>\n<li>5th Place Match - Raymond Arebalo (Crosstown Wrestling) won by injury default over Cooper Wettig (Izzy Style Wrestling) Inj. 0:00</li>\n<li>7th Place Match - Blake Varga (SCN Youth WC) won by decision over Michael Kelly (Tinley Park Bulldogs WC) Dec 4-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Alexander Tagler (Lincoln-Way Vittum Cats) won by major decision over Caden Ernd (Crystal Lake Wizards) Maj 9-1</li>\n<li>5th Place Match - Case Harmston (Stockton Renegades) won by decision over Grant Hansen (Maddog Wrestling Academy) Dec 10-5</li>\n<li>7th Place Match - Elijah Chiaro (SCN Youth WC) won by injury default over Tom Culp (Champions WC) Inj. 0:00</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Mario Tormey (Tinley Park Bulldogs WC) won by fall over Braeden Tosterud (Elk Grove Junior Grens) Fall 2:49</li>\n<li>5th Place Match - Anthony Chiaro (SCN Youth WC) won by major decision over Jayrid Stoltz (Peoria Razorbacks WC) Maj 15-6</li>\n<li>7th Place Match - Kevin Zimmer (Lincoln-Way Vittum Cats) won by fall over Stacey Terry (Harvey Twisters WC) Fall 3:50</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Jacob Mumm (Bolingbrook Junior Raiders) won by major decision over Buddy Evangelista (Greg Gomez Trained Wrestling) Maj 10-0</li>\n<li>5th Place Match - William White (Mt. Vernon Lions WC) won by fall over Robert Gaylord (Redhawk WC) Fall 1:15</li>\n<li>7th Place Match - Eathin Diveley (Lil Bucs WC) won by fall over Christopher Carr (Izzy Style Wrestling) Fall 4:00</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Pate Eastin (Unity Youth WC) won by decision over Colin Kohler (Celtic Elite) Dec 5-3</li>\n<li>5th Place Match - Aidan Roberts (Golden Eagles WC) won by decision over Barry Johnson (AJ Junior Wildcats WC) Dec 1-0</li>\n<li>7th Place Match - Michael Roath (SCN Youth WC) won by major decision over Ethan Sperry (Crusaders` Elite) Maj 10-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Elliott Lewis (Tinley Park Bulldogs WC) won by fall over Sean Alletto (Villa-Lombard Cougars) Fall 4:00</li>\n<li>5th Place Match - Abel Colunga (Hoopeston Area WC) won by decision over Colin O`Neill (Wolfpak WC) Dec 7-6</li>\n<li>7th Place Match - Dillan Johnson (Force WC) won by decision over Sydney Manos (Lil Bucs WC) Dec 8-6</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Xander Schnake (Hononegah WC) won by fall over Jacob Morel (Pitbull Wrestling Alliance) Fall 2:12</li>\n<li>5th Place Match - Benjamin Uribe (Wolfpak WC) won by fall over Nathan Wemstrom (Arlington Cardinals WC) Fall 1:20</li>\n<li>7th Place Match - Ghee Rachal (Harvey Twisters WC) won by fall over Camren Stinespring (Storm Youth WC) Fall 2:56</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Aydan Trueblood (TJ Trained) won in tie breaker - 1 over Isaiah Gonzalez (Izzy Style Wrestling) TB-1 5-2</li>\n<li>5th Place Match - Ryan Boersma (Tinley Park Bulldogs WC) won by decision over Brody Goodspeed (Geneva Junior Vikings) Dec 3-2</li>\n<li>7th Place Match - William Penrod (Mt. Vernon Lions WC) won by fall over Gavin Mouser (Vandalia Jr WC) Fall 4:26</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Malachi Jennings (Manteno Jr Panthers WC) won by decision over Simon Wilson (Champbuilders Wrestling) Dec 6-1</li>\n<li>5th Place Match - Joey Graham (Celtic Elite) won by fall over Laron Reed (Danville Chargers Wrestling) Fall 2:07</li>\n<li>7th Place Match - Juan Alvarado (Caravan Kids WC) won by fall over Robert Schneider (Celtic Elite) Fall 0:45</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Saul Trejo (Gomez Wrestling Academy) won by decision over Shay Korhorn (Force WC) Dec 3-2</li>\n<li>5th Place Match - Tyler Aters (Martinez Fox Valley Elite) won by fall over Connor Kidd (TJ Trained) Fall 4:00</li>\n<li>7th Place Match - Inocencio Garcia (Force WC) won by decision over Payton Murphy (TJ Trained) Dec 5-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Antonio Alvarado (Belvidere Bandits WC) won by fall over Joey Malito (Celtic Elite) Fall 0:43</li>\n<li>5th Place Match - Alexander Marre (Gomez Wrestling Academy) won by fall over Maurice Dotson (Junior Comanche WC) Fall 0:51</li>\n<li>7th Place Match - Carter Rude (Sauk Valley WC) won by major decision over Devin Lozdoski (Harlem Cougars WC) Maj 12-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Billy Meiszner (Lincoln-Way Vittum Cats) won by major decision over Jacob Macatangay (Force WC) Maj 9-0</li>\n<li>5th Place Match - Edmund Enright (Mustang/SKT WC) won by decision over Carter Hall (Champaign WC) Dec 5-1</li>\n<li>7th Place Match - Caden Muselman (Tinley Park Bulldogs WC) won by fall over Isaac Thomas (Midwest Central Youth WC) Fall 2:25</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Santino Robinson (Wrestling 365) won by decision over Nicholas Gonzalez (Gomez Wrestling Academy) Dec 4-0</li>\n<li>5th Place Match - Christopher Moore (Crystal Lake Wizards) won by decision over Mason Alessio (Celtic Elite) Dec 7-1</li>\n<li>7th Place Match - Seth Larson (Force WC) won by decision over Noah Manuel Tapia (Young Guns Wrestling) Dec 6-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Kyle Schickel (Celtic Elite) won by fall over Cameron Johnson (Martinez Fox Valley Elite) Fall 0:39</li>\n<li>5th Place Match - Ben Lunn (Edwardsville WC) won by decision over Ryan Haynes (Pekin Boys &amp; Girls Club) Dec 4-0</li>\n<li>7th Place Match - Presley Beasley (Crystal Lake Wizards) won by decision over Sean Crump (Izzy Style Wrestling) Dec 2-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Joel Vandervere (The Wrestling Factory) won by decision over Kyle Tunink (Sauk Valley WC) Dec 6-2</li>\n<li>5th Place Match - Payton Geigner (Lincoln-Way Vittum Cats) won by decision over John McDermott (Force WC) Dec 4-1</li>\n<li>7th Place Match - Ezekiel Hulet (Super Soldiers WC) won by decision over Thomas Egan (Mustang/SKT WC) Dec 7-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Connor Gaynor (Tinley Park Bulldogs WC) won by decision over Zeke Marshall (Martinez Fox Valley Elite) Dec 6-0</li>\n<li>5th Place Match - Tristan Daugherty (Central Illinois Wrestling Academy) won by decision over Christian Goin (Super Soldiers WC) Dec 3-0</li>\n<li>7th Place Match - Jake Harrier (Golden Eagles WC) won by decision over Bryce Shelton (Crystal Lake Wizards) Dec 7-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Jacob Tinajero (SCN Youth WC) won by decision over Donovan Golden (Brawlers WC) Dec 5-1</li>\n<li>5th Place Match - Reese Martin (Glenbard East Jr Rams) won by fall over Carlos Sanchez (Lil Bucs WC) Fall 3:40</li>\n<li>7th Place Match - Rocco Iannantone (Lincoln-Way Vittum Cats) won by fall over William Hillard (Triad Little Knights WC) Fall 3:48</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Danny Pucino (The Wrestling Factory) won by major decision over Zachary Kolb (Force WC) Maj 11-3</li>\n<li>5th Place Match - Drew Nash (Lemont Bears) won by decision over Ryan Gardner (Iguana WC) Dec 6-0</li>\n<li>7th Place Match - Cole Watkins (Super Soldiers WC) won by fall over Jackson Certa (Martinez Fox Valley Elite) Fall 1:18</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Ashton Breen (Bolingbrook Junior Raiders) won by decision over Chad Richards (Harlem Cougars WC) Dec 6-0</li>\n<li>5th Place Match - Dylan Connell (The Wrestling Factory) won by decision over Jack Patting (Young Guns Wrestling) Dec 6-2</li>\n<li>7th Place Match - Daemyen Middlebrooks (Little Huskies WC) won by decision over Austin Abitua (Hononegah WC) Dec 8-6</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Victor Guzman (Rock Island WC) won by decision over Isaiah Parker (The Wrestling Factory) Dec 3-1</li>\n<li>5th Place Match - Zeke Waltz (Jersey Junior Panthers Wrestling) won by decision over Joe Chapman (Little Huskies WC) Dec 5-1</li>\n<li>7th Place Match - Jakob Wheeler (Celtic Elite) won by decision over Alejandro Mejia (Pitbull Wrestling Alliance) Dec 11-8</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Jordan Chisum (Zee-Bee Stingers WC) won by decision over Mustafa St. Clair (Harvey Twisters WC) Dec 3-2</li>\n<li>5th Place Match - Antonio Figueroa (Hononegah WC) won by injury default over Luke Rasmussen (Barrington Broncos WC) Inj. 0:00</li>\n<li>7th Place Match - Bradley Peters (Cary Matmen WC) won by decision over Ian Swidergal (Celtic Elite) Dec 6-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Caleb Grau (Team Mascoutah WC) won by fall over Joseph Parrish (Fox Valley WC) Fall 1:22</li>\n<li>5th Place Match - Tommy Evans (Wolves WC) won by fall over Jeffrey Tyler (Granite City Wrestling Association) Fall 1:56</li>\n<li>7th Place Match - Thomas Luedke (Celtic Elite) won by decision over John Sexton (Saber WC) Dec 7-5</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Logan Wilson (Champaign WC) won by fall over Blake Moss (Edwardsville WC) Fall 1:28</li>\n<li>5th Place Match - Vincent Clinite (Z`s Team Pena) won by fall over Vincent Querciagrossa (Metamora Kids WC) Fall 1:30</li>\n<li>7th Place Match - River Flute (West Frankfort Jr. Redbirds) won by tech fall over Carter Maggio (St. Charles WC) TF 19-4</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Connor Eaton (West Frankfort Jr. Redbirds) won by decision over Tyson Heerman (TJ Trained) Dec 6-2</li>\n<li>5th Place Match - Peyton Lind (Xtreme WC) won by fall over Tyler McCracken (Edwardsville WC) Fall 4:11</li>\n<li>7th Place Match - Julian Ramirez (Tinley Park Bulldogs WC) won by decision over Joshua Crandall (Wolves WC) Dec 7-2</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Brandon Hoselton (Prairie Central Hawks) won by fall over Tyler Berhenke (Champbuilders Wrestling) Fall 1:30</li>\n<li>5th Place Match - Nicholas Skamra (Headlock Wrestling Academy) won by decision over Jaylin Garay (Villa-Lombard Cougars) Dec 13-7</li>\n<li>7th Place Match - Alvin Maten (Harlem Cougars WC) won by decision over Cesar Resendiz (DuPage WC) Dec 7-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Jacob Shipla (Minooka Indians Elite) won by fall over Jonathan Lopez (Waukegan Youth WC) Fall 3:23</li>\n<li>5th Place Match - Dustin Olmstead (Belleville Little Devils WC) won by injury default over Victor Rodriguez (Villa-Lombard Cougars) Inj. 0:00</li>\n<li>7th Place Match - Jalen Farmer (St. Charles WC) won in sudden victory - 1 over Basilo Betancourt (Harvey Twisters WC) SV-1 3-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Nikolas Mishka (Tinley Park Bulldogs WC) won by decision over Zachary Wallace (Moline WC) Dec 3-2</li>\n<li>5th Place Match - Mason Baker (O`Fallon Little Panthers WC) won in overtime over Colin Baker (Downers Grove Cougars) OT 3-2</li>\n<li>7th Place Match - Angel Jaimes (Martinez Fox Valley Elite) won by decision over Peter Gianaris (Maine Eagles WC) Dec 7-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Tyler Elsbury (Xtreme WC) won by fall over Martin Cortina (Force WC) Fall 0:53</li>\n<li>5th Place Match - Derick Platt (Team 1006 Wrestling) won by fall over Pedro Castanon (Villa-Lombard Cougars) Fall 1:00</li>\n<li>7th Place Match - Payton Piraino (LP Crunching Cavs) won by fall over Michael Dubanowski (Rockets Youth WC) Fall 0:55</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Christian Olsen (Crystal Lake Wizards) won by decision over Joseph Knapp (Brawlers WC) Dec 9-2</li>\n<li>5th Place Match - Cameron Clark (TJ Trained) won by decision over Marco Nash (Harvey Twisters WC) Dec 6-4</li>\n<li>7th Place Match - Ronan Schuelke (Maddog Wrestling Academy) won by decision over John Asiuras (Headlock Wrestling Academy) Dec 6-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Andrew Herbst (Hawk WC Ltd.) won by decision over Malakye Rodriguez (Red Raiders Wrestling Team) Dec 4-1</li>\n<li>5th Place Match - Alex Randell (Greg Gomez Trained Wrestling) won by decision over Matthew Minick (O`Fallon Little Panthers WC) Dec 4-2</li>\n<li>7th Place Match - Joe Roti (Lincoln-Way Vittum Cats) won in overtime over Jarek Wehrle (Vandalia Jr WC) OT 3-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Nicholas Matthias (Celtic Elite) won by decision over Javen Estrada (Bolingbrook Junior Raiders) Dec 5-2</li>\n<li>5th Place Match - Jalen May (Crusaders` Elite) won by decision over Joey Chirillo (Tinley Park Bulldogs WC) Dec 3-0</li>\n<li>7th Place Match - Michael Kass (Mean Green Machine) won by decision over Kaeden Kinison (Springfield Capitals Kids WC) Dec 6-4</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Kannon Webster (Super Soldiers WC) won by decision over Joseph Fernau (Team 1006 Wrestling) Dec 5-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Grant Matarelli (Edwardsville WC) won by decision over Alex Ventimilla (Martinez Fox Valley Elite) Dec 8-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Dean Hamiti (Martinez Fox Valley Elite) won by fall over Jack Milos (Arlington Cardinals WC) Fall 2:55</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Nain Vazquez (Martinez Fox Valley Elite) won by decision over Robert Major (Bolingbrook Junior Raiders) Dec 7-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Brayden Thompson (Izzy Style Wrestling) won in sudden victory - 1 over Brody Hallin (Crystal Lake Wizards) SV-1 6-4</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Jake Matthews (Headlock Wrestling Academy) won by decision over Jared Gumila (Force WC) Dec 14-7</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Kennedy Blades (Martinez Fox Valley Elite) won by fall over Jack Hartman (Barrington Broncos WC) Fall 1:11</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Jason Hermann (Stockton Renegades) won by decision over Andrew Wenzel (Dakota WC) Dec 5-3</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Donald Dorich (Minooka Indians Elite) won by decision over Mathieu Arsenault (Celtic Elite) Dec 6-3</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Brandon Navarro (Izzy Style Wrestling) won by fall over Joey Braunagel (Crusaders` Elite) Fall 0:38</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Julian Navarro (Team 1006 Wrestling) won by decision over Ison Robinson (Bolingbrook Junior Raiders) Dec 2-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Tyler Williams (Riverton Youth Wrestling) won by fall over Luis Cretsinger (Xtreme WC) Fall 1:09</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Hayden Copass (Storm Youth WC) won by decision over Brock Neill (LP Crunching Cavs) Dec 3-0</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Jameson Garcia (Gomez Wrestling Academy) won in tie breaker - 1 over Dominic Ducato (Golden Eagles WC) TB-1 5-4</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Samuel Hayes (Contender Wrestling) won by fall over Phoenix Mordick (Dakota WC) Fall 4:24</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Daniel Sheen (Izzy Style Wrestling) won in sudden victory - 1 over Tyler Guerra (Gomez Wrestling Academy) SV-1 4-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Nasir Bailey (Harvey Twisters WC) won by decision over Charlie Farmer (Young Guns Wrestling) Dec 8-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Vincent Zerban (Bulls WC) won by decision over Kaleb Thompson (Bolingbrook Junior Raiders) Dec 5-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Luke Odom (Edwardsville WC) won by decision over Joshua Ogunsanya (Harvey Twisters WC) Dec 1-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Nicholas Bolivar (Gomez Wrestling Academy) won by decision over Grant Laduke (Celtic Elite) Dec 3-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Fabian Lopez (Martinez Fox Valley Elite) won by decision over James Pierandozzi (Bolingbrook Junior Raiders) Dec 5-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Noah Villarreal (Martinez Fox Valley Elite) won by decision over Sincere Bailey (Harvey Twisters WC) Dec 9-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Kevin Countryman (Celtic Elite) won by decision over Jake Mensik (Bolingbrook Junior Raiders) Dec 3-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Noah Alsguson (Harvey Twisters WC) won by fall over Preston Berry (Greg Gomez Trained Wrestling) Fall 1:26</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Fidel Mayora (Epic Wrestling) won by tech fall over Eric Epenesa (Edwardsville WC) TF 19-4</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Dalton Hall (Champaign WC) won by decision over Grant Ripperda (Springfield Capitals Kids WC) Dec 10-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Nick Stemmet (Bolingbrook Junior Raiders) won by major decision over Mikey Bosco (Tinley Park Bulldogs WC) Maj 9-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Anthony Glauser (The Wrestling Factory) won by tech fall over Reide Wilson (Granite City Wrestling Association) TF 16-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Trevor Swier (Force WC) won by fall over Thomas Doyle (Lincoln-Way Vittum Cats) Fall 2:17</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Partick Peters (Tinley Park Bulldogs WC) Fall 1:14</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Cody Goodman (The Wrestling Factory) won by major decision over Drew Gutknecht (Minooka Indians Elite) Maj 9-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Anthony Enlow (Vandalia Jr WC) won by fall over Randy Turner (Team Mascoutah WC) Fall 1:21</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Dylan Amico (Force WC) won by decision over Jack Finnegan (Force WC) Dec 2-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Jacob Rundell (Little Huskies WC) won by major decision over Joshua Koderhandt (Crusaders` Elite) Maj 15-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Diego Sotelo (Martinez Fox Valley Elite) won by decision over Kendall Norfleet (Harvey Twisters WC) Dec 7-3</li>\n</ul>\n</section>"
}
