{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - John McDermott (Force Wrestling Club) won by fall over Natris Morris (Tiger Wrestling Club) Fall 1:52</li>\n<li>Champ. Round 1 - Dayton Hall (Aces Wrestling Club) won by major decision over Billy Taylor (Junior Pioneer Wrestling Club) Maj 14-2</li>\n<li>Champ. Round 1 - Michael Flier (Cumberland Youth Wrestling Club) won by decision over Cole Ferguson (Yorkville Wrestling Club) Dec 10-6</li>\n<li>Champ. Round 1 - Nicholas Minnito (Force Wrestling Club) won by decision over Caine Tyus (Bulls Wrestling Club) Dec 6-0</li>\n<li>Champ. Round 1 - Cooper Wettig (Izzy Style Wrestling) won by fall over Zack Rotkvich (Mustang/SKT WC) Fall 2:57</li>\n<li>Champ. Round 1 - Bryce Shelton (Crystal Lake Wizards) won by decision over Michael D`Orazio (SCN Youth Wrestling Club) Dec 1-0</li>\n<li>Champ. Round 1 - Jack Milos (Arlington Cardinals Wrestling Club) won by decision over Michael Caliendo (Batavia Wrestling Club) Dec 3-1</li>\n<li>Champ. Round 1 - Mateen Taylor (Harvey Twisters WC) won by fall over Rocco Carone (Crystal Lake Wizards) Fall 0:54</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Brock Pfeifer (Celtic Elite) won by fall over Nathaniel Dundon (Tiger Wrestling Club) Fall 2:51</li>\n<li>Champ. Round 1 - Jake Harrier (Golden Eagles Wrestling Club) won by decision over Reese Martin (Glenbard East Jr Rams Wrestling Club) Dec 1-0</li>\n<li>Champ. Round 1 - Caden Ernd (Crystal Lake Wizards) won by decision over Rocco Iannantone (Vittum Cats Wrestling Club) Dec 6-4</li>\n<li>Champ. Round 1 - Jacob Tinajero (SCN Youth Wrestling Club) won by fall over Tavius Hosley (Unity Youth Wrestling Club) Fall 2:52</li>\n<li>Champ. Round 1 - Ashton Kellett (LP Crunching Cavs) won by fall over Adam Thebeau (East St. Louis Wrestling) Fall 3:26</li>\n<li>Champ. Round 1 - Jake Matthews (Headlock Wrestling Academy) won by decision over Michael Kelly (Tinley Park Bulldogs Wrestling Club) Dec 5-3</li>\n<li>Champ. Round 1 - Cole Watkins (TJ Trained) won by decision over Kurtis Smith (The Wrestling Factory) Dec 9-2</li>\n<li>Champ. Round 1 - Jack Coyle (Mustang/SKT WC) won by decision over Owen Hollaway (O`Fallon Little Panthers Wrestling Club) Dec 10-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Alexander Tagler (Vittum Cats Wrestling Club) won by major decision over Danny Lack (ATTWarHawks Wrestling Club) Maj 9-1</li>\n<li>Champ. Round 1 - Ryan Smith (Harvey Twisters WC) won by tech fall over Michael Miralles (North Shore Edge) TF 16-1</li>\n<li>Champ. Round 1 - Connor Gaynor (Tinley Park Bulldogs Wrestling Club) won by fall over Jesse Stewart (Springfield Capitals Kids WC) Fall 0:37</li>\n<li>Champ. Round 1 - Barry Stevenson (Force Wrestling Club) won in sudden victory - 1 over Christopher Worcester (Villa-Lombard Cougars) SV-1 11-9</li>\n<li>Champ. Round 1 - Gavin Bloom (Hononegah Wrestling Club) won by fall over Michael Wirkus (SCN Youth Wrestling Club) Fall 3:19</li>\n<li>Champ. Round 1 - Jackson Baker (O`Fallon Little Panthers Wrestling Club) won by fall over Robert Gonzalez (Team 1006) Fall 0:52</li>\n<li>Champ. Round 1 - Elijah Chiaro (SCN Youth Wrestling Club) won by fall over Dillon Dublo (Bulls Wrestling Club) Fall 1:05</li>\n<li>Champ. Round 1 - Jacob Sollberger (TJ Trained) won by fall over Carlos Sanchez (Lil Bucs Wrestling Club) Fall 0:34</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Jack Riemer (Pitbull Wrestling Alliance) won by decision over Jackson Creasy (Macomb Bomber Wrestling) Dec 5-0</li>\n<li>Champ. Round 1 - Ben Harvey (Rochelle Wrestling Club) won by decision over Michael Carpenter (Cumberland Youth Wrestling Club) Dec 8-3</li>\n<li>Champ. Round 1 - Hunter Anderson (Paxton Youth Wrestling Club) won by decision over Kayden Wenninger (Champbuilders Wrestling) Dec 9-6</li>\n<li>Champ. Round 1 - Bryce Faworski (Xtreme Wrestling Club) won by fall over Alexander Goworowski (St. Tarcissus Wrestling Club) Fall 1:06</li>\n<li>Champ. Round 1 - Jonathan Hernandez (Force Wrestling Club) won by fall over Jackson Thulin (Blackhawk Wrestling Club) Fall 1:23</li>\n<li>Champ. Round 1 - Raymond Hernandez (Mustang/SKT WC) won by fall over Grayson Cook (Saukee Youth Wrestling Club) Fall 1:49</li>\n<li>Champ. Round 1 - Martin Larkin (Redhawk Wrestling Club) won by fall over Kevin Zimmer (Vittum Cats Wrestling Club) Fall 2:27</li>\n<li>Champ. Round 1 - Anthony Chiaro (SCN Youth Wrestling Club) won by major decision over Lucas Daly (Carbondale Wrestling Club) Maj 8-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Elijah Lopez (SCN Youth Wrestling Club) won by decision over Kaunyae Pillows (Lionheart Intense Wrestling) Dec 3-2</li>\n<li>Champ. Round 1 - Tyler Haynes (Pekin Boys &amp; Girls Club) won by fall over Dustin Roberts (Carlinville Wrestling Club) Fall 3:32</li>\n<li>Champ. Round 1 - Noah Setser (Ottawa Crushers Kids Wrestling Club) won by injury default over Traeton Woods (Saber Wrestling Club) Inj. 4:22</li>\n<li>Champ. Round 1 - Jackson Certa (Martinez Fox Valley Elite) won by decision over Jacob Averett (Team Mascoutah Wrestling) Dec 8-6</li>\n<li>Champ. Round 1 - Daniel Jezik (Celtic Elite) won by major decision over Jason Hermann (Stockton Renegades) Maj 9-0</li>\n<li>Champ. Round 1 - Omarion Dixon (Maywood Bucs/Powerhouse) won by fall over Delano Walker (St. Tarcissus Wrestling Club) Fall 2:25</li>\n<li>Champ. Round 1 - Brian Stacy (The Wrestling Factory) won by decision over Kyle Koelblinger (Wolves Wrestling Club Inc.) Dec 5-2</li>\n<li>Champ. Round 1 - Eric Andersen (Mustang/SKT WC) won by decision over Jacob Mumm (Bolingbrook Junior Raiders) Dec 10-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Dalton Smith (Taylorville Wrestling Club) won by fall over Will Rising (DuPage Tiger Wrestling Club) Fall 3:45</li>\n<li>Champ. Round 1 - Jake Viloria (Little Huskies Wrestling Club) won by fall over Griffin Watts (Midwest Central Youth WC) Fall 2:45</li>\n<li>Champ. Round 1 - Drew Nash (Lemont Bears) won by fall over William Gandolfi (Lincoln Youth Wrestling Club) Fall 0:25</li>\n<li>Champ. Round 1 - Brenden Gran (Scorpion Wrestling Club) won by fall over Minani Allin (Rock Island Wrestling Club) Fall 2:56</li>\n<li>Champ. Round 1 - Mead Tomash (Stillman Valley Wrestling Club) won by decision over Ethan Sperry (Crusaders` Elite) Dec 5-0</li>\n<li>Champ. Round 1 - Zachary Kolb (Force Wrestling Club) won in sudden victory - 1 over Joe Chapman (Pitbull Wrestling Alliance) SV-1 8-6</li>\n<li>Champ. Round 1 - Andrew Wenzel (Dakota Wrestling Club) won by decision over Peyton Knepper (Celtic Elite) Dec 3-0</li>\n<li>Champ. Round 1 - Noah Ross (Izzy Style Wrestling) won by fall over Chase Michaelis (Carlinville Wrestling Club) Fall 2:50</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Drew Gvillo (Edwardsville Wrestling Club) won by fall over Donovan Dolittle (Badger Wrestling Club) Fall 1:28</li>\n<li>Champ. Round 1 - Anjual Joyner (Evanston School of Wrestling) won by decision over Dakota Ritter (Riverton Youth Wrestling) Dec 10-4</li>\n<li>Champ. Round 1 - Andrew Mulay (Tinley Park Bulldogs Wrestling Club) won by decision over Pate Eastin (Unity Youth Wrestling Club) Dec 4-2</li>\n<li>Champ. Round 1 - David Groetecke (Granite City WC) won by decision over Israel Aguayo (Waukegan Youth Wrestling Club) Dec 5-1</li>\n<li>Champ. Round 1 - Kaleb Vahle (Quincy Cyclones Wrestling) won in sudden victory - 1 over Aidan Nardin (Dakota Wrestling Club) SV-1 9-5</li>\n<li>Champ. Round 1 - Sean Alletto (Falcons Elite Wrestling Club) won by decision over Matthew Cronk (Lincoln Way Wrestling Club) Dec 10-7</li>\n<li>Champ. Round 1 - Ethan Hall (Downers Grove Cougars WC) won by decision over Dylan Davidson (Mendota Mat Masters) Dec 7-4</li>\n<li>Champ. Round 1 - Kaydon Norkus (Force Wrestling Club) won by decision over Carter Wyatt (Rockford Wrestling Club) Dec 1-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Cooper Palmore (Prairie Central Hawks) won by fall over Justin Galler (Fox Valley Wrestling Club) Fall 4:22</li>\n<li>Champ. Round 1 - Kody Sipe (West Carroll Wrestling Club) won by fall over Julian Ramirez (Mustang/SKT WC) Fall 2:17</li>\n<li>Champ. Round 1 - Joe Hawkes (Batavia Wrestling Club) won by fall over Jordan Allen (Caravan Kids Wrestling Club) Fall 0:34</li>\n<li>Champ. Round 1 - Alexander Bogdanic (Lincoln Youth Wrestling Club) won by decision over Ryan Golnick (Golden Eagles Wrestling Club) Dec 6-2</li>\n<li>Champ. Round 1 - Jaiden Vancoillie (Rock Island Wrestling Club) won by fall over Joey Vinson (Villa-Lombard Cougars) Fall 1:54</li>\n<li>Champ. Round 1 - Brian Hardy (Celtic Elite) won by fall over William Thomas (Murphysboro Wrestling Club) Fall 1:23</li>\n<li>Champ. Round 1 - Dackota Huskey (MC Bulldog Wrestling Club) won by fall over Avery Shaw (Dixon Wrestling Club) Fall 4:01</li>\n<li>Champ. Round 1 - Kyle Franklin (Team 360 Gatorstyle Wrestling) won in sudden victory - 1 over Matt Simpson (Crosstown Wrestling) SV-1 15-13</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Cade Scott (Unity Youth Wrestling Club) won by fall over Gabriel Herrera (Martinez Fox Valley Elite) Fall 0:22</li>\n<li>Champ. Round 1 - Ethan Tinarwo (O`Fallon Little Panthers Wrestling Club) won by fall over Ison Robinson (Bolingbrook Junior Raiders) Fall 1:00</li>\n<li>Champ. Round 1 - Brock Donati (St. Charles WC) won by decision over Noah Curl (RC Jr. Panthers Wrestling Club) Dec 10-4</li>\n<li>Champ. Round 1 - John Sexton (Saber Wrestling Club) won by fall over Ryder Coleman (Triad Little Knights Wrestling Club) Fall 0:50</li>\n<li>Champ. Round 1 - Apollo Gothard (Lemont Bears) won by major decision over Cole Baumgartner (Sycamore Wrestling Club) Maj 10-1</li>\n<li>Champ. Round 1 - Julian Navarro (Team 1006) won by fall over Giovanni Jackson (Palatine Cobras Wrestling Club) Fall 2:14</li>\n<li>Champ. Round 1 - Matthew Ramirez (Barrington Broncos Wrestling Club) won by fall over Arturo Acevedo (Morton Little Mustangs) Fall 0:56</li>\n<li>Champ. Round 1 - Xander Schnake (Hononegah Wrestling Club) won by decision over Ethan Rash (River Bend Wrestling Club) Dec 4-2</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Spence (Iguana Wrestling Club) won by fall over Dane McMahon (Scorpion Wrestling Club) Fall 2:09</li>\n<li>Champ. Round 1 - Immanuel Cervantes (Yorkville Wrestling Club) won by decision over Isaiah Gonzalez (Izzy Style Wrestling) Dec 6-1</li>\n<li>Champ. Round 1 - Xavier Sierra (Headlock Wrestling Academy) won by tech fall over Kalan Pawlak (Rantoul Junior Eagles) TF 17-1</li>\n<li>Champ. Round 1 - Wil Lambaz (Scorpion Wrestling Club) won by fall over Bright Da-Silveira (Moline Wrestling Club) Fall 3:46</li>\n<li>Champ. Round 1 - Thomas Luedke (Celtic Elite) won by fall over Tyler Lorden (LP Crunching Cavs) Fall 0:51</li>\n<li>Champ. Round 1 - Nathaniel Thomas (Badger Wrestling Club) won by fall over Jorge Contreras (Lil Bucs Wrestling Club) Fall 2:27</li>\n<li>Champ. Round 1 - William Penrod (Mt. Vernon Lions Wrestling Club) won by fall over Isidoro Martinez (Morton Little Mustangs) Fall 0:37</li>\n<li>Champ. Round 1 - Luis Cretsinger (Xtreme Wrestling Club) won by fall over Timothy Lowe (Little Boilers Wrestling Club) Fall 0:37</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Hunter Stellhorn (Edwardsville Wrestling Club) won by decision over Blake Kunkel (Geneva Junior Vikings) Dec 8-4</li>\n<li>Champ. Round 1 - Tyler Williams (Riverton Youth Wrestling) won by fall over Vincent Skentzos (Celtic Elite) Fall 0:35</li>\n<li>Champ. Round 1 - Jesiah Bradshaw (Springfield Capitals Kids WC) won by fall over Braxton Wilson (Bismarck-Henning Wrestling Club) Fall 0:13</li>\n<li>Champ. Round 1 - Kyle Amodia (Grayslake Wrestling Club) won by fall over Zach Benson (Batavia Wrestling Club) Fall 2:11</li>\n<li>Champ. Round 1 - Xavier Jean-Simon (HF Spartan Elite WC) won by fall over Joshua Taylor (Harvey Twisters WC) Fall 2:46</li>\n<li>Champ. Round 1 - Dustin Olmstead (King Select Wrestling) won by fall over Eli Denton (Junior Pioneer Wrestling Club) Fall 2:09</li>\n<li>Champ. Round 1 - Dayton Baue (Sparta Junior Bulldogs) won by fall over Ghassan Salah (Tinley Park Bulldogs Wrestling Club) Fall 3:39</li>\n<li>Champ. Round 1 - Kody Mongan (Tiger Town Tanglers Wrestling Club) won by fall over Ryan Boersma (Indians Elite) Fall 3:00</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Robert Schneider (Celtic Elite) won by decision over Jason Johnston (Metamora Kids Wrestling Club) Dec 2-1</li>\n<li>Champ. Round 1 - Simon Wilson (Champbuilders Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Laron Reed (Danville Chargers Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Eliazar Tapia (Champbuilders Wrestling) won by decision over Jameel Salah (Celtic Elite) Dec 5-0</li>\n<li>Champ. Round 1 - Ryan Hannah (Maywood Bucs/Powerhouse) received a bye   () Bye</li>\n<li>Champ. Round 1 - Angel Jaimes (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Champ. Round 1 - Oran Varela (Hoopeston Area Wrestling Club) won by fall over Corey Krueger (SCN Youth Wrestling Club) Fall 0:40</li>\n<li>Champ. Round 1 - Damien Thomas (Caravan Kids Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Phoenix Mordick (Dakota Wrestling Club) won by decision over Ronan Schuelke (Maddog Wrestling Club) Dec 8-4</li>\n<li>Champ. Round 1 - Maurice Dotson (Granite City WC) won by fall over Draven Kyger (Oakwood Youth Wrestling Club) Fall 1:48</li>\n<li>Champ. Round 1 - Trevor Reed (Harvey Twisters WC) won by decision over William Baysingar (Arlington Cardinals Wrestling Club) Dec 9-5</li>\n<li>Champ. Round 1 - Dillon Carlson (Crystal Lake Wizards) won by decision over Jesse Hahs (Southern Kings) Dec 4-0</li>\n<li>Champ. Round 1 - Jacob Crandall (Greg Gomez Trained Wrestling) won by fall over Isaac Bourge (Team 1006) Fall 2:49</li>\n<li>Champ. Round 1 - Griffin Duffin (Mustang/SKT WC) won by decision over Joey Malito (Celtic Elite) Dec 8-4</li>\n<li>Champ. Round 1 - Jacob Gliva (Contender Wrestling) won by major decision over Rory Burright (Greg Gomez Trained Wrestling) Maj 10-2</li>\n<li>Champ. Round 1 - Pierre Baldwin (Maywood Bucs/Powerhouse) won by fall over Jacob Owens (Team 1006) Fall 1:19</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Reef Pacot (Storm Youth Wrestling Club) won by decision over Brenden Fahey (Lakeland Predators WC) Dec 6-1</li>\n<li>Champ. Round 1 - Kenyon Boyce (Harvey Twisters WC) won by major decision over Cory Hoyle (Morton Youth Wrestling Club) Maj 19-5</li>\n<li>Champ. Round 1 - Paul Ishikawa (TJ Trained) won by tech fall over Benjamin Gavel (Unity Youth Wrestling Club) TF 19-2</li>\n<li>Champ. Round 1 - Caden Muselman (Tinley Park Bulldogs Wrestling Club) won by decision over Sean Conway (St. Tarcissus Wrestling Club) Dec 9-2</li>\n<li>Champ. Round 1 - Christian Olsen (Crystal Lake Wizards) won by fall over Aaron Niemeyer (Roxana Outlaws) Fall 1:14</li>\n<li>Champ. Round 1 - Conor Smetana (Bolingbrook Junior Raiders) won by forfeit over Angel Mendez (Martinez Fox Valley Elite) FF</li>\n<li>Champ. Round 1 - Connor Surtin (Edwardsville Wrestling Club) won by fall over Colin Sons (SCN Youth Wrestling Club) Fall 4:07</li>\n<li>Champ. Round 1 - Joel Mylin (Golden Eagles Wrestling Club) won by decision over Logan Kuhel-trimmer (Force Wrestling Club) Dec 6-5</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Cajaun Johnson (Tiger Wrestling Club) won by fall over Drew Lehn (The Wrestling Factory) Fall 1:16</li>\n<li>Champ. Round 1 - Tommy Curran (Martinez Fox Valley Elite) won by decision over Billy Meiszner (Lincoln Way Wrestling Club) Dec 6-0</li>\n<li>Champ. Round 1 - Alex Randell (Greg Gomez Trained Wrestling) won by fall over Matthew Poniatowski (Windy City Wrestling of Notre Dame) Fall 2:47</li>\n<li>Champ. Round 1 - Jack Finnegan (Force Wrestling Club) won by fall over Drew Burns (Pontiac Wrestling Club) Fall 2:01</li>\n<li>Champ. Round 1 - Vincent Robinson (Harvey Twisters WC) won by decision over Connor Speck (TJ Trained) Dec 4-2</li>\n<li>Champ. Round 1 - Chase Hall (King Select Wrestling) won by decision over Brandon Burke (Red Raiders Wrestling Team) Dec 7-3</li>\n<li>Champ. Round 1 - Mia Palumbo (Southside Stallions School of Wrestling) won by decision over Arojae Hart (Murphysboro Wrestling Club) Dec 7-0</li>\n<li>Champ. Round 1 - Cameron Clark (TJ Trained) won by fall over Waylon Hanke (Hawk Wrestling Club Ltd.) Fall 0:43</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Will Carlile (Bulls Wrestling Club) won by decision over Anterrius Turner (Champaign Wrestling Club) Dec 10-3</li>\n<li>Champ. Round 1 - Jack McClimon (Indians Elite) won by fall over Jack Barracca (Gomez Wrestling Academy) Fall 0:37</li>\n<li>Champ. Round 1 - Jordan Blew (Force Wrestling Club) won by fall over Rashon Allen (Tiger Wrestling Club) Fall 1:42</li>\n<li>Champ. Round 1 - Phillip Chapa (Barrington Broncos Wrestling Club) won by decision over Grover Mays (AJ Junior Wildcats Wrestling Club) Dec 4-2</li>\n<li>Champ. Round 1 - Malakye Rodriguez (Red Raiders Wrestling Team) won by decision over Andrew Burkeybile (Champbuilders Wrestling) Dec 7-5</li>\n<li>Champ. Round 1 - Joseph Fernau (St. Charles WC) won by decision over Damari Reed (Harvey Twisters WC) Dec 2-0</li>\n<li>Champ. Round 1 - Grant Peterson (Central Illinois Wrestling Academy) won by major decision over Korina Blades (Martinez Fox Valley Elite) Maj 9-0</li>\n<li>Champ. Round 1 - Michael Kass (Southside Stallions School of Wrestling) won by fall over Tyler Simmer (Dakota Wrestling Club) Fall 4:27</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Gaige Owens (Marion Youth Wrestling) won by decision over Hunter Travis (Pontiac Wrestling Club) Dec 5-3</li>\n<li>Champ. Round 1 - Luke Barron (Team 1006) won by decision over Ethen Doty (West Carroll Wrestling Club) Dec 3-2</li>\n<li>Champ. Round 1 - Donnie Hidden (TJ Trained) won by fall over Rayce Zike (Cumberland Youth Wrestling Club) Fall 4:26</li>\n<li>Champ. Round 1 - Andrew Lira (Crystal Lake Wizards) won by major decision over Caleb Tyus (Bulls Wrestling Club) Maj 9-0</li>\n<li>Champ. Round 1 - Peyton Schroeder (SCN Youth Wrestling Club) won by decision over Charles Vandevelde (Mustang/SKT WC) Dec 6-2</li>\n<li>Champ. Round 1 - Marko Hennin (Barrington Broncos Wrestling Club) won by decision over Kaden Bray (Celtic Elite) Dec 2-0</li>\n<li>Champ. Round 1 - Michael Archer (Southside Stallions School of Wrestling) won by decision over Ethan Stiles (Izzy Style Wrestling) Dec 9-8</li>\n<li>Champ. Round 1 - Terrance Snapp (Will County Warriors) won by tech fall over Abraham Alansari (Scorpion Wrestling Club) TF 17-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Andrew Cervantes (Force Wrestling Club) won by decision over Keyn Humes (Paxton Youth Wrestling Club) Dec 5-3</li>\n<li>Champ. Round 1 - Mitchell Millsap (King Select Wrestling) won by major decision over Michael Myers (Rock Island Wrestling Club) Maj 14-2</li>\n<li>Champ. Round 1 - Brody Powell (Hoopeston Area Wrestling Club) won by fall over Tyler Peach (Yorkville Wrestling Club) Fall 2:36</li>\n<li>Champ. Round 1 - Austin Markee (Indians Elite) won by decision over Elijah Hay (Junior Kahoks) Dec 6-0</li>\n<li>Champ. Round 1 - Riley Palm (The Wrestling Factory) won by fall over Brian Ritter (Oak Forest Warriors) Fall 0:49</li>\n<li>Champ. Round 1 - Justin Major (Martinez Fox Valley Elite) won by fall over Luke Bennett (Stillman Valley Wrestling Club) Fall 3:42</li>\n<li>Champ. Round 1 - Benjamin Anderson (SCN Youth Wrestling Club) won by decision over Aidan McKeag (St. Tarcissus Wrestling Club) Dec 8-2</li>\n<li>Champ. Round 1 - Torry Early (Little Huskies Wrestling Club) won by tech fall over Andrew Schwartz (Warrior Monks) TF 16-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Jackson Hosman (Celtic Elite) won by fall over Trinity Johnson (Danville Chargers Wrestling) Fall 0:15</li>\n<li>Champ. Round 1 - George Marre (Gomez Wrestling Academy) won by decision over Miles Hoey (Redhawk Wrestling Club) Dec 7-0</li>\n<li>Champ. Round 1 - Igor Husick (Morton Little Mustangs) won by fall over Mohammad Jodeh (Oak Forest Warriors) Fall 2:12</li>\n<li>Champ. Round 1 - Nicky Amato (Izzy Style Wrestling) won by decision over Luke Gardner (Vittum Cats Wrestling Club) Dec 3-2</li>\n<li>Champ. Round 1 - Dominic Duve (DuPage Tiger Wrestling Club) won by decision over Logan Lagerhausen (Stillman Valley Wrestling Club) Dec 3-2</li>\n<li>Champ. Round 1 - Tanner Swain (Vandalia Jr Wrestling Club) won by tech fall over Dimitrie Justus (Rock Island Wrestling Club) TF 19-2</li>\n<li>Champ. Round 1 - Preston Berry (Falcons Elite Wrestling Club) won by fall over Jack Evans (Edwardsville Wrestling Club) Fall 2:44</li>\n<li>Champ. Round 1 - Brody Ivey (Sauk Valley Wrestling Club) won by decision over Chad Richards (Harlem Cougar WC) Dec 6-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Cameren Carver (Charleston Wrestling Club) won by fall over Austin Robinson (Team 1006) Fall 4:11</li>\n<li>Champ. Round 1 - D`Anthony Hopkins (Force Wrestling Club) won by fall over Eric Muhammad (Astro Wrestling Club) Fall 2:38</li>\n<li>Champ. Round 1 - Tommy Criscione (Celtic Elite) won by major decision over Paul Gonzalez (Champbuilders Wrestling) Maj 10-0</li>\n<li>Champ. Round 1 - Anthony Bitner (Little Rams Wrestling) won by fall over Wyatt Wright (Cumberland Youth Wrestling Club) Fall 0:41</li>\n<li>Champ. Round 1 - Joshua Ramos (Martinez Fox Valley Elite) won by fall over Kaleb Beeler (Edwardsville Wrestling Club) Fall 3:29</li>\n<li>Champ. Round 1 - Abe Assad (Gomez Wrestling Academy) won by major decision over Andrew Henkle (Crystal Lake Wizards) Maj 9-0</li>\n<li>Champ. Round 1 - Kyle Dixon (Carlinville Wrestling Club) won by major decision over Jarrett Kinney (Hononegah Wrestling Club) Maj 11-2</li>\n<li>Champ. Round 1 - John Paul Smith (The Wrestling Factory) won by decision over Jacob Saldana (SCN Youth Wrestling Club) Dec 7-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Jamel Sheppard (Gomez Wrestling Academy) won by fall over Andrew Rizzo (Geneseo Spider Wrestling Club) Fall 2:28</li>\n<li>Champ. Round 1 - Garrett Lashuay (Oakwood Youth Wrestling Club) won by decision over Chase Clark (Hawk Wrestling Club Ltd.) Dec 4-2</li>\n<li>Champ. Round 1 - Hunter Yohn (Champions WC) won by tech fall over Caleb Lashuay (Oakwood Youth Wrestling Club) TF 15-0</li>\n<li>Champ. Round 1 - Dylan Kull (Evanston School of Wrestling) won by decision over Bradley Peters (Cary-Grove Matmen WC) Dec 4-0</li>\n<li>Champ. Round 1 - Johnny Acevedo (Martinez Fox Valley Elite) won by fall over Mario Leon (Lincoln Way Wrestling Club) Fall 2:11</li>\n<li>Champ. Round 1 - Caleb Grau (Team Mascoutah Wrestling) won in sudden victory - 1 over Hareson Willis (Badger Wrestling Club) SV-1 11-6</li>\n<li>Champ. Round 1 - Isaiah Willett (Renegade Wrestling Club (NFP)) won in sudden victory - 1 over Solomon Lewis (Crosstown Wrestling) SV-1 7-5</li>\n<li>Champ. Round 1 - Peter Ferraro (SCN Youth Wrestling Club) won by tech fall over Tucker Hughes (Carlinville Wrestling Club) TF 19-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Peyton Berry (Falcons Elite Wrestling Club) won by decision over Grant Ripperda (Springfield Capitals Kids WC) Dec 3-0</li>\n<li>Champ. Round 1 - Norman Harris (Edwardsville Wrestling Club) won by major decision over Aaron Mickelson (Junior Pioneer Wrestling Club) Maj 10-0</li>\n<li>Champ. Round 1 - Mason Ajster (Champaign Wrestling Club) won by fall over Ke`shawn Hess (Peoria Razorbacks Wrestling Club) Fall 2:03</li>\n<li>Champ. Round 1 - Alex Maguire (Roxana Outlaws) won by decision over Gavin Barton (Downers Grove Cougars WC) Dec 7-5</li>\n<li>Champ. Round 1 - Nicolas Patch (Force Wrestling Club) won by decision over Jacob Poulos (Crystal Lake Wizards) Dec 4-0</li>\n<li>Champ. Round 1 - Cormac Kane (Junior Cougar Wrestling Club) won by fall over Jamal Osborne (Harvey Twisters WC) Fall 5:55</li>\n<li>Champ. Round 1 - Anthony Geraci (Headlock Wrestling Academy) won by decision over Benjamin Zalapi (Hononegah Wrestling Club) Dec 5-3</li>\n<li>Champ. Round 1 - Mateo Portillo (Southside Stallions School of Wrestling) won by major decision over Daniel Skold (Force Wrestling Club) Maj 8-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Jiovanni Martinez (Martinez Fox Valley Elite) won by decision over Elijah Cannon (Champaign Wrestling Club) Dec 6-5</li>\n<li>Champ. Round 1 - Eli Pannell (River Bend Wrestling Club) won by major decision over Noah Aguirre (Little Rams Wrestling) Maj 13-0</li>\n<li>Champ. Round 1 - Anthony Kluk (Oak Forest Warriors) won by fall over Tyler Lanning (Pontiac Wrestling Club) Fall 0:52</li>\n<li>Champ. Round 1 - Hayden Tibbs (Pekin Boys &amp; Girls Club) won in sudden victory - 1 over Ian Deisher (Blackhawk Wrestling Club) SV-1 8-6</li>\n<li>Champ. Round 1 - Colton Ingram (Xtreme Wrestling Club) won by decision over Jonathan Finley (Crusaders` Elite) Dec 8-3</li>\n<li>Champ. Round 1 - Quintin Hamilton (Evanston School of Wrestling) won by fall over Rashad Dabney (Celtic Elite) Fall 1:30</li>\n<li>Champ. Round 1 - Brenden Parks (Kaneland Knights Wrestling Club) won by fall over Cole Garcia (Force Wrestling Club) Fall 2:35</li>\n<li>Champ. Round 1 - Peter Christensen (Izzy Style Wrestling) won by fall over Jimmy Hicks (Harrisburg Junior Bulldogs) Fall 0:44</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Damien Ross (East St. Louis Wrestling) won by fall over Kevin Ziech (Friar Wrestling Club) Fall 2:27</li>\n<li>Champ. Round 1 - Anthony Pennington (Gomez Wrestling Academy) won by decision over Kevin Sanchez (Bismarck-Henning Wrestling Club) Dec 11-9</li>\n<li>Champ. Round 1 - Gianfranco Montalto (Lemont Bears) won by decision over Jacob Woodrey (Prairie Central Hawks) Dec 8-3</li>\n<li>Champ. Round 1 - Jay Cee Randolph-Gonzalez (Izzy Style Wrestling) won by fall over Jackson Barnhart (Junior Kahoks) Fall 1:21</li>\n<li>Champ. Round 1 - Peyton Lind (Xtreme Wrestling Club) won by fall over Anthony Tovar (Moline Wrestling Club) Fall 1:49</li>\n<li>Champ. Round 1 - Thomas Collins (Vittum Cats Wrestling Club) won by fall over Cory Goetz (Falcons Elite Wrestling Club) Fall 3:00</li>\n<li>Champ. Round 1 - Jett Dowell (Falcons Elite Wrestling Club) won by decision over Gabriel Pierce (Dawgs Wrestling Club) Dec 3-1</li>\n<li>Champ. Round 1 - Richard Messling (Xtreme Wrestling Club) won by fall over Carson Cleasby (Force Wrestling Club) Fall 4:25</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Matthew Carmody (Waubonsie Wrestling Club) won in sudden victory - 1 over Grant Daykin (Riverton Youth Wrestling) SV-1 4-2</li>\n<li>Champ. Round 1 - Malik Daghash (Badger Wrestling Club) won by fall over Ryan O`Malley (Cary-Grove Matmen WC) Fall 0:42</li>\n<li>Champ. Round 1 - Brian Ziech (Friar Wrestling Club) won by decision over Michael Rhodes (Hinsdale Red Devil WC) Dec 7-3</li>\n<li>Champ. Round 1 - Joseph Esposito (Hononegah Wrestling Club) won by fall over Clayton Stock (Warrensburg-Latham Jr Cardinals WC) Fall 3:54</li>\n<li>Champ. Round 1 - Jimmy Bartell (Maine Eagles WC) won by fall over Edward Gilmore (Illini Bluffs Kids Wrestling Club) Fall 2:31</li>\n<li>Champ. Round 1 - Nathan Crane (Junior Kahoks) won by fall over Kyle Blind (Moline Wrestling Club) Fall 0:12</li>\n<li>Champ. Round 1 - Evan Carney (O`Fallon Little Panthers Wrestling Club) won by fall over Antonio Terronez (Champbuilders Wrestling) Fall 3:31</li>\n<li>Champ. Round 1 - Geno Lukowski (Martinez Fox Valley Elite) won by fall over Jake Chapman (Pitbull Wrestling Alliance) Fall 4:27</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Isaiah Fields (Martinez Fox Valley Elite) won by fall over Caleb Pforr (Charleston Wrestling Club) Fall 2:13</li>\n<li>Champ. Round 1 - Thomas Doyle (Vittum Cats Wrestling Club) won by fall over Alex Strubberg (Belleville Little Devils Wrestling Club) Fall 2:39</li>\n<li>Champ. Round 1 - Cameron Palmer (Naperville Wrestling Club) won by fall over Hunter Mifflin (Little Boilers Wrestling Club) Fall 0:26</li>\n<li>Champ. Round 1 - Dayton Houston (Junior Kahoks) won by fall over Tanner Bowen (Paxton Youth Wrestling Club) Fall 0:37</li>\n<li>Champ. Round 1 - Isaac Harris (Morton Little Mustangs) won by decision over Jose Lopez (Dundee Highlanders WC) Dec 8-2</li>\n<li>Champ. Round 1 - David Preston (Mundelein WC) won by fall over Gabe Robison (Central Elite Rebels) Fall 1:21</li>\n<li>Champ. Round 1 - Ethan Torres (Grayslake Wrestling Club) won by fall over Kory McNicholas (Badger Wrestling Club) Fall 2:31</li>\n<li>Champ. Round 1 - Dylan Lozeau (Sycamore Wrestling Club) won by fall over Thomas Flores (Scorpion Wrestling Club) Fall 4:01</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Joseph Passarelli (Downers Grove Cougars WC) won by fall over Quinn Stewart (Taylorville Wrestling Club) Fall 1:53</li>\n<li>Champ. Round 1 - Maximus Gomez (Izzy Style Wrestling) won by major decision over Dallas Hill (Tiger Town Tanglers Wrestling Club) Maj 14-0</li>\n<li>Champ. Round 1 - David Hardwick (Lancer Wrestling Club) won by fall over Adam Maxwell (Warrensburg-Latham Jr Cardinals WC) Fall 0:52</li>\n<li>Champ. Round 1 - Cole Campbell (Geneva Junior Vikings) won by fall over Chase Gann (Pekin Boys &amp; Girls Club) Fall 0:31</li>\n<li>Champ. Round 1 - Jaylen Washington (East St. Louis Wrestling) won by fall over Sheldon Cherry (Will County Warriors) Fall 0:19</li>\n<li>Champ. Round 1 - Jase Abraham (Belvidere Bandits Wrestling Club) won by fall over Felipe Martinez (Calumet Memorial PD Wolverines) Fall 2:35</li>\n<li>Champ. Round 1 - Drew Huff (Roxana Outlaws) won by fall over Logan Jennings (Stillman Valley Wrestling Club) Fall 0:17</li>\n<li>Champ. Round 1 - Brian Morel (Pitbull Wrestling Alliance) won by decision over Noah Kuligowski (Harlem Cougar WC) Dec 1-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Julian Jaimes (Martinez Fox Valley Elite) won by fall over Caden Triplett (Xtreme Wrestling Club) Fall 2:27</li>\n<li>Champ. Round 1 - Hadi Abolghasem (Maddog Wrestling Club) won by fall over Evan Hahn (Hononegah Wrestling Club) Fall 2:42</li>\n<li>Champ. Round 1 - Thomas Robson (Wolves Wrestling Club Inc.) won by fall over Andrew Hock (Geneseo Spider Wrestling Club) Fall 4:04</li>\n<li>Champ. Round 1 - Victor Rodriguez (Villa-Lombard Cougars) won by fall over Logan Gramly (Blackhawk Wrestling Club) Fall 2:41</li>\n<li>Champ. Round 1 - Jonathan Lopez (Waukegan Youth Wrestling Club) won by fall over Juan Harris (Calumet Memorial PD Wolverines) Fall 0:48</li>\n<li>Champ. Round 1 - Tyler Berhenke (Champbuilders Wrestling) won in tie breaker - 1 over Mason Baker (O`Fallon Little Panthers Wrestling Club) TB-1 5-4</li>\n<li>Champ. Round 1 - Samuel Martin (Edwardsville Wrestling Club) won by fall over Brice Gunter (West Frankfort Jr. Redbirds) Fall 1:57</li>\n<li>Champ. Round 1 - Hunter McAlpine (Team 1006) won by fall over Bryce Clover (Murphysboro Wrestling Club) Fall 1:01</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Isaac Williamson (Charleston Wrestling Club) won by major decision over Luke Francis (Vandalia Jr Wrestling Club) Maj 8-0</li>\n<li>Champ. Round 1 - Chase Tatum (Tiger Town Tanglers Wrestling Club) won by fall over Nicholas Henson (Rochelle Wrestling Club) Fall 0:42</li>\n<li>Champ. Round 1 - Tate Poole (Hononegah Wrestling Club) won by fall over Isaac Pacheco (Murphysboro Wrestling Club) Fall 0:56</li>\n<li>Champ. Round 1 - Quentin Davis (HF Spartan Elite WC) won by decision over Angel Orduna-DeLeon (Champbuilders Wrestling) Dec 6-0</li>\n<li>Champ. Round 1 - Jesus Lopez (Lancer Wrestling Club) won by fall over Emanuel Estrada (Badger Wrestling Club) Fall 3:38</li>\n<li>Champ. Round 1 - Kane Blaylock (Granite City WC) won by decision over Anilud Huerta (Waukegan Youth Wrestling Club) Dec 8-1</li>\n<li>Champ. Round 1 - Victor Ramirez (Gomez Wrestling Academy) won by fall over Peter Steinberg (St. Tarcissus Wrestling Club) Fall 1:05</li>\n<li>Champ. Round 1 - Nolan Tewell (Lawrence County Wrestling Club) won by fall over Benjamin Nichols (Palatine Cobras Wrestling Club) Fall 1:04</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Adam Copeland (Bulls Wrestling Club) won by fall over Devin Long (Pontiac Wrestling Club) Fall 0:54</li>\n<li>Champ. Round 1 - Noah Laney (Crystal Lake Wizards) won by fall over Vito Tito (Badger Wrestling Club) Fall 3:22</li>\n<li>Champ. Round 1 - Nicholas Blades (Harlem Cougar WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Craig Weiss (Badger Wrestling Club) won by fall over Jake Rider (Carmi Bulldog WC) Fall 2:07</li>\n<li>Champ. Round 1 - Pedro Castanon (Falcons Elite Wrestling Club) won by fall over Donny McGee (Little Boilers Wrestling Club) Fall 4:52</li>\n<li>Champ. Round 1 - Jacob Gonzalez (Little Rams Wrestling) won by major decision over Thomas Munoz (Redhawk Wrestling Club) Maj 13-5</li>\n<li>Champ. Round 1 - Nicholas Vaccariello (Force Wrestling Club) received a bye   () Bye</li>\n<li>Champ. Round 1 - Lamarkio Bess (East St. Louis Wrestling) won by fall over Daniel Arreola (DuPage Wrestling Club) Fall 1:40</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Logan Reed (Marengo Youth Wrestling) won by fall over Patrick Gossett (Rantoul Junior Eagles) Fall 2:49</li>\n<li>Champ. Round 1 - Jake Tanquilut (Tinley Park Bulldogs Wrestling Club) won by decision over Owen Farquer (Central Illinois Wrestling Academy) Dec 5-2</li>\n<li>Champ. Round 1 - Vincenzo Biciocchi (Roxana Outlaws) won by fall over Caleb Bradle (Central Elite Rebels) Fall 2:48</li>\n<li>Champ. Round 1 - Jack McDonald (Little Rams Wrestling) won by decision over Griffin McEnroe (Elk Grove Junior Grens) Dec 4-2</li>\n<li>Champ. Round 1 - Nicholas Lockhart (Sycamore Wrestling Club) won by decision over Tyler Brooks (Bulls Wrestling Club) Dec 8-2</li>\n<li>Champ. Round 1 - Luke Fleming (Martinez Fox Valley Elite) won by decision over Drew Massie (Force Wrestling Club) Dec 2-0</li>\n<li>Champ. Round 1 - Jalen May (Crusaders` Elite) won by major decision over Nicholas Pierce (Martinez Fox Valley Elite) Maj 9-0</li>\n<li>Champ. Round 1 - Jacob Randolph (Celtic Elite) won by fall over Conner Elmer (Dakota Wrestling Club) Fall 0:57</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Joshua Holm (Izzy Style Wrestling) won by fall over Logan Peters (Springfield Capitals Kids WC) Fall 1:06</li>\n<li>Champ. Round 1 - Brice Balosky (Greg Gomez Trained Wrestling) won by fall over Khai Stephens (HF Spartan Elite WC) Fall 2:29</li>\n<li>Champ. Round 1 - Joel Vandervere (The Wrestling Factory) won by fall over Carlton Best (DuPage Tiger Wrestling Club) Fall 0:52</li>\n<li>Champ. Round 1 - Sam Emery (Celtic Elite) won by decision over Tyler Timmons (Champaign Wrestling Club) Dec 5-2</li>\n<li>Champ. Round 1 - Grant Woodruff (TJ Trained) won by decision over Paul McGrath (Lemont Bears) Dec 12-9</li>\n<li>Champ. Round 1 - Justin Peters (Dundee Highlanders WC) won by fall over Jacob Pflasterer (Team Mascoutah Wrestling) Fall 0:40</li>\n<li>Champ. Round 1 - Zeth Stallings (Lawrence County Wrestling Club) won by decision over Jeremy Kelly (Tinley Park Bulldogs Wrestling Club) Dec 6-5</li>\n<li>Champ. Round 1 - Jake Doyle (Red Raiders Wrestling Team) won by decision over Austin Howard (Little Redskins Wrestling Club) Dec 4-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Ty`Reese Smith (Lionheart Intense Wrestling) won by decision over Logan Swangren (Scorpion Wrestling Club) Dec 9-4</li>\n<li>Champ. Round 1 - Christopher Kennedy (Celtic Elite) won by fall over Nathan Holler (Sharks Wrestling Club) Fall 0:52</li>\n<li>Champ. Round 1 - Anthony Molton (Will County Warriors) won by fall over Jason Palmberg (Saber Wrestling Club) Fall 0:18</li>\n<li>Champ. Round 1 - Kaleb Thompson (Bolingbrook Junior Raiders) won by tech fall over Christian Rivero (Z`s Team Pena) TF 17-1</li>\n<li>Champ. Round 1 - Trevor Boryla (Sycamore Wrestling Club) won by decision over Ayden Sines (LP Crunching Cavs) Dec 9-2</li>\n<li>Champ. Round 1 - Michael Jaffe (SCN Youth Wrestling Club) won by major decision over Jimmy Ruston (Lions Wrestling Club) Maj 8-0</li>\n<li>Champ. Round 1 - Christian Goin (TJ Trained) won by major decision over Riley Woods (Batavia Wrestling Club) Maj 12-0</li>\n<li>Champ. Round 1 - Luc Valdez (Tinley Park Bulldogs Wrestling Club) won by decision over Jevin Doke (Harlem Cougar WC) Dec 7-3</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Ryan Fleck (SCN Youth Wrestling Club) won by fall over Kyle Bowles (Edwardsville Wrestling Club) Fall 2:47</li>\n<li>Champ. Round 1 - Ezra Elliott (Hoopeston Area Wrestling Club) won by fall over Briscoe Watson (Harvey Twisters WC) Fall 1:20</li>\n<li>Champ. Round 1 - Chevvy Wood (Aces Wrestling Club) won by tech fall over Gabriel Chavez (Charleston Wrestling Club) TF 15-0</li>\n<li>Champ. Round 1 - Joshua Ogunsanya (Harvey Twisters WC) won by major decision over Mark Guerrero (St. Charles WC) Maj 12-1</li>\n<li>Champ. Round 1 - Daniel McPherson (Lakeland Predators WC) won by fall over Seth Antle (LP Crunching Cavs) Fall 3:50</li>\n<li>Champ. Round 1 - Noah Bickett (Force Wrestling Club) won by decision over Parker Suyko (Cary-Grove Matmen WC) Dec 9-7</li>\n<li>Champ. Round 1 - Jacob Lukaszczyk (Vittum Cats Wrestling Club) won by decision over Anthony Greco (Shamrock Wrestling Club) Dec 2-1</li>\n<li>Champ. Round 1 - Ayden Whaley (Xtreme Wrestling Club) won by decision over Ezekiel Hulet (Dawgs Wrestling Club) Dec 2-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Garrett Johnson (Prairie Central Hawks) received a bye   () Bye</li>\n<li>Champ. Round 1 - Caleb Alber (Dakota Wrestling Club) won by decision over Charlie Korey (Tiger Town Tanglers Wrestling Club) Dec 5-4</li>\n<li>Champ. Round 1 - Adam Meenen (Sauk Valley Wrestling Club) won by tech fall over Calvin Armoska (Rocket Fuel Wrestling Club) TF 15-0</li>\n<li>Champ. Round 1 - Cameron Miller (Marengo Youth Wrestling) won by fall over Jacob Sileven (West Frankfort Jr. Redbirds) Fall 2:39</li>\n<li>Champ. Round 1 - Justin Benjamin (SCN Youth Wrestling Club) won by tech fall over Jacob Abeja (Tinley Park Bulldogs Wrestling Club) TF 18-3</li>\n<li>Champ. Round 1 - Reece Heller (Izzy Style Wrestling) won by injury default over Dejhavone Allen (HF Spartan Elite WC) Inj. 0:00</li>\n<li>Champ. Round 1 - Jack Kilroe (Mustang/SKT WC) won by fall over James Ost (Villa-Lombard Cougars) Fall 3:42</li>\n<li>Champ. Round 1 - Dylan Burnoski (Bolingbrook Junior Raiders) won by decision over Denis Murphy (Fox Valley Wrestling Club) Dec 8-3</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Nain Vazquez (Martinez Fox Valley Elite) won by fall over John McDermott (Force Wrestling Club) Fall 1:28</li>\n<li>Champ. Round 2 - Tanner Kalkbrenner (The Law) won by decision over Dayton Hall (Aces Wrestling Club) Dec 6-4</li>\n<li>Champ. Round 2 - Patrick Houston (Tinley Park Bulldogs Wrestling Club) won by fall over Michael Flier (Cumberland Youth Wrestling Club) Fall 1:15</li>\n<li>Champ. Round 2 - Nicholas Bolivar (Gomez Wrestling Academy) won by decision over Nicholas Minnito (Force Wrestling Club) Dec 4-1</li>\n<li>Champ. Round 2 - Tristan Daugherty (Central Illinois Wrestling Academy) won by decision over Cooper Wettig (Izzy Style Wrestling) Dec 8-1</li>\n<li>Champ. Round 2 - Luke Odom (Edwardsville Wrestling Club) won by fall over Bryce Shelton (Crystal Lake Wizards) Fall 1:25</li>\n<li>Champ. Round 2 - Alex Villar (Bolingbrook Junior Raiders) won by decision over Jack Milos (Arlington Cardinals Wrestling Club) Dec 9-5</li>\n<li>Champ. Round 2 - Mateen Taylor (Harvey Twisters WC) won by fall over Draven Mcdonald (Warrior Wrestling) Fall 1:49</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Brock Pfeifer (Celtic Elite) won in tie breaker - 1 over Matthew Zuber (Southside Stallions School of Wrestling) TB-1 3-2</li>\n<li>Champ. Round 2 - Brayden Thompson (Izzy Style Wrestling) won in sudden victory - 1 over Jake Harrier (Golden Eagles Wrestling Club) SV-1 6-4</li>\n<li>Champ. Round 2 - Caden Ernd (Crystal Lake Wizards) won by decision over Dallas Krueger (Moline Wrestling Club) Dec 5-1</li>\n<li>Champ. Round 2 - Jacob Tinajero (SCN Youth Wrestling Club) won by decision over Garrett Bakarich (Triad Little Knights Wrestling Club) Dec 7-6</li>\n<li>Champ. Round 2 - Zeke Marshall (Martinez Fox Valley Elite) won by fall over Ashton Kellett (LP Crunching Cavs) Fall 1:25</li>\n<li>Champ. Round 2 - Kyle Tunink (Xtreme Wrestling Club) won by major decision over Jake Matthews (Headlock Wrestling Academy) Maj 8-0</li>\n<li>Champ. Round 2 - Grant Laduke (Celtic Elite) won by decision over Cole Watkins (TJ Trained) Dec 3-0</li>\n<li>Champ. Round 2 - Jack Coyle (Mustang/SKT WC) won by decision over Cory West (Springfield Capitals Kids WC) Dec 10-4</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Alexander Tagler (Vittum Cats Wrestling Club) won by decision over Cal Debaillie (Geneseo Spider Wrestling Club) Dec 4-2</li>\n<li>Champ. Round 2 - Ryan Smith (Harvey Twisters WC) won by decision over Peyton Bechtold (King Select Wrestling) Dec 7-0</li>\n<li>Champ. Round 2 - Connor Gaynor (Tinley Park Bulldogs Wrestling Club) won by fall over Kennedy Blades (Martinez Fox Valley Elite) Fall 2:14</li>\n<li>Champ. Round 2 - Barry Stevenson (Force Wrestling Club) won by decision over Evan Riggle (Dakota Wrestling Club) Dec 7-2</li>\n<li>Champ. Round 2 - Sincere Bailey (Harvey Twisters WC) won by fall over Gavin Bloom (Hononegah Wrestling Club) Fall 1:52</li>\n<li>Champ. Round 2 - Deon Lopez (Lakeland Predators WC) won by major decision over Jackson Baker (O`Fallon Little Panthers Wrestling Club) Maj 12-1</li>\n<li>Champ. Round 2 - Qayin Dabney (Celtic Elite) won by decision over Elijah Chiaro (SCN Youth Wrestling Club) Dec 4-3</li>\n<li>Champ. Round 2 - Peyton Holt (St. Joseph Odgen Youth Wrestling Club) won by decision over Jacob Sollberger (TJ Trained) Dec 5-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Zachary Janz (Greg Gomez Trained Wrestling) won by fall over Jack Riemer (Pitbull Wrestling Alliance) Fall 3:48</li>\n<li>Champ. Round 2 - Ben Harvey (Rochelle Wrestling Club) won by decision over Adrian McDougle (King Select Wrestling) Dec 7-3</li>\n<li>Champ. Round 2 - Bryan Smith (Harvey Twisters WC) won by fall over Hunter Anderson (Paxton Youth Wrestling Club) Fall 3:24</li>\n<li>Champ. Round 2 - Kevin Countryman (Celtic Elite) won by major decision over Bryce Faworski (Xtreme Wrestling Club) Maj 14-4</li>\n<li>Champ. Round 2 - Dylan Connell (Crystal Lake Wizards) won by decision over Jonathan Hernandez (Force Wrestling Club) Dec 5-4</li>\n<li>Champ. Round 2 - Raymond Hernandez (Mustang/SKT WC) won by decision over Michael DiGioia (Maddog Wrestling Club) Dec 10-4</li>\n<li>Champ. Round 2 - Martin Larkin (Redhawk Wrestling Club) won by major decision over Tom Culp (Champions WC) Maj 11-2</li>\n<li>Champ. Round 2 - Logan Deacetis (Prairie Central Hawks) won by fall over Anthony Chiaro (SCN Youth Wrestling Club) Fall 1:09</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Daemyen Middlebrooks (Little Huskies Wrestling Club) won by fall over Elijah Lopez (SCN Youth Wrestling Club) Fall 2:13</li>\n<li>Champ. Round 2 - Alex Carrillo (Force Wrestling Club) won by fall over Tyler Haynes (Pekin Boys &amp; Girls Club) Fall 0:57</li>\n<li>Champ. Round 2 - Marc Catama (Golden Eagles Wrestling Club) won by decision over Noah Setser (Ottawa Crushers Kids Wrestling Club) Dec 8-2</li>\n<li>Champ. Round 2 - Isaiah Parker (The Wrestling Factory) won by fall over Jackson Certa (Martinez Fox Valley Elite) Fall 0:41</li>\n<li>Champ. Round 2 - Noah Villarreal (Martinez Fox Valley Elite) won by tech fall over Daniel Jezik (Celtic Elite) TF 24-9</li>\n<li>Champ. Round 2 - Kaden Beeler (Edwardsville Wrestling Club) won by decision over Omarion Dixon (Maywood Bucs/Powerhouse) Dec 9-2</li>\n<li>Champ. Round 2 - Jack Patting (Moline Wrestling Club) won by decision over Brian Stacy (The Wrestling Factory) Dec 6-3</li>\n<li>Champ. Round 2 - Colt Guyon (Cumberland Youth Wrestling Club) won by fall over Eric Andersen (Mustang/SKT WC) Fall 2:50</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Alonzo Smiley (Gomez Wrestling Academy) won by fall over Dalton Smith (Taylorville Wrestling Club) Fall 2:03</li>\n<li>Champ. Round 2 - Jake Viloria (Little Huskies Wrestling Club) won in sudden victory - 1 over Brody Rutherford (Mt. Vernon Lions Wrestling Club) SV-1 4-2</li>\n<li>Champ. Round 2 - Drew Nash (Lemont Bears) won by decision over Antonio Figueroa (Crystal Lake Wizards) Dec 6-2</li>\n<li>Champ. Round 2 - Jeremy Pullen (Force Wrestling Club) won by fall over Brenden Gran (Scorpion Wrestling Club) Fall 2:00</li>\n<li>Champ. Round 2 - Niko Lopez (Greg Gomez Trained Wrestling) won by fall over Mead Tomash (Stillman Valley Wrestling Club) Fall 4:30</li>\n<li>Champ. Round 2 - Zachary Kolb (Force Wrestling Club) won by fall over Jackson Murphy (Yorkville Wrestling Club) Fall 1:57</li>\n<li>Champ. Round 2 - Noah Alsguson (Harvey Twisters WC) won by fall over Andrew Wenzel (Dakota Wrestling Club) Fall 0:55</li>\n<li>Champ. Round 2 - Noah Ross (Izzy Style Wrestling) won by decision over Daniel Stewart (Springfield Capitals Kids WC) Dec 7-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Drew Gvillo (Edwardsville Wrestling Club) won in sudden victory - 1 over Austin Abitua (Xtreme Wrestling Club) SV-1 6-4</li>\n<li>Champ. Round 2 - Kyle Berg (Vittum Cats Wrestling Club) won by fall over Anjual Joyner (Evanston School of Wrestling) Fall 3:42</li>\n<li>Champ. Round 2 - Josh Labarbera (Martinez Fox Valley Elite) won by decision over Andrew Mulay (Tinley Park Bulldogs Wrestling Club) Dec 7-1</li>\n<li>Champ. Round 2 - Robert Bates (Little Redskins Wrestling Club) won by fall over David Groetecke (Granite City WC) Fall 1:50</li>\n<li>Champ. Round 2 - Sean Swinkle (St. Tarcissus Wrestling Club) won by decision over Kaleb Vahle (Quincy Cyclones Wrestling) Dec 8-6</li>\n<li>Champ. Round 2 - Aron Taylor (Carbondale Wrestling Club) won by fall over Sean Alletto (Falcons Elite Wrestling Club) Fall 4:25</li>\n<li>Champ. Round 2 - Ronald Massari (Little Huskies Wrestling Club) won by major decision over Ethan Hall (Downers Grove Cougars WC) Maj 8-0</li>\n<li>Champ. Round 2 - Miguel Barrett (Pontiac Wrestling Club) won by fall over Kaydon Norkus (Force Wrestling Club) Fall 3:00</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Tavaris Macklin (Carbondale Wrestling Club) won by decision over Cooper Palmore (Prairie Central Hawks) Dec 4-0</li>\n<li>Champ. Round 2 - Daemon McMurtry (Celtic Elite) won by major decision over Kody Sipe (West Carroll Wrestling Club) Maj 17-6</li>\n<li>Champ. Round 2 - Jordan Chisum (Zee-Bee Stingers Wrestling Club) won by fall over Joe Hawkes (Batavia Wrestling Club) Fall 2:14</li>\n<li>Champ. Round 2 - Vincent Querciagrossa (Metamora Kids Wrestling Club) won by fall over Alexander Bogdanic (Lincoln Youth Wrestling Club) Fall 2:06</li>\n<li>Champ. Round 2 - Tommy Evans (Wolves Wrestling Club Inc.) won by fall over Jaiden Vancoillie (Rock Island Wrestling Club) Fall 2:17</li>\n<li>Champ. Round 2 - Mike Bosco (Tinley Park Bulldogs Wrestling Club) won by decision over Brian Hardy (Celtic Elite) Dec 6-1</li>\n<li>Champ. Round 2 - Carter Maggio (St. Charles WC) won by decision over Dackota Huskey (MC Bulldog Wrestling Club) Dec 7-0</li>\n<li>Champ. Round 2 - Brandon Hoselton (Prairie Central Hawks) won by fall over Kyle Franklin (Team 360 Gatorstyle Wrestling) Fall 1:24</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Joseph Jens (Grayslake Wrestling Club) won by fall over Cade Scott (Unity Youth Wrestling Club) Fall 0:46</li>\n<li>Champ. Round 2 - Tyson Heerman (Peoria Razorbacks Wrestling Club) won by fall over Ethan Tinarwo (O`Fallon Little Panthers Wrestling Club) Fall 2:52</li>\n<li>Champ. Round 2 - Kaleb Simms (Rochelle Wrestling Club) won by fall over Brock Donati (St. Charles WC) Fall 1:10</li>\n<li>Champ. Round 2 - Mustafa St. Clair (Harvey Twisters WC) won by fall over John Sexton (Saber Wrestling Club) Fall 1:08</li>\n<li>Champ. Round 2 - Apollo Gothard (Lemont Bears) won by decision over Kenny Lutz (Junior Kahoks) Dec 7-4</li>\n<li>Champ. Round 2 - Angel Alverio (Crosstown Wrestling) won by fall over Julian Navarro (Team 1006) Fall 2:32</li>\n<li>Champ. Round 2 - Matthew Ramirez (Barrington Broncos Wrestling Club) won by major decision over Dzhabrail Khurshidov (Blackhawk Wrestling Club) Maj 9-0</li>\n<li>Champ. Round 2 - Cole Gaddis (Hoopeston Area Wrestling Club) won by fall over Xander Schnake (Hononegah Wrestling Club) Fall 2:52</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Alvin Maten (Harlem Cougar WC) won by fall over Tyler Spence (Iguana Wrestling Club) Fall 1:06</li>\n<li>Champ. Round 2 - Nikolas Mishka (Tinley Park Bulldogs Wrestling Club) won by fall over Immanuel Cervantes (Yorkville Wrestling Club) Fall 0:40</li>\n<li>Champ. Round 2 - Jacob Morrissey (Edwardsville Wrestling Club) won by fall over Xavier Sierra (Headlock Wrestling Academy) Fall 1:05</li>\n<li>Champ. Round 2 - Dashun Walker (HF Spartan Elite WC) won by injury default over Wil Lambaz (Scorpion Wrestling Club) Inj. 1:30</li>\n<li>Champ. Round 2 - Nicholas Skamra (Headlock Wrestling Academy) won by fall over Thomas Luedke (Celtic Elite) Fall 1:14</li>\n<li>Champ. Round 2 - Nathaniel Thomas (Badger Wrestling Club) won by tech fall over Jared Dowell (Pekin Boys &amp; Girls Club) TF 16-1</li>\n<li>Champ. Round 2 - Jaylin Garay (Falcons Elite Wrestling Club) won by decision over William Penrod (Mt. Vernon Lions Wrestling Club) Dec 13-6</li>\n<li>Champ. Round 2 - Luis Cretsinger (Xtreme Wrestling Club) won by decision over Hayden Copass (Storm Youth Wrestling Club) Dec 14-8</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Joey Graham (Celtic Elite) won by decision over Hunter Stellhorn (Edwardsville Wrestling Club) Dec 4-2</li>\n<li>Champ. Round 2 - Tyler Williams (Riverton Youth Wrestling) won in sudden victory - 1 over Brock Neill (LP Crunching Cavs) SV-1 11-9</li>\n<li>Champ. Round 2 - Connor Eaton (West Frankfort Jr. Redbirds) won by fall over Jesiah Bradshaw (Springfield Capitals Kids WC) Fall 0:33</li>\n<li>Champ. Round 2 - Partick Peters (Tinley Park Bulldogs Wrestling Club) won by fall over Kyle Amodia (Grayslake Wrestling Club) Fall 0:33</li>\n<li>Champ. Round 2 - Miguel Luna (Pitbull Wrestling Alliance) won by fall over Xavier Jean-Simon (HF Spartan Elite WC) Fall 2:47</li>\n<li>Champ. Round 2 - Colin Baker (Downers Grove Cougars WC) won by fall over Dustin Olmstead (King Select Wrestling) Fall 1:15</li>\n<li>Champ. Round 2 - Dayton Baue (Sparta Junior Bulldogs) won by fall over Jimmy Liston (Hinsdale Red Devil WC) Fall 0:23</li>\n<li>Champ. Round 2 - Joshua Woodrey (Prairie Central Hawks) won by fall over Kody Mongan (Tiger Town Tanglers Wrestling Club) Fall 2:05</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Enlow (Vandalia Kings) won by fall over Robert Schneider (Celtic Elite) Fall 0:20</li>\n<li>Champ. Round 2 - Simon Wilson (Champbuilders Wrestling) won by fall over Justin Sapp (Calumet Memorial PD Wolverines) Fall 4:05</li>\n<li>Champ. Round 2 - Jaiden Lowery (Waukegan Youth Wrestling Club) won by fall over Laron Reed (Danville Chargers Wrestling) Fall 0:20</li>\n<li>Champ. Round 2 - Shawn Lee (Downers Grove Cougars WC) won by fall over Eliazar Tapia (Champbuilders Wrestling) Fall 0:09</li>\n<li>Champ. Round 2 - Malachi Jennings (HF Spartan Elite WC) won by decision over Ryan Hannah (Maywood Bucs/Powerhouse) Dec 3-0</li>\n<li>Champ. Round 2 - Angel Jaimes (Martinez Fox Valley Elite) won by tech fall over Zachary Wallace (Moline Wrestling Club) TF 15-0</li>\n<li>Champ. Round 2 - Dreyden Pitts (Tiger Wrestling Club) won by fall over Oran Varela (Hoopeston Area Wrestling Club) Fall 0:28</li>\n<li>Champ. Round 2 - Trenton Overvig (Cumberland Youth Wrestling Club) won by fall over Damien Thomas (Caravan Kids Wrestling Club) Fall 0:29</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Phoenix Mordick (Dakota Wrestling Club) won by fall over Micah Bergen (TJ Trained) Fall 1:07</li>\n<li>Champ. Round 2 - Maurice Dotson (Granite City WC) won by injury default over Trevor Silzer (Tinley Park Bulldogs Wrestling Club) Inj. 3:45</li>\n<li>Champ. Round 2 - Samuel Hayes (Contender Wrestling) won by fall over Trevor Reed (Harvey Twisters WC) Fall 2:08</li>\n<li>Champ. Round 2 - Daniel Sheen (SCN Youth Wrestling Club) won by fall over Dillon Carlson (Crystal Lake Wizards) Fall 1:18</li>\n<li>Champ. Round 2 - Jacob Crandall (Greg Gomez Trained Wrestling) won by major decision over Brenden Cobine (Roxana Outlaws) Maj 13-0</li>\n<li>Champ. Round 2 - Antonio Alvarado (Belvidere Bandits Wrestling Club) won by fall over Griffin Duffin (Mustang/SKT WC) Fall 1:59</li>\n<li>Champ. Round 2 - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Jacob Gliva (Contender Wrestling) Dec 9-2</li>\n<li>Champ. Round 2 - Carter Hall (Champaign Wrestling Club) won by decision over Pierre Baldwin (Maywood Bucs/Powerhouse) Dec 13-6</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Dylan Amico (Force Wrestling Club) won by major decision over Reef Pacot (Storm Youth Wrestling Club) Maj 10-1</li>\n<li>Champ. Round 2 - Kenyon Boyce (Harvey Twisters WC) won by major decision over Danny Curran (Martinez Fox Valley Elite) Maj 12-2</li>\n<li>Champ. Round 2 - Matthew Minick (King Select Wrestling) won by fall over Paul Ishikawa (TJ Trained) Fall 1:21</li>\n<li>Champ. Round 2 - Christopher Moore (Crystal Lake Wizards) won by decision over Caden Muselman (Tinley Park Bulldogs Wrestling Club) Dec 9-2</li>\n<li>Champ. Round 2 - Christian Olsen (Crystal Lake Wizards) won by decision over Charlie Farmer (Moline Wrestling Club) Dec 4-0</li>\n<li>Champ. Round 2 - Nasir Bailey (Harvey Twisters WC) won by fall over Conor Smetana (Bolingbrook Junior Raiders) Fall 2:07</li>\n<li>Champ. Round 2 - Connor Surtin (Edwardsville Wrestling Club) won by decision over John Asiuras (Headlock Wrestling Academy) Dec 4-2</li>\n<li>Champ. Round 2 - Joel Mylin (Golden Eagles Wrestling Club) won in sudden victory - 1 over Carson Nishida (Iguana Wrestling Club) SV-1 4-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Koderhandt (Crusaders` Elite) won by tech fall over Cajaun Johnson (Tiger Wrestling Club) TF 17-2</li>\n<li>Champ. Round 2 - Tommy Curran (Martinez Fox Valley Elite) won by fall over Samuel Henkle (Crystal Lake Wizards) Fall 3:32</li>\n<li>Champ. Round 2 - Alex Randell (Greg Gomez Trained Wrestling) won by decision over Justin Cole (Team 1006) Dec 3-0</li>\n<li>Champ. Round 2 - Jacob Rundell (Little Huskies Wrestling Club) won by fall over Jack Finnegan (Force Wrestling Club) Fall 2:29</li>\n<li>Champ. Round 2 - Vincent Robinson (Harvey Twisters WC) won by decision over Joseph Knapp (Brawlers Wrestling Club) Dec 12-5</li>\n<li>Champ. Round 2 - Diego Sotelo (Martinez Fox Valley Elite) won by tech fall over Chase Hall (King Select Wrestling) TF 16-1</li>\n<li>Champ. Round 2 - Mia Palumbo (Southside Stallions School of Wrestling) won by fall over Cole Rhemrev (Junior Patriots Wrestling Club) Fall 1:11</li>\n<li>Champ. Round 2 - Cameron Clark (TJ Trained) won by decision over Nick Kotiw (Champaign Wrestling Club) Dec 5-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Will Carlile (Bulls Wrestling Club) won by decision over Michael Rodriguez (Southside Stallions School of Wrestling) Dec 2-1</li>\n<li>Champ. Round 2 - Alex Ventimilla (Martinez Fox Valley Elite) won by major decision over Jack McClimon (Indians Elite) Maj 15-3</li>\n<li>Champ. Round 2 - Kannon Webster (TJ Trained) won by decision over Jordan Blew (Force Wrestling Club) Dec 5-2</li>\n<li>Champ. Round 2 - Andrew Herbst (Hawk Wrestling Club Ltd.) won by fall over Phillip Chapa (Barrington Broncos Wrestling Club) Fall 2:47</li>\n<li>Champ. Round 2 - Kyle Schickel (Celtic Elite) won by tech fall over Malakye Rodriguez (Red Raiders Wrestling Team) TF 15-0</li>\n<li>Champ. Round 2 - Justin Warmowski (Fox Lake WC) won by decision over Joseph Fernau (St. Charles WC) Dec 5-3</li>\n<li>Champ. Round 2 - Grant Matarelli (Edwardsville Wrestling Club) won by decision over Grant Peterson (Central Illinois Wrestling Academy) Dec 5-2</li>\n<li>Champ. Round 2 - Brac Hooper (Champaign Wrestling Club) won by decision over Michael Kass (Southside Stallions School of Wrestling) Dec 4-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Nicholas Matthias (Celtic Elite) won by fall over Gaige Owens (Marion Youth Wrestling) Fall 2:02</li>\n<li>Champ. Round 2 - Kai Conway (Gomez Wrestling Academy) won by fall over Luke Barron (Team 1006) Fall 4:19</li>\n<li>Champ. Round 2 - Kendall Norfleet (Harvey Twisters WC) won by major decision over Donnie Hidden (TJ Trained) Maj 10-2</li>\n<li>Champ. Round 2 - Dean Hamiti (Martinez Fox Valley Elite) won by fall over Andrew Lira (Crystal Lake Wizards) Fall 1:30</li>\n<li>Champ. Round 2 - Joseph Cape (TJ Trained) won by decision over Peyton Schroeder (SCN Youth Wrestling Club) Dec 6-2</li>\n<li>Champ. Round 2 - Peyton Timmons (Red Raiders Wrestling Team) won by decision over Marko Hennin (Barrington Broncos Wrestling Club) Dec 2-0</li>\n<li>Champ. Round 2 - Vincent Zerban (King Select Wrestling) won by fall over Michael Archer (Southside Stallions School of Wrestling) Fall 2:06</li>\n<li>Champ. Round 2 - Terrance Snapp (Will County Warriors) won by decision over Austin McConaha (Champaign Wrestling Club) Dec 7-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Trevor Chumbley (SCN Youth Wrestling Club) won by major decision over Andrew Cervantes (Force Wrestling Club) Maj 11-0</li>\n<li>Champ. Round 2 - Mitchell Millsap (King Select Wrestling) won by major decision over Chase Duncan (Wolves Wrestling Club Inc.) Maj 13-0</li>\n<li>Champ. Round 2 - Donnell Washington (Harvey Twisters WC) won by fall over Brody Powell (Hoopeston Area Wrestling Club) Fall 2:31</li>\n<li>Champ. Round 2 - Eddie Bolivar (Gomez Wrestling Academy) won by decision over Austin Markee (Indians Elite) Dec 5-2</li>\n<li>Champ. Round 2 - Riley Palm (The Wrestling Factory) won by decision over Leo Mushinsky (TJ Trained) Dec 8-2</li>\n<li>Champ. Round 2 - William Edgar (King Select Wrestling) won by decision over Justin Major (Martinez Fox Valley Elite) Dec 2-0</li>\n<li>Champ. Round 2 - Pat Nolan (Orland Park Pioneers) won by decision over Benjamin Anderson (SCN Youth Wrestling Club) Dec 3-0</li>\n<li>Champ. Round 2 - Torry Early (Little Huskies Wrestling Club) won by decision over Joel Sarver (Champaign Wrestling Club) Dec 3-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Jackson Hosman (Celtic Elite) won by injury default over Isaac Martinez (Moline Wrestling Club) Inj. 3:40</li>\n<li>Champ. Round 2 - Kyle Cavender (Harrisburg Junior Bulldogs) won in sudden victory - 1 over George Marre (Gomez Wrestling Academy) SV-1 9-7</li>\n<li>Champ. Round 2 - Nicholas Termini (SCN Youth Wrestling Club) won by fall over Igor Husick (Morton Little Mustangs) Fall 3:25</li>\n<li>Champ. Round 2 - Nicky Amato (Izzy Style Wrestling) won by fall over Cameron Wolf (Sycamore Wrestling Club) Fall 3:32</li>\n<li>Champ. Round 2 - Casey Roberts (Mustang/SKT WC) won by decision over Dominic Duve (DuPage Tiger Wrestling Club) Dec 2-0</li>\n<li>Champ. Round 2 - Tanner Swain (Vandalia Jr Wrestling Club) won by decision over Alexander Posada (Villa-Lombard Cougars) Dec 4-0</li>\n<li>Champ. Round 2 - Jacob Dado (Bolingbrook Junior Raiders) won by major decision over Preston Berry (Falcons Elite Wrestling Club) Maj 14-5</li>\n<li>Champ. Round 2 - Brody Ivey (Sauk Valley Wrestling Club) won by decision over Nolan Roseman (Champaign Wrestling Club) Dec 3-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Tyler Besse (Dakota Wrestling Club) won by fall over Cameren Carver (Charleston Wrestling Club) Fall 2:45</li>\n<li>Champ. Round 2 - Jake Stiles (Izzy Style Wrestling) won by decision over D`Anthony Hopkins (Force Wrestling Club) Dec 9-4</li>\n<li>Champ. Round 2 - Patrick Daum (SCN Youth Wrestling Club) won by decision over Tommy Criscione (Celtic Elite) Dec 5-0</li>\n<li>Champ. Round 2 - Kody Cavender (Harrisburg Junior Bulldogs) won by decision over Anthony Bitner (Little Rams Wrestling) Dec 7-1</li>\n<li>Champ. Round 2 - Joshua Ramos (Martinez Fox Valley Elite) won by fall over Hugh Gorman (Redhawk Wrestling Club) Fall 3:45</li>\n<li>Champ. Round 2 - Abe Assad (Gomez Wrestling Academy) won by decision over Jake Kendall (Force Wrestling Club) Dec 5-3</li>\n<li>Champ. Round 2 - Jared Head (TJ Trained) won by decision over Kyle Dixon (Carlinville Wrestling Club) Dec 10-4</li>\n<li>Champ. Round 2 - Jacquez Stewart (Springfield Capitals Kids WC) won by decision over John Paul Smith (The Wrestling Factory) Dec 6-4</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Juan Bazaldua (Martinez Fox Valley Elite) won by decision over Jamel Sheppard (Gomez Wrestling Academy) Dec 8-2</li>\n<li>Champ. Round 2 - Maxwell Kristoff (Crusaders` Elite) won by decision over Garrett Lashuay (Oakwood Youth Wrestling Club) Dec 8-4</li>\n<li>Champ. Round 2 - Fidel Mayora (Epic Wrestling) won by tech fall over Hunter Yohn (Champions WC) TF 19-3</li>\n<li>Champ. Round 2 - Corey Sapp (Bolingbrook Junior Raiders) won by fall over Dylan Kull (Evanston School of Wrestling) Fall 0:30</li>\n<li>Champ. Round 2 - Eddie Villalobos (Rochelle Wrestling Club) won in sudden victory - 1 over Johnny Acevedo (Martinez Fox Valley Elite) SV-1 3-1</li>\n<li>Champ. Round 2 - Michael Gunther (The Wrestling Factory) won by major decision over Caleb Grau (Team Mascoutah Wrestling) Maj 13-4</li>\n<li>Champ. Round 2 - Jayden Terronez (Moline Wrestling Club) won by decision over Isaiah Willett (Renegade Wrestling Club (NFP)) Dec 6-0</li>\n<li>Champ. Round 2 - Peter Ferraro (SCN Youth Wrestling Club) won by decision over Dalton Hall (Champaign Wrestling Club) Dec 4-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Bilal Bailey (Harvey Twisters WC) won by decision over Peyton Berry (Falcons Elite Wrestling Club) Dec 5-1</li>\n<li>Champ. Round 2 - Norman Harris (Edwardsville Wrestling Club) won by decision over Ike Papes (Celtic Elite) Dec 4-3</li>\n<li>Champ. Round 2 - Stephen Bushy (Crystal Lake Wizards) won by major decision over Mason Ajster (Champaign Wrestling Club) Maj 10-2</li>\n<li>Champ. Round 2 - Elijah Black (The Wrestling Factory) won by tech fall over Alex Maguire (Roxana Outlaws) TF 17-2</li>\n<li>Champ. Round 2 - Nicolas Patch (Force Wrestling Club) won by decision over Luke Russell (Naperville Wrestling Club) Dec 5-1</li>\n<li>Champ. Round 2 - Cormac Kane (Junior Cougar Wrestling Club) won by decision over Devin Wills (Crusaders` Elite) Dec 4-2</li>\n<li>Champ. Round 2 - Victor Guzman (Rock Island Wrestling Club) won by decision over Anthony Geraci (Headlock Wrestling Academy) Dec 4-1</li>\n<li>Champ. Round 2 - Peter Mccusker (Champaign Wrestling Club) won by fall over Mateo Portillo (Southside Stallions School of Wrestling) Fall 3:55</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Anthony Glauser (The Wrestling Factory) won by tech fall over Jiovanni Martinez (Martinez Fox Valley Elite) TF 18-2</li>\n<li>Champ. Round 2 - Sam Blaha (Junior Kahoks) won by major decision over Eli Pannell (River Bend Wrestling Club) Maj 13-0</li>\n<li>Champ. Round 2 - Trey Piotrowski (Wolves Wrestling Club Inc.) won by decision over Anthony Kluk (Oak Forest Warriors) Dec 2-1</li>\n<li>Champ. Round 2 - Baylor Fernandes (Bolingbrook Junior Raiders) won by fall over Hayden Tibbs (Pekin Boys &amp; Girls Club) Fall 2:11</li>\n<li>Champ. Round 2 - Brad Gross (SCN Youth Wrestling Club) won by fall over Colton Ingram (Xtreme Wrestling Club) Fall 1:19</li>\n<li>Champ. Round 2 - Quintin Hamilton (Evanston School of Wrestling) won by fall over Mason Newman (Sauk Valley Wrestling Club) Fall 1:47</li>\n<li>Champ. Round 2 - J.p. Migawa (Tinley Park Bulldogs Wrestling Club) won by injury default over Brenden Parks (Kaneland Knights Wrestling Club) Inj. 3:30</li>\n<li>Champ. Round 2 - Peter Christensen (Izzy Style Wrestling) won by major decision over Austin Reeves (Pontiac Wrestling Club) Maj 10-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Drake Regenhardt (Wolves Wrestling Club Inc.) won by fall over Damien Ross (East St. Louis Wrestling) Fall 3:21</li>\n<li>Champ. Round 2 - Anthony Pennington (Gomez Wrestling Academy) won by decision over Antonio Tuminello (Celtic Elite) Dec 2-1</li>\n<li>Champ. Round 2 - Jackson Punzel (Naperville Wrestling Club) won by fall over Gianfranco Montalto (Lemont Bears) Fall 3:04</li>\n<li>Champ. Round 2 - Jay Cee Randolph-Gonzalez (Izzy Style Wrestling) won by decision over Santos Castillo (Charger WC) Dec 7-6</li>\n<li>Champ. Round 2 - Conor Prettyman (Barrington Broncos Wrestling Club) won by decision over Peyton Lind (Xtreme Wrestling Club) Dec 8-1</li>\n<li>Champ. Round 2 - Cory Peterson (King Select Wrestling) won by fall over Thomas Collins (Vittum Cats Wrestling Club) Fall 0:28</li>\n<li>Champ. Round 2 - Jett Dowell (Falcons Elite Wrestling Club) won by major decision over Donovan Corn (Harvey Twisters WC) Maj 8-0</li>\n<li>Champ. Round 2 - Logan Wilson (Champaign Wrestling Club) won by fall over Richard Messling (Xtreme Wrestling Club) Fall 2:06</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Jacob Erslon (Bulls Wrestling Club) won by major decision over Matthew Carmody (Waubonsie Wrestling Club) Maj 13-0</li>\n<li>Champ. Round 2 - Trevor Swier (Force Wrestling Club) won by major decision over Malik Daghash (Badger Wrestling Club) Maj 9-0</li>\n<li>Champ. Round 2 - Tayesean White (Gomez Wrestling Academy) won by fall over Brian Ziech (Friar Wrestling Club) Fall 4:27</li>\n<li>Champ. Round 2 - Peyton Hammerich (Tiger Town Tanglers Wrestling Club) won by decision over Joseph Esposito (Hononegah Wrestling Club) Dec 12-5</li>\n<li>Champ. Round 2 - Jimmy Bartell (Maine Eagles WC) won by major decision over Connor McCratic (Cary-Grove Matmen WC) Maj 11-0</li>\n<li>Champ. Round 2 - Dan Benoit (Redhawk Wrestling Club) won by major decision over Nathan Crane (Junior Kahoks) Maj 8-0</li>\n<li>Champ. Round 2 - Joey Alletto (Falcons Elite Wrestling Club) won by decision over Evan Carney (O`Fallon Little Panthers Wrestling Club) Dec 4-0</li>\n<li>Champ. Round 2 - Tyson Burton (Champaign Wrestling Club) won by fall over Geno Lukowski (Martinez Fox Valley Elite) Fall 1:08</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Jon Halvorsen (Maine Eagles WC) won by major decision over Isaiah Fields (Martinez Fox Valley Elite) Maj 12-3</li>\n<li>Champ. Round 2 - Thomas Doyle (Vittum Cats Wrestling Club) won by major decision over Brody Spencer (Tiger Town Tanglers Wrestling Club) Maj 14-4</li>\n<li>Champ. Round 2 - John Hawkins (Crystal Lake Wizards) won by fall over Cameron Palmer (Naperville Wrestling Club) Fall 2:15</li>\n<li>Champ. Round 2 - Kobe Howard (Renegade Wrestling Club (NFP)) won by fall over Dayton Houston (Junior Kahoks) Fall 3:18</li>\n<li>Champ. Round 2 - Tyreek Austin (East St. Louis Wrestling) won by tech fall over Isaac Harris (Morton Little Mustangs) TF 16-1</li>\n<li>Champ. Round 2 - Nick Mahajlovich (Celtic Elite) won by decision over David Preston (Mundelein WC) Dec 6-3</li>\n<li>Champ. Round 2 - Kyle Borske (Fox Valley Wrestling Club) won by decision over Ethan Torres (Grayslake Wrestling Club) Dec 6-0</li>\n<li>Champ. Round 2 - Dylan Lozeau (Sycamore Wrestling Club) won by decision over Justin Allen (Prairie Central Hawks) Dec 14-11</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Joseph Passarelli (Downers Grove Cougars WC) won by decision over Trevor Barton (Sycamore Wrestling Club) Dec 6-4</li>\n<li>Champ. Round 2 - Santino Blanco (Morton Little Mustangs) won in sudden victory - 1 over Maximus Gomez (Izzy Style Wrestling) SV-1 5-3</li>\n<li>Champ. Round 2 - Bo Meikamp (Edwardsville Wrestling Club) won by fall over David Hardwick (Lancer Wrestling Club) Fall 4:15</li>\n<li>Champ. Round 2 - Cole Campbell (Geneva Junior Vikings) won by fall over Garrett St. Clair (Force Wrestling Club) Fall 2:40</li>\n<li>Champ. Round 2 - Jaylen Washington (East St. Louis Wrestling) won by decision over Cody Goodman (The Wrestling Factory) Dec 5-4</li>\n<li>Champ. Round 2 - Jesse Linch (Rock Island Wrestling Club) won by fall over Jase Abraham (Belvidere Bandits Wrestling Club) Fall 0:45</li>\n<li>Champ. Round 2 - Jacob Kaminski (Martinez Fox Valley Elite) won by major decision over Drew Huff (Roxana Outlaws) Maj 13-3</li>\n<li>Champ. Round 2 - Brian Morel (Pitbull Wrestling Alliance) won by fall over Cova Curry (Hoopeston Area Wrestling Club) Fall 3:54</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Ameer Aqel (Vittum Cats Wrestling Club) won by decision over Julian Jaimes (Martinez Fox Valley Elite) Dec 7-1</li>\n<li>Champ. Round 2 - Cameron Lee (TJ Trained) won by fall over Hadi Abolghasem (Maddog Wrestling Club) Fall 1:50</li>\n<li>Champ. Round 2 - Jordan Gregg (Hillsboro Jr Toppers Wrestling Club) won by fall over Thomas Robson (Wolves Wrestling Club Inc.) Fall 2:32</li>\n<li>Champ. Round 2 - Victor Rodriguez (Villa-Lombard Cougars) won by fall over Michael Swistowicz (Mustang/SKT WC) Fall 4:02</li>\n<li>Champ. Round 2 - Saul Quintana (Villa-Lombard Cougars) won by fall over Jonathan Lopez (Waukegan Youth Wrestling Club) Fall 0:21</li>\n<li>Champ. Round 2 - Tyler Berhenke (Champbuilders Wrestling) won by fall over Justin Hull (St. Charles WC) Fall 2:58</li>\n<li>Champ. Round 2 - Samuel Martin (Edwardsville Wrestling Club) won by decision over James Bowers (Hononegah Wrestling Club) Dec 5-4</li>\n<li>Champ. Round 2 - Luke Luffman (Champaign Wrestling Club) won by fall over Hunter McAlpine (Team 1006) Fall 2:02</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Anderson (Edwardsville Wrestling Club) won by decision over Isaac Williamson (Charleston Wrestling Club) Dec 4-1</li>\n<li>Champ. Round 2 - Chase Tatum (Tiger Town Tanglers Wrestling Club) won by fall over Mounes Betancourt (Harvey Twisters WC) Fall 0:18</li>\n<li>Champ. Round 2 - Jose Ramos (Arlington Cardinals Wrestling Club) won by decision over Tate Poole (Hononegah Wrestling Club) Dec 10-3</li>\n<li>Champ. Round 2 - Darrell Gregg (St. Charles WC) won by fall over Quentin Davis (HF Spartan Elite WC) Fall 1:44</li>\n<li>Champ. Round 2 - Lucas Korte (Celtic Elite) won by fall over Jesus Lopez (Lancer Wrestling Club) Fall 0:28</li>\n<li>Champ. Round 2 - Jace Punke (TJ Trained) won by fall over Kane Blaylock (Granite City WC) Fall 0:19</li>\n<li>Champ. Round 2 - Cory Fant (Rochelle Wrestling Club) won by fall over Victor Ramirez (Gomez Wrestling Academy) Fall 0:21</li>\n<li>Champ. Round 2 - Caleb Guise (Clinton Wrestling Club) won by decision over Nolan Tewell (Lawrence County Wrestling Club) Dec 5-3</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Adam Copeland (Bulls Wrestling Club) won by fall over Mike Perry (Maine Eagles WC) Fall 0:30</li>\n<li>Champ. Round 2 - Michael McNicholas (Glenbard East Jr Rams Wrestling Club) won by decision over Noah Laney (Crystal Lake Wizards) Dec 7-5</li>\n<li>Champ. Round 2 - Ronald Tucker (Bolingbrook Junior Raiders) won by fall over Nicholas Blades (Harlem Cougar WC) Fall 0:30</li>\n<li>Champ. Round 2 - Bill Blaser (Geneseo Spider Wrestling Club) won by fall over Craig Weiss (Badger Wrestling Club) Fall 0:17</li>\n<li>Champ. Round 2 - Tristan Phillips (Murphysboro Wrestling Club) won by fall over Pedro Castanon (Falcons Elite Wrestling Club) Fall 2:58</li>\n<li>Champ. Round 2 - Banski Fountain (Junior Pirates) won by fall over Jacob Gonzalez (Little Rams Wrestling) Fall 0:34</li>\n<li>Champ. Round 2 - Nicholas Vaccariello (Force Wrestling Club) won by fall over Tyler Elsbury (Xtreme Wrestling Club) Fall 2:42</li>\n<li>Champ. Round 2 - Khamarion Smith (Tiger Wrestling Club) won by injury default over Lamarkio Bess (East St. Louis Wrestling) Inj. 0:19</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Javen Estrada (Bolingbrook Junior Raiders) won by fall over Logan Reed (Marengo Youth Wrestling) Fall 2:20</li>\n<li>Champ. Round 2 - Robert Pizarro (Martinez Fox Valley Elite) won by decision over Jake Tanquilut (Tinley Park Bulldogs Wrestling Club) Dec 6-0</li>\n<li>Champ. Round 2 - Ben Lunn (Edwardsville Wrestling Club) won by fall over Vincenzo Biciocchi (Roxana Outlaws) Fall 0:50</li>\n<li>Champ. Round 2 - Michael Crawford (Sycamore Wrestling Club) won by major decision over Jack McDonald (Little Rams Wrestling) Maj 15-1</li>\n<li>Champ. Round 2 - Derek Torza (Team 1006) won by decision over Nicholas Lockhart (Sycamore Wrestling Club) Dec 5-1</li>\n<li>Champ. Round 2 - Luke Fleming (Martinez Fox Valley Elite) won by decision over Jameir Castleberry (Little Huskies Wrestling Club) Dec 1-0</li>\n<li>Champ. Round 2 - Reese Durlacher (The Wrestling Factory) won by decision over Jalen May (Crusaders` Elite) Dec 4-0</li>\n<li>Champ. Round 2 - Jacob Randolph (Celtic Elite) won by fall over James Raycraft (Springfield Capitals Kids WC) Fall 0:32</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Holm (Izzy Style Wrestling) won by fall over Zachary Hayes (Roxana Outlaws) Fall 0:13</li>\n<li>Champ. Round 2 - Presley Beasley (Crystal Lake Wizards) won by major decision over Brice Balosky (Greg Gomez Trained Wrestling) Maj 9-1</li>\n<li>Champ. Round 2 - Joel Vandervere (The Wrestling Factory) won by fall over Aric Nieves (Team 1006) Fall 0:08</li>\n<li>Champ. Round 2 - Sam Emery (Celtic Elite) won in sudden victory - 1 over Dasan Johnson (Harvey Twisters WC) SV-1 1-0</li>\n<li>Champ. Round 2 - Anthony Schickel (Bolingbrook Junior Raiders) won by decision over Grant Woodruff (TJ Trained) Dec 8-1</li>\n<li>Champ. Round 2 - Cameron Johnson (Martinez Fox Valley Elite) won by tech fall over Justin Peters (Dundee Highlanders WC) TF 17-2</li>\n<li>Champ. Round 2 - Dylan Ragusin (Izzy Style Wrestling) won by fall over Zeth Stallings (Lawrence County Wrestling Club) Fall 2:05</li>\n<li>Champ. Round 2 - Brody Norman (TJ Trained-Decatur) won by decision over Jake Doyle (Red Raiders Wrestling Team) Dec 2-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Michael Leveille (Redhawk Wrestling Club) won by fall over Ty`Reese Smith (Lionheart Intense Wrestling) Fall 1:20</li>\n<li>Champ. Round 2 - Nathan Callaway (Martinez Fox Valley Elite) won by major decision over Christopher Kennedy (Celtic Elite) Maj 10-2</li>\n<li>Champ. Round 2 - Anthony Molton (Will County Warriors) won by decision over Ryan Haynes (Pekin Boys &amp; Girls Club) Dec 7-0</li>\n<li>Champ. Round 2 - Kaleb Thompson (Bolingbrook Junior Raiders) won by major decision over Jace Sparks (Crystal Lake Wizards) Maj 13-1</li>\n<li>Champ. Round 2 - Matthew Ramos (Bolingbrook Junior Raiders) won by tech fall over Trevor Boryla (Sycamore Wrestling Club) TF 18-0</li>\n<li>Champ. Round 2 - Michael Jaffe (SCN Youth Wrestling Club) won by decision over Trey Cysewski (Barrington Broncos Wrestling Club) Dec 4-1</li>\n<li>Champ. Round 2 - Noah Surtin (Edwardsville Wrestling Club) won by fall over Christian Goin (TJ Trained) Fall 3:37</li>\n<li>Champ. Round 2 - Luc Valdez (Tinley Park Bulldogs Wrestling Club) won by decision over Joseph Cardani (Champaign Wrestling Club) Dec 10-5</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Ryan Fleck (SCN Youth Wrestling Club) won by tech fall over Harley Kent (Knox County Krushers) TF 16-0</li>\n<li>Champ. Round 2 - Ezra Elliott (Hoopeston Area Wrestling Club) won by decision over Noah Paul (Xtreme Wrestling Club) Dec 8-1</li>\n<li>Champ. Round 2 - James Pierandozzi (Bolingbrook Junior Raiders) won by fall over Chevvy Wood (Aces Wrestling Club) Fall 2:17</li>\n<li>Champ. Round 2 - Daniel Pucino (The Wrestling Factory) won by decision over Joshua Ogunsanya (Harvey Twisters WC) Dec 12-9</li>\n<li>Champ. Round 2 - Jacob Lindsey (Oak Forest Warriors) won by tech fall over Daniel McPherson (Lakeland Predators WC) TF 19-2</li>\n<li>Champ. Round 2 - Enzo Silva (Martinez Fox Valley Elite) won by tech fall over Noah Bickett (Force Wrestling Club) TF 19-4</li>\n<li>Champ. Round 2 - Jacob Lukaszczyk (Vittum Cats Wrestling Club) won by decision over William Hillard (Triad Little Knights Wrestling Club) Dec 7-0</li>\n<li>Champ. Round 2 - Anthony Turner (Champaign Wrestling Club) won by decision over Ayden Whaley (Xtreme Wrestling Club) Dec 10-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Domenic Zaccone (Orland Park Pioneers) won by tech fall over Garrett Johnson (Prairie Central Hawks) TF 18-2</li>\n<li>Champ. Round 2 - Andrew Baysingar (Arlington Cardinals Wrestling Club) won by fall over Caleb Alber (Dakota Wrestling Club) Fall 0:46</li>\n<li>Champ. Round 2 - Justen Pate (Harvey Twisters WC) won by decision over Adam Meenen (Sauk Valley Wrestling Club) Dec 6-4</li>\n<li>Champ. Round 2 - Nico Nunez (Martinez Fox Valley Elite) won by major decision over Cameron Miller (Marengo Youth Wrestling) Maj 11-2</li>\n<li>Champ. Round 2 - Justin Benjamin (SCN Youth Wrestling Club) won by fall over Andrew Greenwood (TJ Trained) Fall 0:54</li>\n<li>Champ. Round 2 - Reece Heller (Izzy Style Wrestling) won by fall over Giovanni Cassioppi (Hononegah Wrestling Club) Fall 1:56</li>\n<li>Champ. Round 2 - Alexander Fulton (O`Fallon Little Panthers Wrestling Club) won by fall over Jack Kilroe (Mustang/SKT WC) Fall 0:59</li>\n<li>Champ. Round 2 - Dylan Burnoski (Bolingbrook Junior Raiders) won by fall over Tyson Coon (Hoopeston Area Wrestling Club) Fall 0:59</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Nain Vazquez (Martinez Fox Valley Elite) won by fall over Tanner Kalkbrenner (The Law) Fall 3:22</li>\n<li>Quarterfinal - Nicholas Bolivar (Gomez Wrestling Academy) won in sudden victory - 1 over Patrick Houston (Tinley Park Bulldogs Wrestling Club) SV-1 2-0</li>\n<li>Quarterfinal - Luke Odom (Edwardsville Wrestling Club) won by decision over Tristan Daugherty (Central Illinois Wrestling Academy) Dec 3-0</li>\n<li>Quarterfinal - Alex Villar (Bolingbrook Junior Raiders) won by major decision over Mateen Taylor (Harvey Twisters WC) Maj 9-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Brayden Thompson (Izzy Style Wrestling) won by decision over Brock Pfeifer (Celtic Elite) Dec 3-2</li>\n<li>Quarterfinal - Jacob Tinajero (SCN Youth Wrestling Club) won by decision over Caden Ernd (Crystal Lake Wizards) Dec 6-0</li>\n<li>Quarterfinal - Zeke Marshall (Martinez Fox Valley Elite) won by decision over Kyle Tunink (Xtreme Wrestling Club) Dec 6-4</li>\n<li>Quarterfinal - Grant Laduke (Celtic Elite) won by decision over Jack Coyle (Mustang/SKT WC) Dec 10-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Ryan Smith (Harvey Twisters WC) won by fall over Alexander Tagler (Vittum Cats Wrestling Club) Fall 1:07</li>\n<li>Quarterfinal - Connor Gaynor (Tinley Park Bulldogs Wrestling Club) won by fall over Barry Stevenson (Force Wrestling Club) Fall 0:31</li>\n<li>Quarterfinal - Sincere Bailey (Harvey Twisters WC) won by fall over Deon Lopez (Lakeland Predators WC) Fall 0:32</li>\n<li>Quarterfinal - Qayin Dabney (Celtic Elite) won by major decision over Peyton Holt (St. Joseph Odgen Youth Wrestling Club) Maj 9-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Ben Harvey (Rochelle Wrestling Club) won by decision over Zachary Janz (Greg Gomez Trained Wrestling) Dec 2-1</li>\n<li>Quarterfinal - Kevin Countryman (Celtic Elite) won by decision over Bryan Smith (Harvey Twisters WC) Dec 7-4</li>\n<li>Quarterfinal - Dylan Connell (Crystal Lake Wizards) won by decision over Raymond Hernandez (Mustang/SKT WC) Dec 8-5</li>\n<li>Quarterfinal - Martin Larkin (Redhawk Wrestling Club) won in sudden victory - 1 over Logan Deacetis (Prairie Central Hawks) SV-1 6-5</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Daemyen Middlebrooks (Little Huskies Wrestling Club) won by decision over Alex Carrillo (Force Wrestling Club) Dec 12-7</li>\n<li>Quarterfinal - Isaiah Parker (The Wrestling Factory) won by major decision over Marc Catama (Golden Eagles Wrestling Club) Maj 14-3</li>\n<li>Quarterfinal - Noah Villarreal (Martinez Fox Valley Elite) won by fall over Kaden Beeler (Edwardsville Wrestling Club) Fall 0:46</li>\n<li>Quarterfinal - Jack Patting (Moline Wrestling Club) won by decision over Colt Guyon (Cumberland Youth Wrestling Club) Dec 13-10</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Alonzo Smiley (Gomez Wrestling Academy) won by decision over Jake Viloria (Little Huskies Wrestling Club) Dec 4-2</li>\n<li>Quarterfinal - Drew Nash (Lemont Bears) won by decision over Jeremy Pullen (Force Wrestling Club) Dec 6-2</li>\n<li>Quarterfinal - Zachary Kolb (Force Wrestling Club) won by decision over Niko Lopez (Greg Gomez Trained Wrestling) Dec 4-0</li>\n<li>Quarterfinal - Noah Alsguson (Harvey Twisters WC) won by fall over Noah Ross (Izzy Style Wrestling) Fall 0:15</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Drew Gvillo (Edwardsville Wrestling Club) won by decision over Kyle Berg (Vittum Cats Wrestling Club) Dec 4-2</li>\n<li>Quarterfinal - Josh Labarbera (Martinez Fox Valley Elite) won by decision over Robert Bates (Little Redskins Wrestling Club) Dec 5-4</li>\n<li>Quarterfinal - Aron Taylor (Carbondale Wrestling Club) won by fall over Sean Swinkle (St. Tarcissus Wrestling Club) Fall 2:36</li>\n<li>Quarterfinal - Miguel Barrett (Pontiac Wrestling Club) won by fall over Ronald Massari (Little Huskies Wrestling Club) Fall 3:56</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Daemon McMurtry (Celtic Elite) won by fall over Tavaris Macklin (Carbondale Wrestling Club) Fall 4:18</li>\n<li>Quarterfinal - Jordan Chisum (Zee-Bee Stingers Wrestling Club) won by decision over Vincent Querciagrossa (Metamora Kids Wrestling Club) Dec 9-2</li>\n<li>Quarterfinal - Tommy Evans (Wolves Wrestling Club Inc.) won by decision over Mike Bosco (Tinley Park Bulldogs Wrestling Club) Dec 6-4</li>\n<li>Quarterfinal - Brandon Hoselton (Prairie Central Hawks) won by major decision over Carter Maggio (St. Charles WC) Maj 11-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Joseph Jens (Grayslake Wrestling Club) won by decision over Tyson Heerman (Peoria Razorbacks Wrestling Club) Dec 5-2</li>\n<li>Quarterfinal - Mustafa St. Clair (Harvey Twisters WC) won by fall over Kaleb Simms (Rochelle Wrestling Club) Fall 0:21</li>\n<li>Quarterfinal - Apollo Gothard (Lemont Bears) won by decision over Angel Alverio (Crosstown Wrestling) Dec 7-6</li>\n<li>Quarterfinal - Matthew Ramirez (Barrington Broncos Wrestling Club) won by fall over Cole Gaddis (Hoopeston Area Wrestling Club) Fall 1:23</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Nikolas Mishka (Tinley Park Bulldogs Wrestling Club) won by major decision over Alvin Maten (Harlem Cougar WC) Maj 14-2</li>\n<li>Quarterfinal - Jacob Morrissey (Edwardsville Wrestling Club) won by fall over Dashun Walker (HF Spartan Elite WC) Fall 1:02</li>\n<li>Quarterfinal - Nicholas Skamra (Headlock Wrestling Academy) won by fall over Nathaniel Thomas (Badger Wrestling Club) Fall 0:57</li>\n<li>Quarterfinal - Jaylin Garay (Falcons Elite Wrestling Club) won by major decision over Luis Cretsinger (Xtreme Wrestling Club) Maj 12-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Tyler Williams (Riverton Youth Wrestling) won by fall over Joey Graham (Celtic Elite) Fall 2:46</li>\n<li>Quarterfinal - Connor Eaton (West Frankfort Jr. Redbirds) won by fall over Partick Peters (Tinley Park Bulldogs Wrestling Club) Fall 2:51</li>\n<li>Quarterfinal - Colin Baker (Downers Grove Cougars WC) won by fall over Miguel Luna (Pitbull Wrestling Alliance) Fall 4:11</li>\n<li>Quarterfinal - Joshua Woodrey (Prairie Central Hawks) won by decision over Dayton Baue (Sparta Junior Bulldogs) Dec 6-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Anthony Enlow (Vandalia Kings) won by fall over Simon Wilson (Champbuilders Wrestling) Fall 1:26</li>\n<li>Quarterfinal - Shawn Lee (Downers Grove Cougars WC) won by fall over Jaiden Lowery (Waukegan Youth Wrestling Club) Fall 1:15</li>\n<li>Quarterfinal - Angel Jaimes (Martinez Fox Valley Elite) won by fall over Malachi Jennings (HF Spartan Elite WC) Fall 0:58</li>\n<li>Quarterfinal - Trenton Overvig (Cumberland Youth Wrestling Club) won by fall over Dreyden Pitts (Tiger Wrestling Club) Fall 2:10</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Phoenix Mordick (Dakota Wrestling Club) won by decision over Maurice Dotson (Granite City WC) Dec 9-8</li>\n<li>Quarterfinal - Samuel Hayes (Contender Wrestling) won by decision over Daniel Sheen (SCN Youth Wrestling Club) Dec 7-2</li>\n<li>Quarterfinal - Antonio Alvarado (Belvidere Bandits Wrestling Club) won by decision over Jacob Crandall (Greg Gomez Trained Wrestling) Dec 5-3</li>\n<li>Quarterfinal - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Carter Hall (Champaign Wrestling Club) Dec 6-4</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Dylan Amico (Force Wrestling Club) won by major decision over Kenyon Boyce (Harvey Twisters WC) Maj 10-0</li>\n<li>Quarterfinal - Christopher Moore (Crystal Lake Wizards) won by decision over Matthew Minick (King Select Wrestling) Dec 2-1</li>\n<li>Quarterfinal - Nasir Bailey (Harvey Twisters WC) won by decision over Christian Olsen (Crystal Lake Wizards) Dec 8-2</li>\n<li>Quarterfinal - Joel Mylin (Golden Eagles Wrestling Club) won by decision over Connor Surtin (Edwardsville Wrestling Club) Dec 7-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Joshua Koderhandt (Crusaders` Elite) won by major decision over Tommy Curran (Martinez Fox Valley Elite) Maj 10-0</li>\n<li>Quarterfinal - Jacob Rundell (Little Huskies Wrestling Club) won by major decision over Alex Randell (Greg Gomez Trained Wrestling) Maj 14-0</li>\n<li>Quarterfinal - Diego Sotelo (Martinez Fox Valley Elite) won by decision over Vincent Robinson (Harvey Twisters WC) Dec 6-0</li>\n<li>Quarterfinal - Mia Palumbo (Southside Stallions School of Wrestling) won by decision over Cameron Clark (TJ Trained) Dec 8-4</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Will Carlile (Bulls Wrestling Club) won by decision over Alex Ventimilla (Martinez Fox Valley Elite) Dec 4-3</li>\n<li>Quarterfinal - Kannon Webster (TJ Trained) won by decision over Andrew Herbst (Hawk Wrestling Club Ltd.) Dec 7-0</li>\n<li>Quarterfinal - Kyle Schickel (Celtic Elite) won by major decision over Justin Warmowski (Fox Lake WC) Maj 12-3</li>\n<li>Quarterfinal - Grant Matarelli (Edwardsville Wrestling Club) won by fall over Brac Hooper (Champaign Wrestling Club) Fall 2:51</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Nicholas Matthias (Celtic Elite) won by decision over Kai Conway (Gomez Wrestling Academy) Dec 6-0</li>\n<li>Quarterfinal - Dean Hamiti (Martinez Fox Valley Elite) won by decision over Kendall Norfleet (Harvey Twisters WC) Dec 7-0</li>\n<li>Quarterfinal - Joseph Cape (TJ Trained) won by decision over Peyton Timmons (Red Raiders Wrestling Team) Dec 3-2</li>\n<li>Quarterfinal - Vincent Zerban (King Select Wrestling) won by major decision over Terrance Snapp (Will County Warriors) Maj 12-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Trevor Chumbley (SCN Youth Wrestling Club) won by tech fall over Mitchell Millsap (King Select Wrestling) TF 15-0</li>\n<li>Quarterfinal - Donnell Washington (Harvey Twisters WC) won by decision over Eddie Bolivar (Gomez Wrestling Academy) Dec 6-4</li>\n<li>Quarterfinal - Riley Palm (The Wrestling Factory) won by fall over William Edgar (King Select Wrestling) Fall 2:48</li>\n<li>Quarterfinal - Pat Nolan (Orland Park Pioneers) won by fall over Torry Early (Little Huskies Wrestling Club) Fall 3:09</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Kyle Cavender (Harrisburg Junior Bulldogs) won by decision over Jackson Hosman (Celtic Elite) Dec 3-0</li>\n<li>Quarterfinal - Nicholas Termini (SCN Youth Wrestling Club) won by decision over Nicky Amato (Izzy Style Wrestling) Dec 7-1</li>\n<li>Quarterfinal - Tanner Swain (Vandalia Jr Wrestling Club) won by decision over Casey Roberts (Mustang/SKT WC) Dec 7-0</li>\n<li>Quarterfinal - Jacob Dado (Bolingbrook Junior Raiders) won by major decision over Brody Ivey (Sauk Valley Wrestling Club) Maj 11-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Jake Stiles (Izzy Style Wrestling) won by fall over Tyler Besse (Dakota Wrestling Club) Fall 1:07</li>\n<li>Quarterfinal - Kody Cavender (Harrisburg Junior Bulldogs) won by decision over Patrick Daum (SCN Youth Wrestling Club) Dec 5-1</li>\n<li>Quarterfinal - Abe Assad (Gomez Wrestling Academy) won by decision over Joshua Ramos (Martinez Fox Valley Elite) Dec 3-0</li>\n<li>Quarterfinal - Jared Head (TJ Trained) won by decision over Jacquez Stewart (Springfield Capitals Kids WC) Dec 5-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Juan Bazaldua (Martinez Fox Valley Elite) won by decision over Maxwell Kristoff (Crusaders` Elite) Dec 7-0</li>\n<li>Quarterfinal - Fidel Mayora (Epic Wrestling) won in sudden victory - 1 over Corey Sapp (Bolingbrook Junior Raiders) SV-1 3-1</li>\n<li>Quarterfinal - Michael Gunther (The Wrestling Factory) won by decision over Eddie Villalobos (Rochelle Wrestling Club) Dec 4-1</li>\n<li>Quarterfinal - Peter Ferraro (SCN Youth Wrestling Club) won by fall over Jayden Terronez (Moline Wrestling Club) Fall 1:01</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Bilal Bailey (Harvey Twisters WC) won by major decision over Norman Harris (Edwardsville Wrestling Club) Maj 9-1</li>\n<li>Quarterfinal - Elijah Black (The Wrestling Factory) won by decision over Stephen Bushy (Crystal Lake Wizards) Dec 8-3</li>\n<li>Quarterfinal - Cormac Kane (Junior Cougar Wrestling Club) won by decision over Nicolas Patch (Force Wrestling Club) Dec 7-2</li>\n<li>Quarterfinal - Peter Mccusker (Champaign Wrestling Club) won by major decision over Victor Guzman (Rock Island Wrestling Club) Maj 12-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Anthony Glauser (The Wrestling Factory) won by fall over Sam Blaha (Junior Kahoks) Fall 2:16</li>\n<li>Quarterfinal - Baylor Fernandes (Bolingbrook Junior Raiders) won by injury default over Trey Piotrowski (Wolves Wrestling Club Inc.) Inj. 3:59</li>\n<li>Quarterfinal - Brad Gross (SCN Youth Wrestling Club) won by fall over Quintin Hamilton (Evanston School of Wrestling) Fall 1:27</li>\n<li>Quarterfinal - Peter Christensen (Izzy Style Wrestling) won by decision over J.p. Migawa (Tinley Park Bulldogs Wrestling Club) Dec 6-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Drake Regenhardt (Wolves Wrestling Club Inc.) won by major decision over Anthony Pennington (Gomez Wrestling Academy) Maj 11-1</li>\n<li>Quarterfinal - Jackson Punzel (Naperville Wrestling Club) won by decision over Jay Cee Randolph-Gonzalez (Izzy Style Wrestling) Dec 3-2</li>\n<li>Quarterfinal - Cory Peterson (King Select Wrestling) won by major decision over Conor Prettyman (Barrington Broncos Wrestling Club) Maj 9-1</li>\n<li>Quarterfinal - Logan Wilson (Champaign Wrestling Club) won by major decision over Jett Dowell (Falcons Elite Wrestling Club) Maj 14-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Trevor Swier (Force Wrestling Club) won by fall over Jacob Erslon (Bulls Wrestling Club) Fall 0:24</li>\n<li>Quarterfinal - Peyton Hammerich (Tiger Town Tanglers Wrestling Club) won by decision over Tayesean White (Gomez Wrestling Academy) Dec 7-6</li>\n<li>Quarterfinal - Dan Benoit (Redhawk Wrestling Club) won by fall over Jimmy Bartell (Maine Eagles WC) Fall 3:52</li>\n<li>Quarterfinal - Joey Alletto (Falcons Elite Wrestling Club) won by fall over Tyson Burton (Champaign Wrestling Club) Fall 1:56</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Jon Halvorsen (Maine Eagles WC) won by major decision over Thomas Doyle (Vittum Cats Wrestling Club) Maj 11-1</li>\n<li>Quarterfinal - Kobe Howard (Renegade Wrestling Club (NFP)) won by decision over John Hawkins (Crystal Lake Wizards) Dec 6-3</li>\n<li>Quarterfinal - Tyreek Austin (East St. Louis Wrestling) won by decision over Nick Mahajlovich (Celtic Elite) Dec 5-2</li>\n<li>Quarterfinal - Kyle Borske (Fox Valley Wrestling Club) won by decision over Dylan Lozeau (Sycamore Wrestling Club) Dec 7-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Santino Blanco (Morton Little Mustangs) won by decision over Joseph Passarelli (Downers Grove Cougars WC) Dec 3-2</li>\n<li>Quarterfinal - Cole Campbell (Geneva Junior Vikings) won by decision over Bo Meikamp (Edwardsville Wrestling Club) Dec 6-4</li>\n<li>Quarterfinal - Jesse Linch (Rock Island Wrestling Club) won by fall over Jaylen Washington (East St. Louis Wrestling) Fall 2:02</li>\n<li>Quarterfinal - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Brian Morel (Pitbull Wrestling Alliance) Fall 2:58</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Ameer Aqel (Vittum Cats Wrestling Club) won by decision over Cameron Lee (TJ Trained) Dec 4-1</li>\n<li>Quarterfinal - Jordan Gregg (Hillsboro Jr Toppers Wrestling Club) won by fall over Victor Rodriguez (Villa-Lombard Cougars) Fall 0:42</li>\n<li>Quarterfinal - Tyler Berhenke (Champbuilders Wrestling) won by decision over Saul Quintana (Villa-Lombard Cougars) Dec 6-1</li>\n<li>Quarterfinal - Luke Luffman (Champaign Wrestling Club) won by fall over Samuel Martin (Edwardsville Wrestling Club) Fall 0:59</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Chase Tatum (Tiger Town Tanglers Wrestling Club) won by major decision over Joshua Anderson (Edwardsville Wrestling Club) Maj 13-2</li>\n<li>Quarterfinal - Darrell Gregg (St. Charles WC) won by fall over Jose Ramos (Arlington Cardinals Wrestling Club) Fall 4:00</li>\n<li>Quarterfinal - Jace Punke (TJ Trained) won by fall over Lucas Korte (Celtic Elite) Fall 0:43</li>\n<li>Quarterfinal - Caleb Guise (Clinton Wrestling Club) won by fall over Cory Fant (Rochelle Wrestling Club) Fall 2:51</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Michael McNicholas (Glenbard East Jr Rams Wrestling Club) won by fall over Adam Copeland (Bulls Wrestling Club) Fall 1:51</li>\n<li>Quarterfinal - Ronald Tucker (Bolingbrook Junior Raiders) won by fall over Bill Blaser (Geneseo Spider Wrestling Club) Fall 3:48</li>\n<li>Quarterfinal - Tristan Phillips (Murphysboro Wrestling Club) won by fall over Banski Fountain (Junior Pirates) Fall 0:40</li>\n<li>Quarterfinal - Nicholas Vaccariello (Force Wrestling Club) won by fall over Khamarion Smith (Tiger Wrestling Club) Fall 2:09</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Javen Estrada (Bolingbrook Junior Raiders) won by decision over Robert Pizarro (Martinez Fox Valley Elite) Dec 7-4</li>\n<li>Quarterfinal - Ben Lunn (Edwardsville Wrestling Club) won by decision over Michael Crawford (Sycamore Wrestling Club) Dec 7-0</li>\n<li>Quarterfinal - Luke Fleming (Martinez Fox Valley Elite) won by fall over Derek Torza (Team 1006) Fall 1:04</li>\n<li>Quarterfinal - Jacob Randolph (Celtic Elite) won by decision over Reese Durlacher (The Wrestling Factory) Dec 4-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Presley Beasley (Crystal Lake Wizards) won by major decision over Joshua Holm (Izzy Style Wrestling) Maj 11-1</li>\n<li>Quarterfinal - Joel Vandervere (The Wrestling Factory) won by major decision over Sam Emery (Celtic Elite) Maj 12-2</li>\n<li>Quarterfinal - Cameron Johnson (Martinez Fox Valley Elite) won by decision over Anthony Schickel (Bolingbrook Junior Raiders) Dec 8-2</li>\n<li>Quarterfinal - Dylan Ragusin (Izzy Style Wrestling) won by fall over Brody Norman (TJ Trained-Decatur) Fall 2:42</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Nathan Callaway (Martinez Fox Valley Elite) won by decision over Michael Leveille (Redhawk Wrestling Club) Dec 1-0</li>\n<li>Quarterfinal - Kaleb Thompson (Bolingbrook Junior Raiders) won by decision over Anthony Molton (Will County Warriors) Dec 6-4</li>\n<li>Quarterfinal - Matthew Ramos (Bolingbrook Junior Raiders) won by fall over Michael Jaffe (SCN Youth Wrestling Club) Fall 4:00</li>\n<li>Quarterfinal - Noah Surtin (Edwardsville Wrestling Club) won by fall over Luc Valdez (Tinley Park Bulldogs Wrestling Club) Fall 1:28</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Ryan Fleck (SCN Youth Wrestling Club) won by decision over Ezra Elliott (Hoopeston Area Wrestling Club) Dec 10-4</li>\n<li>Quarterfinal - James Pierandozzi (Bolingbrook Junior Raiders) won by decision over Daniel Pucino (The Wrestling Factory) Dec 7-2</li>\n<li>Quarterfinal - Jacob Lindsey (Oak Forest Warriors) won by decision over Enzo Silva (Martinez Fox Valley Elite) Dec 7-2</li>\n<li>Quarterfinal - Anthony Turner (Champaign Wrestling Club) won by decision over Jacob Lukaszczyk (Vittum Cats Wrestling Club) Dec 9-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Domenic Zaccone (Orland Park Pioneers) won by decision over Andrew Baysingar (Arlington Cardinals Wrestling Club) Dec 5-1</li>\n<li>Quarterfinal - Nico Nunez (Martinez Fox Valley Elite) won by tech fall over Justen Pate (Harvey Twisters WC) TF 16-0</li>\n<li>Quarterfinal - Reece Heller (Izzy Style Wrestling) won by major decision over Justin Benjamin (SCN Youth Wrestling Club) Maj 13-2</li>\n<li>Quarterfinal - Dylan Burnoski (Bolingbrook Junior Raiders) won by fall over Alexander Fulton (O`Fallon Little Panthers Wrestling Club) Fall 1:01</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - John McDermott (Force Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Minnito (Force Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bryce Shelton (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Milos (Arlington Cardinals Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Jake Harrier (Golden Eagles Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Garrett Bakarich (Triad Little Knights Wrestling Club) won by major decision over Tavius Hosley (Unity Youth Wrestling Club) Maj 10-1</li>\n<li>Cons. Round 1 - Ashton Kellett (LP Crunching Cavs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cole Watkins (TJ Trained) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Peyton Bechtold (King Select Wrestling) won by decision over Michael Miralles (North Shore Edge) Dec 8-1</li>\n<li>Cons. Round 1 - Kennedy Blades (Martinez Fox Valley Elite) won by tech fall over Jesse Stewart (Springfield Capitals Kids WC) TF 16-0</li>\n<li>Cons. Round 1 - Gavin Bloom (Hononegah Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Elijah Chiaro (SCN Youth Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Michael Carpenter (Cumberland Youth Wrestling Club) won by decision over Adrian McDougle (King Select Wrestling) Dec 8-7</li>\n<li>Cons. Round 1 - Bryce Faworski (Xtreme Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jonathan Hernandez (Force Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tom Culp (Champions WC) won by decision over Kevin Zimmer (Vittum Cats Wrestling Club) Dec 4-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Elijah Lopez (SCN Youth Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jackson Certa (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Daniel Jezik (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brian Stacy (The Wrestling Factory) received a bye   () Bye</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Dalton Smith (Taylorville Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Antonio Figueroa (Crystal Lake Wizards) won by fall over William Gandolfi (Lincoln Youth Wrestling Club) Fall 0:56</li>\n<li>Cons. Round 1 - Joe Chapman (Pitbull Wrestling Alliance) won by decision over Jackson Murphy (Yorkville Wrestling Club) Dec 2-0</li>\n<li>Cons. Round 1 - Andrew Wenzel (Dakota Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Austin Abitua (Xtreme Wrestling Club) won by fall over Donovan Dolittle (Badger Wrestling Club) Fall 3:46</li>\n<li>Cons. Round 1 - Andrew Mulay (Tinley Park Bulldogs Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean Alletto (Falcons Elite Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kaydon Norkus (Force Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Kody Sipe (West Carroll Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joe Hawkes (Batavia Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jaiden Vancoillie (Rock Island Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kyle Franklin (Team 360 Gatorstyle Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Cade Scott (Unity Youth Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - John Sexton (Saber Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kenny Lutz (Junior Kahoks) won by fall over Cole Baumgartner (Sycamore Wrestling Club) Fall 1:18</li>\n<li>Cons. Round 1 - Arturo Acevedo (Morton Little Mustangs) won by decision over Dzhabrail Khurshidov (Blackhawk Wrestling Club) Dec 6-3</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Immanuel Cervantes (Yorkville Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Xavier Sierra (Headlock Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Luedke (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - William Penrod (Mt. Vernon Lions Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Brock Neill (LP Crunching Cavs) won by fall over Vincent Skentzos (Celtic Elite) Fall 1:52</li>\n<li>Cons. Round 1 - Jesiah Bradshaw (Springfield Capitals Kids WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dustin Olmstead (King Select Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kody Mongan (Tiger Town Tanglers Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Robert Schneider (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Eliazar Tapia (Champbuilders Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Wallace (Moline Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Damien Thomas (Caravan Kids Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Ronan Schuelke (Maddog Wrestling Club) won by decision over Micah Bergen (TJ Trained) Dec 1-0</li>\n<li>Cons. Round 1 - Trevor Reed (Harvey Twisters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Griffin Duffin (Mustang/SKT WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Gliva (Contender Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Reef Pacot (Storm Youth Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caden Muselman (Tinley Park Bulldogs Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Conor Smetana (Bolingbrook Junior Raiders) received a bye   () Bye</li>\n<li>Cons. Round 1 - Logan Kuhel-trimmer (Force Wrestling Club) won by major decision over Carson Nishida (Iguana Wrestling Club) Maj 12-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Cajaun Johnson (Tiger Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Finnegan (Force Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chase Hall (King Select Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Arojae Hart (Murphysboro Wrestling Club) won by fall over Cole Rhemrev (Junior Patriots Wrestling Club) Fall 1:27</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Michael Rodriguez (Southside Stallions School of Wrestling) won by fall over Anterrius Turner (Champaign Wrestling Club) Fall 0:53</li>\n<li>Cons. Round 1 - Jordan Blew (Force Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Malakye Rodriguez (Red Raiders Wrestling Team) received a bye   () Bye</li>\n<li>Cons. Round 1 - Grant Peterson (Central Illinois Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Gaige Owens (Marion Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Lira (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Peyton Schroeder (SCN Youth Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Archer (Southside Stallions School of Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Andrew Cervantes (Force Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brody Powell (Hoopeston Area Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Leo Mushinsky (TJ Trained) won by fall over Brian Ritter (Oak Forest Warriors) Fall 1:02</li>\n<li>Cons. Round 1 - Benjamin Anderson (SCN Youth Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - George Marre (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Igor Husick (Morton Little Mustangs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alexander Posada (Villa-Lombard Cougars) won in sudden victory - 1 over Dimitrie Justus (Rock Island Wrestling Club) SV-1 8-6</li>\n<li>Cons. Round 1 - Preston Berry (Falcons Elite Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - D`Anthony Hopkins (Force Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Bitner (Little Rams Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Kendall (Force Wrestling Club) won by decision over Andrew Henkle (Crystal Lake Wizards) Dec 3-1</li>\n<li>Cons. Round 1 - Kyle Dixon (Carlinville Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Jamel Sheppard (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hunter Yohn (Champions WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caleb Grau (Team Mascoutah Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dalton Hall (Champaign Wrestling Club) won by major decision over Tucker Hughes (Carlinville Wrestling Club) Maj 13-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Peyton Berry (Falcons Elite Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Maguire (Roxana Outlaws) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jamal Osborne (Harvey Twisters WC) won by decision over Devin Wills (Crusaders` Elite) Dec 9-3</li>\n<li>Cons. Round 1 - Mateo Portillo (Southside Stallions School of Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Jiovanni Martinez (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hayden Tibbs (Pekin Boys &amp; Girls Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colton Ingram (Xtreme Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jimmy Hicks (Harrisburg Junior Bulldogs) won by forfeit over Austin Reeves (Pontiac Wrestling Club) FF</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Damien Ross (East St. Louis Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gianfranco Montalto (Lemont Bears) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Collins (Vittum Cats Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Richard Messling (Xtreme Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Malik Daghash (Badger Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joseph Esposito (Hononegah Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Crane (Junior Kahoks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Evan Carney (O`Fallon Little Panthers Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Isaiah Fields (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dayton Houston (Junior Kahoks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Isaac Harris (Morton Little Mustangs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ethan Torres (Grayslake Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Maximus Gomez (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Garrett St. Clair (Force Wrestling Club) won by fall over Chase Gann (Pekin Boys &amp; Girls Club) Fall 0:41</li>\n<li>Cons. Round 1 - Jase Abraham (Belvidere Bandits Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drew Huff (Roxana Outlaws) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Julian Jaimes (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Robson (Wolves Wrestling Club Inc.) received a bye   () Bye</li>\n<li>Cons. Round 1 - Justin Hull (St. Charles WC) won by decision over Mason Baker (O`Fallon Little Panthers Wrestling Club) Dec 4-2</li>\n<li>Cons. Round 1 - Hunter McAlpine (Team 1006) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Mounes Betancourt (Harvey Twisters WC) won by fall over Nicholas Henson (Rochelle Wrestling Club) Fall 4:20</li>\n<li>Cons. Round 1 - Quentin Davis (HF Spartan Elite WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kane Blaylock (Granite City WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nolan Tewell (Lawrence County Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Noah Laney (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Blades (Harlem Cougar WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Pedro Castanon (Falcons Elite Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Elsbury (Xtreme Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Logan Reed (Marengo Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Vincenzo Biciocchi (Roxana Outlaws) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jameir Castleberry (Little Huskies Wrestling Club) won by decision over Drew Massie (Force Wrestling Club) Dec 11-5</li>\n<li>Cons. Round 1 - Conner Elmer (Dakota Wrestling Club) won by decision over James Raycraft (Springfield Capitals Kids WC) Dec 3-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Brice Balosky (Greg Gomez Trained Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aric Nieves (Team 1006) won by fall over Carlton Best (DuPage Tiger Wrestling Club) Fall 0:55</li>\n<li>Cons. Round 1 - Justin Peters (Dundee Highlanders WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zeth Stallings (Lawrence County Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Christopher Kennedy (Celtic Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jace Sparks (Crystal Lake Wizards) won by major decision over Christian Rivero (Z`s Team Pena) Maj 14-4</li>\n<li>Cons. Round 1 - Trevor Boryla (Sycamore Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christian Goin (TJ Trained) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Harley Kent (Knox County Krushers) won by fall over Kyle Bowles (Edwardsville Wrestling Club) Fall 4:15</li>\n<li>Cons. Round 1 - Chevvy Wood (Aces Wrestling Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Daniel McPherson (Lakeland Predators WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ayden Whaley (Xtreme Wrestling Club) received a bye   () Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Garrett Johnson (Prairie Central Hawks) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cameron Miller (Marengo Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Giovanni Cassioppi (Hononegah Wrestling Club) won by forfeit over Dejhavone Allen (HF Spartan Elite WC) FF</li>\n<li>Cons. Round 1 - Denis Murphy (Fox Valley Wrestling Club) won by decision over Tyson Coon (Hoopeston Area Wrestling Club) Dec 13-7</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - John McDermott (Force Wrestling Club) won by fall over Tanner Kalkbrenner (The Law) Fall 1:19</li>\n<li>Cons. Round 2 - Patrick Houston (Tinley Park Bulldogs Wrestling Club) won by major decision over Nicholas Minnito (Force Wrestling Club) Maj 9-0</li>\n<li>Cons. Round 2 - Tristan Daugherty (Central Illinois Wrestling Academy) won by major decision over Bryce Shelton (Crystal Lake Wizards) Maj 12-0</li>\n<li>Cons. Round 2 - Jack Milos (Arlington Cardinals Wrestling Club) won by decision over Mateen Taylor (Harvey Twisters WC) Dec 6-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Jake Harrier (Golden Eagles Wrestling Club) won by decision over Brock Pfeifer (Celtic Elite) Dec 4-2</li>\n<li>Cons. Round 2 - Garrett Bakarich (Triad Little Knights Wrestling Club) won by fall over Caden Ernd (Crystal Lake Wizards) Fall 2:32</li>\n<li>Cons. Round 2 - Kyle Tunink (Xtreme Wrestling Club) won by decision over Ashton Kellett (LP Crunching Cavs) Dec 5-0</li>\n<li>Cons. Round 2 - Cole Watkins (TJ Trained) won by major decision over Jack Coyle (Mustang/SKT WC) Maj 14-5</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Peyton Bechtold (King Select Wrestling) won by decision over Alexander Tagler (Vittum Cats Wrestling Club) Dec 7-1</li>\n<li>Cons. Round 2 - Kennedy Blades (Martinez Fox Valley Elite) won by decision over Barry Stevenson (Force Wrestling Club) Dec 11-4</li>\n<li>Cons. Round 2 - Deon Lopez (Lakeland Predators WC) won by decision over Gavin Bloom (Hononegah Wrestling Club) Dec 7-2</li>\n<li>Cons. Round 2 - Elijah Chiaro (SCN Youth Wrestling Club) won by decision over Peyton Holt (St. Joseph Odgen Youth Wrestling Club) Dec 4-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Zachary Janz (Greg Gomez Trained Wrestling) won by fall over Michael Carpenter (Cumberland Youth Wrestling Club) Fall 0:33</li>\n<li>Cons. Round 2 - Bryan Smith (Harvey Twisters WC) won by decision over Bryce Faworski (Xtreme Wrestling Club) Dec 9-3</li>\n<li>Cons. Round 2 - Jonathan Hernandez (Force Wrestling Club) won by fall over Raymond Hernandez (Mustang/SKT WC) Fall 1:23</li>\n<li>Cons. Round 2 - Logan Deacetis (Prairie Central Hawks) won by major decision over Tom Culp (Champions WC) Maj 16-5</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Alex Carrillo (Force Wrestling Club) won by fall over Elijah Lopez (SCN Youth Wrestling Club) Fall 0:40</li>\n<li>Cons. Round 2 - Marc Catama (Golden Eagles Wrestling Club) won by decision over Jackson Certa (Martinez Fox Valley Elite) Dec 9-7</li>\n<li>Cons. Round 2 - Daniel Jezik (Celtic Elite) won in sudden victory - 1 over Kaden Beeler (Edwardsville Wrestling Club) SV-1 3-1</li>\n<li>Cons. Round 2 - Colt Guyon (Cumberland Youth Wrestling Club) won by decision over Brian Stacy (The Wrestling Factory) Dec 6-4</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Jake Viloria (Little Huskies Wrestling Club) won by fall over Dalton Smith (Taylorville Wrestling Club) Fall 4:13</li>\n<li>Cons. Round 2 - Jeremy Pullen (Force Wrestling Club) won by decision over Antonio Figueroa (Crystal Lake Wizards) Dec 8-1</li>\n<li>Cons. Round 2 - Joe Chapman (Pitbull Wrestling Alliance) won by major decision over Niko Lopez (Greg Gomez Trained Wrestling) Maj 13-1</li>\n<li>Cons. Round 2 - Noah Ross (Izzy Style Wrestling) won by decision over Andrew Wenzel (Dakota Wrestling Club) Dec 10-5</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Kyle Berg (Vittum Cats Wrestling Club) won by fall over Austin Abitua (Xtreme Wrestling Club) Fall 4:05</li>\n<li>Cons. Round 2 - Robert Bates (Little Redskins Wrestling Club) won by decision over Andrew Mulay (Tinley Park Bulldogs Wrestling Club) Dec 1-0</li>\n<li>Cons. Round 2 - Sean Alletto (Falcons Elite Wrestling Club) won by fall over Sean Swinkle (St. Tarcissus Wrestling Club) Fall 3:33</li>\n<li>Cons. Round 2 - Ronald Massari (Little Huskies Wrestling Club) won by major decision over Kaydon Norkus (Force Wrestling Club) Maj 13-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Tavaris Macklin (Carbondale Wrestling Club) won by decision over Kody Sipe (West Carroll Wrestling Club) Dec 7-2</li>\n<li>Cons. Round 2 - Vincent Querciagrossa (Metamora Kids Wrestling Club) won by fall over Joe Hawkes (Batavia Wrestling Club) Fall 3:22</li>\n<li>Cons. Round 2 - Mike Bosco (Tinley Park Bulldogs Wrestling Club) won by fall over Jaiden Vancoillie (Rock Island Wrestling Club) Fall 2:57</li>\n<li>Cons. Round 2 - Kyle Franklin (Team 360 Gatorstyle Wrestling) won by decision over Carter Maggio (St. Charles WC) Dec 6-4</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Tyson Heerman (Peoria Razorbacks Wrestling Club) won by fall over Cade Scott (Unity Youth Wrestling Club) Fall 1:56</li>\n<li>Cons. Round 2 - John Sexton (Saber Wrestling Club) won by fall over Kaleb Simms (Rochelle Wrestling Club) Fall 3:30</li>\n<li>Cons. Round 2 - Kenny Lutz (Junior Kahoks) won by decision over Angel Alverio (Crosstown Wrestling) Dec 3-2</li>\n<li>Cons. Round 2 - Cole Gaddis (Hoopeston Area Wrestling Club) won by decision over Arturo Acevedo (Morton Little Mustangs) Dec 4-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Alvin Maten (Harlem Cougar WC) won by fall over Immanuel Cervantes (Yorkville Wrestling Club) Fall 1:44</li>\n<li>Cons. Round 2 - Xavier Sierra (Headlock Wrestling Academy) won by fall over Dashun Walker (HF Spartan Elite WC) Fall 3:47</li>\n<li>Cons. Round 2 - Nathaniel Thomas (Badger Wrestling Club) won by fall over Thomas Luedke (Celtic Elite) Fall 1:57</li>\n<li>Cons. Round 2 - Luis Cretsinger (Xtreme Wrestling Club) won by decision over William Penrod (Mt. Vernon Lions Wrestling Club) Dec 17-11</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Brock Neill (LP Crunching Cavs) won by injury default over Joey Graham (Celtic Elite) Inj. 3:33</li>\n<li>Cons. Round 2 - Partick Peters (Tinley Park Bulldogs Wrestling Club) won by fall over Jesiah Bradshaw (Springfield Capitals Kids WC) Fall 0:41</li>\n<li>Cons. Round 2 - Dustin Olmstead (King Select Wrestling) won by major decision over Miguel Luna (Pitbull Wrestling Alliance) Maj 11-0</li>\n<li>Cons. Round 2 - Dayton Baue (Sparta Junior Bulldogs) won by fall over Kody Mongan (Tiger Town Tanglers Wrestling Club) Fall 0:55</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Simon Wilson (Champbuilders Wrestling) won by fall over Robert Schneider (Celtic Elite) Fall 1:47</li>\n<li>Cons. Round 2 - Jaiden Lowery (Waukegan Youth Wrestling Club) won by fall over Eliazar Tapia (Champbuilders Wrestling) Fall 1:20</li>\n<li>Cons. Round 2 - Zachary Wallace (Moline Wrestling Club) won by fall over Malachi Jennings (HF Spartan Elite WC) Fall 2:31</li>\n<li>Cons. Round 2 - Dreyden Pitts (Tiger Wrestling Club) won by fall over Damien Thomas (Caravan Kids Wrestling Club) Fall 0:44</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Ronan Schuelke (Maddog Wrestling Club) won by decision over Maurice Dotson (Granite City WC) Dec 12-9</li>\n<li>Cons. Round 2 - Daniel Sheen (SCN Youth Wrestling Club) won by fall over Trevor Reed (Harvey Twisters WC) Fall 1:03</li>\n<li>Cons. Round 2 - Jacob Crandall (Greg Gomez Trained Wrestling) won by fall over Griffin Duffin (Mustang/SKT WC) Fall 4:15</li>\n<li>Cons. Round 2 - Carter Hall (Champaign Wrestling Club) won by decision over Jacob Gliva (Contender Wrestling) Dec 7-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Kenyon Boyce (Harvey Twisters WC) won by tech fall over Reef Pacot (Storm Youth Wrestling Club) TF 17-2</li>\n<li>Cons. Round 2 - Matthew Minick (King Select Wrestling) won by major decision over Caden Muselman (Tinley Park Bulldogs Wrestling Club) Maj 11-0</li>\n<li>Cons. Round 2 - Christian Olsen (Crystal Lake Wizards) won in sudden victory - 1 over Conor Smetana (Bolingbrook Junior Raiders) SV-1 6-4</li>\n<li>Cons. Round 2 - Logan Kuhel-trimmer (Force Wrestling Club) won by decision over Connor Surtin (Edwardsville Wrestling Club) Dec 7-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Tommy Curran (Martinez Fox Valley Elite) won by major decision over Cajaun Johnson (Tiger Wrestling Club) Maj 13-0</li>\n<li>Cons. Round 2 - Alex Randell (Greg Gomez Trained Wrestling) won by decision over Jack Finnegan (Force Wrestling Club) Dec 3-0</li>\n<li>Cons. Round 2 - Vincent Robinson (Harvey Twisters WC) won by decision over Chase Hall (King Select Wrestling) Dec 4-1</li>\n<li>Cons. Round 2 - Cameron Clark (TJ Trained) won by decision over Arojae Hart (Murphysboro Wrestling Club) Dec 3-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Alex Ventimilla (Martinez Fox Valley Elite) won by decision over Michael Rodriguez (Southside Stallions School of Wrestling) Dec 4-2</li>\n<li>Cons. Round 2 - Jordan Blew (Force Wrestling Club) won by major decision over Andrew Herbst (Hawk Wrestling Club Ltd.) Maj 9-1</li>\n<li>Cons. Round 2 - Justin Warmowski (Fox Lake WC) won by decision over Malakye Rodriguez (Red Raiders Wrestling Team) Dec 8-3</li>\n<li>Cons. Round 2 - Grant Peterson (Central Illinois Wrestling Academy) won by decision over Brac Hooper (Champaign Wrestling Club) Dec 8-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Kai Conway (Gomez Wrestling Academy) won by fall over Gaige Owens (Marion Youth Wrestling) Fall 3:35</li>\n<li>Cons. Round 2 - Kendall Norfleet (Harvey Twisters WC) won by decision over Andrew Lira (Crystal Lake Wizards) Dec 6-2</li>\n<li>Cons. Round 2 - Peyton Timmons (Red Raiders Wrestling Team) won by major decision over Peyton Schroeder (SCN Youth Wrestling Club) Maj 11-0</li>\n<li>Cons. Round 2 - Terrance Snapp (Will County Warriors) won by fall over Michael Archer (Southside Stallions School of Wrestling) Fall 1:25</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Andrew Cervantes (Force Wrestling Club) won by major decision over Mitchell Millsap (King Select Wrestling) Maj 11-1</li>\n<li>Cons. Round 2 - Eddie Bolivar (Gomez Wrestling Academy) won by tech fall over Brody Powell (Hoopeston Area Wrestling Club) TF 16-0</li>\n<li>Cons. Round 2 - Leo Mushinsky (TJ Trained) won by decision over William Edgar (King Select Wrestling) Dec 3-0</li>\n<li>Cons. Round 2 - Benjamin Anderson (SCN Youth Wrestling Club) won by decision over Torry Early (Little Huskies Wrestling Club) Dec 4-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - George Marre (Gomez Wrestling Academy) won by decision over Jackson Hosman (Celtic Elite) Dec 4-2</li>\n<li>Cons. Round 2 - Nicky Amato (Izzy Style Wrestling) won by fall over Igor Husick (Morton Little Mustangs) Fall 0:52</li>\n<li>Cons. Round 2 - Casey Roberts (Mustang/SKT WC) won by decision over Alexander Posada (Villa-Lombard Cougars) Dec 4-2</li>\n<li>Cons. Round 2 - Brody Ivey (Sauk Valley Wrestling Club) won by decision over Preston Berry (Falcons Elite Wrestling Club) Dec 7-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - D`Anthony Hopkins (Force Wrestling Club) won by injury default over Tyler Besse (Dakota Wrestling Club) Inj. 0:47</li>\n<li>Cons. Round 2 - Anthony Bitner (Little Rams Wrestling) won in sudden victory - 2 over Patrick Daum (SCN Youth Wrestling Club) SV-2 2-1</li>\n<li>Cons. Round 2 - Joshua Ramos (Martinez Fox Valley Elite) won by decision over Jake Kendall (Force Wrestling Club) Dec 2-1</li>\n<li>Cons. Round 2 - Jacquez Stewart (Springfield Capitals Kids WC) won by decision over Kyle Dixon (Carlinville Wrestling Club) Dec 3-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Jamel Sheppard (Gomez Wrestling Academy) won by fall over Maxwell Kristoff (Crusaders` Elite) Fall 0:34</li>\n<li>Cons. Round 2 - Corey Sapp (Bolingbrook Junior Raiders) won by major decision over Hunter Yohn (Champions WC) Maj 16-7</li>\n<li>Cons. Round 2 - Eddie Villalobos (Rochelle Wrestling Club) won by decision over Caleb Grau (Team Mascoutah Wrestling) Dec 7-6</li>\n<li>Cons. Round 2 - Dalton Hall (Champaign Wrestling Club) won by decision over Jayden Terronez (Moline Wrestling Club) Dec 7-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Peyton Berry (Falcons Elite Wrestling Club) won by decision over Norman Harris (Edwardsville Wrestling Club) Dec 4-3</li>\n<li>Cons. Round 2 - Stephen Bushy (Crystal Lake Wizards) won by decision over Alex Maguire (Roxana Outlaws) Dec 5-3</li>\n<li>Cons. Round 2 - Jamal Osborne (Harvey Twisters WC) won by decision over Nicolas Patch (Force Wrestling Club) Dec 2-1</li>\n<li>Cons. Round 2 - Victor Guzman (Rock Island Wrestling Club) won by fall over Mateo Portillo (Southside Stallions School of Wrestling) Fall 1:26</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Sam Blaha (Junior Kahoks) won by disqualification over Jiovanni Martinez (Martinez Fox Valley Elite) DQ</li>\n<li>Cons. Round 2 - Trey Piotrowski (Wolves Wrestling Club Inc.) won by fall over Hayden Tibbs (Pekin Boys &amp; Girls Club) Fall 3:35</li>\n<li>Cons. Round 2 - Quintin Hamilton (Evanston School of Wrestling) won by major decision over Colton Ingram (Xtreme Wrestling Club) Maj 14-0</li>\n<li>Cons. Round 2 - J.p. Migawa (Tinley Park Bulldogs Wrestling Club) won by decision over Jimmy Hicks (Harrisburg Junior Bulldogs) Dec 3-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Anthony Pennington (Gomez Wrestling Academy) won by decision over Damien Ross (East St. Louis Wrestling) Dec 2-1</li>\n<li>Cons. Round 2 - Gianfranco Montalto (Lemont Bears) won by decision over Jay Cee Randolph-Gonzalez (Izzy Style Wrestling) Dec 5-4</li>\n<li>Cons. Round 2 - Conor Prettyman (Barrington Broncos Wrestling Club) won by decision over Thomas Collins (Vittum Cats Wrestling Club) Dec 4-2</li>\n<li>Cons. Round 2 - Jett Dowell (Falcons Elite Wrestling Club) won by decision over Richard Messling (Xtreme Wrestling Club) Dec 5-4</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Malik Daghash (Badger Wrestling Club) won by fall over Jacob Erslon (Bulls Wrestling Club) Fall 0:58</li>\n<li>Cons. Round 2 - Tayesean White (Gomez Wrestling Academy) won by fall over Joseph Esposito (Hononegah Wrestling Club) Fall 1:50</li>\n<li>Cons. Round 2 - Jimmy Bartell (Maine Eagles WC) won by decision over Nathan Crane (Junior Kahoks) Dec 7-3</li>\n<li>Cons. Round 2 - Tyson Burton (Champaign Wrestling Club) won by major decision over Evan Carney (O`Fallon Little Panthers Wrestling Club) Maj 12-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Thomas Doyle (Vittum Cats Wrestling Club) won in sudden victory - 1 over Isaiah Fields (Martinez Fox Valley Elite) SV-1 12-7</li>\n<li>Cons. Round 2 - John Hawkins (Crystal Lake Wizards) won by fall over Dayton Houston (Junior Kahoks) Fall 2:04</li>\n<li>Cons. Round 2 - Nick Mahajlovich (Celtic Elite) won by fall over Isaac Harris (Morton Little Mustangs) Fall 2:53</li>\n<li>Cons. Round 2 - Dylan Lozeau (Sycamore Wrestling Club) won by decision over Ethan Torres (Grayslake Wrestling Club) Dec 6-5</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Maximus Gomez (Izzy Style Wrestling) won by decision over Joseph Passarelli (Downers Grove Cougars WC) Dec 7-1</li>\n<li>Cons. Round 2 - Bo Meikamp (Edwardsville Wrestling Club) won by fall over Garrett St. Clair (Force Wrestling Club) Fall 2:12</li>\n<li>Cons. Round 2 - Jaylen Washington (East St. Louis Wrestling) won by decision over Jase Abraham (Belvidere Bandits Wrestling Club) Dec 4-0</li>\n<li>Cons. Round 2 - Drew Huff (Roxana Outlaws) won by fall over Brian Morel (Pitbull Wrestling Alliance) Fall 2:12</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Cameron Lee (TJ Trained) won by decision over Julian Jaimes (Martinez Fox Valley Elite) Dec 2-1</li>\n<li>Cons. Round 2 - Victor Rodriguez (Villa-Lombard Cougars) won in tie breaker - 1 over Thomas Robson (Wolves Wrestling Club Inc.) TB-1 2-1</li>\n<li>Cons. Round 2 - Justin Hull (St. Charles WC) won by decision over Saul Quintana (Villa-Lombard Cougars) Dec 4-0</li>\n<li>Cons. Round 2 - Samuel Martin (Edwardsville Wrestling Club) won by decision over Hunter McAlpine (Team 1006) Dec 4-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Joshua Anderson (Edwardsville Wrestling Club) won by fall over Mounes Betancourt (Harvey Twisters WC) Fall 0:52</li>\n<li>Cons. Round 2 - Jose Ramos (Arlington Cardinals Wrestling Club) won by decision over Quentin Davis (HF Spartan Elite WC) Dec 9-4</li>\n<li>Cons. Round 2 - Lucas Korte (Celtic Elite) won by injury default over Kane Blaylock (Granite City WC) Inj. 0:13</li>\n<li>Cons. Round 2 - Cory Fant (Rochelle Wrestling Club) won by fall over Nolan Tewell (Lawrence County Wrestling Club) Fall 4:17</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Noah Laney (Crystal Lake Wizards) won by fall over Adam Copeland (Bulls Wrestling Club) Fall 0:42</li>\n<li>Cons. Round 2 - Bill Blaser (Geneseo Spider Wrestling Club) won by fall over Nicholas Blades (Harlem Cougar WC) Fall 1:12</li>\n<li>Cons. Round 2 - Pedro Castanon (Falcons Elite Wrestling Club) won by fall over Banski Fountain (Junior Pirates) Fall 3:06</li>\n<li>Cons. Round 2 - Tyler Elsbury (Xtreme Wrestling Club) won by disqualification over Khamarion Smith (Tiger Wrestling Club) DQ</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Robert Pizarro (Martinez Fox Valley Elite) won by fall over Logan Reed (Marengo Youth Wrestling) Fall 2:44</li>\n<li>Cons. Round 2 - Michael Crawford (Sycamore Wrestling Club) won by fall over Vincenzo Biciocchi (Roxana Outlaws) Fall 2:02</li>\n<li>Cons. Round 2 - Jameir Castleberry (Little Huskies Wrestling Club) won by major decision over Derek Torza (Team 1006) Maj 15-6</li>\n<li>Cons. Round 2 - Reese Durlacher (The Wrestling Factory) won by tech fall over Conner Elmer (Dakota Wrestling Club) TF 16-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Joshua Holm (Izzy Style Wrestling) won by decision over Brice Balosky (Greg Gomez Trained Wrestling) Dec 6-3</li>\n<li>Cons. Round 2 - Sam Emery (Celtic Elite) won by decision over Aric Nieves (Team 1006) Dec 7-4</li>\n<li>Cons. Round 2 - Anthony Schickel (Bolingbrook Junior Raiders) won in sudden victory - 1 over Justin Peters (Dundee Highlanders WC) SV-1 13-0</li>\n<li>Cons. Round 2 - Brody Norman (TJ Trained-Decatur) won by major decision over Zeth Stallings (Lawrence County Wrestling Club) Maj 12-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Christopher Kennedy (Celtic Elite) won by decision over Michael Leveille (Redhawk Wrestling Club) Dec 5-3</li>\n<li>Cons. Round 2 - Anthony Molton (Will County Warriors) won by fall over Jace Sparks (Crystal Lake Wizards) Fall 3:33</li>\n<li>Cons. Round 2 - Michael Jaffe (SCN Youth Wrestling Club) won by decision over Trevor Boryla (Sycamore Wrestling Club) Dec 7-5</li>\n<li>Cons. Round 2 - Christian Goin (TJ Trained) won by decision over Luc Valdez (Tinley Park Bulldogs Wrestling Club) Dec 11-4</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Ezra Elliott (Hoopeston Area Wrestling Club) won by fall over Harley Kent (Knox County Krushers) Fall 3:34</li>\n<li>Cons. Round 2 - Daniel Pucino (The Wrestling Factory) won by fall over Chevvy Wood (Aces Wrestling Club) Fall 1:09</li>\n<li>Cons. Round 2 - Enzo Silva (Martinez Fox Valley Elite) won by major decision over Daniel McPherson (Lakeland Predators WC) Maj 12-2</li>\n<li>Cons. Round 2 - Jacob Lukaszczyk (Vittum Cats Wrestling Club) won by decision over Ayden Whaley (Xtreme Wrestling Club) Dec 8-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Andrew Baysingar (Arlington Cardinals Wrestling Club) won by fall over Garrett Johnson (Prairie Central Hawks) Fall 0:18</li>\n<li>Cons. Round 2 - Cameron Miller (Marengo Youth Wrestling) won by decision over Justen Pate (Harvey Twisters WC) Dec 9-2</li>\n<li>Cons. Round 2 - Giovanni Cassioppi (Hononegah Wrestling Club) won by decision over Justin Benjamin (SCN Youth Wrestling Club) Dec 5-0</li>\n<li>Cons. Round 2 - Denis Murphy (Fox Valley Wrestling Club) won in sudden victory - 1 over Alexander Fulton (O`Fallon Little Panthers Wrestling Club) SV-1 7-5</li>\n</ul>\n</section>",
  "Champ Semi`s & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semi`s &amp; Con Quarterfinal</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Nain Vazquez (Martinez Fox Valley Elite) won by decision over Nicholas Bolivar (Gomez Wrestling Academy) Dec 2-1</li>\n<li>Semifinal - Luke Odom (Edwardsville Wrestling Club) won by decision over Alex Villar (Bolingbrook Junior Raiders) Dec 7-1</li>\n<li>Cons. Round 3 - Patrick Houston (Tinley Park Bulldogs Wrestling Club) won by decision over John McDermott (Force Wrestling Club) Dec 4-1</li>\n<li>Cons. Round 3 - Tristan Daugherty (Central Illinois Wrestling Academy) won by decision over Jack Milos (Arlington Cardinals Wrestling Club) Dec 2-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Jacob Tinajero (SCN Youth Wrestling Club) won by decision over Brayden Thompson (Izzy Style Wrestling) Dec 1-0</li>\n<li>Semifinal - Zeke Marshall (Martinez Fox Valley Elite) won by decision over Grant Laduke (Celtic Elite) Dec 5-2</li>\n<li>Cons. Round 3 - Garrett Bakarich (Triad Little Knights Wrestling Club) won by decision over Jake Harrier (Golden Eagles Wrestling Club) Dec 4-0</li>\n<li>Cons. Round 3 - Kyle Tunink (Xtreme Wrestling Club) won by decision over Cole Watkins (TJ Trained) Dec 7-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Ryan Smith (Harvey Twisters WC) won by decision over Connor Gaynor (Tinley Park Bulldogs Wrestling Club) Dec 2-1</li>\n<li>Semifinal - Sincere Bailey (Harvey Twisters WC) won by tech fall over Qayin Dabney (Celtic Elite) TF 19-2</li>\n<li>Cons. Round 3 - Kennedy Blades (Martinez Fox Valley Elite) won by decision over Peyton Bechtold (King Select Wrestling) Dec 4-3</li>\n<li>Cons. Round 3 - Elijah Chiaro (SCN Youth Wrestling Club) won in sudden victory - 1 over Deon Lopez (Lakeland Predators WC) SV-1 3-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Kevin Countryman (Celtic Elite) won by major decision over Ben Harvey (Rochelle Wrestling Club) Maj 12-0</li>\n<li>Semifinal - Dylan Connell (Crystal Lake Wizards) won by decision over Martin Larkin (Redhawk Wrestling Club) Dec 7-0</li>\n<li>Cons. Round 3 - Bryan Smith (Harvey Twisters WC) won by decision over Zachary Janz (Greg Gomez Trained Wrestling) Dec 7-1</li>\n<li>Cons. Round 3 - Logan Deacetis (Prairie Central Hawks) won by decision over Jonathan Hernandez (Force Wrestling Club) Dec 7-3</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Isaiah Parker (The Wrestling Factory) won by decision over Daemyen Middlebrooks (Little Huskies Wrestling Club) Dec 6-5</li>\n<li>Semifinal - Noah Villarreal (Martinez Fox Valley Elite) won by tech fall over Jack Patting (Moline Wrestling Club) TF 17-0</li>\n<li>Cons. Round 3 - Alex Carrillo (Force Wrestling Club) won by major decision over Marc Catama (Golden Eagles Wrestling Club) Maj 10-0</li>\n<li>Cons. Round 3 - Daniel Jezik (Celtic Elite) won by tech fall over Colt Guyon (Cumberland Youth Wrestling Club) TF 17-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Drew Nash (Lemont Bears) won by major decision over Alonzo Smiley (Gomez Wrestling Academy) Maj 10-2</li>\n<li>Semifinal - Noah Alsguson (Harvey Twisters WC) won by decision over Zachary Kolb (Force Wrestling Club) Dec 6-1</li>\n<li>Cons. Round 3 - Jeremy Pullen (Force Wrestling Club) won by major decision over Jake Viloria (Little Huskies Wrestling Club) Maj 11-1</li>\n<li>Cons. Round 3 - Joe Chapman (Pitbull Wrestling Alliance) won by decision over Noah Ross (Izzy Style Wrestling) Dec 7-3</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Josh Labarbera (Martinez Fox Valley Elite) won by major decision over Drew Gvillo (Edwardsville Wrestling Club) Maj 11-2</li>\n<li>Semifinal - Aron Taylor (Carbondale Wrestling Club) won by fall over Miguel Barrett (Pontiac Wrestling Club) Fall 2:45</li>\n<li>Cons. Round 3 - Kyle Berg (Vittum Cats Wrestling Club) won by decision over Robert Bates (Little Redskins Wrestling Club) Dec 4-1</li>\n<li>Cons. Round 3 - Ronald Massari (Little Huskies Wrestling Club) won by fall over Sean Alletto (Falcons Elite Wrestling Club) Fall 1:42</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Jordan Chisum (Zee-Bee Stingers Wrestling Club) won by decision over Daemon McMurtry (Celtic Elite) Dec 9-3</li>\n<li>Semifinal - Brandon Hoselton (Prairie Central Hawks) won by decision over Tommy Evans (Wolves Wrestling Club Inc.) Dec 11-4</li>\n<li>Cons. Round 3 - Vincent Querciagrossa (Metamora Kids Wrestling Club) won by decision over Tavaris Macklin (Carbondale Wrestling Club) Dec 7-4</li>\n<li>Cons. Round 3 - Mike Bosco (Tinley Park Bulldogs Wrestling Club) won by fall over Kyle Franklin (Team 360 Gatorstyle Wrestling) Fall 1:03</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Mustafa St. Clair (Harvey Twisters WC) won by fall over Joseph Jens (Grayslake Wrestling Club) Fall 0:46</li>\n<li>Semifinal - Matthew Ramirez (Barrington Broncos Wrestling Club) won by fall over Apollo Gothard (Lemont Bears) Fall 1:18</li>\n<li>Cons. Round 3 - Tyson Heerman (Peoria Razorbacks Wrestling Club) won by major decision over John Sexton (Saber Wrestling Club) Maj 12-0</li>\n<li>Cons. Round 3 - Cole Gaddis (Hoopeston Area Wrestling Club) won by decision over Kenny Lutz (Junior Kahoks) Dec 6-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Nikolas Mishka (Tinley Park Bulldogs Wrestling Club) won by fall over Jacob Morrissey (Edwardsville Wrestling Club) Fall 2:45</li>\n<li>Semifinal - Nicholas Skamra (Headlock Wrestling Academy) won by decision over Jaylin Garay (Falcons Elite Wrestling Club) Dec 6-4</li>\n<li>Cons. Round 3 - Xavier Sierra (Headlock Wrestling Academy) won by fall over Alvin Maten (Harlem Cougar WC) Fall 1:50</li>\n<li>Cons. Round 3 - Nathaniel Thomas (Badger Wrestling Club) won by fall over Luis Cretsinger (Xtreme Wrestling Club) Fall 1:55</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Connor Eaton (West Frankfort Jr. Redbirds) won by decision over Tyler Williams (Riverton Youth Wrestling) Dec 4-2</li>\n<li>Semifinal - Colin Baker (Downers Grove Cougars WC) won by fall over Joshua Woodrey (Prairie Central Hawks) Fall 1:18</li>\n<li>Cons. Round 3 - Brock Neill (LP Crunching Cavs) won by fall over Partick Peters (Tinley Park Bulldogs Wrestling Club) Fall 0:22</li>\n<li>Cons. Round 3 - Dustin Olmstead (King Select Wrestling) won in sudden victory - 1 over Dayton Baue (Sparta Junior Bulldogs) SV-1 11-9</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Shawn Lee (Downers Grove Cougars WC) won by decision over Anthony Enlow (Vandalia Kings) Dec 5-4</li>\n<li>Semifinal - Angel Jaimes (Martinez Fox Valley Elite) won by fall over Trenton Overvig (Cumberland Youth Wrestling Club) Fall 1:07</li>\n<li>Cons. Round 3 - Jaiden Lowery (Waukegan Youth Wrestling Club) won by fall over Simon Wilson (Champbuilders Wrestling) Fall 0:49</li>\n<li>Cons. Round 3 - Zachary Wallace (Moline Wrestling Club) won by fall over Dreyden Pitts (Tiger Wrestling Club) Fall 1:03</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Samuel Hayes (Contender Wrestling) won by fall over Phoenix Mordick (Dakota Wrestling Club) Fall 2:20</li>\n<li>Semifinal - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Antonio Alvarado (Belvidere Bandits Wrestling Club) Dec 5-1</li>\n<li>Cons. Round 3 - Daniel Sheen (SCN Youth Wrestling Club) won by decision over Ronan Schuelke (Maddog Wrestling Club) Dec 7-1</li>\n<li>Cons. Round 3 - Carter Hall (Champaign Wrestling Club) won by fall over Jacob Crandall (Greg Gomez Trained Wrestling) Fall 2:09</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Christopher Moore (Crystal Lake Wizards) won by fall over Dylan Amico (Force Wrestling Club) Fall 4:04</li>\n<li>Semifinal - Nasir Bailey (Harvey Twisters WC) won by decision over Joel Mylin (Golden Eagles Wrestling Club) Dec 5-1</li>\n<li>Cons. Round 3 - Matthew Minick (King Select Wrestling) won by decision over Kenyon Boyce (Harvey Twisters WC) Dec 4-0</li>\n<li>Cons. Round 3 - Logan Kuhel-trimmer (Force Wrestling Club) won by decision over Christian Olsen (Crystal Lake Wizards) Dec 4-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Joshua Koderhandt (Crusaders` Elite) won by decision over Jacob Rundell (Little Huskies Wrestling Club) Dec 6-0</li>\n<li>Semifinal - Diego Sotelo (Martinez Fox Valley Elite) won by major decision over Mia Palumbo (Southside Stallions School of Wrestling) Maj 9-0</li>\n<li>Cons. Round 3 - Tommy Curran (Martinez Fox Valley Elite) won by injury default over Alex Randell (Greg Gomez Trained Wrestling) Inj. 0:41</li>\n<li>Cons. Round 3 - Vincent Robinson (Harvey Twisters WC) won by decision over Cameron Clark (TJ Trained) Dec 8-4</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Kannon Webster (TJ Trained) won by major decision over Will Carlile (Bulls Wrestling Club) Maj 10-0</li>\n<li>Semifinal - Kyle Schickel (Celtic Elite) won by fall over Grant Matarelli (Edwardsville Wrestling Club) Fall 1:13</li>\n<li>Cons. Round 3 - Jordan Blew (Force Wrestling Club) won by decision over Alex Ventimilla (Martinez Fox Valley Elite) Dec 2-0</li>\n<li>Cons. Round 3 - Justin Warmowski (Fox Lake WC) won in sudden victory - 1 over Grant Peterson (Central Illinois Wrestling Academy) SV-1 4-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Dean Hamiti (Martinez Fox Valley Elite) won by major decision over Nicholas Matthias (Celtic Elite) Maj 11-0</li>\n<li>Semifinal - Vincent Zerban (King Select Wrestling) won by fall over Joseph Cape (TJ Trained) Fall 2:08</li>\n<li>Cons. Round 3 - Kendall Norfleet (Harvey Twisters WC) won by decision over Kai Conway (Gomez Wrestling Academy) Dec 11-4</li>\n<li>Cons. Round 3 - Terrance Snapp (Will County Warriors) won by fall over Peyton Timmons (Red Raiders Wrestling Team) Fall 4:01</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Donnell Washington (Harvey Twisters WC) won by decision over Trevor Chumbley (SCN Youth Wrestling Club) Dec 2-1</li>\n<li>Semifinal - Pat Nolan (Orland Park Pioneers) won by decision over Riley Palm (The Wrestling Factory) Dec 9-3</li>\n<li>Cons. Round 3 - Eddie Bolivar (Gomez Wrestling Academy) won by forfeit over Andrew Cervantes (Force Wrestling Club) FF</li>\n<li>Cons. Round 3 - Benjamin Anderson (SCN Youth Wrestling Club) won by decision over Leo Mushinsky (TJ Trained) Dec 1-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Kyle Cavender (Harrisburg Junior Bulldogs) won by decision over Nicholas Termini (SCN Youth Wrestling Club) Dec 4-3</li>\n<li>Semifinal - Jacob Dado (Bolingbrook Junior Raiders) won by decision over Tanner Swain (Vandalia Jr Wrestling Club) Dec 5-0</li>\n<li>Cons. Round 3 - George Marre (Gomez Wrestling Academy) won by major decision over Nicky Amato (Izzy Style Wrestling) Maj 11-3</li>\n<li>Cons. Round 3 - Brody Ivey (Sauk Valley Wrestling Club) won by fall over Casey Roberts (Mustang/SKT WC) Fall 2:58</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Jake Stiles (Izzy Style Wrestling) won by major decision over Kody Cavender (Harrisburg Junior Bulldogs) Maj 10-0</li>\n<li>Semifinal - Abe Assad (Gomez Wrestling Academy) won by major decision over Jared Head (TJ Trained) Maj 13-1</li>\n<li>Cons. Round 3 - D`Anthony Hopkins (Force Wrestling Club) won by decision over Anthony Bitner (Little Rams Wrestling) Dec 5-2</li>\n<li>Cons. Round 3 - Joshua Ramos (Martinez Fox Valley Elite) won by decision over Jacquez Stewart (Springfield Capitals Kids WC) Dec 7-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Juan Bazaldua (Martinez Fox Valley Elite) won in double overtime over Fidel Mayora (Epic Wrestling) 2-OT 4-3</li>\n<li>Semifinal - Peter Ferraro (SCN Youth Wrestling Club) won by major decision over Michael Gunther (The Wrestling Factory) Maj 9-0</li>\n<li>Cons. Round 3 - Corey Sapp (Bolingbrook Junior Raiders) won in sudden victory - 1 over Jamel Sheppard (Gomez Wrestling Academy) SV-1 7-5</li>\n<li>Cons. Round 3 - Dalton Hall (Champaign Wrestling Club) won by decision over Eddie Villalobos (Rochelle Wrestling Club) Dec 3-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Bilal Bailey (Harvey Twisters WC) won by decision over Elijah Black (The Wrestling Factory) Dec 6-3</li>\n<li>Semifinal - Cormac Kane (Junior Cougar Wrestling Club) won in sudden victory - 1 over Peter Mccusker (Champaign Wrestling Club) SV-1 2-0</li>\n<li>Cons. Round 3 - Stephen Bushy (Crystal Lake Wizards) won by decision over Peyton Berry (Falcons Elite Wrestling Club) Dec 3-0</li>\n<li>Cons. Round 3 - Jamal Osborne (Harvey Twisters WC) won by major decision over Victor Guzman (Rock Island Wrestling Club) Maj 13-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Baylor Fernandes (Bolingbrook Junior Raiders) won by tech fall over Anthony Glauser (The Wrestling Factory) TF 15-0</li>\n<li>Semifinal - Brad Gross (SCN Youth Wrestling Club) won by decision over Peter Christensen (Izzy Style Wrestling) Dec 6-1</li>\n<li>Cons. Round 3 - Trey Piotrowski (Wolves Wrestling Club Inc.) won by injury default over Sam Blaha (Junior Kahoks) Inj. 0:00</li>\n<li>Cons. Round 3 - Quintin Hamilton (Evanston School of Wrestling) won by major decision over J.p. Migawa (Tinley Park Bulldogs Wrestling Club) Maj 9-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Jackson Punzel (Naperville Wrestling Club) won by decision over Drake Regenhardt (Wolves Wrestling Club Inc.) Dec 3-2</li>\n<li>Semifinal - Cory Peterson (King Select Wrestling) won by tech fall over Logan Wilson (Champaign Wrestling Club) TF 19-4</li>\n<li>Cons. Round 3 - Anthony Pennington (Gomez Wrestling Academy) won by decision over Gianfranco Montalto (Lemont Bears) Dec 5-2</li>\n<li>Cons. Round 3 - Conor Prettyman (Barrington Broncos Wrestling Club) won by decision over Jett Dowell (Falcons Elite Wrestling Club) Dec 4-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Trevor Swier (Force Wrestling Club) won by decision over Peyton Hammerich (Tiger Town Tanglers Wrestling Club) Dec 6-2</li>\n<li>Semifinal - Dan Benoit (Redhawk Wrestling Club) won in sudden victory - 1 over Joey Alletto (Falcons Elite Wrestling Club) SV-1 3-1</li>\n<li>Cons. Round 3 - Tayesean White (Gomez Wrestling Academy) won by decision over Malik Daghash (Badger Wrestling Club) Dec 8-3</li>\n<li>Cons. Round 3 - Jimmy Bartell (Maine Eagles WC) won by fall over Tyson Burton (Champaign Wrestling Club) Fall 2:03</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Jon Halvorsen (Maine Eagles WC) won by major decision over Kobe Howard (Renegade Wrestling Club (NFP)) Maj 11-0</li>\n<li>Semifinal - Tyreek Austin (East St. Louis Wrestling) won by fall over Kyle Borske (Fox Valley Wrestling Club) Fall 2:01</li>\n<li>Cons. Round 3 - John Hawkins (Crystal Lake Wizards) won by tech fall over Thomas Doyle (Vittum Cats Wrestling Club) TF 15-0</li>\n<li>Cons. Round 3 - Nick Mahajlovich (Celtic Elite) won by fall over Dylan Lozeau (Sycamore Wrestling Club) Fall 0:14</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Cole Campbell (Geneva Junior Vikings) won by fall over Santino Blanco (Morton Little Mustangs) Fall 0:50</li>\n<li>Semifinal - Jacob Kaminski (Martinez Fox Valley Elite) won by fall over Jesse Linch (Rock Island Wrestling Club) Fall 3:41</li>\n<li>Cons. Round 3 - Bo Meikamp (Edwardsville Wrestling Club) won by fall over Maximus Gomez (Izzy Style Wrestling) Fall 3:10</li>\n<li>Cons. Round 3 - Jaylen Washington (East St. Louis Wrestling) won by decision over Drew Huff (Roxana Outlaws) Dec 8-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Ameer Aqel (Vittum Cats Wrestling Club) won by fall over Jordan Gregg (Hillsboro Jr Toppers Wrestling Club) Fall 4:22</li>\n<li>Semifinal - Luke Luffman (Champaign Wrestling Club) won by fall over Tyler Berhenke (Champbuilders Wrestling) Fall 1:52</li>\n<li>Cons. Round 3 - Cameron Lee (TJ Trained) won by fall over Victor Rodriguez (Villa-Lombard Cougars) Fall 2:01</li>\n<li>Cons. Round 3 - Justin Hull (St. Charles WC) won by decision over Samuel Martin (Edwardsville Wrestling Club) Dec 4-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Chase Tatum (Tiger Town Tanglers Wrestling Club) won by decision over Darrell Gregg (St. Charles WC) Dec 10-3</li>\n<li>Semifinal - Jace Punke (TJ Trained) won by fall over Caleb Guise (Clinton Wrestling Club) Fall 2:00</li>\n<li>Cons. Round 3 - Joshua Anderson (Edwardsville Wrestling Club) won by fall over Jose Ramos (Arlington Cardinals Wrestling Club) Fall 4:12</li>\n<li>Cons. Round 3 - Cory Fant (Rochelle Wrestling Club) won by fall over Lucas Korte (Celtic Elite) Fall 2:53</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Ronald Tucker (Bolingbrook Junior Raiders) won by fall over Michael McNicholas (Glenbard East Jr Rams Wrestling Club) Fall 2:13</li>\n<li>Semifinal - Nicholas Vaccariello (Force Wrestling Club) won by fall over Tristan Phillips (Murphysboro Wrestling Club) Fall 3:25</li>\n<li>Cons. Round 3 - Bill Blaser (Geneseo Spider Wrestling Club) won by fall over Noah Laney (Crystal Lake Wizards) Fall 2:38</li>\n<li>Cons. Round 3 - Tyler Elsbury (Xtreme Wrestling Club) won by fall over Pedro Castanon (Falcons Elite Wrestling Club) Fall 1:16</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Ben Lunn (Edwardsville Wrestling Club) won by decision over Javen Estrada (Bolingbrook Junior Raiders) Dec 6-0</li>\n<li>Semifinal - Jacob Randolph (Celtic Elite) won by decision over Luke Fleming (Martinez Fox Valley Elite) Dec 4-0</li>\n<li>Cons. Round 3 - Robert Pizarro (Martinez Fox Valley Elite) won in sudden victory - 1 over Michael Crawford (Sycamore Wrestling Club) SV-1 4-2</li>\n<li>Cons. Round 3 - Reese Durlacher (The Wrestling Factory) won by decision over Jameir Castleberry (Little Huskies Wrestling Club) Dec 6-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Joel Vandervere (The Wrestling Factory) won by tech fall over Presley Beasley (Crystal Lake Wizards) TF 19-3</li>\n<li>Semifinal - Dylan Ragusin (Izzy Style Wrestling) won by decision over Cameron Johnson (Martinez Fox Valley Elite) Dec 7-1</li>\n<li>Cons. Round 3 - Joshua Holm (Izzy Style Wrestling) won by fall over Sam Emery (Celtic Elite) Fall 4:29</li>\n<li>Cons. Round 3 - Anthony Schickel (Bolingbrook Junior Raiders) won by fall over Brody Norman (TJ Trained-Decatur) Fall 1:24</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Nathan Callaway (Martinez Fox Valley Elite) won by decision over Kaleb Thompson (Bolingbrook Junior Raiders) Dec 4-2</li>\n<li>Semifinal - Noah Surtin (Edwardsville Wrestling Club) won by decision over Matthew Ramos (Bolingbrook Junior Raiders) Dec 6-2</li>\n<li>Cons. Round 3 - Anthony Molton (Will County Warriors) won by decision over Christopher Kennedy (Celtic Elite) Dec 5-3</li>\n<li>Cons. Round 3 - Christian Goin (TJ Trained) won in sudden victory - 1 over Michael Jaffe (SCN Youth Wrestling Club) SV-1 5-3</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - James Pierandozzi (Bolingbrook Junior Raiders) won by decision over Ryan Fleck (SCN Youth Wrestling Club) Dec 7-4</li>\n<li>Semifinal - Anthony Turner (Champaign Wrestling Club) won by decision over Jacob Lindsey (Oak Forest Warriors) Dec 5-1</li>\n<li>Cons. Round 3 - Daniel Pucino (The Wrestling Factory) won by decision over Ezra Elliott (Hoopeston Area Wrestling Club) Dec 9-3</li>\n<li>Cons. Round 3 - Enzo Silva (Martinez Fox Valley Elite) won by decision over Jacob Lukaszczyk (Vittum Cats Wrestling Club) Dec 7-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Domenic Zaccone (Orland Park Pioneers) won by decision over Nico Nunez (Martinez Fox Valley Elite) Dec 7-2</li>\n<li>Semifinal - Dylan Burnoski (Bolingbrook Junior Raiders) won by decision over Reece Heller (Izzy Style Wrestling) Dec 5-3</li>\n<li>Cons. Round 3 - Andrew Baysingar (Arlington Cardinals Wrestling Club) won by decision over Cameron Miller (Marengo Youth Wrestling) Dec 7-0</li>\n<li>Cons. Round 3 - Giovanni Cassioppi (Hononegah Wrestling Club) won by decision over Denis Murphy (Fox Valley Wrestling Club) Dec 8-3</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Nicholas Bolivar (Gomez Wrestling Academy) won by decision over Patrick Houston (Tinley Park Bulldogs Wrestling Club) Dec 2-0</li>\n<li>Cons. Semi - Alex Villar (Bolingbrook Junior Raiders) won in sudden victory - 1 over Tristan Daugherty (Central Illinois Wrestling Academy) SV-1 3-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Garrett Bakarich (Triad Little Knights Wrestling Club) won by fall over Brayden Thompson (Izzy Style Wrestling) Fall 4:30</li>\n<li>Cons. Semi - Kyle Tunink (Xtreme Wrestling Club) won by decision over Grant Laduke (Celtic Elite) Dec 5-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Connor Gaynor (Tinley Park Bulldogs Wrestling Club) won by fall over Kennedy Blades (Martinez Fox Valley Elite) Fall 2:14</li>\n<li>Cons. Semi - Qayin Dabney (Celtic Elite) won by major decision over Elijah Chiaro (SCN Youth Wrestling Club) Maj 9-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Bryan Smith (Harvey Twisters WC) won by decision over Ben Harvey (Rochelle Wrestling Club) Dec 6-1</li>\n<li>Cons. Semi - Martin Larkin (Redhawk Wrestling Club) won by decision over Logan Deacetis (Prairie Central Hawks) Dec 6-5</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Daemyen Middlebrooks (Little Huskies Wrestling Club) won by decision over Alex Carrillo (Force Wrestling Club) Dec 12-7</li>\n<li>Cons. Semi - Daniel Jezik (Celtic Elite) won by decision over Jack Patting (Moline Wrestling Club) Dec 4-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Jeremy Pullen (Force Wrestling Club) won by major decision over Alonzo Smiley (Gomez Wrestling Academy) Maj 13-2</li>\n<li>Cons. Semi - Zachary Kolb (Force Wrestling Club) won by decision over Joe Chapman (Pitbull Wrestling Alliance) Dec 8-6</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Drew Gvillo (Edwardsville Wrestling Club) won by decision over Kyle Berg (Vittum Cats Wrestling Club) Dec 4-2</li>\n<li>Cons. Semi - Miguel Barrett (Pontiac Wrestling Club) won by fall over Ronald Massari (Little Huskies Wrestling Club) Fall 3:56</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Daemon McMurtry (Celtic Elite) won by decision over Vincent Querciagrossa (Metamora Kids Wrestling Club) Dec 4-2</li>\n<li>Cons. Semi - Tommy Evans (Wolves Wrestling Club Inc.) won by decision over Mike Bosco (Tinley Park Bulldogs Wrestling Club) Dec 6-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Joseph Jens (Grayslake Wrestling Club) won by decision over Tyson Heerman (Peoria Razorbacks Wrestling Club) Dec 5-2</li>\n<li>Cons. Semi - Cole Gaddis (Hoopeston Area Wrestling Club) won by fall over Apollo Gothard (Lemont Bears) Fall 1:18</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Jacob Morrissey (Edwardsville Wrestling Club) won by fall over Xavier Sierra (Headlock Wrestling Academy) Fall 1:05</li>\n<li>Cons. Semi - Jaylin Garay (Falcons Elite Wrestling Club) won by decision over Nathaniel Thomas (Badger Wrestling Club) Dec 3-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Tyler Williams (Riverton Youth Wrestling) won by decision over Brock Neill (LP Crunching Cavs) Dec 11-9</li>\n<li>Cons. Semi - Dustin Olmstead (King Select Wrestling) won in tie breaker - 1 over Joshua Woodrey (Prairie Central Hawks) TB-1 3-1</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Anthony Enlow (Vandalia Kings) won by fall over Jaiden Lowery (Waukegan Youth Wrestling Club) Fall 2:07</li>\n<li>Cons. Semi - Zachary Wallace (Moline Wrestling Club) won in sudden victory - 1 over Trenton Overvig (Cumberland Youth Wrestling Club) SV-1 6-4</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Daniel Sheen (SCN Youth Wrestling Club) won by major decision over Phoenix Mordick (Dakota Wrestling Club) Maj 11-3</li>\n<li>Cons. Semi - Carter Hall (Champaign Wrestling Club) won in sudden victory - 1 over Antonio Alvarado (Belvidere Bandits Wrestling Club) SV-1 5-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Dylan Amico (Force Wrestling Club) won by decision over Matthew Minick (King Select Wrestling) Dec 6-1</li>\n<li>Cons. Semi - Joel Mylin (Golden Eagles Wrestling Club) won by decision over Logan Kuhel-trimmer (Force Wrestling Club) Dec 6-5</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Jacob Rundell (Little Huskies Wrestling Club) won by major decision over Tommy Curran (Martinez Fox Valley Elite) Maj 12-1</li>\n<li>Cons. Semi - Vincent Robinson (Harvey Twisters WC) won by decision over Mia Palumbo (Southside Stallions School of Wrestling) Dec 6-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Jordan Blew (Force Wrestling Club) won by fall over Will Carlile (Bulls Wrestling Club) Fall 0:55</li>\n<li>Cons. Semi - Grant Matarelli (Edwardsville Wrestling Club) won by major decision over Justin Warmowski (Fox Lake WC) Maj 10-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Nicholas Matthias (Celtic Elite) won by decision over Kendall Norfleet (Harvey Twisters WC) Dec 4-2</li>\n<li>Cons. Semi - Terrance Snapp (Will County Warriors) won by fall over Joseph Cape (TJ Trained) Fall 2:09</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Trevor Chumbley (SCN Youth Wrestling Club) won by decision over Eddie Bolivar (Gomez Wrestling Academy) Dec 5-2</li>\n<li>Cons. Semi - Riley Palm (The Wrestling Factory) won by decision over Benjamin Anderson (SCN Youth Wrestling Club) Dec 6-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - George Marre (Gomez Wrestling Academy) won by decision over Nicholas Termini (SCN Youth Wrestling Club) Dec 5-1</li>\n<li>Cons. Semi - Brody Ivey (Sauk Valley Wrestling Club) won in sudden victory - 1 over Tanner Swain (Vandalia Jr Wrestling Club) SV-1 4-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Kody Cavender (Harrisburg Junior Bulldogs) won by decision over D`Anthony Hopkins (Force Wrestling Club) Dec 9-4</li>\n<li>Cons. Semi - Joshua Ramos (Martinez Fox Valley Elite) won by decision over Jared Head (TJ Trained) Dec 5-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Fidel Mayora (Epic Wrestling) won by decision over Corey Sapp (Bolingbrook Junior Raiders) Dec 3-1</li>\n<li>Cons. Semi - Michael Gunther (The Wrestling Factory) won by fall over Dalton Hall (Champaign Wrestling Club) Fall 4:17</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Elijah Black (The Wrestling Factory) won by decision over Stephen Bushy (Crystal Lake Wizards) Dec 8-3</li>\n<li>Cons. Semi - Jamal Osborne (Harvey Twisters WC) won by decision over Peter Mccusker (Champaign Wrestling Club) Dec 1-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Anthony Glauser (The Wrestling Factory) won by decision over Trey Piotrowski (Wolves Wrestling Club Inc.) Dec 7-2</li>\n<li>Cons. Semi - Peter Christensen (Izzy Style Wrestling) won by fall over Quintin Hamilton (Evanston School of Wrestling) Fall 1:22</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Drake Regenhardt (Wolves Wrestling Club Inc.) won by major decision over Anthony Pennington (Gomez Wrestling Academy) Maj 11-1</li>\n<li>Cons. Semi - Logan Wilson (Champaign Wrestling Club) won by decision over Conor Prettyman (Barrington Broncos Wrestling Club) Dec 9-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Peyton Hammerich (Tiger Town Tanglers Wrestling Club) won by decision over Tayesean White (Gomez Wrestling Academy) Dec 7-6</li>\n<li>Cons. Semi - Joey Alletto (Falcons Elite Wrestling Club) won by decision over Jimmy Bartell (Maine Eagles WC) Dec 2-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Kobe Howard (Renegade Wrestling Club (NFP)) won by decision over John Hawkins (Crystal Lake Wizards) Dec 6-3</li>\n<li>Cons. Semi - Nick Mahajlovich (Celtic Elite) won by fall over Kyle Borske (Fox Valley Wrestling Club) Fall 2:48</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Bo Meikamp (Edwardsville Wrestling Club) won by fall over Santino Blanco (Morton Little Mustangs) Fall 2:48</li>\n<li>Cons. Semi - Jesse Linch (Rock Island Wrestling Club) won by fall over Jaylen Washington (East St. Louis Wrestling) Fall 2:02</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Cameron Lee (TJ Trained) won by fall over Jordan Gregg (Hillsboro Jr Toppers Wrestling Club) Fall 5:15</li>\n<li>Cons. Semi - Tyler Berhenke (Champbuilders Wrestling) won by fall over Justin Hull (St. Charles WC) Fall 2:58</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Darrell Gregg (St. Charles WC) won by decision over Joshua Anderson (Edwardsville Wrestling Club) Dec 8-6</li>\n<li>Cons. Semi - Caleb Guise (Clinton Wrestling Club) won by fall over Cory Fant (Rochelle Wrestling Club) Fall 2:51</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Bill Blaser (Geneseo Spider Wrestling Club) won by decision over Michael McNicholas (Glenbard East Jr Rams Wrestling Club) Dec 7-0</li>\n<li>Cons. Semi - Tyler Elsbury (Xtreme Wrestling Club) won in sudden victory - 1 over Tristan Phillips (Murphysboro Wrestling Club) SV-1 5-3</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Javen Estrada (Bolingbrook Junior Raiders) won by decision over Robert Pizarro (Martinez Fox Valley Elite) Dec 7-4</li>\n<li>Cons. Semi - Reese Durlacher (The Wrestling Factory) won by decision over Luke Fleming (Martinez Fox Valley Elite) Dec 7-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Presley Beasley (Crystal Lake Wizards) won by major decision over Joshua Holm (Izzy Style Wrestling) Maj 11-1</li>\n<li>Cons. Semi - Cameron Johnson (Martinez Fox Valley Elite) won by decision over Anthony Schickel (Bolingbrook Junior Raiders) Dec 8-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Kaleb Thompson (Bolingbrook Junior Raiders) won by decision over Anthony Molton (Will County Warriors) Dec 6-4</li>\n<li>Cons. Semi - Matthew Ramos (Bolingbrook Junior Raiders) won by fall over Christian Goin (TJ Trained) Fall 2:03</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Daniel Pucino (The Wrestling Factory) won by decision over Ryan Fleck (SCN Youth Wrestling Club) Dec 8-2</li>\n<li>Cons. Semi - Jacob Lindsey (Oak Forest Warriors) won by decision over Enzo Silva (Martinez Fox Valley Elite) Dec 7-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Nico Nunez (Martinez Fox Valley Elite) won by decision over Andrew Baysingar (Arlington Cardinals Wrestling Club) Dec 5-3</li>\n<li>Cons. Semi - Reece Heller (Izzy Style Wrestling) won by fall over Giovanni Cassioppi (Hononegah Wrestling Club) Fall 1:56</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Nicholas Bolivar (Gomez Wrestling Academy) won in tie breaker - 1 over Alex Villar (Bolingbrook Junior Raiders) TB-1 2-1</li>\n<li>5th Place Match - Tristan Daugherty (Central Illinois Wrestling Academy) won by decision over Patrick Houston (Tinley Park Bulldogs Wrestling Club) Dec 2-0</li>\n<li>7th Place Match - Jack Milos (Arlington Cardinals Wrestling Club) won by tech fall over John McDermott (Force Wrestling Club) TF 16-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Kyle Tunink (Xtreme Wrestling Club) won by fall over Garrett Bakarich (Triad Little Knights Wrestling Club) Fall 2:53</li>\n<li>5th Place Match - Grant Laduke (Celtic Elite) won by decision over Brayden Thompson (Izzy Style Wrestling) Dec 7-6</li>\n<li>7th Place Match - Jake Harrier (Golden Eagles Wrestling Club) won by decision over Cole Watkins (TJ Trained) Dec 7-4</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Connor Gaynor (Tinley Park Bulldogs Wrestling Club) won by decision over Qayin Dabney (Celtic Elite) Dec 6-1</li>\n<li>5th Place Match - Kennedy Blades (Martinez Fox Valley Elite) won by decision over Elijah Chiaro (SCN Youth Wrestling Club) Dec 5-0</li>\n<li>7th Place Match - Deon Lopez (Lakeland Predators WC) won by decision over Peyton Bechtold (King Select Wrestling) Dec 5-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Bryan Smith (Harvey Twisters WC) won by decision over Martin Larkin (Redhawk Wrestling Club) Dec 9-5</li>\n<li>5th Place Match - Logan Deacetis (Prairie Central Hawks) won by fall over Ben Harvey (Rochelle Wrestling Club) Fall 1:06</li>\n<li>7th Place Match - Jonathan Hernandez (Force Wrestling Club) won by fall over Zachary Janz (Greg Gomez Trained Wrestling) Fall 2:58</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Daemyen Middlebrooks (Little Huskies Wrestling Club) won in sudden victory - 1 over Daniel Jezik (Celtic Elite) SV-1 6-4</li>\n<li>5th Place Match - Alex Carrillo (Force Wrestling Club) won by major decision over Jack Patting (Moline Wrestling Club) Maj 11-3</li>\n<li>7th Place Match - Marc Catama (Golden Eagles Wrestling Club) won by fall over Colt Guyon (Cumberland Youth Wrestling Club) Fall 0:56</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Jeremy Pullen (Force Wrestling Club) won by decision over Zachary Kolb (Force Wrestling Club) Dec 4-0</li>\n<li>5th Place Match - Joe Chapman (Pitbull Wrestling Alliance) won by decision over Alonzo Smiley (Gomez Wrestling Academy) Dec 5-3</li>\n<li>7th Place Match - Noah Ross (Izzy Style Wrestling) won by decision over Jake Viloria (Little Huskies Wrestling Club) Dec 7-1</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Drew Gvillo (Edwardsville Wrestling Club) won by injury default over Miguel Barrett (Pontiac Wrestling Club) Inj. 0:00</li>\n<li>5th Place Match - Ronald Massari (Little Huskies Wrestling Club) won by major decision over Kyle Berg (Vittum Cats Wrestling Club) Maj 8-0</li>\n<li>7th Place Match - Sean Alletto (Falcons Elite Wrestling Club) won by fall over Robert Bates (Little Redskins Wrestling Club) Fall 2:03</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Daemon McMurtry (Celtic Elite) won by decision over Tommy Evans (Wolves Wrestling Club Inc.) Dec 2-1</li>\n<li>5th Place Match - Mike Bosco (Tinley Park Bulldogs Wrestling Club) won in sudden victory - 1 over Vincent Querciagrossa (Metamora Kids Wrestling Club) SV-1 5-3</li>\n<li>7th Place Match - Tavaris Macklin (Carbondale Wrestling Club) won by fall over Kyle Franklin (Team 360 Gatorstyle Wrestling) Fall 2:39</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Joseph Jens (Grayslake Wrestling Club) won by decision over Cole Gaddis (Hoopeston Area Wrestling Club) Dec 8-2</li>\n<li>5th Place Match - Apollo Gothard (Lemont Bears) won by decision over Tyson Heerman (Peoria Razorbacks Wrestling Club) Dec 2-0</li>\n<li>7th Place Match - John Sexton (Saber Wrestling Club) won by decision over Kenny Lutz (Junior Kahoks) Dec 6-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Jacob Morrissey (Edwardsville Wrestling Club) won by decision over Jaylin Garay (Falcons Elite Wrestling Club) Dec 6-5</li>\n<li>5th Place Match - Xavier Sierra (Headlock Wrestling Academy) won by injury default over Nathaniel Thomas (Badger Wrestling Club) Inj. 1:46</li>\n<li>7th Place Match - Alvin Maten (Harlem Cougar WC) won by fall over Luis Cretsinger (Xtreme Wrestling Club) Fall 1:47</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Tyler Williams (Riverton Youth Wrestling) won by decision over Dustin Olmstead (King Select Wrestling) Dec 14-7</li>\n<li>5th Place Match - Joshua Woodrey (Prairie Central Hawks) won by decision over Brock Neill (LP Crunching Cavs) Dec 5-1</li>\n<li>7th Place Match - Dayton Baue (Sparta Junior Bulldogs) won by fall over Partick Peters (Tinley Park Bulldogs Wrestling Club) Fall 0:36</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Anthony Enlow (Vandalia Kings) won by decision over Zachary Wallace (Moline Wrestling Club) Dec 7-1</li>\n<li>5th Place Match - Jaiden Lowery (Waukegan Youth Wrestling Club) won by decision over Trenton Overvig (Cumberland Youth Wrestling Club) Dec 4-0</li>\n<li>7th Place Match - Simon Wilson (Champbuilders Wrestling) won by fall over Dreyden Pitts (Tiger Wrestling Club) Fall 1:24</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Carter Hall (Champaign Wrestling Club) won by decision over Daniel Sheen (SCN Youth Wrestling Club) Dec 2-1</li>\n<li>5th Place Match - Antonio Alvarado (Belvidere Bandits Wrestling Club) won by decision over Phoenix Mordick (Dakota Wrestling Club) Dec 4-0</li>\n<li>7th Place Match - Ronan Schuelke (Maddog Wrestling Club) won by decision over Jacob Crandall (Greg Gomez Trained Wrestling) Dec 4-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Dylan Amico (Force Wrestling Club) won by decision over Joel Mylin (Golden Eagles Wrestling Club) Dec 5-2</li>\n<li>5th Place Match - Matthew Minick (King Select Wrestling) won by decision over Logan Kuhel-trimmer (Force Wrestling Club) Dec 10-7</li>\n<li>7th Place Match - Christian Olsen (Crystal Lake Wizards) won by decision over Kenyon Boyce (Harvey Twisters WC) Dec 3-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Jacob Rundell (Little Huskies Wrestling Club) won by injury default over Vincent Robinson (Harvey Twisters WC) Inj. 2:03</li>\n<li>5th Place Match - Tommy Curran (Martinez Fox Valley Elite) won by decision over Mia Palumbo (Southside Stallions School of Wrestling) Dec 7-2</li>\n<li>7th Place Match - Cameron Clark (TJ Trained) won by injury default over Alex Randell (Greg Gomez Trained Wrestling) Inj. 0:00</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Grant Matarelli (Edwardsville Wrestling Club) won by decision over Jordan Blew (Force Wrestling Club) Dec 5-3</li>\n<li>5th Place Match - Will Carlile (Bulls Wrestling Club) won by forfeit over Justin Warmowski (Fox Lake WC) FF</li>\n<li>7th Place Match - Alex Ventimilla (Martinez Fox Valley Elite) won by decision over Grant Peterson (Central Illinois Wrestling Academy) Dec 4-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Nicholas Matthias (Celtic Elite) won by decision over Terrance Snapp (Will County Warriors) Dec 7-0</li>\n<li>5th Place Match - Kendall Norfleet (Harvey Twisters WC) won by decision over Joseph Cape (TJ Trained) Dec 12-5</li>\n<li>7th Place Match - Peyton Timmons (Red Raiders Wrestling Team) won by fall over Kai Conway (Gomez Wrestling Academy) Fall 4:13</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Riley Palm (The Wrestling Factory) won in tie breaker - 1 over Trevor Chumbley (SCN Youth Wrestling Club) TB-1 5-3</li>\n<li>5th Place Match - Eddie Bolivar (Gomez Wrestling Academy) won by decision over Benjamin Anderson (SCN Youth Wrestling Club) Dec 1-0</li>\n<li>7th Place Match - Leo Mushinsky (TJ Trained) won by forfeit over   () FF</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Brody Ivey (Sauk Valley Wrestling Club) won by decision over George Marre (Gomez Wrestling Academy) Dec 2-0</li>\n<li>5th Place Match - Tanner Swain (Vandalia Jr Wrestling Club) won by decision over Nicholas Termini (SCN Youth Wrestling Club) Dec 2-0</li>\n<li>7th Place Match - Nicky Amato (Izzy Style Wrestling) won by decision over Casey Roberts (Mustang/SKT WC) Dec 4-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Joshua Ramos (Martinez Fox Valley Elite) won by decision over Kody Cavender (Harrisburg Junior Bulldogs) Dec 6-2</li>\n<li>5th Place Match - Jared Head (TJ Trained) won by decision over D`Anthony Hopkins (Force Wrestling Club) Dec 10-6</li>\n<li>7th Place Match - Jacquez Stewart (Springfield Capitals Kids WC) won by decision over Anthony Bitner (Little Rams Wrestling) Dec 3-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Michael Gunther (The Wrestling Factory) won in sudden victory - 2 over Fidel Mayora (Epic Wrestling) SV-2 2-1</li>\n<li>5th Place Match - Dalton Hall (Champaign Wrestling Club) won in tie breaker - 1 over Corey Sapp (Bolingbrook Junior Raiders) TB-1 2-1</li>\n<li>7th Place Match - Eddie Villalobos (Rochelle Wrestling Club) won by decision over Jamel Sheppard (Gomez Wrestling Academy) Dec 6-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Jamal Osborne (Harvey Twisters WC) won by decision over Elijah Black (The Wrestling Factory) Dec 4-3</li>\n<li>5th Place Match - Peter Mccusker (Champaign Wrestling Club) won by decision over Stephen Bushy (Crystal Lake Wizards) Dec 3-1</li>\n<li>7th Place Match - Peyton Berry (Falcons Elite Wrestling Club) won by decision over Victor Guzman (Rock Island Wrestling Club) Dec 3-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Anthony Glauser (The Wrestling Factory) won by decision over Peter Christensen (Izzy Style Wrestling) Dec 8-4</li>\n<li>5th Place Match - Trey Piotrowski (Wolves Wrestling Club Inc.) won by fall over Quintin Hamilton (Evanston School of Wrestling) Fall 0:53</li>\n<li>7th Place Match - J.p. Migawa (Tinley Park Bulldogs Wrestling Club) won by injury default over Sam Blaha (Junior Kahoks) Inj. 0:00</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Logan Wilson (Champaign Wrestling Club) won by decision over Drake Regenhardt (Wolves Wrestling Club Inc.) Dec 13-6</li>\n<li>5th Place Match - Conor Prettyman (Barrington Broncos Wrestling Club) won in sudden victory - 1 over Anthony Pennington (Gomez Wrestling Academy) SV-1 4-2</li>\n<li>7th Place Match - Gianfranco Montalto (Lemont Bears) won in tie breaker - 1 over Jett Dowell (Falcons Elite Wrestling Club) TB-1 2-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Joey Alletto (Falcons Elite Wrestling Club) won by fall over Peyton Hammerich (Tiger Town Tanglers Wrestling Club) Fall 4:11</li>\n<li>5th Place Match - Jimmy Bartell (Maine Eagles WC) won by decision over Tayesean White (Gomez Wrestling Academy) Dec 1-0</li>\n<li>7th Place Match - Malik Daghash (Badger Wrestling Club) won by fall over Tyson Burton (Champaign Wrestling Club) Fall 3:14</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Kobe Howard (Renegade Wrestling Club (NFP)) won by fall over Nick Mahajlovich (Celtic Elite) Fall 1:10</li>\n<li>5th Place Match - John Hawkins (Crystal Lake Wizards) won by decision over Kyle Borske (Fox Valley Wrestling Club) Dec 2-1</li>\n<li>7th Place Match - Thomas Doyle (Vittum Cats Wrestling Club) won by injury default over Dylan Lozeau (Sycamore Wrestling Club) Inj. 0:00</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Jesse Linch (Rock Island Wrestling Club) won by decision over Bo Meikamp (Edwardsville Wrestling Club) Dec 9-8</li>\n<li>5th Place Match - Jaylen Washington (East St. Louis Wrestling) won by decision over Santino Blanco (Morton Little Mustangs) Dec 2-0</li>\n<li>7th Place Match - Maximus Gomez (Izzy Style Wrestling) won by decision over Drew Huff (Roxana Outlaws) Dec 4-3</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Cameron Lee (TJ Trained) won by decision over Tyler Berhenke (Champbuilders Wrestling) Dec 4-3</li>\n<li>5th Place Match - Justin Hull (St. Charles WC) won by decision over Jordan Gregg (Hillsboro Jr Toppers Wrestling Club) Dec 5-0</li>\n<li>7th Place Match - Samuel Martin (Edwardsville Wrestling Club) won by decision over Victor Rodriguez (Villa-Lombard Cougars) Dec 5-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Darrell Gregg (St. Charles WC) won by fall over Caleb Guise (Clinton Wrestling Club) Fall 2:04</li>\n<li>5th Place Match - Joshua Anderson (Edwardsville Wrestling Club) won by fall over Cory Fant (Rochelle Wrestling Club) Fall 2:51</li>\n<li>7th Place Match - Jose Ramos (Arlington Cardinals Wrestling Club) won by major decision over Lucas Korte (Celtic Elite) Maj 13-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Bill Blaser (Geneseo Spider Wrestling Club) won by decision over Tyler Elsbury (Xtreme Wrestling Club) Dec 7-0</li>\n<li>5th Place Match - Michael McNicholas (Glenbard East Jr Rams Wrestling Club) won by fall over Tristan Phillips (Murphysboro Wrestling Club) Fall 0:41</li>\n<li>7th Place Match - Noah Laney (Crystal Lake Wizards) won by decision over Pedro Castanon (Falcons Elite Wrestling Club) Dec 4-0</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Reese Durlacher (The Wrestling Factory) won by decision over Javen Estrada (Bolingbrook Junior Raiders) Dec 6-5</li>\n<li>5th Place Match - Luke Fleming (Martinez Fox Valley Elite) won in sudden victory - 1 over Robert Pizarro (Martinez Fox Valley Elite) SV-1 4-2</li>\n<li>7th Place Match - Jameir Castleberry (Little Huskies Wrestling Club) won by decision over Michael Crawford (Sycamore Wrestling Club) Dec 6-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Cameron Johnson (Martinez Fox Valley Elite) won by decision over Presley Beasley (Crystal Lake Wizards) Dec 6-0</li>\n<li>5th Place Match - Anthony Schickel (Bolingbrook Junior Raiders) won by decision over Joshua Holm (Izzy Style Wrestling) Dec 14-8</li>\n<li>7th Place Match - Brody Norman (TJ Trained-Decatur) won by decision over Sam Emery (Celtic Elite) Dec 3-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Matthew Ramos (Bolingbrook Junior Raiders) won by decision over Kaleb Thompson (Bolingbrook Junior Raiders) Dec 5-2</li>\n<li>5th Place Match - Anthony Molton (Will County Warriors) won by decision over Christian Goin (TJ Trained) Dec 5-3</li>\n<li>7th Place Match - Christopher Kennedy (Celtic Elite) won by decision over Michael Jaffe (SCN Youth Wrestling Club) Dec 4-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Jacob Lindsey (Oak Forest Warriors) won by major decision over Daniel Pucino (The Wrestling Factory) Maj 10-2</li>\n<li>5th Place Match - Enzo Silva (Martinez Fox Valley Elite) won by decision over Ryan Fleck (SCN Youth Wrestling Club) Dec 5-1</li>\n<li>7th Place Match - Ezra Elliott (Hoopeston Area Wrestling Club) won by decision over Jacob Lukaszczyk (Vittum Cats Wrestling Club) Dec 6-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Nico Nunez (Martinez Fox Valley Elite) won by decision over Reece Heller (Izzy Style Wrestling) Dec 6-3</li>\n<li>5th Place Match - Andrew Baysingar (Arlington Cardinals Wrestling Club) won by decision over Giovanni Cassioppi (Hononegah Wrestling Club) Dec 3-2</li>\n<li>7th Place Match - Cameron Miller (Marengo Youth Wrestling) won by decision over Denis Murphy (Fox Valley Wrestling Club) Dec 5-4</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Luke Odom (Edwardsville Wrestling Club) won by decision over Nain Vazquez (Martinez Fox Valley Elite) Dec 1-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Zeke Marshall (Martinez Fox Valley Elite) won in sudden victory - 1 over Jacob Tinajero (SCN Youth Wrestling Club) SV-1 7-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Sincere Bailey (Harvey Twisters WC) won by decision over Ryan Smith (Harvey Twisters WC) Dec 5-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Kevin Countryman (Celtic Elite) won by decision over Dylan Connell (Crystal Lake Wizards) Dec 7-2</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Noah Villarreal (Martinez Fox Valley Elite) won by tech fall over Isaiah Parker (The Wrestling Factory) TF 18-1</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Drew Nash (Lemont Bears) won by decision over Noah Alsguson (Harvey Twisters WC) Dec 7-3</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Aron Taylor (Carbondale Wrestling Club) won in tie breaker - 1 over Josh Labarbera (Martinez Fox Valley Elite) TB-1 1-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Brandon Hoselton (Prairie Central Hawks) won by fall over Jordan Chisum (Zee-Bee Stingers Wrestling Club) Fall 4:23</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Mustafa St. Clair (Harvey Twisters WC) won by fall over Matthew Ramirez (Barrington Broncos Wrestling Club) Fall 0:12</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Nicholas Skamra (Headlock Wrestling Academy) won by major decision over Nikolas Mishka (Tinley Park Bulldogs Wrestling Club) Maj 14-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Connor Eaton (West Frankfort Jr. Redbirds) won by fall over Colin Baker (Downers Grove Cougars WC) Fall 2:39</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Shawn Lee (Downers Grove Cougars WC) won by fall over Angel Jaimes (Martinez Fox Valley Elite) Fall 2:30</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Samuel Hayes (Contender Wrestling) won by major decision over Nicholas Gonzalez (Gomez Wrestling Academy) Maj 8-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Christopher Moore (Crystal Lake Wizards) won by major decision over Nasir Bailey (Harvey Twisters WC) Maj 11-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Diego Sotelo (Martinez Fox Valley Elite) won by fall over Joshua Koderhandt (Crusaders` Elite) Fall 4:29</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Kannon Webster (TJ Trained) won in sudden victory - 1 over Kyle Schickel (Celtic Elite) SV-1 5-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Dean Hamiti (Martinez Fox Valley Elite) won by decision over Vincent Zerban (King Select Wrestling) Dec 8-4</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Donnell Washington (Harvey Twisters WC) won by injury default over Pat Nolan (Orland Park Pioneers) Inj. 2:28</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Jacob Dado (Bolingbrook Junior Raiders) won by decision over Kyle Cavender (Harrisburg Junior Bulldogs) Dec 3-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Abe Assad (Gomez Wrestling Academy) won by decision over Jake Stiles (Izzy Style Wrestling) Dec 2-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Juan Bazaldua (Martinez Fox Valley Elite) won in sudden victory - 1 over Peter Ferraro (SCN Youth Wrestling Club) SV-1 3-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Bilal Bailey (Harvey Twisters WC) won by decision over Cormac Kane (Junior Cougar Wrestling Club) Dec 6-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Baylor Fernandes (Bolingbrook Junior Raiders) won by decision over Brad Gross (SCN Youth Wrestling Club) Dec 9-8</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Cory Peterson (King Select Wrestling) won by major decision over Jackson Punzel (Naperville Wrestling Club) Maj 17-4</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Trevor Swier (Force Wrestling Club) won by decision over Dan Benoit (Redhawk Wrestling Club) Dec 3-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Jon Halvorsen (Maine Eagles WC) won by decision over Tyreek Austin (East St. Louis Wrestling) Dec 9-2</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Jacob Kaminski (Martinez Fox Valley Elite) won by decision over Cole Campbell (Geneva Junior Vikings) Dec 8-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Luke Luffman (Champaign Wrestling Club) won by decision over Ameer Aqel (Vittum Cats Wrestling Club) Dec 4-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Jace Punke (TJ Trained) won by decision over Chase Tatum (Tiger Town Tanglers Wrestling Club) Dec 8-2</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Ronald Tucker (Bolingbrook Junior Raiders) won by fall over Nicholas Vaccariello (Force Wrestling Club) Fall 3:56</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Ben Lunn (Edwardsville Wrestling Club) won by decision over Jacob Randolph (Celtic Elite) Dec 5-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Dylan Ragusin (Izzy Style Wrestling) won by decision over Joel Vandervere (The Wrestling Factory) Dec 7-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Noah Surtin (Edwardsville Wrestling Club) won in sudden victory - 1 over Nathan Callaway (Martinez Fox Valley Elite) SV-1 3-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - James Pierandozzi (Bolingbrook Junior Raiders) won by fall over Anthony Turner (Champaign Wrestling Club) Fall 3:58</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Domenic Zaccone (Orland Park Pioneers) won by decision over Dylan Burnoski (Bolingbrook Junior Raiders) Dec 3-1</li>\n</ul>\n</section>"
}
