{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Aters (Martinez Fox Valley Elite) won by decision over Brady Foster (Mattoon Youth WC) Dec 5-0</li>\n<li>Champ. Round 1 - Liam Fox (Murphysboro WC) won by decision over Noah O`Connor (Lemont Bears) Dec 6-0</li>\n<li>Champ. Round 1 - Sean Larkin (Redhawk WC/Panther WC) won by fall over Zach Kruse (Hinsdale Red Devil WC) Fall 1:58</li>\n<li>Champ. Round 1 - Jake Schwartz (Carlinville WC) won by decision over Tallen Pawlak (Champaign WC) Dec 9-2</li>\n<li>Champ. Round 1 - Isaac Thomas (TJ Trained) won by fall over Jacob Crandall (Arlington Cardinals WC) Fall 3:55</li>\n<li>Champ. Round 1 - Tyler Evans (Wolves WC) won by decision over Jermaine Butler (Crosstown Spartan Elite WC) Dec 8-4</li>\n<li>Champ. Round 1 - Colin Young (Da WC) won by fall over Daniel Kelly (Sauk Valley WC) Fall 3:55</li>\n<li>Champ. Round 1 - Saul Trejo (Gomez Wrestling Academy) won by decision over Jarian Jones (Will County Warriors) Dec 5-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Aidan Huck (Batavia WC) won by tech fall over Brayden Sanders-Hall (Mt. Zion Kids WC) TF 16-0</li>\n<li>Champ. Round 1 - Renzo Morgan (The Wrestling Factory) won by decision over Paul Ishikawa (TJ Trained) Dec 5-2</li>\n<li>Champ. Round 1 - Caleb Nobiling (Lakeland Predators WC) won by fall over Francisco Solis (Martinez Fox Valley Elite) Fall 1:15</li>\n<li>Champ. Round 1 - Brendan Tunink (Sauk Valley WC) won by fall over Brayden Kull (Iguana WC) Fall 1:28</li>\n<li>Champ. Round 1 - Karsten Nordlie (Hononegah WC) won by major decision over Jaxson Roberts (Brawlers WC) Maj 13-2</li>\n<li>Champ. Round 1 - Sam Schuit (Lemont Bears) won by decision over Ben Skaggs (Bulls WC) Dec 3-0</li>\n<li>Champ. Round 1 - Dillon Carlson (Crystal Lake Wizards) won by fall over Cameron Kelley (O`Fallon Little Panthers WC) Fall 2:40</li>\n<li>Champ. Round 1 - Evan Schiffman (Lemont Bears) won by major decision over Alexander Lizak (Celtic Elite) Maj 8-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Brandon Krier (Martinez Fox Valley Elite) won by decision over Ryan Wojcik (Tinley Park Bulldogs WC) Dec 9-2</li>\n<li>Champ. Round 1 - Daniel Aguilar (Gomez Wrestling Academy) won by tech fall over Isaiah Hayes (Mt. Zion Kids WC) TF 16-0</li>\n<li>Champ. Round 1 - Dimitrios Lalezas (Lemont Bears) won by decision over Dalton Wells (Storm Youth WC) Dec 7-0</li>\n<li>Champ. Round 1 - Michael Calcagno (Izzy Style Wrestling) won by fall over Kenneth Siwicki (Naperville WC) Fall 2:21</li>\n<li>Champ. Round 1 - Jacob Jensen (Crystal Lake Wizards) won by decision over Nile Chotner (AJ Junior Wildcats WC) Dec 4-0</li>\n<li>Champ. Round 1 - Logan Swaw (Team 1006 Wrestling) won by major decision over Tyler Starr (Brawlers WC) Maj 12-3</li>\n<li>Champ. Round 1 - Jacob Macatangay (Force WC) won by fall over Drew Landau (Edwardsville WC) Fall 0:31</li>\n<li>Champ. Round 1 - Joseph Griffin (Team 1006 Wrestling) won by decision over Andre Rios (Z`s Team Pena) Dec 8-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Joe Mushinsky (TJ Trained) won by tech fall over Charles Connolly (Mustang WC) TF 17-0</li>\n<li>Champ. Round 1 - Luke Christie (Brawlers WC) won by decision over Connor Thompson (SCN Youth WC) Dec 4-1</li>\n<li>Champ. Round 1 - Nate Pacetti (Redhawk WC/Panther WC) won by decision over Jack Kaneshiro (Scorpion WC) Dec 7-0</li>\n<li>Champ. Round 1 - Michael Jabaay (Contender Wrestling) won by decision over Zane Hulet (Super Soldiers WC) Dec 2-0</li>\n<li>Champ. Round 1 - Cole Peters (TJ Trained-Springfield) won by decision over Garrett Vincent (Dakota WC) Dec 6-0</li>\n<li>Champ. Round 1 - Dominik Mallinder (Izzy Style Wrestling) won by decision over Zachariah Lusk (Belleville Little Devils WC) Dec 8-2</li>\n<li>Champ. Round 1 - Jayden Colon (Gomez Wrestling Academy) won by tech fall over Samuel McArthur (Champaign WC) TF 16-0</li>\n<li>Champ. Round 1 - Austin Bauer (Edwardsville WC) won by fall over Dillon Raab (The Law) Fall 2:52</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Nick Mabutas (Glenbard East Jr Rams WC) won by major decision over Kaden Christensen (Harlem Cougars WC) Maj 10-2</li>\n<li>Champ. Round 1 - Jake Zator (Lemont Bears) won by decision over Collin Reif (Jacksonville Area Wrestling) Dec 10-4</li>\n<li>Champ. Round 1 - Colin Kelly (Tinley Park Bulldogs WC) won by major decision over Maddox Stieb (SCN Youth WC) Maj 11-0</li>\n<li>Champ. Round 1 - Zackary Crawford (Sycamore WC) won by fall over Colton Carlisle (Bulls WC) Fall 2:08</li>\n<li>Champ. Round 1 - Joseph Lashuay (Storm Youth WC) won by decision over Lynel Williams (UP Town WC) Dec 10-3</li>\n<li>Champ. Round 1 - Anthony Montez (Junior Pioneer WC) won by fall over Matthew Boyer (North Shore Edge) Fall 0:33</li>\n<li>Champ. Round 1 - Carlos Munoz-Flores (Team 1006 Wrestling) won by decision over Andrew Dado (Bolingbrook Junior Raiders) Dec 7-1</li>\n<li>Champ. Round 1 - Shane Carr (Izzy Style Wrestling) won by major decision over Daniel Brownfield (TJ Trained-Springfield) Maj 12-4</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Luke Schultz (O`Fallon Little Panthers WC) won by decision over Benjamin Albavera (The Wrestling Factory) Dec 11-8</li>\n<li>Champ. Round 1 - Jalen Curtis (Greg Gomez Trained Wrestling) won by fall over Danny Cihocki (Tiger Town Tanglers WC) Fall 0:56</li>\n<li>Champ. Round 1 - Jack Smialowicz (Pitbull Wrestling Alliance) won by fall over Evan Grazzini (Elmhurst Jr Dukes WC) Fall 2:16</li>\n<li>Champ. Round 1 - Tyler Casey (TJ Trained) won by decision over Tanner Clayton (Hillsboro Jr Toppers) Dec 7-0</li>\n<li>Champ. Round 1 - Thomas Boland (Redhawk WC/Panther WC) won by tech fall over Brock Hoyd (Contender Wrestling) TF 15-0</li>\n<li>Champ. Round 1 - Hunter Travis (Pontiac WC) won by decision over Sam Carlson (Sycamore WC) Dec 6-3</li>\n<li>Champ. Round 1 - Billy Lindsey (Oak Forest Warriors) won by decision over Elliott Diemel (Hononegah WC) Dec 6-2</li>\n<li>Champ. Round 1 - Alexis Janiak (Force WC) won by decision over Clayvonte Sloan (Urbana Tigers WC) Dec 7-5</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Aaron Perez (Hinsdale Red Devil WC) won by decision over Zach Meyer (Barrington Broncos WC) Dec 7-2</li>\n<li>Champ. Round 1 - Tyrin Newsome (Urbana Tigers WC) won by fall over Aidan Nolting (Junior Porters WC) Fall 0:41</li>\n<li>Champ. Round 1 - Aidan Linden (Martinez Fox Valley Elite) won by decision over Emarion Jones (Crosstown Spartan Elite WC) Dec 7-2</li>\n<li>Champ. Round 1 - Christian Gilbert (Elk Grove Junior Grens) won by fall over Phillip Shaw (Lionheart Intense Wrestling) Fall 0:51</li>\n<li>Champ. Round 1 - Abraham Wojcikiewicz (Bulls WC) won by decision over Tyler Martinez (Team 1006 Wrestling) Dec 2-0</li>\n<li>Champ. Round 1 - Tommy Bennett (Redhawk WC/Panther WC) won by tech fall over Sam Siegel (Sycamore WC) TF 21-4</li>\n<li>Champ. Round 1 - Elijah Munoz (Team 1006 Wrestling) won by decision over Tommy McAuliffe (Tinley Park Bulldogs WC) Dec 4-0</li>\n<li>Champ. Round 1 - Henry Goetz (Crystal Lake Wizards) won by decision over Dominic Thebeau (East St. Louis Wrestling) Dec 6-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Ben Butler (Crystal Lake Wizards) won by decision over Fabian Serrano (Elmhurst Jr Dukes WC) Dec 6-2</li>\n<li>Champ. Round 1 - Jack Cummings (North Shore Edge) won by decision over Brandon Theres (Force WC) Dec 4-2</li>\n<li>Champ. Round 1 - Gus Cambier (Sycamore WC) won by fall over Patrick Mooney (Palatine Cobras WC) Fall 2:51</li>\n<li>Champ. Round 1 - Aidan O`Connor (Celtic Elite) won by fall over Ryan Palmeri (Scorpion WC) Fall 0:37</li>\n<li>Champ. Round 1 - William Strelow (Oak Forest Warriors) won by major decision over Fiston Niyogushima (Rock Island WC) Maj 15-5</li>\n<li>Champ. Round 1 - Austin Hale (Granite City Wrestling Association) won by fall over Anthony Zamora (Hoopeston Area WC) Fall 3:30</li>\n<li>Champ. Round 1 - Micheal Brown (Harvey Twisters) won by decision over Kenny Taylor (Aces WC) Dec 12-11</li>\n<li>Champ. Round 1 - Hunter Janeczko (Yorkville WC) won by decision over Jerod Carl (Cumberland Youth WC) Dec 3-2</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Noah Rapinchuk (Downers Grove WC) won by fall over Louden Schnake (Hononegah WC) Fall 1:14</li>\n<li>Champ. Round 1 - Alaynia Bryant (Charleston WC) won by fall over Luca Thies (Jacksonville Area Wrestling) Fall 0:41</li>\n<li>Champ. Round 1 - Andrew Mensendike (The Law) won by fall over Gabriel Orosco (Springfield Capitals Kids WC) Fall 1:08</li>\n<li>Champ. Round 1 - Owen Birkner (Carlyle WC) won by fall over Ethan Morga (Tomcat WC) Fall 1:45</li>\n<li>Champ. Round 1 - Blake Jorgensen (Celtic Elite) won by decision over Benjamin McLaughlin (Waukegan Youth WC) Dec 8-4</li>\n<li>Champ. Round 1 - Vincent McDonald (Little Huskies WC) won by tech fall over James Soliz (Moline WC) TF 19-3</li>\n<li>Champ. Round 1 - Benjamin Alvarez (Team 1006 Wrestling) won by fall over Nickolas Armenta (Notre Dame WC) Fall 0:39</li>\n<li>Champ. Round 1 - Attalia Watson (Crosstown Spartan Elite WC) won by fall over Colin Ashley (Redhawk WC/Panther WC) Fall 1:54</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Michael Rydell (Orland Park Pioneers) won by decision over Nickolas Garantziotis (Crystal Lake Wizards) Dec 6-0</li>\n<li>Champ. Round 1 - David Stewart (Blackhawk WC) won by major decision over Tommy Isitt (Team 1006 Wrestling) Maj 13-2</li>\n<li>Champ. Round 1 - Adrian Guerrero (Martinez Fox Valley Elite) won by decision over Hunter Powell (Force WC) Dec 7-3</li>\n<li>Champ. Round 1 - Jackson Funderburg (Sycamore WC) won by decision over Garrett Tunget (Quincy Cyclones Wrestling) Dec 5-3</li>\n<li>Champ. Round 1 - Montres Reed (Urbana Tigers WC) won by fall over Ayden Salley (Barrington Broncos WC) Fall 1:30</li>\n<li>Champ. Round 1 - Connor Nelligan (Mustang WC) won by fall over Luke Daugherty (Carlinville WC) Fall 3:32</li>\n<li>Champ. Round 1 - Xander Sherwood (The Wrestling Factory) won by decision over Kevin Hale (Murphysboro WC) Dec 1-0</li>\n<li>Champ. Round 1 - Gabino Perez (Morton Little Mustangs) won by decision over Craig Johnson (Danville Chargers) Dec 5-3</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - David Ridges (Fox Valley WC) won by fall over Jackson Barnhart (Champaign WC) Fall 0:29</li>\n<li>Champ. Round 1 - Daniel Cushing (Little Rams Wrestling) won by fall over Quaid Odum (Mt. Vernon Lions WC) Fall 2:38</li>\n<li>Champ. Round 1 - Aaron Hernandez (Pitbull Wrestling Alliance) won by decision over Thomas Roath (SCN Youth WC) Dec 9-5</li>\n<li>Champ. Round 1 - Karson Richardson (Unity Youth WC) won by fall over Anthony Garcia (Badger WC/B.E.T.A.) Fall 0:19</li>\n<li>Champ. Round 1 - Hector Jimenez (The Wrestling Factory) won by fall over Colten Stevens (Yorkville WC) Fall 0:33</li>\n<li>Champ. Round 1 - Eathin Diveley (Red Raiders Wrestling Team) won by fall over Brayden Stumpf (MC Bulldog WC) Fall 0:27</li>\n<li>Champ. Round 1 - Lee Smith (Da WC) won by fall over Hunter Luyando (Sauk Valley WC) Fall 2:24</li>\n<li>Champ. Round 1 - Seth Brooks (Granite City Wrestling Association) won by fall over Owen Birt (St. Joseph Ogden Youth WC) Fall 0:19</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Makya Seibel (Belleville Little Devils WC) won by fall over Jackson Nekolny (Batavia WC) Fall 1:20</li>\n<li>Champ. Round 1 - Justin Thomas (UP Town WC) won by fall over Michael Furlin (Headlock Wrestling Academy) Fall 2:10</li>\n<li>Champ. Round 1 - Jake Ziemniarski (Force WC) won by fall over Sampson Price (Downers Grove WC) Fall 1:56</li>\n<li>Champ. Round 1 - Robert Hooker (O`Fallon Little Panthers WC) won by decision over Justin Bland (Villa-Lombard Cougars) Dec 5-4</li>\n<li>Champ. Round 1 - Tyler Cerny (Red Raiders Wrestling Team) won by fall over Nathaniel Gnaden (Bismarck-Henning Youth WC) Fall 1:11</li>\n<li>Champ. Round 1 - Savage Wates (Rock Island WC) won by fall over Leno Campbell (Harvey Twisters) Fall 0:46</li>\n<li>Champ. Round 1 - Jonathan Gilbert (Maywood Bucs) won by fall over Alexander Stout (Charleston WC) Fall 0:20</li>\n<li>Champ. Round 1 - Braden Hunter (Team 1006 Wrestling) won by fall over Andrew Forcier (Stillman Valley WC) Fall 2:45</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Ryan Clancy (Crosstown Spartan Elite WC) won by fall over Jacob Hurt (Thundercats) Fall 0:53</li>\n<li>Champ. Round 1 - Aidan Avilez (Martinez Fox Valley Elite) won by fall over Shammond Nichols (East St. Louis Wrestling) Fall 1:25</li>\n<li>Champ. Round 1 - Giovanni Amaya (Blackhawk WC) won by major decision over Lucas Armstrong (Peoria Razorbacks WC) Maj 15-1</li>\n<li>Champ. Round 1 - Jordan Lishman (Tomcat WC) won by decision over Aiden Taylor (Carbondale WC) Dec 2-0</li>\n<li>Champ. Round 1 - Eddie Solis (Marengo Youth WC) won by fall over Rodolfo Flores (Little Rams Wrestling) Fall 2:57</li>\n<li>Champ. Round 1 - Isaiah Gonzalez (Izzy Style Wrestling) won by fall over Ricardo Townsend (Lionheart Intense Wrestling) Fall 2:13</li>\n<li>Champ. Round 1 - Camren Stinespring (Storm Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Max Terlap (Libertyville Wildcats WC) won by fall over Wojtek Chrobak (Lemont Bears) Fall 0:20</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Madilyn Hawk (AJ Junior Wildcats WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Isaiah Hill (O`Fallon Little Panthers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Sterling Campbell (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Hayden Shofner (Tiger Town Tanglers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Nathan Alas (Contender Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Noah Carl (Cumberland Youth WC) Fall 1:42</li>\n<li>Champ. Round 1 - Jack Eberhart (O`Fallon Little Panthers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Andre Hunt (Urbana Tigers WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Donny Pigoni (SCN Youth WC) won by decision over Carson Bissey (Olney Cubs WC) Dec 6-1</li>\n<li>Champ. Round 1 - Jacob Venegas (Rock Island WC) won by fall over Evan Parish (Storm Youth WC) Fall 1:49</li>\n<li>Champ. Round 1 - Chase Hampton (Greg Gomez Trained Wrestling) won by decision over Angelo DiPol (TJ Trained-Springfield) Dec 6-3</li>\n<li>Champ. Round 1 - Drew Sadler (AJ Junior Wildcats WC) won in sudden victory - 1 over Ace Christiansen (Tiger Town Tanglers WC) SV-1 5-3</li>\n<li>Champ. Round 1 - Nore Turner (Lincoln-Way WC) won by fall over Brayden Mortell (G2 WC) Fall 0:50</li>\n<li>Champ. Round 1 - Kaden Harman (Golden Eagles WC) won by major decision over Vincent Merola (Gomez Wrestling Academy) Maj 17-4</li>\n<li>Champ. Round 1 - Carter Mikolajczak (Lemont Bears) won by decision over Donald Cannon (Belvidere Bandits WC) Dec 2-0</li>\n<li>Champ. Round 1 - Rocco Hayes (Contender Wrestling) won by decision over Olin Walker (Team 312) Dec 6-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Colin Mccloskey (Z`s Team Pena) won by fall over Trevor Gihring (Granite City Wrestling Association) Fall 3:10</li>\n<li>Champ. Round 1 - Benjamin Davino (SCN Youth WC) won by decision over Luke Berktold (The Wrestling Factory) Dec 5-0</li>\n<li>Champ. Round 1 - Kameron Weddle (SCN Youth WC) won by decision over Dominick Tannler (Roxana Outlaws) Dec 6-0</li>\n<li>Champ. Round 1 - Karter Guzman (Headlock Wrestling Academy) won by fall over Daniel Bychowski (Woodstock Cyclones) Fall 3:31</li>\n<li>Champ. Round 1 - Connor Kidd (TJ Trained) won by decision over Josyah Holland (Harvey Twisters) Dec 8-2</li>\n<li>Champ. Round 1 - Matthew Soltis (Lincoln-Way WC) won by fall over Talan Gredy-Nelson (Hoopeston Area WC) Fall 1:55</li>\n<li>Champ. Round 1 - Ty Edwards (Team 1006 Wrestling) won by major decision over Carter Chambliss (Storm Youth WC) Maj 12-0</li>\n<li>Champ. Round 1 - Max Siegel (Tinley Park Bulldogs WC) won by major decision over Luke Burgess (Wheaton Warrenville Tiger WC) Maj 15-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Raymond Cavey (SCN Youth WC) won by fall over Tony Keene (Gladiator Elite) Fall 1:57</li>\n<li>Champ. Round 1 - Shay Korhorn (Force WC) won by major decision over Jovan Williams (Harvey Twisters) Maj 8-0</li>\n<li>Champ. Round 1 - Trevor Silzer (Tinley Park Bulldogs WC) won by major decision over Sean Berger (Elmhurst Jr Dukes WC) Maj 13-0</li>\n<li>Champ. Round 1 - Joey Malito (Celtic Elite) won by decision over Mason Tieffel (Gladiator Elite) Dec 7-4</li>\n<li>Champ. Round 1 - William Baysingar (Arlington Cardinals WC) won by major decision over Devin Lozdoski (Harlem Cougars WC) Maj 11-1</li>\n<li>Champ. Round 1 - Ryder Janeczko (Yorkville WC) won by decision over Kaden Inman (Hoopeston Area WC) Dec 4-3</li>\n<li>Champ. Round 1 - Christian Favia (Gomez Wrestling Academy) won by decision over Avery Speck (TJ Trained) Dec 6-2</li>\n<li>Champ. Round 1 - Peyton Cox (Champaign WC) won by decision over T.J. Silva (Da WC) Dec 11-6</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Israel Quintanilla (Evolution Wrestling Institute) won by decision over Gabriel Kristiansen (Carbondale WC) Dec 7-5</li>\n<li>Champ. Round 1 - Jason Shaw (Roxana Outlaws) won by fall over Brant Kirby (Oak Forest Warriors) Fall 4:26</li>\n<li>Champ. Round 1 - Griffin Duffin (Mustang WC) won by major decision over Jeffrey Zofkie (Batavia WC) Maj 12-0</li>\n<li>Champ. Round 1 - Jesse Hahs (Herrin Jr WC) won by major decision over Jack Vulich (Redhawk WC/Panther WC) Maj 10-0</li>\n<li>Champ. Round 1 - Gavin Ranquist (Headlock Wrestling Academy) won by decision over Samuel Ohl (Metamora Kids WC) Dec 4-1</li>\n<li>Champ. Round 1 - Logan Kuhel-trimmer (Force WC) won by fall over Ethan Wilk (Hononegah WC) Fall 0:24</li>\n<li>Champ. Round 1 - Maddux Mordick (Dakota WC) won by fall over Hunter Pavia (Team 1006 Wrestling) Fall 1:08</li>\n<li>Champ. Round 1 - Daniel Sheen (Izzy Style Wrestling) won by fall over Jacob Gliva (Contender Wrestling) Fall 0:33</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Justin Warmowski (Fox Lake WC) won by fall over Matthew Poniatowski (Martinez Fox Valley Elite) Fall 4:26</li>\n<li>Champ. Round 1 - Joseph McDermott (Force WC) won by major decision over Ryan Koelblinger (Wolves WC) Maj 10-0</li>\n<li>Champ. Round 1 - Joseph Knapp (Brawlers WC) won by major decision over Ethan Rood (Dakota WC) Maj 10-0</li>\n<li>Champ. Round 1 - Thomas Porter (Naperville WC) won in sudden victory - 1 over Bryce Fiegel (Crystal Lake Wizards) SV-1 6-4</li>\n<li>Champ. Round 1 - Connor Surtin (Edwardsville WC) won by fall over Henry Coughlin (Tinley Park Bulldogs WC) Fall 4:08</li>\n<li>Champ. Round 1 - Kai Neumark (Arlington Cardinals WC) won by fall over Greg Mann (Mendota Mat Masters) Fall 2:30</li>\n<li>Champ. Round 1 - Tyler Bentley (Lemont Bears) won by decision over Ashton Rice (Super Soldiers WC) Dec 6-2</li>\n<li>Champ. Round 1 - Housten Armbruster (Bulls WC) won by fall over Joel Jankowski (Team 312) Fall 1:59</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Maxwell Sztuk (St. Charles WC) won by fall over Paris Lewis (Edwardsville WC) Fall 3:52</li>\n<li>Champ. Round 1 - Julian Gonzalez (Team 1006 Wrestling) won by fall over Drew Lehn (The Wrestling Factory) Fall 2:57</li>\n<li>Champ. Round 1 - Jimmy Espinoza (Glenbard East Jr Rams WC) won by decision over Lennon Steinkuehler (Arlington Cardinals WC) Dec 9-6</li>\n<li>Champ. Round 1 - Jonathan Chaidez (Headlock Wrestling Academy) won by fall over Matthew Harris (Tiger Town Tanglers WC) Fall 3:40</li>\n<li>Champ. Round 1 - Jack Finnegan (Force WC) won by decision over Donovan Crumpacker (Stillman Valley WC) Dec 4-3</li>\n<li>Champ. Round 1 - Caleb Tyus (Bulls WC) won by fall over Connor Nagela (Little Huskies WC) Fall 2:23</li>\n<li>Champ. Round 1 - Scottt Burke (Crystal Lake Wizards) won by decision over Jarek Wehrle (Vandalia Jr WC) Dec 12-6</li>\n<li>Champ. Round 1 - Blain Christie (Brawlers WC) won by decision over Joe Roti (Tinley Park Bulldogs WC) Dec 8-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Alex Ventimilla (Martinez Fox Valley Elite) won by major decision over Noel Rosales (Redhawk WC/Panther WC) Maj 8-0</li>\n<li>Champ. Round 1 - Hayden Halter (The Wrestling Factory) won by tech fall over Brennden Cobine (Roxana Outlaws) TF 18-2</li>\n<li>Champ. Round 1 - Kenyon Boyce (Harvey Twisters) won by major decision over Colin Day (Force WC) Maj 13-3</li>\n<li>Champ. Round 1 - Michael D`orazio (SCN Youth WC) won by decision over Jack Barracca (Gomez Wrestling Academy) Dec 8-1</li>\n<li>Champ. Round 1 - Dylan Gvillo (Edwardsville WC) won by decision over Tyler Simmer (Dakota WC) Dec 4-2</li>\n<li>Champ. Round 1 - Bryce Claypool (Team 1006 Wrestling) won by decision over Gabriel Hinkle (Celtic Elite) Dec 2-1</li>\n<li>Champ. Round 1 - Dayton Hall (Aces WC) won by decision over Jack McClimon (Celtic Elite) Dec 9-4</li>\n<li>Champ. Round 1 - Felippe Willis (Peoria Razorbacks WC) won by fall over Marey Roby (The Law) Fall 3:58</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Connor Speck (TJ Trained) won by decision over Mia Palumbo (Mean Green Machine) Dec 2-0</li>\n<li>Champ. Round 1 - Andrew Perez (Hinsdale Red Devil WC) won by major decision over Connor Linthicum (Celtic Elite) Maj 12-0</li>\n<li>Champ. Round 1 - Jake Tanquilut (Tinley Park Bulldogs WC) won by fall over Elon Rodriguez (Martinez Fox Valley Elite) Fall 4:29</li>\n<li>Champ. Round 1 - Andrew Burkeybile (Moline WC) won in sudden victory - 1 over Michael Yario (Celtic Elite) SV-1 3-1</li>\n<li>Champ. Round 1 - Nick Kotiw (Champaign WC) won by decision over Jake Ridle (Golden Eagles WC) Dec 7-0</li>\n<li>Champ. Round 1 - Zach Lemp (Villa-Lombard Cougars) won by major decision over William Dahm (Belleville Little Devils WC) Maj 12-0</li>\n<li>Champ. Round 1 - Patrick Curran (Gomez Wrestling Academy) won by fall over Anterrius Turner (Storm Youth WC) Fall 2:18</li>\n<li>Champ. Round 1 - Gannen Kane (Junior Kahoks) won by major decision over Hayden Faworski (Xtreme WC) Maj 13-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Ryan Scott (Fox Valley WC) won by decision over Simon Rillie (Stockton Renegades) Dec 10-6</li>\n<li>Champ. Round 1 - Jeremy Jakowitsch (Barrington Broncos WC) won in tie breaker - 1 over Zack Rotkvich (Redhawk WC/Panther WC) TB-1 5-4</li>\n<li>Champ. Round 1 - Will Collins (North Shore Edge) won by tech fall over Moses Quintana (Blackhawk WC) TF 16-0</li>\n<li>Champ. Round 1 - Tyler Milani (Tinley Park Bulldogs WC) won by decision over Lucas Sutherland (Dakota WC) Dec 7-4</li>\n<li>Champ. Round 1 - Melvin Rogers (East St. Louis Wrestling) won by fall over Michael Gentile (Contender Wrestling) Fall 1:18</li>\n<li>Champ. Round 1 - Billy Taylor (Junior Pioneer WC) won by fall over Jesse Stewart (Springfield Capitals Kids WC) Fall 2:39</li>\n<li>Champ. Round 1 - Dustin Kozlowski (Celtic Elite) won by decision over Connor Hutson (Storm Youth WC) Dec 1-0</li>\n<li>Champ. Round 1 - Andrew Johnson (Team 1006 Wrestling) won by decision over Maxon Karnes (Edwardsville WC) Dec 4-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Mason Wilke (Edwardsville WC) won in sudden victory - 1 over Paul Murphy-Hoff (Villa-Lombard Cougars) SV-1 2-0</li>\n<li>Champ. Round 1 - Riley Woods (Batavia WC) won by major decision over David Dierickx (Junior Pioneer WC) Maj 13-4</li>\n<li>Champ. Round 1 - Bryce Boumans (Fox Valley WC) won by fall over Kyler Kradle (Gomez Wrestling Academy) Fall 4:22</li>\n<li>Champ. Round 1 - Anthony Cantu (Team 1006 Wrestling) won by injury default over Kaleb Neuwirth (O`Fallon Little Panthers WC) Inj. 1:30</li>\n<li>Champ. Round 1 - Jack Villarreal (Lions WC) won by decision over Zacary Sutton (Junior Porters WC) Dec 8-2</li>\n<li>Champ. Round 1 - Shane Moran (Crystal Lake Wizards) won by decision over Tomas Reed (Storm Youth WC) Dec 6-2</li>\n<li>Champ. Round 1 - Quinton Heilemeier (Dakota WC) won by fall over David Schied (Redhawk WC/Panther WC) Fall 1:21</li>\n<li>Champ. Round 1 - Michael Rodriguez (Contender Wrestling) won by major decision over Rashon Allen (Urbana Tigers WC) Maj 8-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Damien Lopez (Martinez Fox Valley Elite) won in tie breaker - 1 over Caden Ernd (The Wrestling Factory) TB-1 7-5</li>\n<li>Champ. Round 1 - Donovan Golden (Brawlers WC) won by major decision over Elisio Perez (Lionheart Intense Wrestling) Maj 13-0</li>\n<li>Champ. Round 1 - Raymond Arebalo (Crosstown Spartan Elite WC) won by decision over Joshua Dorr (Greg Gomez Trained Wrestling) Dec 7-2</li>\n<li>Champ. Round 1 - Grant Hansen (Maddog Wrestling Academy) won by fall over Joseph Kisting (Saber WC) Fall 2:44</li>\n<li>Champ. Round 1 - Lucas Daly (Carbondale WC) won by decision over Noe Marrero (Team 1006 Wrestling) Dec 3-2</li>\n<li>Champ. Round 1 - Raymond Hernandez (Little Huskies WC) won by decision over Tanner Kalkbrenner (The Law) Dec 11-4</li>\n<li>Champ. Round 1 - Logan Fitz (Metamora Kids WC) won by decision over Trevor Griffin (Tinley Park Bulldogs WC) Dec 5-3</li>\n<li>Champ. Round 1 - Case Harmston (Stockton Renegades) won in sudden victory - 2 over Nathan Critchfield (Aces WC) SV-2 7-6</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Kennedy Blades (Martinez Fox Valley Elite) won by major decision over Marshal Cunz (Harlem Cougars WC) Maj 11-0</li>\n<li>Champ. Round 1 - Brody Roth (North Shore Edge) won by fall over Mason Pierceall (Force WC) Fall 1:03</li>\n<li>Champ. Round 1 - Austin Abitua (Da WC) won by fall over Kobe Gilbert (Elk Grove Junior Grens) Fall 2:15</li>\n<li>Champ. Round 1 - Buddy Evangelista (Greg Gomez Trained Wrestling) won by fall over Aidan Kyllonen (Brawlers WC) Fall 1:15</li>\n<li>Champ. Round 1 - Tony Pacetti (Redhawk WC/Panther WC) won by decision over Mack Mulvany (Young Guns) Dec 6-0</li>\n<li>Champ. Round 1 - Robert Carter (Granite City Wrestling Association) won by fall over Michael Koenig (Pontiac WC) Fall 1:13</li>\n<li>Champ. Round 1 - William White (Mt. Vernon Lions WC) won by tech fall over Colby Cline (Beat the Streets-Chicago) TF 19-3</li>\n<li>Champ. Round 1 - Cole Pradel (Team 1006 Wrestling) won by fall over John McKeon (Mustang WC) Fall 2:03</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Adrian Corral (Blackhawk WC) won by decision over Mason Engelkens (Stillman Valley WC) Dec 12-6</li>\n<li>Champ. Round 1 - Adrian McDougle (Bulls WC) won by fall over Tyler Thompson (Charleston WC) Fall 2:03</li>\n<li>Champ. Round 1 - Kaden Randazzo (Crystal Lake Wizards) won by decision over Aidan Roberts (Golden Eagles WC) Dec 2-0</li>\n<li>Champ. Round 1 - Elijah Chiaro (SCN Youth WC) won by decision over Chase Overton (Team Mascoutah WC) Dec 4-2</li>\n<li>Champ. Round 1 - Christopher Worcester (Villa-Lombard Cougars) won by decision over Ethan Pitts (Lincoln-Way WC) Dec 5-2</li>\n<li>Champ. Round 1 - Jayrid Stoltz (Peoria Razorbacks WC) won by decision over Tyler Coyle (Mustang WC) Dec 3-0</li>\n<li>Champ. Round 1 - Kayden Kleckner (Yorkville WC) won by fall over Kieran Pavlat (Chicago Park District) Fall 2:11</li>\n<li>Champ. Round 1 - Noah Lukosius (Force WC) won by decision over Stacey Terry (Harvey Twisters) Dec 5-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Aidan Nardin (Dakota WC) won by fall over Rylan Poole (LP Crunching Cavs) Fall 1:14</li>\n<li>Champ. Round 1 - Brenden Gran (Scorpion WC) won by decision over Tyler Haynes (Pekin Boys &amp; Girls Club) Dec 7-3</li>\n<li>Champ. Round 1 - Nathan Pappas (Fox Valley WC) won by fall over Gavin Trost (Minooka Indians Elite) Fall 1:18</li>\n<li>Champ. Round 1 - Parker Bernabe (Harlem Cougars WC) won by fall over Connor Barnes (Peoria Heights Minutemen WC) Fall 2:31</li>\n<li>Champ. Round 1 - Joey Gaskill (Elk Grove Junior Grens) won in sudden victory - 1 over Jack Hartman (Barrington Broncos WC) SV-1 2-1</li>\n<li>Champ. Round 1 - Ramel Lee (Beat the Streets-Chicago) won by fall over Landon Vaugniaux (Edwardsville WC) Fall 0:23</li>\n<li>Champ. Round 1 - Ricardo Salinas (Evanston School of Wrestling) won by major decision over Nicholas Eby (Crawford County WC) Maj 9-0</li>\n<li>Champ. Round 1 - Omarion Dixon (Panther WC) won by fall over Pate Eastin (Unity Youth WC) Fall 2:10</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Michael Roath (SCN Youth WC) won by fall over Vinny Cafazza (Bulls WC) Fall 2:11</li>\n<li>Champ. Round 1 - Elliott Lewis (Tinley Park Bulldogs WC) won by fall over Gavin Jones (Bolingbrook Junior Raiders) Fall 1:08</li>\n<li>Champ. Round 1 - Ajay Williams (Crosstown Spartan Elite WC) won by decision over Caleb Yu (Naperville Hammer Huskies) Dec 10-5</li>\n<li>Champ. Round 1 - Javontay Bright (Maywood Bucs) won by fall over Korbyn Roque (St. Joseph Ogden Youth WC) Fall 0:13</li>\n<li>Champ. Round 1 - Sean Swinkle (Notre Dame WC) won by fall over Ethan Patterson (Illini Bluffs Kids WC) Fall 3:27</li>\n<li>Champ. Round 1 - Antonio Figueroa (Hononegah WC) won by decision over Kylen Rose (Roxana Outlaws) Dec 8-2</li>\n<li>Champ. Round 1 - Payton Cardin (Metamora Kids WC) won by decision over Dylan Shuman (Sycamore WC) Dec 4-1</li>\n<li>Champ. Round 1 - James Clancy (Team 312) won by decision over Keyton Mitchell (Carlyle WC) Dec 3-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Mason Ahlers (Edwardsville WC) won by fall over David Sanchez (Tomcat WC) Fall 0:56</li>\n<li>Champ. Round 1 - Kyle Franklin (Gomez Wrestling Academy) won by decision over Daniel Hipolito (Force WC) Dec 9-8</li>\n<li>Champ. Round 1 - Ison Robinson (Bolingbrook Junior Raiders) won by fall over Syncere Arroyo (Martinez Fox Valley Elite) Fall 2:14</li>\n<li>Champ. Round 1 - Jacob Morel (Pitbull Wrestling Alliance) won by decision over Riley Elam (Belleville Little Devils WC) Dec 3-2</li>\n<li>Champ. Round 1 - Lou Gaddy (Crystal Lake Wizards) won by fall over Jacob Plohr (Team No Ego WC) Fall 2:08</li>\n<li>Champ. Round 1 - Jaxon Lambrigger (Tinley Park Bulldogs WC) won by fall over Ethan Turner (Thundercats) Fall 2:59</li>\n<li>Champ. Round 1 - Lucas Quinlan (Oak Forest Warriors) won by major decision over Benjamin Sylvester (Thundercats) Maj 10-2</li>\n<li>Champ. Round 1 - Dalton Riggle (Dakota WC) won by fall over Nicholas Heise (Mendota Mat Masters) Fall 3:56</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Lucas Smith (Super Soldiers WC) won by decision over Jacob Rott (Celtic Elite) Dec 4-3</li>\n<li>Champ. Round 1 - Brock Donati (St. Charles WC) won by fall over Joseph Korasick (Edwardsville WC) Fall 2:08</li>\n<li>Champ. Round 1 - Alexander Aguirre (Martinez Fox Valley Elite) won by fall over Jonas Ortiz (Champbuilders Wrestling) Fall 1:46</li>\n<li>Champ. Round 1 - Da`Marion Sanders (Will County Warriors) won by decision over Tiler Worker (Vandalia Jr WC) Dec 11-5</li>\n<li>Champ. Round 1 - Louie Cretsinger (Xtreme WC) won by fall over Kenneth Regnier (Notre Dame WC) Fall 1:22</li>\n<li>Champ. Round 1 - Michael Williams (Rambler WC) won by decision over Dane Tsao (Naperville Hammer Huskies) Dec 6-0</li>\n<li>Champ. Round 1 - Jordon Paisley (Stockton Renegades) won by fall over Jose Castro (Thundercats) Fall 0:40</li>\n<li>Champ. Round 1 - Nicholas Lopez (Tinley Park Bulldogs WC) won by fall over Lawrence Hernandez (Junior Cougar WC) Fall 1:20</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Ethan Pike (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jack Bostick (Edwardsville WC) won by fall over Tyler Thrush (LP Crunching Cavs) Fall 1:17</li>\n<li>Champ. Round 1 - Kyle Smith (Edwardsville WC) won by fall over Luke Grage (Oak Forest Warriors) Fall 0:51</li>\n<li>Champ. Round 1 - Aydan Trueblood (TJ Trained) received a bye   () Bye</li>\n<li>Champ. Round 1 - Gabriel Taylor (Mt. Vernon Lions WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Tyler Lorden (LP Crunching Cavs) won by fall over Garrette Franks (Aces WC) Fall 2:33</li>\n<li>Champ. Round 1 - Gavin Mouser (Vandalia Jr WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Joshua Shoulders (Olney Cubs WC) won by fall over Kevin Rahn (Hoopeston Area WC) Fall 1:43</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Cole Michna (Metamora Kids WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jamison VanVickle (Oakwood Youth WC) won by decision over Connor Runnells (North Boone WC) Dec 9-3</li>\n<li>Champ. Round 1 - Zachary Barlev (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Laron Reed (Danville Chargers) received a bye   () Bye</li>\n<li>Champ. Round 1 - Andre Naydenov (The Wrestling Factory) received a bye   () Bye</li>\n<li>Champ. Round 1 - Malachi Jennings (Crosstown Spartan Elite WC) won by fall over Kyle Boughan (Olney Cubs WC) Fall 1:18</li>\n<li>Champ. Round 1 - Chase Freitag (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Kyle Johnson (Will County Warriors) won by fall over Andrew Foutch (Carlyle WC) Fall 2:50</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Andrew Kaltmayer (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Dreyden Shelton (Urbana Tigers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Cory Woods (Crawford County WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Dontae Jackson (East St. Louis Wrestling) won by decision over J Guido Pigoni (SCN Youth WC) Dec 2-0</li>\n<li>Champ. Round 1 - Brandon Weber (Contender Wrestling) won by decision over Cooper Mikolajczak (Lemont Bears) Dec 1-0</li>\n<li>Champ. Round 1 - Henry Locker (Downers Grove WC) won by decision over Matthew Starzyk (Mustang WC) Dec 5-4</li>\n<li>Champ. Round 1 - Lauden Edwards (Villa-Lombard Cougars) won by decision over Jack Summers (Edwardsville WC) Dec 5-3</li>\n<li>Champ. Round 1 - Maddox Khalimsky (Arlington Cardinals WC) won by major decision over David-Joseph Rice (Belvidere Bandits WC) Maj 9-0</li>\n<li>Champ. Round 1 - Chance Arlt-Seip (Triad Little Knights WC) won by major decision over Kalob Hunt (Midwest Central Youth WC) Maj 10-2</li>\n<li>Champ. Round 1 - Caelan Riley (The Wrestling Factory) won by major decision over Dalton Nimrick (Junior Pioneer WC) Maj 12-2</li>\n<li>Champ. Round 1 - Alex Hadzima (SCN Youth WC) won in tie breaker - 1 over Stevie Granat (G2 WC) TB-1 3-2</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Antonio Alvarado (Crystal Lake Wizards) won by fall over Tyler Aters (Martinez Fox Valley Elite) Fall 3:33</li>\n<li>Champ. Round 2 - Cody Tavoso (Force WC) won by major decision over Liam Fox (Murphysboro WC) Maj 8-0</li>\n<li>Champ. Round 2 - Alexander Marre (Gomez Wrestling Academy) won by decision over Sean Larkin (Redhawk WC/Panther WC) Dec 4-0</li>\n<li>Champ. Round 2 - Carter Rude (Sauk Valley WC) won by decision over Jake Schwartz (Carlinville WC) Dec 4-1</li>\n<li>Champ. Round 2 - Jackson Smith (Lemont Bears) won by fall over Isaac Thomas (TJ Trained) Fall 0:44</li>\n<li>Champ. Round 2 - Bryce Griffin (Bulls WC) won by major decision over Tyler Evans (Wolves WC) Maj 14-3</li>\n<li>Champ. Round 2 - Colin Young (Da WC) won by major decision over Reef Pacot (Storm Youth WC) Maj 11-0</li>\n<li>Champ. Round 2 - Saul Trejo (Gomez Wrestling Academy) won by major decision over Collin Carrigan (Naperville WC) Maj 13-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Aidan Huck (Batavia WC) won by fall over Edmund Enright (Mustang WC) Fall 2:11</li>\n<li>Champ. Round 2 - Santino Robinson (Wrestling 365) won by decision over Renzo Morgan (The Wrestling Factory) Dec 7-1</li>\n<li>Champ. Round 2 - Christopher Moore (Crystal Lake Wizards) won by decision over Caleb Nobiling (Lakeland Predators WC) Dec 4-2</li>\n<li>Champ. Round 2 - Mason Alessio (Celtic Elite) won by decision over Brendan Tunink (Sauk Valley WC) Dec 9-6</li>\n<li>Champ. Round 2 - Tyler Guerra (Gomez Wrestling Academy) won by fall over Karsten Nordlie (Hononegah WC) Fall 2:11</li>\n<li>Champ. Round 2 - Noah Manuel Tapia (Young Guns) won by decision over Sam Schuit (Lemont Bears) Dec 2-0</li>\n<li>Champ. Round 2 - Dillon Carlson (Crystal Lake Wizards) won by fall over Marquan Shaw (Lionheart Intense Wrestling) Fall 4:26</li>\n<li>Champ. Round 2 - Evan Schiffman (Lemont Bears) won by major decision over Santino Scolaro (SCN Youth WC) Maj 8-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Matthew Hollingsworth (Lincoln-Way WC) won by fall over Brandon Krier (Martinez Fox Valley Elite) Fall 4:19</li>\n<li>Champ. Round 2 - Kannon Webster (Super Soldiers WC) won by fall over Daniel Aguilar (Gomez Wrestling Academy) Fall 3:14</li>\n<li>Champ. Round 2 - Garrett Luke (Stockton Renegades) won by fall over Dimitrios Lalezas (Lemont Bears) Fall 3:45</li>\n<li>Champ. Round 2 - Michael Calcagno (Izzy Style Wrestling) won by fall over Bradden Davis (Mt. Vernon Lions WC) Fall 1:02</li>\n<li>Champ. Round 2 - David Mayora (Izzy Style Wrestling) won by fall over Jacob Jensen (Crystal Lake Wizards) Fall 4:00</li>\n<li>Champ. Round 2 - Cajaun Johnson (Urbana Tigers WC) won by decision over Logan Swaw (Team 1006 Wrestling) Dec 3-0</li>\n<li>Champ. Round 2 - Nasir Bailey (Harvey Twisters) won by decision over Jacob Macatangay (Force WC) Dec 5-1</li>\n<li>Champ. Round 2 - David Williams (Martinez Fox Valley Elite) won by decision over Joseph Griffin (Team 1006 Wrestling) Dec 5-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Joe Mushinsky (TJ Trained) won by decision over Ethan Struck (Crystal Lake Wizards) Dec 4-3</li>\n<li>Champ. Round 2 - Arojae Hart (AJ Junior Wildcats WC) won by decision over Luke Christie (Brawlers WC) Dec 3-0</li>\n<li>Champ. Round 2 - Joseph Fernau (Izzy Style Wrestling) won by fall over Nate Pacetti (Redhawk WC/Panther WC) Fall 2:01</li>\n<li>Champ. Round 2 - Brac Hooper (Champaign WC) won by decision over Michael Jabaay (Contender Wrestling) Dec 7-1</li>\n<li>Champ. Round 2 - Cole Peters (TJ Trained-Springfield) won by major decision over Damen Michicich (Contender Wrestling) Maj 12-1</li>\n<li>Champ. Round 2 - Dominik Mallinder (Izzy Style Wrestling) won by decision over Jackson Gillen (Team 1006 Wrestling) Dec 7-0</li>\n<li>Champ. Round 2 - Damari Reed (Harvey Twisters) won by major decision over Jayden Colon (Gomez Wrestling Academy) Maj 11-2</li>\n<li>Champ. Round 2 - Austin Bauer (Edwardsville WC) won by decision over Michael Phillips (SCN Youth WC) Dec 6-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Ethan Stiles (Izzy Style Wrestling) won by major decision over Nick Mabutas (Glenbard East Jr Rams WC) Maj 11-2</li>\n<li>Champ. Round 2 - Jake Zator (Lemont Bears) won by fall over Hunter Milam (Pontiac WC) Fall 1:05</li>\n<li>Champ. Round 2 - Jordan Blew (Force WC) won by decision over Colin Kelly (Tinley Park Bulldogs WC) Dec 6-1</li>\n<li>Champ. Round 2 - Will Rude (Sauk Valley WC) won by decision over Zackary Crawford (Sycamore WC) Dec 6-2</li>\n<li>Champ. Round 2 - Jack Seacrist (Belvidere Bandits WC) won by fall over Joseph Lashuay (Storm Youth WC) Fall 3:20</li>\n<li>Champ. Round 2 - Grover Mays (Gladiator Elite) won by decision over Anthony Montez (Junior Pioneer WC) Dec 7-2</li>\n<li>Champ. Round 2 - Vincent Robinson (Harvey Twisters) won by decision over Carlos Munoz-Flores (Team 1006 Wrestling) Dec 10-4</li>\n<li>Champ. Round 2 - Tyler Perry (Batavia WC) won by decision over Shane Carr (Izzy Style Wrestling) Dec 4-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Franklin (UP Town WC) won by tech fall over Luke Schultz (O`Fallon Little Panthers WC) TF 15-0</li>\n<li>Champ. Round 2 - Jalen Curtis (Greg Gomez Trained Wrestling) won by decision over Nicholas Nosler (Unity Youth WC) Dec 2-1</li>\n<li>Champ. Round 2 - Dylan Sayles (Hononegah WC) won in tie breaker - 1 over Jack Smialowicz (Pitbull Wrestling Alliance) TB-1 4-3</li>\n<li>Champ. Round 2 - Michael Kelly (Tinley Park Bulldogs WC) won by decision over Tyler Casey (TJ Trained) Dec 5-2</li>\n<li>Champ. Round 2 - Braulio Flores (Team 1006 Wrestling) won by fall over Thomas Boland (Redhawk WC/Panther WC) Fall 1:27</li>\n<li>Champ. Round 2 - Hunter Travis (Pontiac WC) won in sudden victory - 1 over Dayton Hoffman (Murphysboro WC) SV-1 4-2</li>\n<li>Champ. Round 2 - Joseph Olalde (Gomez Wrestling Academy) won by fall over Billy Lindsey (Oak Forest Warriors) Fall 2:14</li>\n<li>Champ. Round 2 - Cruz Ibarra (Martinez Fox Valley Elite) won by decision over Alexis Janiak (Force WC) Dec 2-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Ryder Hunkins (Crystal Lake Wizards) won by fall over Aaron Perez (Hinsdale Red Devil WC) Fall 3:15</li>\n<li>Champ. Round 2 - Aj Heeg (Lemont Bears) won by fall over Tyrin Newsome (Urbana Tigers WC) Fall 3:58</li>\n<li>Champ. Round 2 - Kole Brower (Moline WC) won by fall over Aidan Linden (Martinez Fox Valley Elite) Fall 2:58</li>\n<li>Champ. Round 2 - Alexander Miranda (Bulls WC) won by fall over Christian Gilbert (Elk Grove Junior Grens) Fall 4:18</li>\n<li>Champ. Round 2 - Abraham Wojcikiewicz (Bulls WC) won by decision over Demetrius DeShazer (Minooka Indians Elite) Dec 3-0</li>\n<li>Champ. Round 2 - Tavius Hosley (Unity Youth WC) won by fall over Tommy Bennett (Redhawk WC/Panther WC) Fall 0:52</li>\n<li>Champ. Round 2 - Elijah Munoz (Team 1006 Wrestling) won by decision over Gaetano Console (Barrington Broncos WC) Dec 5-0</li>\n<li>Champ. Round 2 - Jack Lesher (SCN Youth WC) won by decision over Henry Goetz (Crystal Lake Wizards) Dec 6-5</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Zane Timon (Team Mascoutah WC) won by decision over Ben Butler (Crystal Lake Wizards) Dec 6-1</li>\n<li>Champ. Round 2 - Jack Cummings (North Shore Edge) won by decision over Jacob Dobbins (Saber WC) Dec 6-2</li>\n<li>Champ. Round 2 - Gus Cambier (Sycamore WC) won by decision over Robert Gonzalez (Team 1006 Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Aidan O`Connor (Celtic Elite) won by fall over Charles Koeppen (Redhawk WC/Panther WC) Fall 3:38</li>\n<li>Champ. Round 2 - Jared Gumila (Force WC) won by fall over William Strelow (Oak Forest Warriors) Fall 0:22</li>\n<li>Champ. Round 2 - Patrick Williams (Junior Cougar WC) won by fall over Austin Hale (Granite City Wrestling Association) Fall 2:47</li>\n<li>Champ. Round 2 - Colton Madura (Crystal Lake Wizards) won by fall over Micheal Brown (Harvey Twisters) Fall 2:07</li>\n<li>Champ. Round 2 - Hunter Janeczko (Yorkville WC) won by decision over Anthony Verges (Scorpion WC) Dec 4-2</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Elijah Lee (Peoria Razorbacks WC) won by decision over Noah Rapinchuk (Downers Grove WC) Dec 1-0</li>\n<li>Champ. Round 2 - Owen Jacobson (Epic Wrestling) won by fall over Alaynia Bryant (Charleston WC) Fall 3:37</li>\n<li>Champ. Round 2 - Andrew Mensendike (The Law) won by decision over J.C. Piker (Brawlers WC) Dec 12-9</li>\n<li>Champ. Round 2 - Braden Stauffenberg (Izzy Style Wrestling) won by fall over Owen Birkner (Carlyle WC) Fall 0:48</li>\n<li>Champ. Round 2 - Blake Jorgensen (Celtic Elite) won by major decision over James Herring (Roxana Outlaws) Maj 18-4</li>\n<li>Champ. Round 2 - Vincent McDonald (Little Huskies WC) won by fall over Calvin Hempel (Storm Youth WC) Fall 2:26</li>\n<li>Champ. Round 2 - Mannix Faworski (Xtreme WC) won by decision over Benjamin Alvarez (Team 1006 Wrestling) Dec 7-0</li>\n<li>Champ. Round 2 - Bradley Gillum (Martinez Fox Valley Elite) won by fall over Attalia Watson (Crosstown Spartan Elite WC) Fall 0:39</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Colby Loftsgaard (Urbana Tigers WC) won by fall over Michael Rydell (Orland Park Pioneers) Fall 1:02</li>\n<li>Champ. Round 2 - Cole Brannigan (Lemont Bears) won in tie breaker - 1 over David Stewart (Blackhawk WC) TB-1 4-3</li>\n<li>Champ. Round 2 - Moisey Trimble (Belleville Little Devils WC) won by fall over Adrian Guerrero (Martinez Fox Valley Elite) Fall 2:49</li>\n<li>Champ. Round 2 - Michael Mosier (Barrington Broncos WC) won by fall over Jackson Funderburg (Sycamore WC) Fall 0:32</li>\n<li>Champ. Round 2 - Montres Reed (Urbana Tigers WC) won by fall over Owen Keenan (Metamora Kids WC) Fall 1:03</li>\n<li>Champ. Round 2 - Connor Nelligan (Mustang WC) won by fall over Osiris Lenker (Sycamore WC) Fall 4:10</li>\n<li>Champ. Round 2 - Liam McDermott (Celtic Elite) won by decision over Xander Sherwood (The Wrestling Factory) Dec 4-0</li>\n<li>Champ. Round 2 - Jacob Bottarini (SCN Youth WC) won by fall over Gabino Perez (Morton Little Mustangs) Fall 3:18</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Armond Edwards (O`Fallon Little Panthers WC) won by fall over David Ridges (Fox Valley WC) Fall 1:29</li>\n<li>Champ. Round 2 - Braeden Tosterud (Elk Grove Junior Grens) won by fall over Daniel Cushing (Little Rams Wrestling) Fall 0:13</li>\n<li>Champ. Round 2 - Gavin Mason (Team 1006 Wrestling) won by fall over Aaron Hernandez (Pitbull Wrestling Alliance) Fall 2:12</li>\n<li>Champ. Round 2 - Jokiah Sewell (Hawk WC) won by fall over Karson Richardson (Unity Youth WC) Fall 2:06</li>\n<li>Champ. Round 2 - Hector Jimenez (The Wrestling Factory) won by fall over Bryson Foley (Unity Youth WC) Fall 2:36</li>\n<li>Champ. Round 2 - Eathin Diveley (Red Raiders Wrestling Team) won by decision over Tyler Wilms (Lemont Bears) Dec 6-0</li>\n<li>Champ. Round 2 - Lee Smith (Da WC) won by fall over Tyler Michelini (Elk Grove Junior Grens) Fall 3:00</li>\n<li>Champ. Round 2 - Seth Brooks (Granite City Wrestling Association) won in tie breaker - 1 over Jack Brozny (Batavia WC) TB-1 11-6</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Connor Lorden (LP Crunching Cavs) won by fall over Makya Seibel (Belleville Little Devils WC) Fall 0:36</li>\n<li>Champ. Round 2 - Nathaniel Dutkin (Wolves WC) won by fall over Justin Thomas (UP Town WC) Fall 1:25</li>\n<li>Champ. Round 2 - Rylee Edwards (Storm Youth WC) won by fall over Jake Ziemniarski (Force WC) Fall 2:24</li>\n<li>Champ. Round 2 - Jadon Mims (Maywood Bucs) won by fall over Robert Hooker (O`Fallon Little Panthers WC) Fall 0:56</li>\n<li>Champ. Round 2 - Tyler Cerny (Red Raiders Wrestling Team) won by decision over Michael Bridgeman (Roxana Outlaws) Dec 4-2</li>\n<li>Champ. Round 2 - Savage Wates (Rock Island WC) won by fall over Aodan O`Sullivan (Notre Dame WC) Fall 0:26</li>\n<li>Champ. Round 2 - Khamari Jones (Crosstown Spartan Elite WC) won by fall over Jonathan Gilbert (Maywood Bucs) Fall 2:06</li>\n<li>Champ. Round 2 - Braden Hunter (Team 1006 Wrestling) won by fall over Adam Lambaz (Scorpion WC) Fall 4:29</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Ghee Rachal (Harvey Twisters) won by fall over Ryan Clancy (Crosstown Spartan Elite WC) Fall 0:55</li>\n<li>Champ. Round 2 - Nathan Wemstrom (Arlington Cardinals WC) won by decision over Aidan Avilez (Martinez Fox Valley Elite) Dec 8-1</li>\n<li>Champ. Round 2 - Robert Rigg (Charleston WC) won by decision over Giovanni Amaya (Blackhawk WC) Dec 6-3</li>\n<li>Champ. Round 2 - Bryan West (Belvidere Bandits WC) won by fall over Jordan Lishman (Tomcat WC) Fall 2:24</li>\n<li>Champ. Round 2 - Jramuel Holman (Junior Comanche WC) won by fall over Eddie Solis (Marengo Youth WC) Fall 3:13</li>\n<li>Champ. Round 2 - Dillan Johnson (Force WC) won in sudden victory - 1 over Isaiah Gonzalez (Izzy Style Wrestling) SV-1 4-2</li>\n<li>Champ. Round 2 - Charlie Jagusah (Junior Pioneer WC) won by fall over Camren Stinespring (Storm Youth WC) Fall 2:28</li>\n<li>Champ. Round 2 - Morley Coval (Martinez Fox Valley Elite) won by fall over Max Terlap (Libertyville Wildcats WC) Fall 3:36</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Evan Christison (Chatham WC) won by fall over Madilyn Hawk (AJ Junior Wildcats WC) Fall 0:36</li>\n<li>Champ. Round 2 - Brian Straight (Dundee Highlanders WC) won by fall over Isaiah Hill (O`Fallon Little Panthers WC) Fall 2:20</li>\n<li>Champ. Round 2 - Mason Kelly (Granite City Wrestling Association) won by fall over Sterling Campbell (Edwardsville WC) Fall 0:22</li>\n<li>Champ. Round 2 - Robert Schneider (Celtic Elite) won by fall over Hayden Shofner (Tiger Town Tanglers WC) Fall 0:26</li>\n<li>Champ. Round 2 - Ryan Boersma (Tinley Park Bulldogs WC) won by fall over Nathan Alas (Contender Wrestling) Fall 0:16</li>\n<li>Champ. Round 2 - Joey Ochoa (Red Raiders Wrestling Team) won by decision over Carter Lucarz (Junior Cougar WC) Dec 6-1</li>\n<li>Champ. Round 2 - Jack Eberhart (O`Fallon Little Panthers WC) won by fall over John Davis (Thundercats) Fall 0:58</li>\n<li>Champ. Round 2 - Andre Hunt (Urbana Tigers WC) won by fall over Alexis Correa (DuPage WC) Fall 1:16</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Donny Pigoni (SCN Youth WC) won by major decision over Jeremy Huf (Gomez Wrestling Academy) Maj 13-0</li>\n<li>Champ. Round 2 - Jerren Gille (Da WC) won in sudden victory - 1 over Jacob Venegas (Rock Island WC) SV-1 6-4</li>\n<li>Champ. Round 2 - Deion Johnson (Harvey Twisters) won in sudden victory - 1 over Chase Hampton (Greg Gomez Trained Wrestling) SV-1 4-2</li>\n<li>Champ. Round 2 - Nathan Knowlton (Celtic Elite) won by tech fall over Drew Sadler (AJ Junior Wildcats WC) TF 18-3</li>\n<li>Champ. Round 2 - Nore Turner (Lincoln-Way WC) won by decision over Camren French (Mattoon Youth WC) Dec 6-2</li>\n<li>Champ. Round 2 - Hunter Robbins (TJ Trained) won by decision over Kaden Harman (Golden Eagles WC) Dec 5-1</li>\n<li>Champ. Round 2 - Caleb Scott (Granite City Wrestling Association) won by decision over Carter Mikolajczak (Lemont Bears) Dec 5-2</li>\n<li>Champ. Round 2 - Colden Dyer (SCN Youth WC) won by decision over Rocco Hayes (Contender Wrestling) Dec 6-4</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Javin Jackson-Bey (Harvey Twisters) won by tech fall over Colin Mccloskey (Z`s Team Pena) TF 22-5</li>\n<li>Champ. Round 2 - Benjamin Davino (SCN Youth WC) won by decision over Inocencio Garcia (Force WC) Dec 7-1</li>\n<li>Champ. Round 2 - Korbin Bateman (Mattoon Youth WC) won by fall over Kameron Weddle (SCN Youth WC) Fall 1:23</li>\n<li>Champ. Round 2 - Karter Guzman (Headlock Wrestling Academy) won by decision over Noah Dial (Team 1006 Wrestling) Dec 2-0</li>\n<li>Champ. Round 2 - Bryce Durlacher (The Wrestling Factory) won by decision over Connor Kidd (TJ Trained) Dec 3-0</li>\n<li>Champ. Round 2 - Matthew Soltis (Lincoln-Way WC) won by fall over Emmett Nelson (Richmond WC) Fall 4:27</li>\n<li>Champ. Round 2 - Ty Edwards (Team 1006 Wrestling) won by decision over Joseph Lathwood (Team Mascoutah WC) Dec 4-2</li>\n<li>Champ. Round 2 - William Hupke (SCN Youth WC) won by decision over Max Siegel (Tinley Park Bulldogs WC) Dec 5-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Jaedyn Bloomfield (Rochester WC) won by decision over Raymond Cavey (SCN Youth WC) Dec 7-6</li>\n<li>Champ. Round 2 - Shay Korhorn (Force WC) won by decision over Brady Grennan (Sauk Valley WC) Dec 9-3</li>\n<li>Champ. Round 2 - Jameson Garcia (Gomez Wrestling Academy) won by decision over Trevor Silzer (Tinley Park Bulldogs WC) Dec 2-1</li>\n<li>Champ. Round 2 - Joey Malito (Celtic Elite) won by decision over Dominic Ducato (Golden Eagles WC) Dec 3-2</li>\n<li>Champ. Round 2 - William Baysingar (Arlington Cardinals WC) won by decision over Pierre Baldwin (Panther WC) Dec 6-2</li>\n<li>Champ. Round 2 - Seth Mendoza (Contender Wrestling) won by fall over Ryder Janeczko (Yorkville WC) Fall 2:20</li>\n<li>Champ. Round 2 - Colby Crouch (Triad Little Knights WC) won by decision over Christian Favia (Gomez Wrestling Academy) Dec 4-0</li>\n<li>Champ. Round 2 - Michael DiBenedetto (Greg Gomez Trained Wrestling) won by decision over Peyton Cox (Champaign WC) Dec 1-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Nicolas Davidson (Crystal Lake Wizards) won by decision over Israel Quintanilla (Evolution Wrestling Institute) Dec 7-1</li>\n<li>Champ. Round 2 - Jason Shaw (Roxana Outlaws) won by decision over Billy Meiszner (Force WC) Dec 7-4</li>\n<li>Champ. Round 2 - Joel Mylin (Arlington Cardinals WC) won by decision over Griffin Duffin (Mustang WC) Dec 4-2</li>\n<li>Champ. Round 2 - Jesse Hahs (Herrin Jr WC) won by major decision over Micah Bergen (Super Soldiers WC) Maj 8-0</li>\n<li>Champ. Round 2 - Owen Dunlap (Tinley Park Bulldogs WC) won by major decision over Gavin Ranquist (Headlock Wrestling Academy) Maj 9-0</li>\n<li>Champ. Round 2 - Chase Hall (Triad Little Knights WC) won by decision over Logan Kuhel-trimmer (Force WC) Dec 2-0</li>\n<li>Champ. Round 2 - Carter Hall (Champaign WC) won by decision over Maddux Mordick (Dakota WC) Dec 6-2</li>\n<li>Champ. Round 2 - Daniel Sheen (Izzy Style Wrestling) won by major decision over Colin Sons (SCN Youth WC) Maj 17-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Nicholas Gonzalez (Gomez Wrestling Academy) won by major decision over Justin Warmowski (Fox Lake WC) Maj 13-1</li>\n<li>Champ. Round 2 - Charlie Farmer (Young Guns) won by major decision over Joseph McDermott (Force WC) Maj 8-0</li>\n<li>Champ. Round 2 - Joseph Knapp (Brawlers WC) won by decision over Payton Salomon (Lemont Bears) Dec 7-0</li>\n<li>Champ. Round 2 - Joshua Koderhandt (Crusaders` Elite) won by tech fall over Thomas Porter (Naperville WC) TF 17-2</li>\n<li>Champ. Round 2 - Andrew Herbst (Hawk WC) won by fall over Connor Surtin (Edwardsville WC) Fall 1:02</li>\n<li>Champ. Round 2 - Kai Neumark (Arlington Cardinals WC) won by major decision over Conor Smetana (Rogue Wrestling) Maj 10-2</li>\n<li>Champ. Round 2 - Tyler Bentley (Lemont Bears) won by decision over Aizik Wagner (Champaign WC) Dec 3-0</li>\n<li>Champ. Round 2 - Tommy Curran (Martinez Fox Valley Elite) won by fall over Housten Armbruster (Bulls WC) Fall 2:49</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Marcel Bitner (Epic Wrestling) won by major decision over Maxwell Sztuk (St. Charles WC) Maj 9-1</li>\n<li>Champ. Round 2 - Grant Matarelli (Edwardsville WC) won by major decision over Julian Gonzalez (Team 1006 Wrestling) Maj 11-0</li>\n<li>Champ. Round 2 - Samuel Henkle (Crystal Lake Wizards) won by fall over Jimmy Espinoza (Glenbard East Jr Rams WC) Fall 0:43</li>\n<li>Champ. Round 2 - Andrew Lizak (Celtic Elite) won by fall over Jonathan Chaidez (Headlock Wrestling Academy) Fall 2:39</li>\n<li>Champ. Round 2 - Jake Penzato (Izzy Style Wrestling) won by decision over Jack Finnegan (Force WC) Dec 4-3</li>\n<li>Champ. Round 2 - Caleb Tyus (Bulls WC) won by decision over Cameron Clark (TJ Trained) Dec 8-2</li>\n<li>Champ. Round 2 - Gage Reed (Storm Youth WC) won by decision over Scottt Burke (Crystal Lake Wizards) Dec 5-1</li>\n<li>Champ. Round 2 - Danny Curran (Martinez Fox Valley Elite) won by major decision over Blain Christie (Brawlers WC) Maj 9-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Dean Hamiti (Celtic Elite) won by fall over Alex Ventimilla (Martinez Fox Valley Elite) Fall 2:03</li>\n<li>Champ. Round 2 - Hayden Halter (The Wrestling Factory) won by decision over Luke Barron (Team 1006 Wrestling) Dec 7-3</li>\n<li>Champ. Round 2 - Christian Olsen (Crystal Lake Wizards) won by decision over Kenyon Boyce (Harvey Twisters) Dec 4-0</li>\n<li>Champ. Round 2 - Michael D`orazio (SCN Youth WC) won by decision over Caine Tyus (Bulls WC) Dec 9-5</li>\n<li>Champ. Round 2 - Jack Milos (Arlington Cardinals WC) won by fall over Dylan Gvillo (Edwardsville WC) Fall 1:27</li>\n<li>Champ. Round 2 - Bryce Claypool (Team 1006 Wrestling) won by fall over Isaac Tabels (Hoopeston Area WC) Fall 1:12</li>\n<li>Champ. Round 2 - Dayton Hall (Aces WC) won by decision over Mateen-Javid Taylor (Harvey Twisters) Dec 10-3</li>\n<li>Champ. Round 2 - Diego Sotelo (Martinez Fox Valley Elite) won by tech fall over Felippe Willis (Peoria Razorbacks WC) TF 16-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Connor Speck (TJ Trained) won by decision over Jaden Rice (Stockton Renegades) Dec 7-1</li>\n<li>Champ. Round 2 - Kylan Montgomery (Team Mascoutah WC) won by decision over Andrew Perez (Hinsdale Red Devil WC) Dec 5-4</li>\n<li>Champ. Round 2 - Marko Hennin (Barrington Broncos WC) won by decision over Jake Tanquilut (Tinley Park Bulldogs WC) Dec 7-0</li>\n<li>Champ. Round 2 - Kaeden Kinison (Springfield Capitals Kids WC) won by decision over Andrew Burkeybile (Moline WC) Dec 3-0</li>\n<li>Champ. Round 2 - Cole Ferguson (Force WC) won by fall over Nick Kotiw (Champaign WC) Fall 3:33</li>\n<li>Champ. Round 2 - Zach Sato (Team 1006 Wrestling) won by fall over Zach Lemp (Villa-Lombard Cougars) Fall 0:47</li>\n<li>Champ. Round 2 - Javen Estrada (Tinley Park Bulldogs WC) won by fall over Patrick Curran (Gomez Wrestling Academy) Fall 0:26</li>\n<li>Champ. Round 2 - Nain Vazquez (Martinez Fox Valley Elite) won by fall over Gannen Kane (Junior Kahoks) Fall 0:54</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Joey Cape (Super Soldiers WC) won by major decision over Ryan Scott (Fox Valley WC) Maj 9-0</li>\n<li>Champ. Round 2 - Vincent Zerban (Bulls WC) won by major decision over Jeremy Jakowitsch (Barrington Broncos WC) Maj 12-2</li>\n<li>Champ. Round 2 - John Baud (Brawlers WC) won by decision over Will Collins (North Shore Edge) Dec 3-0</li>\n<li>Champ. Round 2 - Tyler Milani (Tinley Park Bulldogs WC) won by decision over Isaiah Immke (Storm Youth WC) Dec 7-5</li>\n<li>Champ. Round 2 - Melvin Rogers (East St. Louis Wrestling) won by major decision over Joaquin Miranda (Crystal Lake Wizards) Maj 15-5</li>\n<li>Champ. Round 2 - Mitchell Rudsinski (Tinley Park Bulldogs WC) won by fall over Billy Taylor (Junior Pioneer WC) Fall 1:18</li>\n<li>Champ. Round 2 - Andrew Lira (The Wrestling Factory) won by fall over Dustin Kozlowski (Celtic Elite) Fall 1:59</li>\n<li>Champ. Round 2 - Michael Caliendo (Batavia WC) won by decision over Andrew Johnson (Team 1006 Wrestling) Dec 6-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Terrance Snapp (Will County Warriors) won by decision over Mason Wilke (Edwardsville WC) Dec 6-2</li>\n<li>Champ. Round 2 - Riley Woods (Batavia WC) won by fall over Rayce Zike (Cumberland Youth WC) Fall 2:23</li>\n<li>Champ. Round 2 - Dathan Wickson (Da WC) won by decision over Bryce Boumans (Fox Valley WC) Dec 2-1</li>\n<li>Champ. Round 2 - Connor Gaynor (Tinley Park Bulldogs WC) won by fall over Anthony Cantu (Team 1006 Wrestling) Fall 0:38</li>\n<li>Champ. Round 2 - Jack Villarreal (Lions WC) won by decision over Drake Hawkins (Pekin Boys &amp; Girls Club) Dec 11-4</li>\n<li>Champ. Round 2 - Adam Thebeau (East St. Louis Wrestling) won by decision over Shane Moran (Crystal Lake Wizards) Dec 6-2</li>\n<li>Champ. Round 2 - Joel Vandervere (The Wrestling Factory) won by tech fall over Quinton Heilemeier (Dakota WC) TF 17-2</li>\n<li>Champ. Round 2 - Robert Major (Greg Gomez Trained Wrestling) won by decision over Michael Rodriguez (Contender Wrestling) Dec 4-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Brody Hallin (Crystal Lake Wizards) won by decision over Damien Lopez (Martinez Fox Valley Elite) Dec 5-2</li>\n<li>Champ. Round 2 - Jack Coyle (Mustang WC) won by injury default over Donovan Golden (Brawlers WC) Inj. 0:53</li>\n<li>Champ. Round 2 - Jack Patting (Young Guns) won by major decision over Raymond Arebalo (Crosstown Spartan Elite WC) Maj 11-2</li>\n<li>Champ. Round 2 - Grant Hansen (Maddog Wrestling Academy) won by decision over Dillon Dublo (Bulls WC) Dec 9-5</li>\n<li>Champ. Round 2 - Amir Johnson (Lincoln-Way WC) won by decision over Lucas Daly (Carbondale WC) Dec 4-2</li>\n<li>Champ. Round 2 - Raymond Hernandez (Little Huskies WC) won by tech fall over Iysten Syfert (Cumberland Youth WC) TF 15-0</li>\n<li>Champ. Round 2 - Jake Matthews (Headlock Wrestling Academy) won by fall over Logan Fitz (Metamora Kids WC) Fall 1:08</li>\n<li>Champ. Round 2 - Ryan Smith (Martinez Fox Valley Elite) won by decision over Case Harmston (Stockton Renegades) Dec 6-5</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Kennedy Blades (Martinez Fox Valley Elite) won by fall over Peyton Bechtold (Bulls WC) Fall 4:16</li>\n<li>Champ. Round 2 - Brody Roth (North Shore Edge) won by fall over Danny Lack (Unity Youth WC) Fall 0:58</li>\n<li>Champ. Round 2 - Austin Abitua (Da WC) won by decision over Jacob Sollberger (Super Soldiers WC) Dec 7-2</li>\n<li>Champ. Round 2 - Jake Viloria (Little Huskies WC) won by major decision over Buddy Evangelista (Greg Gomez Trained Wrestling) Maj 14-3</li>\n<li>Champ. Round 2 - Tony Pacetti (Redhawk WC/Panther WC) won by major decision over Hakupo`mai Watson (Crosstown Spartan Elite WC) Maj 14-2</li>\n<li>Champ. Round 2 - Christopher Carr (Izzy Style Wrestling) won by fall over Robert Carter (Granite City Wrestling Association) Fall 1:19</li>\n<li>Champ. Round 2 - William White (Mt. Vernon Lions WC) won by decision over Jason Hermann (Stockton Renegades) Dec 4-3</li>\n<li>Champ. Round 2 - Bryan Smith (Martinez Fox Valley Elite) won by decision over Cole Pradel (Team 1006 Wrestling) Dec 8-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Connor Brooker (Thundercats) won by fall over Adrian Corral (Blackhawk WC) Fall 1:30</li>\n<li>Champ. Round 2 - Robert Gaylord (Redhawk WC/Panther WC) won in sudden victory - 1 over Adrian McDougle (Bulls WC) SV-1 8-7</li>\n<li>Champ. Round 2 - Jacob Mumm (Minooka Indians Elite) won by decision over Kaden Randazzo (Crystal Lake Wizards) Dec 4-2</li>\n<li>Champ. Round 2 - Dylan Connell (The Wrestling Factory) won by fall over Elijah Chiaro (SCN Youth WC) Fall 0:47</li>\n<li>Champ. Round 2 - Christopher Worcester (Villa-Lombard Cougars) won by major decision over Drew Gvillo (Edwardsville WC) Maj 13-4</li>\n<li>Champ. Round 2 - Peyton Holt (Unity Youth WC) won by fall over Jayrid Stoltz (Peoria Razorbacks WC) Fall 2:22</li>\n<li>Champ. Round 2 - Andrew Wenzel (Dakota WC) won by fall over Kayden Kleckner (Yorkville WC) Fall 2:49</li>\n<li>Champ. Round 2 - Antonio Torres (Martinez Fox Valley Elite) won by decision over Noah Lukosius (Force WC) Dec 9-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Cole Gaddis (Hoopeston Area WC) won by decision over Aidan Nardin (Dakota WC) Dec 6-1</li>\n<li>Champ. Round 2 - Mario Tormey (Tinley Park Bulldogs WC) won by decision over Brenden Gran (Scorpion WC) Dec 7-0</li>\n<li>Champ. Round 2 - Joey Braunagel (O`Fallon Little Panthers WC) won by fall over Nathan Pappas (Fox Valley WC) Fall 1:14</li>\n<li>Champ. Round 2 - Isaiah Parker (The Wrestling Factory) won by fall over Parker Bernabe (Harlem Cougars WC) Fall 1:21</li>\n<li>Champ. Round 2 - Joey Gaskill (Elk Grove Junior Grens) won by decision over Cameron Bergheger (Rock Island WC) Dec 12-8</li>\n<li>Champ. Round 2 - Ramel Lee (Beat the Streets-Chicago) won in sudden victory - 1 over Colton Berg (Sycamore WC) SV-1 8-6</li>\n<li>Champ. Round 2 - Ricardo Salinas (Evanston School of Wrestling) won by fall over Caleb Patton (Contender Wrestling) Fall 2:10</li>\n<li>Champ. Round 2 - Omarion Dixon (Panther WC) won by fall over Jackson Certa (Martinez Fox Valley Elite) Fall 2:55</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Michael Roath (SCN Youth WC) won by fall over Jacob Volz (Granite City Wrestling Association) Fall 2:44</li>\n<li>Champ. Round 2 - Elliott Lewis (Tinley Park Bulldogs WC) won in sudden victory - 1 over Evan Roper (Barrington Broncos WC) SV-1 5-3</li>\n<li>Champ. Round 2 - Immanuel Cervantes (Yorkville WC) won by fall over Ajay Williams (Crosstown Spartan Elite WC) Fall 2:45</li>\n<li>Champ. Round 2 - Benjamin Harvey (Rochelle WC) won by fall over Javontay Bright (Maywood Bucs) Fall 2:27</li>\n<li>Champ. Round 2 - Dakota Ritter (Riverton/Williamsville Youth Wrestling) won by decision over Sean Swinkle (Notre Dame WC) Dec 7-6</li>\n<li>Champ. Round 2 - Antonio Figueroa (Hononegah WC) won by decision over Mustafa St. Clair (Harvey Twisters) Dec 6-4</li>\n<li>Champ. Round 2 - Payton Cardin (Metamora Kids WC) won by major decision over Nathan Masters (Celtic Elite) Maj 11-3</li>\n<li>Champ. Round 2 - Brandon Navarro (Martinez Fox Valley Elite) won by major decision over James Clancy (Team 312) Maj 10-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Mason Ahlers (Edwardsville WC) won by fall over Brenden Watkins (Team 1006 Wrestling) Fall 4:10</li>\n<li>Champ. Round 2 - Tommy Evans (Wolves WC) won by fall over Kyle Franklin (Gomez Wrestling Academy) Fall 0:45</li>\n<li>Champ. Round 2 - Daniel Colunga (Hoopeston Area WC) won by fall over Ison Robinson (Bolingbrook Junior Raiders) Fall 3:25</li>\n<li>Champ. Round 2 - Ethan Yu (Tinley Park Bulldogs WC) won by decision over Jacob Morel (Pitbull Wrestling Alliance) Dec 6-2</li>\n<li>Champ. Round 2 - Trayson Young (East St. Louis Wrestling) won by decision over Lou Gaddy (Crystal Lake Wizards) Dec 7-6</li>\n<li>Champ. Round 2 - Matthew Ramirez (Barrington Broncos WC) won by fall over Jaxon Lambrigger (Tinley Park Bulldogs WC) Fall 0:26</li>\n<li>Champ. Round 2 - John Pacewic (Celtic Elite) won by fall over Lucas Quinlan (Oak Forest Warriors) Fall 0:42</li>\n<li>Champ. Round 2 - Dalton Riggle (Dakota WC) won by fall over Jerred Durian (Wheaton Warrenville Tiger WC) Fall 3:37</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Apollo Gothard (Lemont Bears) won by fall over Lucas Smith (Super Soldiers WC) Fall 0:30</li>\n<li>Champ. Round 2 - Brock Donati (St. Charles WC) won in tie breaker - 1 over Miguel Bonilla (Gomez Wrestling Academy) TB-1 5-4</li>\n<li>Champ. Round 2 - Alexander Aguirre (Martinez Fox Valley Elite) won by fall over Noah Reinhart (Champaign WC) Fall 1:09</li>\n<li>Champ. Round 2 - Ryan Golnick (Golden Eagles WC) won by fall over Da`Marion Sanders (Will County Warriors) Fall 2:50</li>\n<li>Champ. Round 2 - Louie Cretsinger (Xtreme WC) won by fall over Roger Cornwell (Crawford County WC) Fall 0:28</li>\n<li>Champ. Round 2 - Evan Dluzak (Lincoln-Way WC) won by decision over Michael Williams (Rambler WC) Dec 4-1</li>\n<li>Champ. Round 2 - Jordon Paisley (Stockton Renegades) won by decision over Julian Navarro (Team 1006 Wrestling) Dec 4-0</li>\n<li>Champ. Round 2 - Dzhabrail Khurshidov (Blackhawk WC) won by fall over Nicholas Lopez (Tinley Park Bulldogs WC) Fall 2:48</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Brandon Hoselton (Prairie Central Hawks) won by fall over Ethan Pike (Team 1006 Wrestling) Fall 0:31</li>\n<li>Champ. Round 2 - Xander Schnake (Hononegah WC) won by fall over Jack Bostick (Edwardsville WC) Fall 1:00</li>\n<li>Champ. Round 2 - Rewn Stearns (Murphysboro WC) won by decision over Kyle Smith (Edwardsville WC) Dec 5-0</li>\n<li>Champ. Round 2 - Aydan Trueblood (TJ Trained) won by major decision over Jimmy Liston (Martinez Fox Valley Elite) Maj 9-1</li>\n<li>Champ. Round 2 - Gabriel Taylor (Mt. Vernon Lions WC) won by decision over Basilo Betancourt (Harvey Twisters) Dec 1-0</li>\n<li>Champ. Round 2 - Clay Cichowski (Maine Eagles WC) won by major decision over Tyler Lorden (LP Crunching Cavs) Maj 11-0</li>\n<li>Champ. Round 2 - Tyson Heerman (Peoria Razorbacks WC) won by fall over Gavin Mouser (Vandalia Jr WC) Fall 2:54</li>\n<li>Champ. Round 2 - Alexis Aguirre (Martinez Fox Valley Elite) won by fall over Joshua Shoulders (Olney Cubs WC) Fall 2:38</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - William Penrod (Mt. Vernon Lions WC) won by fall over Cole Michna (Metamora Kids WC) Fall 0:33</li>\n<li>Champ. Round 2 - Nikolas Mishka (Force WC) won by fall over Jamison VanVickle (Oakwood Youth WC) Fall 1:19</li>\n<li>Champ. Round 2 - Colin Baker (Lions WC) won by injury default over Zachary Barlev (Team 1006 Wrestling) Inj. 0:15</li>\n<li>Champ. Round 2 - Nathan Tomaso (Villa-Lombard Cougars) won by fall over Laron Reed (Danville Chargers) Fall 4:12</li>\n<li>Champ. Round 2 - Tyler Williams (Riverton/Williamsville Youth Wrestling) won by fall over Andre Naydenov (The Wrestling Factory) Fall 0:45</li>\n<li>Champ. Round 2 - Malachi Jennings (Crosstown Spartan Elite WC) won by fall over Alex Paulson (Belvidere Bandits WC) Fall 1:25</li>\n<li>Champ. Round 2 - Brock Neill (LP Crunching Cavs) won by fall over Chase Freitag (Edwardsville WC) Fall 1:22</li>\n<li>Champ. Round 2 - Kyle Johnson (Will County Warriors) won in overtime over Miles Ripper (Martinez Fox Valley Elite) OT 6-4</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Andrew Kaltmayer (Edwardsville WC) won by fall over Ethan Girdler (Peoria Heights Minutemen WC) Fall 0:36</li>\n<li>Champ. Round 2 - Connor Edge (The Law) received a bye   () Bye</li>\n<li>Champ. Round 2 - Dreyden Shelton (Urbana Tigers WC) won by decision over Ryan Hannah (Panther WC) Dec 2-0</li>\n<li>Champ. Round 2 - Gabriel Craig (Benton WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Hayden Copass (Storm Youth WC) won by fall over Cory Woods (Crawford County WC) Fall 1:20</li>\n<li>Champ. Round 2 - Eric Grabavoy (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 2 - Dustin Olmstead (Belleville Little Devils WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Cruz Quiroz (Blackhawk WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Dontae Jackson (East St. Louis Wrestling) won by fall over Henry Warfel (Cumberland Youth WC) Fall 0:36</li>\n<li>Champ. Round 2 - Isaac Bourge (Team 1006 Wrestling) won in overtime over Brandon Weber (Contender Wrestling) OT 3-1</li>\n<li>Champ. Round 2 - Paul Woo (Villa-Lombard Cougars) won by decision over Henry Locker (Downers Grove WC) Dec 4-1</li>\n<li>Champ. Round 2 - Phoenix Mordick (Dakota WC) won by tech fall over Lauden Edwards (Villa-Lombard Cougars) TF 18-0</li>\n<li>Champ. Round 2 - Kevin Martin (Tinley Park Bulldogs WC) won by decision over Maddox Khalimsky (Arlington Cardinals WC) Dec 4-2</li>\n<li>Champ. Round 2 - Samuel Hayes (Contender Wrestling) won by fall over Chance Arlt-Seip (Triad Little Knights WC) Fall 1:56</li>\n<li>Champ. Round 2 - Caelan Riley (The Wrestling Factory) won by decision over Aaron Niemeyer (Roxana Outlaws) Dec 7-2</li>\n<li>Champ. Round 2 - Hunter Bogwill (Greg Gomez Trained Wrestling) won by fall over Alex Hadzima (SCN Youth WC) Fall 0:25</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Antonio Alvarado (Crystal Lake Wizards) won by major decision over Cody Tavoso (Force WC) Maj 11-0</li>\n<li>Quarterfinal - Alexander Marre (Gomez Wrestling Academy) won by decision over Carter Rude (Sauk Valley WC) Dec 11-5</li>\n<li>Quarterfinal - Bryce Griffin (Bulls WC) won by decision over Jackson Smith (Lemont Bears) Dec 3-2</li>\n<li>Quarterfinal - Colin Young (Da WC) won by decision over Saul Trejo (Gomez Wrestling Academy) Dec 9-5</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Santino Robinson (Wrestling 365) won by fall over Aidan Huck (Batavia WC) Fall 1:10</li>\n<li>Quarterfinal - Christopher Moore (Crystal Lake Wizards) won in sudden victory - 1 over Mason Alessio (Celtic Elite) SV-1 6-4</li>\n<li>Quarterfinal - Tyler Guerra (Gomez Wrestling Academy) won by decision over Noah Manuel Tapia (Young Guns) Dec 5-0</li>\n<li>Quarterfinal - Dillon Carlson (Crystal Lake Wizards) won by decision over Evan Schiffman (Lemont Bears) Dec 7-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Kannon Webster (Super Soldiers WC) won by decision over Matthew Hollingsworth (Lincoln-Way WC) Dec 10-3</li>\n<li>Quarterfinal - Garrett Luke (Stockton Renegades) won by decision over Michael Calcagno (Izzy Style Wrestling) Dec 8-4</li>\n<li>Quarterfinal - David Mayora (Izzy Style Wrestling) won by major decision over Cajaun Johnson (Urbana Tigers WC) Maj 14-1</li>\n<li>Quarterfinal - Nasir Bailey (Harvey Twisters) won by tech fall over David Williams (Martinez Fox Valley Elite) TF 17-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Arojae Hart (AJ Junior Wildcats WC) won by decision over Joe Mushinsky (TJ Trained) Dec 7-2</li>\n<li>Quarterfinal - Joseph Fernau (Izzy Style Wrestling) won by decision over Brac Hooper (Champaign WC) Dec 6-3</li>\n<li>Quarterfinal - Cole Peters (TJ Trained-Springfield) won by decision over Dominik Mallinder (Izzy Style Wrestling) Dec 5-2</li>\n<li>Quarterfinal - Damari Reed (Harvey Twisters) won by major decision over Austin Bauer (Edwardsville WC) Maj 17-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Ethan Stiles (Izzy Style Wrestling) won by major decision over Jake Zator (Lemont Bears) Maj 12-4</li>\n<li>Quarterfinal - Jordan Blew (Force WC) won by decision over Will Rude (Sauk Valley WC) Dec 5-4</li>\n<li>Quarterfinal - Grover Mays (Gladiator Elite) won by decision over Jack Seacrist (Belvidere Bandits WC) Dec 2-1</li>\n<li>Quarterfinal - Vincent Robinson (Harvey Twisters) won by major decision over Tyler Perry (Batavia WC) Maj 12-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Joshua Franklin (UP Town WC) won by major decision over Jalen Curtis (Greg Gomez Trained Wrestling) Maj 9-0</li>\n<li>Quarterfinal - Michael Kelly (Tinley Park Bulldogs WC) won by decision over Dylan Sayles (Hononegah WC) Dec 5-0</li>\n<li>Quarterfinal - Braulio Flores (Team 1006 Wrestling) won by fall over Hunter Travis (Pontiac WC) Fall 0:20</li>\n<li>Quarterfinal - Cruz Ibarra (Martinez Fox Valley Elite) won by fall over Joseph Olalde (Gomez Wrestling Academy) Fall 1:10</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Aj Heeg (Lemont Bears) won by decision over Ryder Hunkins (Crystal Lake Wizards) Dec 3-0</li>\n<li>Quarterfinal - Kole Brower (Moline WC) won by major decision over Alexander Miranda (Bulls WC) Maj 12-0</li>\n<li>Quarterfinal - Tavius Hosley (Unity Youth WC) won by fall over Abraham Wojcikiewicz (Bulls WC) Fall 0:38</li>\n<li>Quarterfinal - Elijah Munoz (Team 1006 Wrestling) won by decision over Jack Lesher (SCN Youth WC) Dec 8-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Jack Cummings (North Shore Edge) won by decision over Zane Timon (Team Mascoutah WC) Dec 9-7</li>\n<li>Quarterfinal - Aidan O`Connor (Celtic Elite) won by decision over Gus Cambier (Sycamore WC) Dec 6-0</li>\n<li>Quarterfinal - Jared Gumila (Force WC) won by tech fall over Patrick Williams (Junior Cougar WC) TF 18-1</li>\n<li>Quarterfinal - Colton Madura (Crystal Lake Wizards) won by fall over Hunter Janeczko (Yorkville WC) Fall 3:27</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Owen Jacobson (Epic Wrestling) won by fall over Elijah Lee (Peoria Razorbacks WC) Fall 2:29</li>\n<li>Quarterfinal - Braden Stauffenberg (Izzy Style Wrestling) won by fall over Andrew Mensendike (The Law) Fall 0:34</li>\n<li>Quarterfinal - Blake Jorgensen (Celtic Elite) won by fall over Vincent McDonald (Little Huskies WC) Fall 2:26</li>\n<li>Quarterfinal - Bradley Gillum (Martinez Fox Valley Elite) won by decision over Mannix Faworski (Xtreme WC) Dec 7-5</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Cole Brannigan (Lemont Bears) won by decision over Colby Loftsgaard (Urbana Tigers WC) Dec 8-3</li>\n<li>Quarterfinal - Michael Mosier (Barrington Broncos WC) won by decision over Moisey Trimble (Belleville Little Devils WC) Dec 3-2</li>\n<li>Quarterfinal - Montres Reed (Urbana Tigers WC) won by fall over Connor Nelligan (Mustang WC) Fall 0:58</li>\n<li>Quarterfinal - Jacob Bottarini (SCN Youth WC) won in sudden victory - 1 over Liam McDermott (Celtic Elite) SV-1 2-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Braeden Tosterud (Elk Grove Junior Grens) won by fall over Armond Edwards (O`Fallon Little Panthers WC) Fall 2:23</li>\n<li>Quarterfinal - Jokiah Sewell (Hawk WC) won by decision over Gavin Mason (Team 1006 Wrestling) Dec 9-2</li>\n<li>Quarterfinal - Eathin Diveley (Red Raiders Wrestling Team) won by major decision over Hector Jimenez (The Wrestling Factory) Maj 12-2</li>\n<li>Quarterfinal - Seth Brooks (Granite City Wrestling Association) won by decision over Lee Smith (Da WC) Dec 2-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Connor Lorden (LP Crunching Cavs) won by fall over Nathaniel Dutkin (Wolves WC) Fall 4:18</li>\n<li>Quarterfinal - Rylee Edwards (Storm Youth WC) won by decision over Jadon Mims (Maywood Bucs) Dec 4-2</li>\n<li>Quarterfinal - Savage Wates (Rock Island WC) won by fall over Tyler Cerny (Red Raiders Wrestling Team) Fall 1:11</li>\n<li>Quarterfinal - Khamari Jones (Crosstown Spartan Elite WC) won by decision over Braden Hunter (Team 1006 Wrestling) Dec 8-4</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Nathan Wemstrom (Arlington Cardinals WC) won by decision over Ghee Rachal (Harvey Twisters) Dec 7-6</li>\n<li>Quarterfinal - Robert Rigg (Charleston WC) won by fall over Bryan West (Belvidere Bandits WC) Fall 2:13</li>\n<li>Quarterfinal - Jramuel Holman (Junior Comanche WC) won by fall over Dillan Johnson (Force WC) Fall 2:04</li>\n<li>Quarterfinal - Charlie Jagusah (Junior Pioneer WC) won by fall over Morley Coval (Martinez Fox Valley Elite) Fall 3:35</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Brian Straight (Dundee Highlanders WC) won by decision over Evan Christison (Chatham WC) Dec 3-1</li>\n<li>Quarterfinal - Mason Kelly (Granite City Wrestling Association) won by decision over Robert Schneider (Celtic Elite) Dec 2-0</li>\n<li>Quarterfinal - Ryan Boersma (Tinley Park Bulldogs WC) won by fall over Joey Ochoa (Red Raiders Wrestling Team) Fall 2:06</li>\n<li>Quarterfinal - Jack Eberhart (O`Fallon Little Panthers WC) won by fall over Andre Hunt (Urbana Tigers WC) Fall 1:07</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Donny Pigoni (SCN Youth WC) won by decision over Jerren Gille (Da WC) Dec 3-0</li>\n<li>Quarterfinal - Deion Johnson (Harvey Twisters) won by decision over Nathan Knowlton (Celtic Elite) Dec 6-4</li>\n<li>Quarterfinal - Nore Turner (Lincoln-Way WC) won by fall over Hunter Robbins (TJ Trained) Fall 2:30</li>\n<li>Quarterfinal - Caleb Scott (Granite City Wrestling Association) won by decision over Colden Dyer (SCN Youth WC) Dec 5-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Benjamin Davino (SCN Youth WC) won by decision over Javin Jackson-Bey (Harvey Twisters) Dec 5-0</li>\n<li>Quarterfinal - Karter Guzman (Headlock Wrestling Academy) won by decision over Korbin Bateman (Mattoon Youth WC) Dec 2-0</li>\n<li>Quarterfinal - Bryce Durlacher (The Wrestling Factory) won by decision over Matthew Soltis (Lincoln-Way WC) Dec 8-1</li>\n<li>Quarterfinal - William Hupke (SCN Youth WC) won by fall over Ty Edwards (Team 1006 Wrestling) Fall 4:17</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Shay Korhorn (Force WC) won by fall over Jaedyn Bloomfield (Rochester WC) Fall 1:14</li>\n<li>Quarterfinal - Jameson Garcia (Gomez Wrestling Academy) won by decision over Joey Malito (Celtic Elite) Dec 6-1</li>\n<li>Quarterfinal - Seth Mendoza (Contender Wrestling) won by decision over William Baysingar (Arlington Cardinals WC) Dec 3-0</li>\n<li>Quarterfinal - Colby Crouch (Triad Little Knights WC) won by fall over Michael DiBenedetto (Greg Gomez Trained Wrestling) Fall 1:13</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Jason Shaw (Roxana Outlaws) won by decision over Nicolas Davidson (Crystal Lake Wizards) Dec 3-0</li>\n<li>Quarterfinal - Joel Mylin (Arlington Cardinals WC) won by decision over Jesse Hahs (Herrin Jr WC) Dec 3-1</li>\n<li>Quarterfinal - Owen Dunlap (Tinley Park Bulldogs WC) won by decision over Chase Hall (Triad Little Knights WC) Dec 3-0</li>\n<li>Quarterfinal - Daniel Sheen (Izzy Style Wrestling) won by decision over Carter Hall (Champaign WC) Dec 6-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Charlie Farmer (Young Guns) Dec 6-0</li>\n<li>Quarterfinal - Joshua Koderhandt (Crusaders` Elite) won by major decision over Joseph Knapp (Brawlers WC) Maj 13-4</li>\n<li>Quarterfinal - Andrew Herbst (Hawk WC) won in sudden victory - 1 over Kai Neumark (Arlington Cardinals WC) SV-1 4-2</li>\n<li>Quarterfinal - Tommy Curran (Martinez Fox Valley Elite) won by fall over Tyler Bentley (Lemont Bears) Fall 1:30</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Grant Matarelli (Edwardsville WC) won by decision over Marcel Bitner (Epic Wrestling) Dec 3-1</li>\n<li>Quarterfinal - Andrew Lizak (Celtic Elite) won by decision over Samuel Henkle (Crystal Lake Wizards) Dec 7-0</li>\n<li>Quarterfinal - Jake Penzato (Izzy Style Wrestling) won in tie breaker - 1 over Caleb Tyus (Bulls WC) TB-1 6-5</li>\n<li>Quarterfinal - Danny Curran (Martinez Fox Valley Elite) won by fall over Gage Reed (Storm Youth WC) Fall 2:35</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Dean Hamiti (Celtic Elite) won by major decision over Hayden Halter (The Wrestling Factory) Maj 9-0</li>\n<li>Quarterfinal - Christian Olsen (Crystal Lake Wizards) won by decision over Michael D`orazio (SCN Youth WC) Dec 6-1</li>\n<li>Quarterfinal - Jack Milos (Arlington Cardinals WC) won by tech fall over Bryce Claypool (Team 1006 Wrestling) TF 16-1</li>\n<li>Quarterfinal - Diego Sotelo (Martinez Fox Valley Elite) won by fall over Dayton Hall (Aces WC) Fall 4:08</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Kylan Montgomery (Team Mascoutah WC) won by decision over Connor Speck (TJ Trained) Dec 9-4</li>\n<li>Quarterfinal - Marko Hennin (Barrington Broncos WC) won by decision over Kaeden Kinison (Springfield Capitals Kids WC) Dec 3-0</li>\n<li>Quarterfinal - Zach Sato (Team 1006 Wrestling) won by fall over Cole Ferguson (Force WC) Fall 4:13</li>\n<li>Quarterfinal - Nain Vazquez (Martinez Fox Valley Elite) won by major decision over Javen Estrada (Tinley Park Bulldogs WC) Maj 14-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Vincent Zerban (Bulls WC) won by fall over Joey Cape (Super Soldiers WC) Fall 2:18</li>\n<li>Quarterfinal - Tyler Milani (Tinley Park Bulldogs WC) won by decision over John Baud (Brawlers WC) Dec 6-5</li>\n<li>Quarterfinal - Mitchell Rudsinski (Tinley Park Bulldogs WC) won in tie breaker - 1 over Melvin Rogers (East St. Louis Wrestling) TB-1 1-0</li>\n<li>Quarterfinal - Michael Caliendo (Batavia WC) won by decision over Andrew Lira (The Wrestling Factory) Dec 7-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Riley Woods (Batavia WC) won by fall over Terrance Snapp (Will County Warriors) Fall 4:12</li>\n<li>Quarterfinal - Connor Gaynor (Tinley Park Bulldogs WC) won by fall over Dathan Wickson (Da WC) Fall 0:44</li>\n<li>Quarterfinal - Adam Thebeau (East St. Louis Wrestling) won by decision over Jack Villarreal (Lions WC) Dec 4-0</li>\n<li>Quarterfinal - Joel Vandervere (The Wrestling Factory) won by decision over Robert Major (Greg Gomez Trained Wrestling) Dec 4-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Jack Coyle (Mustang WC) won in overtime over Brody Hallin (Crystal Lake Wizards) OT 7-5</li>\n<li>Quarterfinal - Jack Patting (Young Guns) won by decision over Grant Hansen (Maddog Wrestling Academy) Dec 6-0</li>\n<li>Quarterfinal - Amir Johnson (Lincoln-Way WC) won by decision over Raymond Hernandez (Little Huskies WC) Dec 5-1</li>\n<li>Quarterfinal - Jake Matthews (Headlock Wrestling Academy) won by decision over Ryan Smith (Martinez Fox Valley Elite) Dec 5-4</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Kennedy Blades (Martinez Fox Valley Elite) won by fall over Brody Roth (North Shore Edge) Fall 4:30</li>\n<li>Quarterfinal - Austin Abitua (Da WC) won by decision over Jake Viloria (Little Huskies WC) Dec 4-2</li>\n<li>Quarterfinal - Tony Pacetti (Redhawk WC/Panther WC) won by decision over Christopher Carr (Izzy Style Wrestling) Dec 6-2</li>\n<li>Quarterfinal - Bryan Smith (Martinez Fox Valley Elite) won by decision over William White (Mt. Vernon Lions WC) Dec 3-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Robert Gaylord (Redhawk WC/Panther WC) won by decision over Connor Brooker (Thundercats) Dec 10-7</li>\n<li>Quarterfinal - Dylan Connell (The Wrestling Factory) won by fall over Jacob Mumm (Minooka Indians Elite) Fall 2:47</li>\n<li>Quarterfinal - Christopher Worcester (Villa-Lombard Cougars) won by decision over Peyton Holt (Unity Youth WC) Dec 7-3</li>\n<li>Quarterfinal - Antonio Torres (Martinez Fox Valley Elite) won by major decision over Andrew Wenzel (Dakota WC) Maj 10-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Mario Tormey (Tinley Park Bulldogs WC) won by decision over Cole Gaddis (Hoopeston Area WC) Dec 6-3</li>\n<li>Quarterfinal - Isaiah Parker (The Wrestling Factory) won by major decision over Joey Braunagel (O`Fallon Little Panthers WC) Maj 12-3</li>\n<li>Quarterfinal - Joey Gaskill (Elk Grove Junior Grens) won in sudden victory - 1 over Ramel Lee (Beat the Streets-Chicago) SV-1 5-3</li>\n<li>Quarterfinal - Ricardo Salinas (Evanston School of Wrestling) won by decision over Omarion Dixon (Panther WC) Dec 6-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Michael Roath (SCN Youth WC) won by fall over Elliott Lewis (Tinley Park Bulldogs WC) Fall 3:53</li>\n<li>Quarterfinal - Benjamin Harvey (Rochelle WC) won by major decision over Immanuel Cervantes (Yorkville WC) Maj 12-0</li>\n<li>Quarterfinal - Antonio Figueroa (Hononegah WC) won by fall over Dakota Ritter (Riverton/Williamsville Youth Wrestling) Fall 1:09</li>\n<li>Quarterfinal - Brandon Navarro (Martinez Fox Valley Elite) won by fall over Payton Cardin (Metamora Kids WC) Fall 1:21</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Tommy Evans (Wolves WC) won by fall over Mason Ahlers (Edwardsville WC) Fall 0:49</li>\n<li>Quarterfinal - Ethan Yu (Tinley Park Bulldogs WC) won by fall over Daniel Colunga (Hoopeston Area WC) Fall 2:40</li>\n<li>Quarterfinal - Matthew Ramirez (Barrington Broncos WC) won by decision over Trayson Young (East St. Louis Wrestling) Dec 3-2</li>\n<li>Quarterfinal - John Pacewic (Celtic Elite) won by tech fall over Dalton Riggle (Dakota WC) TF 16-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Apollo Gothard (Lemont Bears) won by fall over Brock Donati (St. Charles WC) Fall 0:41</li>\n<li>Quarterfinal - Ryan Golnick (Golden Eagles WC) won by decision over Alexander Aguirre (Martinez Fox Valley Elite) Dec 6-5</li>\n<li>Quarterfinal - Louie Cretsinger (Xtreme WC) won by fall over Evan Dluzak (Lincoln-Way WC) Fall 0:12</li>\n<li>Quarterfinal - Dzhabrail Khurshidov (Blackhawk WC) won by fall over Jordon Paisley (Stockton Renegades) Fall 2:34</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Brandon Hoselton (Prairie Central Hawks) won by fall over Xander Schnake (Hononegah WC) Fall 1:49</li>\n<li>Quarterfinal - Aydan Trueblood (TJ Trained) won by fall over Rewn Stearns (Murphysboro WC) Fall 4:14</li>\n<li>Quarterfinal - Gabriel Taylor (Mt. Vernon Lions WC) won by decision over Clay Cichowski (Maine Eagles WC) Dec 2-1</li>\n<li>Quarterfinal - Tyson Heerman (Peoria Razorbacks WC) won by fall over Alexis Aguirre (Martinez Fox Valley Elite) Fall 1:21</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Nikolas Mishka (Force WC) won by decision over William Penrod (Mt. Vernon Lions WC) Dec 5-3</li>\n<li>Quarterfinal - Colin Baker (Lions WC) won by decision over Nathan Tomaso (Villa-Lombard Cougars) Dec 4-0</li>\n<li>Quarterfinal - Tyler Williams (Riverton/Williamsville Youth Wrestling) won by fall over Malachi Jennings (Crosstown Spartan Elite WC) Fall 2:44</li>\n<li>Quarterfinal - Brock Neill (LP Crunching Cavs) won by fall over Kyle Johnson (Will County Warriors) Fall 0:58</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Andrew Kaltmayer (Edwardsville WC) won by fall over Connor Edge (The Law) Fall 0:32</li>\n<li>Quarterfinal - Dreyden Shelton (Urbana Tigers WC) won by fall over Gabriel Craig (Benton WC) Fall 1:54</li>\n<li>Quarterfinal - Hayden Copass (Storm Youth WC) won by fall over Eric Grabavoy (Team 1006 Wrestling) Fall 1:09</li>\n<li>Quarterfinal - Dustin Olmstead (Belleville Little Devils WC) won by fall over Cruz Quiroz (Blackhawk WC) Fall 1:47</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Dontae Jackson (East St. Louis Wrestling) won by fall over Isaac Bourge (Team 1006 Wrestling) Fall 2:43</li>\n<li>Quarterfinal - Phoenix Mordick (Dakota WC) won by decision over Paul Woo (Villa-Lombard Cougars) Dec 7-0</li>\n<li>Quarterfinal - Samuel Hayes (Contender Wrestling) won by major decision over Kevin Martin (Tinley Park Bulldogs WC) Maj 12-3</li>\n<li>Quarterfinal - Hunter Bogwill (Greg Gomez Trained Wrestling) won by decision over Caelan Riley (The Wrestling Factory) Dec 5-2</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Tyler Aters (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sean Larkin (Redhawk WC/Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Evans (Wolves WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Reef Pacot (Storm Youth WC) won by major decision over Daniel Kelly (Sauk Valley WC) Maj 8-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Renzo Morgan (The Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caleb Nobiling (Lakeland Predators WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Karsten Nordlie (Hononegah WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cameron Kelley (O`Fallon Little Panthers WC) won by major decision over Marquan Shaw (Lionheart Intense Wrestling) Maj 11-3</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Daniel Aguilar (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dimitrios Lalezas (Lemont Bears) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Jensen (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Macatangay (Force WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Luke Christie (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nate Pacetti (Redhawk WC/Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Damen Michicich (Contender Wrestling) won by decision over Garrett Vincent (Dakota WC) Dec 4-0</li>\n<li>Cons. Round 1 - Jayden Colon (Gomez Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Nick Mabutas (Glenbard East Jr Rams WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colin Kelly (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Anthony Montez (Junior Pioneer WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Carlos Munoz-Flores (Team 1006 Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Luke Schultz (O`Fallon Little Panthers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Casey (TJ Trained) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Boland (Redhawk WC/Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alexis Janiak (Force WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Tyrin Newsome (Urbana Tigers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aidan Linden (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tommy Bennett (Redhawk WC/Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gaetano Console (Barrington Broncos WC) won by decision over Tommy McAuliffe (Tinley Park Bulldogs WC) Dec 7-1</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Brandon Theres (Force WC) won by decision over Jacob Dobbins (Saber WC) Dec 5-3</li>\n<li>Cons. Round 1 - Charles Koeppen (Redhawk WC/Panther WC) won by fall over Ryan Palmeri (Scorpion WC) Fall 1:29</li>\n<li>Cons. Round 1 - William Strelow (Oak Forest Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Micheal Brown (Harvey Twisters) received a bye   () Bye</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Alaynia Bryant (Charleston WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Owen Birkner (Carlyle WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Benjamin McLaughlin (Waukegan Youth WC) won by fall over James Herring (Roxana Outlaws) Fall 0:52</li>\n<li>Cons. Round 1 - Attalia Watson (Crosstown Spartan Elite WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - David Stewart (Blackhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jackson Funderburg (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ayden Salley (Barrington Broncos WC) won by decision over Owen Keenan (Metamora Kids WC) Dec 3-2</li>\n<li>Cons. Round 1 - Gabino Perez (Morton Little Mustangs) received a bye   () Bye</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Daniel Cushing (Little Rams Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Karson Richardson (Unity Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Wilms (Lemont Bears) won by fall over Brayden Stumpf (MC Bulldog WC) Fall 0:55</li>\n<li>Cons. Round 1 - Jack Brozny (Batavia WC) won by fall over Owen Birt (St. Joseph Ogden Youth WC) Fall 0:36</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Makya Seibel (Belleville Little Devils WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Ziemniarski (Force WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Leno Campbell (Harvey Twisters) won by fall over Aodan O`Sullivan (Notre Dame WC) Fall 4:20</li>\n<li>Cons. Round 1 - Jonathan Gilbert (Maywood Bucs) received a bye   () Bye</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Aidan Avilez (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Giovanni Amaya (Blackhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Eddie Solis (Marengo Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Camren Stinespring (Storm Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Isaiah Hill (O`Fallon Little Panthers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sterling Campbell (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Alas (Contender Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - John Davis (Thundercats) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Jeremy Huf (Gomez Wrestling Academy) won by decision over Carson Bissey (Olney Cubs WC) Dec 11-4</li>\n<li>Cons. Round 1 - Chase Hampton (Greg Gomez Trained Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Camren French (Mattoon Youth WC) won by fall over Brayden Mortell (G2 WC) Fall 2:17</li>\n<li>Cons. Round 1 - Carter Mikolajczak (Lemont Bears) received a bye   () Bye</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Inocencio Garcia (Force WC) won by decision over Luke Berktold (The Wrestling Factory) Dec 8-2</li>\n<li>Cons. Round 1 - Noah Dial (Team 1006 Wrestling) won by fall over Daniel Bychowski (Woodstock Cyclones) Fall 2:56</li>\n<li>Cons. Round 1 - Connor Kidd (TJ Trained) received a bye   () Bye</li>\n<li>Cons. Round 1 - Max Siegel (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Brady Grennan (Sauk Valley WC) won by fall over Jovan Williams (Harvey Twisters) Fall 2:11</li>\n<li>Cons. Round 1 - Trevor Silzer (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryder Janeczko (Yorkville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christian Favia (Gomez Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Billy Meiszner (Force WC) won by major decision over Brant Kirby (Oak Forest Warriors) Maj 13-5</li>\n<li>Cons. Round 1 - Griffin Duffin (Mustang WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gavin Ranquist (Headlock Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Gliva (Contender Wrestling) won by decision over Colin Sons (SCN Youth WC) Dec 2-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Justin Warmowski (Fox Lake WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Porter (Naperville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Connor Surtin (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Housten Armbruster (Bulls WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Julian Gonzalez (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jonathan Chaidez (Headlock Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Finnegan (Force WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Blain Christie (Brawlers WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Alex Ventimilla (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kenyon Boyce (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dylan Gvillo (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Felippe Willis (Peoria Razorbacks WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Andrew Perez (Hinsdale Red Devil WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Tanquilut (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zach Lemp (Villa-Lombard Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gannen Kane (Junior Kahoks) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Jeremy Jakowitsch (Barrington Broncos WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Lucas Sutherland (Dakota WC) won by fall over Isaiah Immke (Storm Youth WC) Fall 2:40</li>\n<li>Cons. Round 1 - Billy Taylor (Junior Pioneer WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andrew Johnson (Team 1006 Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Rayce Zike (Cumberland Youth WC) won by decision over David Dierickx (Junior Pioneer WC) Dec 6-1</li>\n<li>Cons. Round 1 - Anthony Cantu (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Shane Moran (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Quinton Heilemeier (Dakota WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Donovan Golden (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Raymond Arebalo (Crosstown Spartan Elite WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Lucas Daly (Carbondale WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Logan Fitz (Metamora Kids WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Peyton Bechtold (Bulls WC) won by decision over Marshal Cunz (Harlem Cougars WC) Dec 9-5</li>\n<li>Cons. Round 1 - Jacob Sollberger (Super Soldiers WC) won by major decision over Kobe Gilbert (Elk Grove Junior Grens) Maj 9-0</li>\n<li>Cons. Round 1 - Hakupo`mai Watson (Crosstown Spartan Elite WC) won by decision over Mack Mulvany (Young Guns) Dec 3-1</li>\n<li>Cons. Round 1 - Cole Pradel (Team 1006 Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Adrian McDougle (Bulls WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Elijah Chiaro (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drew Gvillo (Edwardsville WC) won by decision over Ethan Pitts (Lincoln-Way WC) Dec 9-2</li>\n<li>Cons. Round 1 - Noah Lukosius (Force WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Brenden Gran (Scorpion WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Parker Bernabe (Harlem Cougars WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jack Hartman (Barrington Broncos WC) won by major decision over Cameron Bergheger (Rock Island WC) Maj 8-0</li>\n<li>Cons. Round 1 - Nicholas Eby (Crawford County WC) won by fall over Caleb Patton (Contender Wrestling) Fall 3:18</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Volz (Granite City Wrestling Association) won by fall over Vinny Cafazza (Bulls WC) Fall 2:28</li>\n<li>Cons. Round 1 - Javontay Bright (Maywood Bucs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mustafa St. Clair (Harvey Twisters) won by fall over Kylen Rose (Roxana Outlaws) Fall 3:38</li>\n<li>Cons. Round 1 - James Clancy (Team 312) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Kyle Franklin (Gomez Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Morel (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jaxon Lambrigger (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Lucas Quinlan (Oak Forest Warriors) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Lucas Smith (Super Soldiers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Da`Marion Sanders (Will County Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - Roger Cornwell (Crawford County WC) won by fall over Kenneth Regnier (Notre Dame WC) Fall 1:45</li>\n<li>Cons. Round 1 - Nicholas Lopez (Tinley Park Bulldogs WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Ethan Pike (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jimmy Liston (Martinez Fox Valley Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Basilo Betancourt (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gavin Mouser (Vandalia Jr WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Jamison VanVickle (Oakwood Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zachary Barlev (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Andre Naydenov (The Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chase Freitag (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Ethan Girdler (Peoria Heights Minutemen WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Hannah (Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cory Woods (Crawford County WC) received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - J Guido Pigoni (SCN Youth WC) won by fall over Henry Warfel (Cumberland Youth WC) Fall 2:47</li>\n<li>Cons. Round 1 - Lauden Edwards (Villa-Lombard Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chance Arlt-Seip (Triad Little Knights WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alex Hadzima (SCN Youth WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Cody Tavoso (Force WC) won by fall over Tyler Aters (Martinez Fox Valley Elite) Fall 0:42</li>\n<li>Cons. Round 2 - Carter Rude (Sauk Valley WC) won in sudden victory - 1 over Sean Larkin (Redhawk WC/Panther WC) SV-1 3-1</li>\n<li>Cons. Round 2 - Jackson Smith (Lemont Bears) won by decision over Tyler Evans (Wolves WC) Dec 7-1</li>\n<li>Cons. Round 2 - Saul Trejo (Gomez Wrestling Academy) won by decision over Reef Pacot (Storm Youth WC) Dec 9-6</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Renzo Morgan (The Wrestling Factory) won by decision over Aidan Huck (Batavia WC) Dec 8-3</li>\n<li>Cons. Round 2 - Mason Alessio (Celtic Elite) won by decision over Caleb Nobiling (Lakeland Predators WC) Dec 9-2</li>\n<li>Cons. Round 2 - Karsten Nordlie (Hononegah WC) won in tie breaker - 1 over Noah Manuel Tapia (Young Guns) TB-1 1-0</li>\n<li>Cons. Round 2 - Evan Schiffman (Lemont Bears) won by fall over Cameron Kelley (O`Fallon Little Panthers WC) Fall 3:33</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Matthew Hollingsworth (Lincoln-Way WC) won by decision over Daniel Aguilar (Gomez Wrestling Academy) Dec 5-2</li>\n<li>Cons. Round 2 - Michael Calcagno (Izzy Style Wrestling) won by major decision over Dimitrios Lalezas (Lemont Bears) Maj 11-1</li>\n<li>Cons. Round 2 - Jacob Jensen (Crystal Lake Wizards) won by major decision over Cajaun Johnson (Urbana Tigers WC) Maj 8-0</li>\n<li>Cons. Round 2 - Jacob Macatangay (Force WC) won by fall over David Williams (Martinez Fox Valley Elite) Fall 2:57</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Joe Mushinsky (TJ Trained) won by decision over Luke Christie (Brawlers WC) Dec 3-2</li>\n<li>Cons. Round 2 - Brac Hooper (Champaign WC) won by decision over Nate Pacetti (Redhawk WC/Panther WC) Dec 4-2</li>\n<li>Cons. Round 2 - Dominik Mallinder (Izzy Style Wrestling) won by decision over Damen Michicich (Contender Wrestling) Dec 7-3</li>\n<li>Cons. Round 2 - Jayden Colon (Gomez Wrestling Academy) won by major decision over Austin Bauer (Edwardsville WC) Maj 11-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Jake Zator (Lemont Bears) won by fall over Nick Mabutas (Glenbard East Jr Rams WC) Fall 3:00</li>\n<li>Cons. Round 2 - Colin Kelly (Tinley Park Bulldogs WC) won by decision over Will Rude (Sauk Valley WC) Dec 4-3</li>\n<li>Cons. Round 2 - Anthony Montez (Junior Pioneer WC) won by decision over Jack Seacrist (Belvidere Bandits WC) Dec 6-4</li>\n<li>Cons. Round 2 - Carlos Munoz-Flores (Team 1006 Wrestling) won by major decision over Tyler Perry (Batavia WC) Maj 14-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Jalen Curtis (Greg Gomez Trained Wrestling) won by decision over Luke Schultz (O`Fallon Little Panthers WC) Dec 8-6</li>\n<li>Cons. Round 2 - Tyler Casey (TJ Trained) won in sudden victory - 1 over Dylan Sayles (Hononegah WC) SV-1 5-1</li>\n<li>Cons. Round 2 - Thomas Boland (Redhawk WC/Panther WC) won by major decision over Hunter Travis (Pontiac WC) Maj 12-1</li>\n<li>Cons. Round 2 - Alexis Janiak (Force WC) won by major decision over Joseph Olalde (Gomez Wrestling Academy) Maj 11-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Ryder Hunkins (Crystal Lake Wizards) won by major decision over Tyrin Newsome (Urbana Tigers WC) Maj 15-1</li>\n<li>Cons. Round 2 - Aidan Linden (Martinez Fox Valley Elite) won by decision over Alexander Miranda (Bulls WC) Dec 5-4</li>\n<li>Cons. Round 2 - Abraham Wojcikiewicz (Bulls WC) won by decision over Tommy Bennett (Redhawk WC/Panther WC) Dec 3-2</li>\n<li>Cons. Round 2 - Jack Lesher (SCN Youth WC) won by decision over Gaetano Console (Barrington Broncos WC) Dec 6-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Brandon Theres (Force WC) won by decision over Zane Timon (Team Mascoutah WC) Dec 5-1</li>\n<li>Cons. Round 2 - Gus Cambier (Sycamore WC) won by fall over Charles Koeppen (Redhawk WC/Panther WC) Fall 4:19</li>\n<li>Cons. Round 2 - Patrick Williams (Junior Cougar WC) won by fall over William Strelow (Oak Forest Warriors) Fall 2:16</li>\n<li>Cons. Round 2 - Hunter Janeczko (Yorkville WC) won by decision over Micheal Brown (Harvey Twisters) Dec 9-4</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Alaynia Bryant (Charleston WC) won by decision over Elijah Lee (Peoria Razorbacks WC) Dec 11-4</li>\n<li>Cons. Round 2 - Andrew Mensendike (The Law) won by fall over Owen Birkner (Carlyle WC) Fall 3:31</li>\n<li>Cons. Round 2 - Benjamin McLaughlin (Waukegan Youth WC) won by fall over Vincent McDonald (Little Huskies WC) Fall 2:36</li>\n<li>Cons. Round 2 - Mannix Faworski (Xtreme WC) won by fall over Attalia Watson (Crosstown Spartan Elite WC) Fall 0:57</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - David Stewart (Blackhawk WC) won by fall over Colby Loftsgaard (Urbana Tigers WC) Fall 4:18</li>\n<li>Cons. Round 2 - Moisey Trimble (Belleville Little Devils WC) won by fall over Jackson Funderburg (Sycamore WC) Fall 2:03</li>\n<li>Cons. Round 2 - Connor Nelligan (Mustang WC) won by fall over Ayden Salley (Barrington Broncos WC) Fall 0:57</li>\n<li>Cons. Round 2 - Liam McDermott (Celtic Elite) won by fall over Gabino Perez (Morton Little Mustangs) Fall 1:29</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Armond Edwards (O`Fallon Little Panthers WC) won by fall over Daniel Cushing (Little Rams Wrestling) Fall 1:26</li>\n<li>Cons. Round 2 - Gavin Mason (Team 1006 Wrestling) won by fall over Karson Richardson (Unity Youth WC) Fall 1:11</li>\n<li>Cons. Round 2 - Tyler Wilms (Lemont Bears) won by injury default over Hector Jimenez (The Wrestling Factory) Inj. 1:30</li>\n<li>Cons. Round 2 - Jack Brozny (Batavia WC) won by fall over Lee Smith (Da WC) Fall 2:18</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Nathaniel Dutkin (Wolves WC) won by fall over Makya Seibel (Belleville Little Devils WC) Fall 0:33</li>\n<li>Cons. Round 2 - Jadon Mims (Maywood Bucs) won by major decision over Jake Ziemniarski (Force WC) Maj 11-1</li>\n<li>Cons. Round 2 - Tyler Cerny (Red Raiders Wrestling Team) won by decision over Leno Campbell (Harvey Twisters) Dec 7-6</li>\n<li>Cons. Round 2 - Jonathan Gilbert (Maywood Bucs) won by decision over Braden Hunter (Team 1006 Wrestling) Dec 6-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Ghee Rachal (Harvey Twisters) won by fall over Aidan Avilez (Martinez Fox Valley Elite) Fall 1:01</li>\n<li>Cons. Round 2 - Bryan West (Belvidere Bandits WC) won by fall over Giovanni Amaya (Blackhawk WC) Fall 4:00</li>\n<li>Cons. Round 2 - Dillan Johnson (Force WC) won by fall over Eddie Solis (Marengo Youth WC) Fall 3:52</li>\n<li>Cons. Round 2 - Morley Coval (Martinez Fox Valley Elite) won by fall over Camren Stinespring (Storm Youth WC) Fall 0:42</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Evan Christison (Chatham WC) won by fall over Isaiah Hill (O`Fallon Little Panthers WC) Fall 2:54</li>\n<li>Cons. Round 2 - Robert Schneider (Celtic Elite) won by decision over Sterling Campbell (Edwardsville WC) Dec 4-0</li>\n<li>Cons. Round 2 - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Nathan Alas (Contender Wrestling) Fall 0:24</li>\n<li>Cons. Round 2 - Andre Hunt (Urbana Tigers WC) won by fall over John Davis (Thundercats) Fall 1:10</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Jerren Gille (Da WC) won by major decision over Jeremy Huf (Gomez Wrestling Academy) Maj 12-2</li>\n<li>Cons. Round 2 - Chase Hampton (Greg Gomez Trained Wrestling) won by decision over Nathan Knowlton (Celtic Elite) Dec 6-2</li>\n<li>Cons. Round 2 - Camren French (Mattoon Youth WC) won by major decision over Hunter Robbins (TJ Trained) Maj 8-0</li>\n<li>Cons. Round 2 - Carter Mikolajczak (Lemont Bears) won in tie breaker - 1 over Colden Dyer (SCN Youth WC) TB-1 2-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Javin Jackson-Bey (Harvey Twisters) won in sudden victory - 1 over Inocencio Garcia (Force WC) SV-1 6-4</li>\n<li>Cons. Round 2 - Noah Dial (Team 1006 Wrestling) won by decision over Korbin Bateman (Mattoon Youth WC) Dec 5-3</li>\n<li>Cons. Round 2 - Connor Kidd (TJ Trained) won by fall over Matthew Soltis (Lincoln-Way WC) Fall 4:19</li>\n<li>Cons. Round 2 - Ty Edwards (Team 1006 Wrestling) won in sudden victory - 1 over Max Siegel (Tinley Park Bulldogs WC) SV-1 4-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Brady Grennan (Sauk Valley WC) won by fall over Jaedyn Bloomfield (Rochester WC) Fall 0:58</li>\n<li>Cons. Round 2 - Trevor Silzer (Tinley Park Bulldogs WC) won by decision over Joey Malito (Celtic Elite) Dec 1-0</li>\n<li>Cons. Round 2 - William Baysingar (Arlington Cardinals WC) won by decision over Ryder Janeczko (Yorkville WC) Dec 7-2</li>\n<li>Cons. Round 2 - Michael DiBenedetto (Greg Gomez Trained Wrestling) won in sudden victory - 1 over Christian Favia (Gomez Wrestling Academy) SV-1 3-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Billy Meiszner (Force WC) won by decision over Nicolas Davidson (Crystal Lake Wizards) Dec 4-0</li>\n<li>Cons. Round 2 - Jesse Hahs (Herrin Jr WC) won by fall over Griffin Duffin (Mustang WC) Fall 1:56</li>\n<li>Cons. Round 2 - Chase Hall (Triad Little Knights WC) won by fall over Gavin Ranquist (Headlock Wrestling Academy) Fall 4:29</li>\n<li>Cons. Round 2 - Carter Hall (Champaign WC) won by decision over Jacob Gliva (Contender Wrestling) Dec 9-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Charlie Farmer (Young Guns) won by decision over Justin Warmowski (Fox Lake WC) Dec 4-2</li>\n<li>Cons. Round 2 - Joseph Knapp (Brawlers WC) won by decision over Thomas Porter (Naperville WC) Dec 7-2</li>\n<li>Cons. Round 2 - Kai Neumark (Arlington Cardinals WC) won by decision over Connor Surtin (Edwardsville WC) Dec 7-2</li>\n<li>Cons. Round 2 - Tyler Bentley (Lemont Bears) won by decision over Housten Armbruster (Bulls WC) Dec 4-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Marcel Bitner (Epic Wrestling) won by decision over Julian Gonzalez (Team 1006 Wrestling) Dec 6-0</li>\n<li>Cons. Round 2 - Samuel Henkle (Crystal Lake Wizards) won by decision over Jonathan Chaidez (Headlock Wrestling Academy) Dec 6-0</li>\n<li>Cons. Round 2 - Caleb Tyus (Bulls WC) won by decision over Jack Finnegan (Force WC) Dec 4-1</li>\n<li>Cons. Round 2 - Blain Christie (Brawlers WC) won by decision over Gage Reed (Storm Youth WC) Dec 8-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Hayden Halter (The Wrestling Factory) won by decision over Alex Ventimilla (Martinez Fox Valley Elite) Dec 4-3</li>\n<li>Cons. Round 2 - Michael D`orazio (SCN Youth WC) won by decision over Kenyon Boyce (Harvey Twisters) Dec 4-2</li>\n<li>Cons. Round 2 - Bryce Claypool (Team 1006 Wrestling) won by decision over Dylan Gvillo (Edwardsville WC) Dec 4-1</li>\n<li>Cons. Round 2 - Dayton Hall (Aces WC) won by tech fall over Felippe Willis (Peoria Razorbacks WC) TF 18-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Andrew Perez (Hinsdale Red Devil WC) won by fall over Connor Speck (TJ Trained) Fall 1:59</li>\n<li>Cons. Round 2 - Jake Tanquilut (Tinley Park Bulldogs WC) won by decision over Kaeden Kinison (Springfield Capitals Kids WC) Dec 6-3</li>\n<li>Cons. Round 2 - Cole Ferguson (Force WC) won by tech fall over Zach Lemp (Villa-Lombard Cougars) TF 16-1</li>\n<li>Cons. Round 2 - Javen Estrada (Tinley Park Bulldogs WC) won by fall over Gannen Kane (Junior Kahoks) Fall 2:43</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Joey Cape (Super Soldiers WC) won by decision over Jeremy Jakowitsch (Barrington Broncos WC) Dec 3-0</li>\n<li>Cons. Round 2 - John Baud (Brawlers WC) won by decision over Lucas Sutherland (Dakota WC) Dec 6-4</li>\n<li>Cons. Round 2 - Melvin Rogers (East St. Louis Wrestling) won by injury default over Billy Taylor (Junior Pioneer WC) Inj. 0:00</li>\n<li>Cons. Round 2 - Andrew Lira (The Wrestling Factory) won by major decision over Andrew Johnson (Team 1006 Wrestling) Maj 10-0</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Terrance Snapp (Will County Warriors) won by major decision over Rayce Zike (Cumberland Youth WC) Maj 11-3</li>\n<li>Cons. Round 2 - Dathan Wickson (Da WC) won by decision over Anthony Cantu (Team 1006 Wrestling) Dec 8-3</li>\n<li>Cons. Round 2 - Jack Villarreal (Lions WC) won by decision over Shane Moran (Crystal Lake Wizards) Dec 6-4</li>\n<li>Cons. Round 2 - Robert Major (Greg Gomez Trained Wrestling) won by major decision over Quinton Heilemeier (Dakota WC) Maj 11-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Brody Hallin (Crystal Lake Wizards) won by decision over Donovan Golden (Brawlers WC) Dec 5-2</li>\n<li>Cons. Round 2 - Grant Hansen (Maddog Wrestling Academy) won by fall over Raymond Arebalo (Crosstown Spartan Elite WC) Fall 0:18</li>\n<li>Cons. Round 2 - Raymond Hernandez (Little Huskies WC) won in tie breaker - 1 over Lucas Daly (Carbondale WC) TB-1 7-6</li>\n<li>Cons. Round 2 - Ryan Smith (Martinez Fox Valley Elite) won in overtime over Logan Fitz (Metamora Kids WC) OT 5-3</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Peyton Bechtold (Bulls WC) won by major decision over Brody Roth (North Shore Edge) Maj 14-4</li>\n<li>Cons. Round 2 - Jake Viloria (Little Huskies WC) won by major decision over Jacob Sollberger (Super Soldiers WC) Maj 9-1</li>\n<li>Cons. Round 2 - Christopher Carr (Izzy Style Wrestling) won by tech fall over Hakupo`mai Watson (Crosstown Spartan Elite WC) TF 17-2</li>\n<li>Cons. Round 2 - William White (Mt. Vernon Lions WC) won by decision over Cole Pradel (Team 1006 Wrestling) Dec 2-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Adrian McDougle (Bulls WC) won by fall over Connor Brooker (Thundercats) Fall 4:03</li>\n<li>Cons. Round 2 - Jacob Mumm (Minooka Indians Elite) won by fall over Elijah Chiaro (SCN Youth WC) Fall 2:48</li>\n<li>Cons. Round 2 - Drew Gvillo (Edwardsville WC) won by decision over Peyton Holt (Unity Youth WC) Dec 4-2</li>\n<li>Cons. Round 2 - Andrew Wenzel (Dakota WC) won by fall over Noah Lukosius (Force WC) Fall 3:41</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Cole Gaddis (Hoopeston Area WC) won by decision over Brenden Gran (Scorpion WC) Dec 6-0</li>\n<li>Cons. Round 2 - Joey Braunagel (O`Fallon Little Panthers WC) won by fall over Parker Bernabe (Harlem Cougars WC) Fall 3:38</li>\n<li>Cons. Round 2 - Jack Hartman (Barrington Broncos WC) won in tie breaker - 1 over Ramel Lee (Beat the Streets-Chicago) TB-1 3-2</li>\n<li>Cons. Round 2 - Omarion Dixon (Panther WC) won by decision over Nicholas Eby (Crawford County WC) Dec 11-6</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Elliott Lewis (Tinley Park Bulldogs WC) won by decision over Jacob Volz (Granite City Wrestling Association) Dec 9-4</li>\n<li>Cons. Round 2 - Immanuel Cervantes (Yorkville WC) won by decision over Javontay Bright (Maywood Bucs) Dec 7-6</li>\n<li>Cons. Round 2 - Mustafa St. Clair (Harvey Twisters) won by fall over Dakota Ritter (Riverton/Williamsville Youth Wrestling) Fall 0:25</li>\n<li>Cons. Round 2 - Payton Cardin (Metamora Kids WC) won by fall over James Clancy (Team 312) Fall 3:34</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Kyle Franklin (Gomez Wrestling Academy) won by major decision over Mason Ahlers (Edwardsville WC) Maj 16-6</li>\n<li>Cons. Round 2 - Daniel Colunga (Hoopeston Area WC) won by tech fall over Jacob Morel (Pitbull Wrestling Alliance) TF 21-4</li>\n<li>Cons. Round 2 - Trayson Young (East St. Louis Wrestling) won by decision over Jaxon Lambrigger (Tinley Park Bulldogs WC) Dec 8-1</li>\n<li>Cons. Round 2 - Dalton Riggle (Dakota WC) won by fall over Lucas Quinlan (Oak Forest Warriors) Fall 3:34</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Brock Donati (St. Charles WC) won by decision over Lucas Smith (Super Soldiers WC) Dec 5-0</li>\n<li>Cons. Round 2 - Alexander Aguirre (Martinez Fox Valley Elite) won by fall over Da`Marion Sanders (Will County Warriors) Fall 1:25</li>\n<li>Cons. Round 2 - Evan Dluzak (Lincoln-Way WC) won by fall over Roger Cornwell (Crawford County WC) Fall 3:48</li>\n<li>Cons. Round 2 - Nicholas Lopez (Tinley Park Bulldogs WC) won by decision over Jordon Paisley (Stockton Renegades) Dec 8-4</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Xander Schnake (Hononegah WC) won by decision over Ethan Pike (Team 1006 Wrestling) Dec 5-2</li>\n<li>Cons. Round 2 - Rewn Stearns (Murphysboro WC) won by fall over Jimmy Liston (Martinez Fox Valley Elite) Fall 0:39</li>\n<li>Cons. Round 2 - Clay Cichowski (Maine Eagles WC) won by decision over Basilo Betancourt (Harvey Twisters) Dec 1-0</li>\n<li>Cons. Round 2 - Alexis Aguirre (Martinez Fox Valley Elite) won by fall over Gavin Mouser (Vandalia Jr WC) Fall 1:11</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Jamison VanVickle (Oakwood Youth WC) won by injury default over William Penrod (Mt. Vernon Lions WC) Inj. 0:00</li>\n<li>Cons. Round 2 - Nathan Tomaso (Villa-Lombard Cougars) won by decision over Zachary Barlev (Team 1006 Wrestling) Dec 6-1</li>\n<li>Cons. Round 2 - Andre Naydenov (The Wrestling Factory) won by fall over Malachi Jennings (Crosstown Spartan Elite WC) Fall 1:22</li>\n<li>Cons. Round 2 - Kyle Johnson (Will County Warriors) won by fall over Chase Freitag (Edwardsville WC) Fall 4:22</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Connor Edge (The Law) won by fall over Ethan Girdler (Peoria Heights Minutemen WC) Fall 2:50</li>\n<li>Cons. Round 2 - Ryan Hannah (Panther WC) won by decision over Gabriel Craig (Benton WC) Dec 3-0</li>\n<li>Cons. Round 2 - Eric Grabavoy (Team 1006 Wrestling) won by fall over Cory Woods (Crawford County WC) Fall 1:51</li>\n<li>Cons. Round 2 - Cruz Quiroz (Blackhawk WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - J Guido Pigoni (SCN Youth WC) won by injury default over Isaac Bourge (Team 1006 Wrestling) Inj. 0:00</li>\n<li>Cons. Round 2 - Paul Woo (Villa-Lombard Cougars) won by major decision over Lauden Edwards (Villa-Lombard Cougars) Maj 12-0</li>\n<li>Cons. Round 2 - Kevin Martin (Tinley Park Bulldogs WC) won by major decision over Chance Arlt-Seip (Triad Little Knights WC) Maj 11-0</li>\n<li>Cons. Round 2 - Caelan Riley (The Wrestling Factory) won by fall over Alex Hadzima (SCN Youth WC) Fall 1:27</li>\n</ul>\n</section>",
  "Champ Semi`s & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semi`s &amp; Con Quarterfinal</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Antonio Alvarado (Crystal Lake Wizards) won by decision over Alexander Marre (Gomez Wrestling Academy) Dec 4-2</li>\n<li>Semifinal - Colin Young (Da WC) won by decision over Bryce Griffin (Bulls WC) Dec 3-1</li>\n<li>Cons. Round 3 - Cody Tavoso (Force WC) won by decision over Carter Rude (Sauk Valley WC) Dec 4-2</li>\n<li>Cons. Round 3 - Jackson Smith (Lemont Bears) won in sudden victory - 1 over Saul Trejo (Gomez Wrestling Academy) SV-1 6-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Christopher Moore (Crystal Lake Wizards) won by decision over Santino Robinson (Wrestling 365) Dec 7-3</li>\n<li>Semifinal - Tyler Guerra (Gomez Wrestling Academy) won by fall over Dillon Carlson (Crystal Lake Wizards) Fall 2:56</li>\n<li>Cons. Round 3 - Mason Alessio (Celtic Elite) won by decision over Renzo Morgan (The Wrestling Factory) Dec 8-2</li>\n<li>Cons. Round 3 - Evan Schiffman (Lemont Bears) won in sudden victory - 1 over Karsten Nordlie (Hononegah WC) SV-1 6-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Kannon Webster (Super Soldiers WC) won by major decision over Garrett Luke (Stockton Renegades) Maj 8-0</li>\n<li>Semifinal - Nasir Bailey (Harvey Twisters) won by fall over David Mayora (Izzy Style Wrestling) Fall 1:22</li>\n<li>Cons. Round 3 - Michael Calcagno (Izzy Style Wrestling) won by decision over Matthew Hollingsworth (Lincoln-Way WC) Dec 6-2</li>\n<li>Cons. Round 3 - Jacob Macatangay (Force WC) won by fall over Jacob Jensen (Crystal Lake Wizards) Fall 0:25</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Joseph Fernau (Izzy Style Wrestling) won by major decision over Arojae Hart (AJ Junior Wildcats WC) Maj 8-0</li>\n<li>Semifinal - Damari Reed (Harvey Twisters) won by fall over Cole Peters (TJ Trained-Springfield) Fall 2:48</li>\n<li>Cons. Round 3 - Brac Hooper (Champaign WC) won by fall over Joe Mushinsky (TJ Trained) Fall 3:30</li>\n<li>Cons. Round 3 - Jayden Colon (Gomez Wrestling Academy) won by fall over Dominik Mallinder (Izzy Style Wrestling) Fall 3:42</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Jordan Blew (Force WC) won by decision over Ethan Stiles (Izzy Style Wrestling) Dec 11-9</li>\n<li>Semifinal - Vincent Robinson (Harvey Twisters) won by fall over Grover Mays (Gladiator Elite) Fall 1:02</li>\n<li>Cons. Round 3 - Colin Kelly (Tinley Park Bulldogs WC) won by decision over Jake Zator (Lemont Bears) Dec 6-0</li>\n<li>Cons. Round 3 - Anthony Montez (Junior Pioneer WC) won by decision over Carlos Munoz-Flores (Team 1006 Wrestling) Dec 5-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Michael Kelly (Tinley Park Bulldogs WC) won by tech fall over Joshua Franklin (UP Town WC) TF 15-0</li>\n<li>Semifinal - Braulio Flores (Team 1006 Wrestling) won by fall over Cruz Ibarra (Martinez Fox Valley Elite) Fall 1:48</li>\n<li>Cons. Round 3 - Tyler Casey (TJ Trained) won by fall over Jalen Curtis (Greg Gomez Trained Wrestling) Fall 2:35</li>\n<li>Cons. Round 3 - Thomas Boland (Redhawk WC/Panther WC) won in sudden victory - 1 over Alexis Janiak (Force WC) SV-1 7-5</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Kole Brower (Moline WC) won by decision over Aj Heeg (Lemont Bears) Dec 4-2</li>\n<li>Semifinal - Tavius Hosley (Unity Youth WC) won by decision over Elijah Munoz (Team 1006 Wrestling) Dec 6-1</li>\n<li>Cons. Round 3 - Ryder Hunkins (Crystal Lake Wizards) won by tech fall over Aidan Linden (Martinez Fox Valley Elite) TF 16-0</li>\n<li>Cons. Round 3 - Abraham Wojcikiewicz (Bulls WC) won by decision over Jack Lesher (SCN Youth WC) Dec 6-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Aidan O`Connor (Celtic Elite) won by fall over Jack Cummings (North Shore Edge) Fall 2:17</li>\n<li>Semifinal - Jared Gumila (Force WC) won by fall over Colton Madura (Crystal Lake Wizards) Fall 0:43</li>\n<li>Cons. Round 3 - Gus Cambier (Sycamore WC) won by fall over Brandon Theres (Force WC) Fall 0:35</li>\n<li>Cons. Round 3 - Patrick Williams (Junior Cougar WC) won by decision over Hunter Janeczko (Yorkville WC) Dec 6-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Braden Stauffenberg (Izzy Style Wrestling) won by fall over Owen Jacobson (Epic Wrestling) Fall 1:55</li>\n<li>Semifinal - Bradley Gillum (Martinez Fox Valley Elite) won by fall over Blake Jorgensen (Celtic Elite) Fall 0:55</li>\n<li>Cons. Round 3 - Andrew Mensendike (The Law) won by fall over Alaynia Bryant (Charleston WC) Fall 1:20</li>\n<li>Cons. Round 3 - Mannix Faworski (Xtreme WC) won by fall over Benjamin McLaughlin (Waukegan Youth WC) Fall 2:03</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Michael Mosier (Barrington Broncos WC) won by fall over Cole Brannigan (Lemont Bears) Fall 1:01</li>\n<li>Semifinal - Montres Reed (Urbana Tigers WC) won by fall over Jacob Bottarini (SCN Youth WC) Fall 0:40</li>\n<li>Cons. Round 3 - Moisey Trimble (Belleville Little Devils WC) won by decision over David Stewart (Blackhawk WC) Dec 8-2</li>\n<li>Cons. Round 3 - Liam McDermott (Celtic Elite) won by fall over Connor Nelligan (Mustang WC) Fall 2:13</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Jokiah Sewell (Hawk WC) won by major decision over Braeden Tosterud (Elk Grove Junior Grens) Maj 16-4</li>\n<li>Semifinal - Eathin Diveley (Red Raiders Wrestling Team) won by fall over Seth Brooks (Granite City Wrestling Association) Fall 2:25</li>\n<li>Cons. Round 3 - Gavin Mason (Team 1006 Wrestling) won by decision over Armond Edwards (O`Fallon Little Panthers WC) Dec 12-7</li>\n<li>Cons. Round 3 - Jack Brozny (Batavia WC) won by fall over Tyler Wilms (Lemont Bears) Fall 1:51</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Rylee Edwards (Storm Youth WC) won by decision over Connor Lorden (LP Crunching Cavs) Dec 4-3</li>\n<li>Semifinal - Khamari Jones (Crosstown Spartan Elite WC) won by major decision over Savage Wates (Rock Island WC) Maj 21-12</li>\n<li>Cons. Round 3 - Jadon Mims (Maywood Bucs) won by decision over Nathaniel Dutkin (Wolves WC) Dec 6-3</li>\n<li>Cons. Round 3 - Jonathan Gilbert (Maywood Bucs) won by tech fall over Tyler Cerny (Red Raiders Wrestling Team) TF 16-1</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Nathan Wemstrom (Arlington Cardinals WC) won by fall over Robert Rigg (Charleston WC) Fall 0:58</li>\n<li>Semifinal - Charlie Jagusah (Junior Pioneer WC) won by fall over Jramuel Holman (Junior Comanche WC) Fall 2:12</li>\n<li>Cons. Round 3 - Ghee Rachal (Harvey Twisters) won by fall over Bryan West (Belvidere Bandits WC) Fall 0:30</li>\n<li>Cons. Round 3 - Dillan Johnson (Force WC) won by fall over Morley Coval (Martinez Fox Valley Elite) Fall 2:35</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Mason Kelly (Granite City Wrestling Association) won by decision over Brian Straight (Dundee Highlanders WC) Dec 5-0</li>\n<li>Semifinal - Ryan Boersma (Tinley Park Bulldogs WC) won by fall over Jack Eberhart (O`Fallon Little Panthers WC) Fall 1:16</li>\n<li>Cons. Round 3 - Evan Christison (Chatham WC) won by fall over Robert Schneider (Celtic Elite) Fall 0:42</li>\n<li>Cons. Round 3 - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Andre Hunt (Urbana Tigers WC) Fall 0:47</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Donny Pigoni (SCN Youth WC) won by decision over Deion Johnson (Harvey Twisters) Dec 2-1</li>\n<li>Semifinal - Nore Turner (Lincoln-Way WC) won by decision over Caleb Scott (Granite City Wrestling Association) Dec 5-0</li>\n<li>Cons. Round 3 - Jerren Gille (Da WC) won by decision over Chase Hampton (Greg Gomez Trained Wrestling) Dec 4-1</li>\n<li>Cons. Round 3 - Camren French (Mattoon Youth WC) won by fall over Carter Mikolajczak (Lemont Bears) Fall 1:16</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Benjamin Davino (SCN Youth WC) won by decision over Karter Guzman (Headlock Wrestling Academy) Dec 5-1</li>\n<li>Semifinal - Bryce Durlacher (The Wrestling Factory) won by decision over William Hupke (SCN Youth WC) Dec 6-2</li>\n<li>Cons. Round 3 - Javin Jackson-Bey (Harvey Twisters) won in sudden victory - 1 over Noah Dial (Team 1006 Wrestling) SV-1 5-3</li>\n<li>Cons. Round 3 - Ty Edwards (Team 1006 Wrestling) won by decision over Connor Kidd (TJ Trained) Dec 3-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Jameson Garcia (Gomez Wrestling Academy) won by decision over Shay Korhorn (Force WC) Dec 4-3</li>\n<li>Semifinal - Seth Mendoza (Contender Wrestling) won by decision over Colby Crouch (Triad Little Knights WC) Dec 6-3</li>\n<li>Cons. Round 3 - Trevor Silzer (Tinley Park Bulldogs WC) won by decision over Brady Grennan (Sauk Valley WC) Dec 6-5</li>\n<li>Cons. Round 3 - William Baysingar (Arlington Cardinals WC) won by decision over Michael DiBenedetto (Greg Gomez Trained Wrestling) Dec 2-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Jason Shaw (Roxana Outlaws) won by decision over Joel Mylin (Arlington Cardinals WC) Dec 6-2</li>\n<li>Semifinal - Owen Dunlap (Tinley Park Bulldogs WC) won by decision over Daniel Sheen (Izzy Style Wrestling) Dec 8-2</li>\n<li>Cons. Round 3 - Billy Meiszner (Force WC) won by decision over Jesse Hahs (Herrin Jr WC) Dec 6-5</li>\n<li>Cons. Round 3 - Carter Hall (Champaign WC) won by decision over Chase Hall (Triad Little Knights WC) Dec 7-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Joshua Koderhandt (Crusaders` Elite) won by decision over Nicholas Gonzalez (Gomez Wrestling Academy) Dec 9-2</li>\n<li>Semifinal - Tommy Curran (Martinez Fox Valley Elite) won by fall over Andrew Herbst (Hawk WC) Fall 3:38</li>\n<li>Cons. Round 3 - Charlie Farmer (Young Guns) won by tech fall over Joseph Knapp (Brawlers WC) TF 16-1</li>\n<li>Cons. Round 3 - Kai Neumark (Arlington Cardinals WC) won by major decision over Tyler Bentley (Lemont Bears) Maj 10-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Grant Matarelli (Edwardsville WC) won by decision over Andrew Lizak (Celtic Elite) Dec 3-2</li>\n<li>Semifinal - Danny Curran (Martinez Fox Valley Elite) won by decision over Jake Penzato (Izzy Style Wrestling) Dec 2-1</li>\n<li>Cons. Round 3 - Marcel Bitner (Epic Wrestling) won by decision over Samuel Henkle (Crystal Lake Wizards) Dec 6-2</li>\n<li>Cons. Round 3 - Blain Christie (Brawlers WC) won by decision over Caleb Tyus (Bulls WC) Dec 2-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Dean Hamiti (Celtic Elite) won by fall over Christian Olsen (Crystal Lake Wizards) Fall 2:23</li>\n<li>Semifinal - Diego Sotelo (Martinez Fox Valley Elite) won by decision over Jack Milos (Arlington Cardinals WC) Dec 4-3</li>\n<li>Cons. Round 3 - Hayden Halter (The Wrestling Factory) won by decision over Michael D`orazio (SCN Youth WC) Dec 2-0</li>\n<li>Cons. Round 3 - Dayton Hall (Aces WC) won by decision over Bryce Claypool (Team 1006 Wrestling) Dec 6-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Kylan Montgomery (Team Mascoutah WC) won by decision over Marko Hennin (Barrington Broncos WC) Dec 6-0</li>\n<li>Semifinal - Nain Vazquez (Martinez Fox Valley Elite) won by tech fall over Zach Sato (Team 1006 Wrestling) TF 18-1</li>\n<li>Cons. Round 3 - Andrew Perez (Hinsdale Red Devil WC) won by decision over Jake Tanquilut (Tinley Park Bulldogs WC) Dec 7-0</li>\n<li>Cons. Round 3 - Javen Estrada (Tinley Park Bulldogs WC) won by decision over Cole Ferguson (Force WC) Dec 4-2</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Vincent Zerban (Bulls WC) won by tech fall over Tyler Milani (Tinley Park Bulldogs WC) TF 16-0</li>\n<li>Semifinal - Michael Caliendo (Batavia WC) won by decision over Mitchell Rudsinski (Tinley Park Bulldogs WC) Dec 7-1</li>\n<li>Cons. Round 3 - Joey Cape (Super Soldiers WC) won by decision over John Baud (Brawlers WC) Dec 5-0</li>\n<li>Cons. Round 3 - Andrew Lira (The Wrestling Factory) won in tie breaker - 1 over Melvin Rogers (East St. Louis Wrestling) TB-1 2-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Connor Gaynor (Tinley Park Bulldogs WC) won by tech fall over Riley Woods (Batavia WC) TF 15-0</li>\n<li>Semifinal - Joel Vandervere (The Wrestling Factory) won by tech fall over Adam Thebeau (East St. Louis Wrestling) TF 18-2</li>\n<li>Cons. Round 3 - Dathan Wickson (Da WC) won in sudden victory - 1 over Terrance Snapp (Will County Warriors) SV-1 3-1</li>\n<li>Cons. Round 3 - Robert Major (Greg Gomez Trained Wrestling) won by major decision over Jack Villarreal (Lions WC) Maj 12-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Jack Patting (Young Guns) won by decision over Jack Coyle (Mustang WC) Dec 4-2</li>\n<li>Semifinal - Jake Matthews (Headlock Wrestling Academy) won by fall over Amir Johnson (Lincoln-Way WC) Fall 2:41</li>\n<li>Cons. Round 3 - Brody Hallin (Crystal Lake Wizards) won by fall over Grant Hansen (Maddog Wrestling Academy) Fall 2:35</li>\n<li>Cons. Round 3 - Ryan Smith (Martinez Fox Valley Elite) won in sudden victory - 1 over Raymond Hernandez (Little Huskies WC) SV-1 5-3</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Austin Abitua (Da WC) won by decision over Kennedy Blades (Martinez Fox Valley Elite) Dec 9-3</li>\n<li>Semifinal - Bryan Smith (Martinez Fox Valley Elite) won by decision over Tony Pacetti (Redhawk WC/Panther WC) Dec 9-2</li>\n<li>Cons. Round 3 - Jake Viloria (Little Huskies WC) won by major decision over Peyton Bechtold (Bulls WC) Maj 11-0</li>\n<li>Cons. Round 3 - William White (Mt. Vernon Lions WC) won by major decision over Christopher Carr (Izzy Style Wrestling) Maj 13-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Dylan Connell (The Wrestling Factory) won by fall over Robert Gaylord (Redhawk WC/Panther WC) Fall 1:03</li>\n<li>Semifinal - Christopher Worcester (Villa-Lombard Cougars) won by tech fall over Antonio Torres (Martinez Fox Valley Elite) TF 22-7</li>\n<li>Cons. Round 3 - Adrian McDougle (Bulls WC) won by tech fall over Jacob Mumm (Minooka Indians Elite) TF 15-0</li>\n<li>Cons. Round 3 - Andrew Wenzel (Dakota WC) won by major decision over Drew Gvillo (Edwardsville WC) Maj 12-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Isaiah Parker (The Wrestling Factory) won by fall over Mario Tormey (Tinley Park Bulldogs WC) Fall 2:38</li>\n<li>Semifinal - Joey Gaskill (Elk Grove Junior Grens) won by decision over Ricardo Salinas (Evanston School of Wrestling) Dec 2-1</li>\n<li>Cons. Round 3 - Cole Gaddis (Hoopeston Area WC) won by fall over Joey Braunagel (O`Fallon Little Panthers WC) Fall 1:47</li>\n<li>Cons. Round 3 - Jack Hartman (Barrington Broncos WC) won by forfeit over Omarion Dixon (Panther WC) FF</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Benjamin Harvey (Rochelle WC) won by decision over Michael Roath (SCN Youth WC) Dec 1-0</li>\n<li>Semifinal - Antonio Figueroa (Hononegah WC) won by decision over Brandon Navarro (Martinez Fox Valley Elite) Dec 8-6</li>\n<li>Cons. Round 3 - Immanuel Cervantes (Yorkville WC) won by fall over Elliott Lewis (Tinley Park Bulldogs WC) Fall 0:44</li>\n<li>Cons. Round 3 - Mustafa St. Clair (Harvey Twisters) won by fall over Payton Cardin (Metamora Kids WC) Fall 0:39</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Tommy Evans (Wolves WC) won by tech fall over Ethan Yu (Tinley Park Bulldogs WC) TF 17-0</li>\n<li>Semifinal - Matthew Ramirez (Barrington Broncos WC) won by major decision over John Pacewic (Celtic Elite) Maj 18-4</li>\n<li>Cons. Round 3 - Kyle Franklin (Gomez Wrestling Academy) won by decision over Daniel Colunga (Hoopeston Area WC) Dec 13-6</li>\n<li>Cons. Round 3 - Trayson Young (East St. Louis Wrestling) won by fall over Dalton Riggle (Dakota WC) Fall 3:43</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Apollo Gothard (Lemont Bears) won by fall over Ryan Golnick (Golden Eagles WC) Fall 1:17</li>\n<li>Semifinal - Louie Cretsinger (Xtreme WC) won by fall over Dzhabrail Khurshidov (Blackhawk WC) Fall 0:41</li>\n<li>Cons. Round 3 - Alexander Aguirre (Martinez Fox Valley Elite) won in sudden victory - 1 over Brock Donati (St. Charles WC) SV-1 11-9</li>\n<li>Cons. Round 3 - Nicholas Lopez (Tinley Park Bulldogs WC) won by major decision over Evan Dluzak (Lincoln-Way WC) Maj 10-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Brandon Hoselton (Prairie Central Hawks) won by fall over Aydan Trueblood (TJ Trained) Fall 1:50</li>\n<li>Semifinal - Tyson Heerman (Peoria Razorbacks WC) won by decision over Gabriel Taylor (Mt. Vernon Lions WC) Dec 2-0</li>\n<li>Cons. Round 3 - Xander Schnake (Hononegah WC) won by major decision over Rewn Stearns (Murphysboro WC) Maj 10-0</li>\n<li>Cons. Round 3 - Clay Cichowski (Maine Eagles WC) won by decision over Alexis Aguirre (Martinez Fox Valley Elite) Dec 6-3</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Colin Baker (Lions WC) won by injury default over Nikolas Mishka (Force WC) Inj. 0:00</li>\n<li>Semifinal - Tyler Williams (Riverton/Williamsville Youth Wrestling) won in overtime over Brock Neill (LP Crunching Cavs) OT 5-3</li>\n<li>Cons. Round 3 - Nathan Tomaso (Villa-Lombard Cougars) won by fall over Jamison VanVickle (Oakwood Youth WC) Fall 1:22</li>\n<li>Cons. Round 3 - Kyle Johnson (Will County Warriors) won in sudden victory - 1 over Andre Naydenov (The Wrestling Factory) SV-1 5-3</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Andrew Kaltmayer (Edwardsville WC) won by fall over Dreyden Shelton (Urbana Tigers WC) Fall 1:25</li>\n<li>Semifinal - Hayden Copass (Storm Youth WC) won by fall over Dustin Olmstead (Belleville Little Devils WC) Fall 4:42</li>\n<li>Cons. Round 3 - Ryan Hannah (Panther WC) won by decision over Connor Edge (The Law) Dec 6-0</li>\n<li>Cons. Round 3 - Cruz Quiroz (Blackhawk WC) won by fall over Eric Grabavoy (Team 1006 Wrestling) Fall 3:44</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Phoenix Mordick (Dakota WC) won by major decision over Dontae Jackson (East St. Louis Wrestling) Maj 13-4</li>\n<li>Semifinal - Samuel Hayes (Contender Wrestling) won by decision over Hunter Bogwill (Greg Gomez Trained Wrestling) Dec 11-5</li>\n<li>Cons. Round 3 - Paul Woo (Villa-Lombard Cougars) won by decision over J Guido Pigoni (SCN Youth WC) Dec 4-1</li>\n<li>Cons. Round 3 - Kevin Martin (Tinley Park Bulldogs WC) won by fall over Caelan Riley (The Wrestling Factory) Fall 0:40</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Alexander Marre (Gomez Wrestling Academy) won by major decision over Cody Tavoso (Force WC) Maj 10-2</li>\n<li>Cons. Semi - Bryce Griffin (Bulls WC) won by decision over Jackson Smith (Lemont Bears) Dec 3-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Santino Robinson (Wrestling 365) won by decision over Mason Alessio (Celtic Elite) Dec 6-0</li>\n<li>Cons. Semi - Dillon Carlson (Crystal Lake Wizards) won by decision over Evan Schiffman (Lemont Bears) Dec 7-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Garrett Luke (Stockton Renegades) won by decision over Michael Calcagno (Izzy Style Wrestling) Dec 8-4</li>\n<li>Cons. Semi - David Mayora (Izzy Style Wrestling) won in sudden victory - 1 over Jacob Macatangay (Force WC) SV-1 11-9</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Brac Hooper (Champaign WC) won by decision over Arojae Hart (AJ Junior Wildcats WC) Dec 4-3</li>\n<li>Cons. Semi - Cole Peters (TJ Trained-Springfield) won by decision over Jayden Colon (Gomez Wrestling Academy) Dec 7-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Ethan Stiles (Izzy Style Wrestling) won by decision over Colin Kelly (Tinley Park Bulldogs WC) Dec 8-2</li>\n<li>Cons. Semi - Grover Mays (Gladiator Elite) won by decision over Anthony Montez (Junior Pioneer WC) Dec 7-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Tyler Casey (TJ Trained) won by medical forfeit over Joshua Franklin (UP Town WC) MFF</li>\n<li>Cons. Semi - Cruz Ibarra (Martinez Fox Valley Elite) won by fall over Thomas Boland (Redhawk WC/Panther WC) Fall 1:10</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Aj Heeg (Lemont Bears) won by decision over Ryder Hunkins (Crystal Lake Wizards) Dec 3-2</li>\n<li>Cons. Semi - Elijah Munoz (Team 1006 Wrestling) won by fall over Abraham Wojcikiewicz (Bulls WC) Fall 2:26</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Jack Cummings (North Shore Edge) won by fall over Gus Cambier (Sycamore WC) Fall 0:56</li>\n<li>Cons. Semi - Colton Madura (Crystal Lake Wizards) won by major decision over Patrick Williams (Junior Cougar WC) Maj 9-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Andrew Mensendike (The Law) won by disqualification over Owen Jacobson (Epic Wrestling) DQ</li>\n<li>Cons. Semi - Mannix Faworski (Xtreme WC) won by major decision over Blake Jorgensen (Celtic Elite) Maj 8-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Cole Brannigan (Lemont Bears) won by decision over Moisey Trimble (Belleville Little Devils WC) Dec 5-3</li>\n<li>Cons. Semi - Jacob Bottarini (SCN Youth WC) won by decision over Liam McDermott (Celtic Elite) Dec 2-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Braeden Tosterud (Elk Grove Junior Grens) won by major decision over Gavin Mason (Team 1006 Wrestling) Maj 10-0</li>\n<li>Cons. Semi - Seth Brooks (Granite City Wrestling Association) won by decision over Jack Brozny (Batavia WC) Dec 11-6</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Jadon Mims (Maywood Bucs) won by major decision over Connor Lorden (LP Crunching Cavs) Maj 9-1</li>\n<li>Cons. Semi - Savage Wates (Rock Island WC) won by fall over Jonathan Gilbert (Maywood Bucs) Fall 0:55</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Ghee Rachal (Harvey Twisters) won by fall over Robert Rigg (Charleston WC) Fall 0:57</li>\n<li>Cons. Semi - Jramuel Holman (Junior Comanche WC) won by fall over Dillan Johnson (Force WC) Fall 2:04</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Brian Straight (Dundee Highlanders WC) won by decision over Evan Christison (Chatham WC) Dec 3-1</li>\n<li>Cons. Semi - Jack Eberhart (O`Fallon Little Panthers WC) won by fall over Joey Ochoa (Red Raiders Wrestling Team) Fall 1:50</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Deion Johnson (Harvey Twisters) won by major decision over Jerren Gille (Da WC) Maj 10-0</li>\n<li>Cons. Semi - Camren French (Mattoon Youth WC) won by fall over Caleb Scott (Granite City Wrestling Association) Fall 2:25</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Karter Guzman (Headlock Wrestling Academy) won by decision over Javin Jackson-Bey (Harvey Twisters) Dec 4-2</li>\n<li>Cons. Semi - William Hupke (SCN Youth WC) won by decision over Ty Edwards (Team 1006 Wrestling) Dec 5-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Trevor Silzer (Tinley Park Bulldogs WC) won in tie breaker - 1 over Shay Korhorn (Force WC) TB-1 2-1</li>\n<li>Cons. Semi - William Baysingar (Arlington Cardinals WC) won by decision over Colby Crouch (Triad Little Knights WC) Dec 2-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Billy Meiszner (Force WC) won by decision over Joel Mylin (Arlington Cardinals WC) Dec 3-2</li>\n<li>Cons. Semi - Daniel Sheen (Izzy Style Wrestling) won by decision over Carter Hall (Champaign WC) Dec 6-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Charlie Farmer (Young Guns) Dec 6-0</li>\n<li>Cons. Semi - Andrew Herbst (Hawk WC) won in sudden victory - 1 over Kai Neumark (Arlington Cardinals WC) SV-1 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Marcel Bitner (Epic Wrestling) won by decision over Andrew Lizak (Celtic Elite) Dec 4-3</li>\n<li>Cons. Semi - Blain Christie (Brawlers WC) won in sudden victory - 1 over Jake Penzato (Izzy Style Wrestling) SV-1 8-6</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Hayden Halter (The Wrestling Factory) won by decision over Christian Olsen (Crystal Lake Wizards) Dec 2-0</li>\n<li>Cons. Semi - Jack Milos (Arlington Cardinals WC) won by decision over Dayton Hall (Aces WC) Dec 9-3</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Andrew Perez (Hinsdale Red Devil WC) won by decision over Marko Hennin (Barrington Broncos WC) Dec 5-1</li>\n<li>Cons. Semi - Javen Estrada (Tinley Park Bulldogs WC) won by decision over Zach Sato (Team 1006 Wrestling) Dec 9-5</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Joey Cape (Super Soldiers WC) won by decision over Tyler Milani (Tinley Park Bulldogs WC) Dec 9-3</li>\n<li>Cons. Semi - Andrew Lira (The Wrestling Factory) won by fall over Mitchell Rudsinski (Tinley Park Bulldogs WC) Fall 2:05</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Riley Woods (Batavia WC) won by decision over Dathan Wickson (Da WC) Dec 5-3</li>\n<li>Cons. Semi - Robert Major (Greg Gomez Trained Wrestling) won by fall over Adam Thebeau (East St. Louis Wrestling) Fall 2:45</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Jack Coyle (Mustang WC) won in overtime over Brody Hallin (Crystal Lake Wizards) OT 7-5</li>\n<li>Cons. Semi - Ryan Smith (Martinez Fox Valley Elite) won by decision over Amir Johnson (Lincoln-Way WC) Dec 2-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Jake Viloria (Little Huskies WC) won by decision over Kennedy Blades (Martinez Fox Valley Elite) Dec 6-3</li>\n<li>Cons. Semi - William White (Mt. Vernon Lions WC) won by major decision over Tony Pacetti (Redhawk WC/Panther WC) Maj 12-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Robert Gaylord (Redhawk WC/Panther WC) won in sudden victory - 1 over Adrian McDougle (Bulls WC) SV-1 8-7</li>\n<li>Cons. Semi - Antonio Torres (Martinez Fox Valley Elite) won by major decision over Andrew Wenzel (Dakota WC) Maj 10-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Mario Tormey (Tinley Park Bulldogs WC) won by decision over Cole Gaddis (Hoopeston Area WC) Dec 6-3</li>\n<li>Cons. Semi - Ricardo Salinas (Evanston School of Wrestling) won by fall over Jack Hartman (Barrington Broncos WC) Fall 2:05</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Immanuel Cervantes (Yorkville WC) won by fall over Michael Roath (SCN Youth WC) Fall 1:19</li>\n<li>Cons. Semi - Mustafa St. Clair (Harvey Twisters) won by decision over Brandon Navarro (Martinez Fox Valley Elite) Dec 8-7</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Kyle Franklin (Gomez Wrestling Academy) won by decision over Ethan Yu (Tinley Park Bulldogs WC) Dec 10-4</li>\n<li>Cons. Semi - Trayson Young (East St. Louis Wrestling) won by fall over John Pacewic (Celtic Elite) Fall 0:55</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Ryan Golnick (Golden Eagles WC) won by decision over Alexander Aguirre (Martinez Fox Valley Elite) Dec 6-5</li>\n<li>Cons. Semi - Dzhabrail Khurshidov (Blackhawk WC) won by fall over Nicholas Lopez (Tinley Park Bulldogs WC) Fall 2:48</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Aydan Trueblood (TJ Trained) won by decision over Xander Schnake (Hononegah WC) Dec 9-7</li>\n<li>Cons. Semi - Gabriel Taylor (Mt. Vernon Lions WC) won by decision over Clay Cichowski (Maine Eagles WC) Dec 2-1</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Nathan Tomaso (Villa-Lombard Cougars) won by injury default over Nikolas Mishka (Force WC) Inj. 0:00</li>\n<li>Cons. Semi - Brock Neill (LP Crunching Cavs) won by fall over Kyle Johnson (Will County Warriors) Fall 0:58</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Dreyden Shelton (Urbana Tigers WC) won by no contest over Ryan Hannah (Panther WC) NC</li>\n<li>Cons. Semi - Dustin Olmstead (Belleville Little Devils WC) won by fall over Cruz Quiroz (Blackhawk WC) Fall 1:47</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Dontae Jackson (East St. Louis Wrestling) won by fall over Paul Woo (Villa-Lombard Cougars) Fall 0:47</li>\n<li>Cons. Semi - Kevin Martin (Tinley Park Bulldogs WC) won by decision over Hunter Bogwill (Greg Gomez Trained Wrestling) Dec 6-2</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Alexander Marre (Gomez Wrestling Academy) won by decision over Bryce Griffin (Bulls WC) Dec 5-1</li>\n<li>5th Place Match - Cody Tavoso (Force WC) won by decision over Jackson Smith (Lemont Bears) Dec 7-3</li>\n<li>7th Place Match - Saul Trejo (Gomez Wrestling Academy) won by decision over Carter Rude (Sauk Valley WC) Dec 4-1</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Santino Robinson (Wrestling 365) won by major decision over Dillon Carlson (Crystal Lake Wizards) Maj 11-0</li>\n<li>5th Place Match - Mason Alessio (Celtic Elite) won by decision over Evan Schiffman (Lemont Bears) Dec 4-0</li>\n<li>7th Place Match - Renzo Morgan (The Wrestling Factory) won by decision over Karsten Nordlie (Hononegah WC) Dec 4-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - David Mayora (Izzy Style Wrestling) won by fall over Garrett Luke (Stockton Renegades) Fall 3:50</li>\n<li>5th Place Match - Jacob Macatangay (Force WC) won by decision over Michael Calcagno (Izzy Style Wrestling) Dec 6-5</li>\n<li>7th Place Match - Matthew Hollingsworth (Lincoln-Way WC) won by decision over Jacob Jensen (Crystal Lake Wizards) Dec 6-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Brac Hooper (Champaign WC) won in tie breaker - 1 over Cole Peters (TJ Trained-Springfield) TB-1 2-1</li>\n<li>5th Place Match - Arojae Hart (AJ Junior Wildcats WC) won by decision over Jayden Colon (Gomez Wrestling Academy) Dec 7-3</li>\n<li>7th Place Match - Dominik Mallinder (Izzy Style Wrestling) won by decision over Joe Mushinsky (TJ Trained) Dec 5-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Ethan Stiles (Izzy Style Wrestling) won by major decision over Grover Mays (Gladiator Elite) Maj 14-6</li>\n<li>5th Place Match - Colin Kelly (Tinley Park Bulldogs WC) won by decision over Anthony Montez (Junior Pioneer WC) Dec 6-2</li>\n<li>7th Place Match - Carlos Munoz-Flores (Team 1006 Wrestling) won by decision over Jake Zator (Lemont Bears) Dec 2-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Tyler Casey (TJ Trained) won by fall over Cruz Ibarra (Martinez Fox Valley Elite) Fall 2:19</li>\n<li>5th Place Match - Thomas Boland (Redhawk WC/Panther WC) won by injury default over Joshua Franklin (UP Town WC) Inj. 0:00</li>\n<li>7th Place Match - Jalen Curtis (Greg Gomez Trained Wrestling) won by decision over Alexis Janiak (Force WC) Dec 1-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Aj Heeg (Lemont Bears) won by fall over Elijah Munoz (Team 1006 Wrestling) Fall 2:32</li>\n<li>5th Place Match - Ryder Hunkins (Crystal Lake Wizards) won by major decision over Abraham Wojcikiewicz (Bulls WC) Maj 12-0</li>\n<li>7th Place Match - Aidan Linden (Martinez Fox Valley Elite) won by decision over Jack Lesher (SCN Youth WC) Dec 7-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Jack Cummings (North Shore Edge) won by decision over Colton Madura (Crystal Lake Wizards) Dec 8-6</li>\n<li>5th Place Match - Patrick Williams (Junior Cougar WC) won by decision over Gus Cambier (Sycamore WC) Dec 5-2</li>\n<li>7th Place Match - Brandon Theres (Force WC) won by decision over Hunter Janeczko (Yorkville WC) Dec 8-5</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Mannix Faworski (Xtreme WC) won by injury default over Andrew Mensendike (The Law) Inj. 0:00</li>\n<li>5th Place Match - Owen Jacobson (Epic Wrestling) won by tech fall over Blake Jorgensen (Celtic Elite) TF 17-2</li>\n<li>7th Place Match - Benjamin McLaughlin (Waukegan Youth WC) won by major decision over Alaynia Bryant (Charleston WC) Maj 8-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Jacob Bottarini (SCN Youth WC) won by major decision over Cole Brannigan (Lemont Bears) Maj 8-0</li>\n<li>5th Place Match - Liam McDermott (Celtic Elite) won by decision over Moisey Trimble (Belleville Little Devils WC) Dec 7-0</li>\n<li>7th Place Match - Connor Nelligan (Mustang WC) won by fall over David Stewart (Blackhawk WC) Fall 3:31</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Braeden Tosterud (Elk Grove Junior Grens) won by decision over Seth Brooks (Granite City Wrestling Association) Dec 4-1</li>\n<li>5th Place Match - Jack Brozny (Batavia WC) won by major decision over Gavin Mason (Team 1006 Wrestling) Maj 11-1</li>\n<li>7th Place Match - Armond Edwards (O`Fallon Little Panthers WC) won by fall over Tyler Wilms (Lemont Bears) Fall 2:28</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Savage Wates (Rock Island WC) won by fall over Jadon Mims (Maywood Bucs) Fall 0:54</li>\n<li>5th Place Match - Connor Lorden (LP Crunching Cavs) won by decision over Jonathan Gilbert (Maywood Bucs) Dec 9-3</li>\n<li>7th Place Match - Tyler Cerny (Red Raiders Wrestling Team) won by decision over Nathaniel Dutkin (Wolves WC) Dec 8-5</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Ghee Rachal (Harvey Twisters) won by fall over Jramuel Holman (Junior Comanche WC) Fall 1:24</li>\n<li>5th Place Match - Dillan Johnson (Force WC) won by fall over Robert Rigg (Charleston WC) Fall 2:46</li>\n<li>7th Place Match - Morley Coval (Martinez Fox Valley Elite) won by decision over Bryan West (Belvidere Bandits WC) Dec 7-3</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Brian Straight (Dundee Highlanders WC) won by decision over Jack Eberhart (O`Fallon Little Panthers WC) Dec 1-0</li>\n<li>5th Place Match - Evan Christison (Chatham WC) won by fall over Joey Ochoa (Red Raiders Wrestling Team) Fall 0:48</li>\n<li>7th Place Match - Robert Schneider (Celtic Elite) won by fall over Andre Hunt (Urbana Tigers WC) Fall 2:19</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Deion Johnson (Harvey Twisters) won by decision over Camren French (Mattoon Youth WC) Dec 4-2</li>\n<li>5th Place Match - Jerren Gille (Da WC) won by decision over Caleb Scott (Granite City Wrestling Association) Dec 6-3</li>\n<li>7th Place Match - Chase Hampton (Greg Gomez Trained Wrestling) won by fall over Carter Mikolajczak (Lemont Bears) Fall 1:56</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - William Hupke (SCN Youth WC) won by decision over Karter Guzman (Headlock Wrestling Academy) Dec 5-0</li>\n<li>5th Place Match - Javin Jackson-Bey (Harvey Twisters) won by major decision over Ty Edwards (Team 1006 Wrestling) Maj 11-2</li>\n<li>7th Place Match - Noah Dial (Team 1006 Wrestling) won by decision over Connor Kidd (TJ Trained) Dec 5-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - William Baysingar (Arlington Cardinals WC) won by decision over Trevor Silzer (Tinley Park Bulldogs WC) Dec 3-2</li>\n<li>5th Place Match - Shay Korhorn (Force WC) won by decision over Colby Crouch (Triad Little Knights WC) Dec 4-2</li>\n<li>7th Place Match - Brady Grennan (Sauk Valley WC) won by fall over Michael DiBenedetto (Greg Gomez Trained Wrestling) Fall 4:11</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Daniel Sheen (Izzy Style Wrestling) won by decision over Billy Meiszner (Force WC) Dec 5-0</li>\n<li>5th Place Match - Carter Hall (Champaign WC) won by decision over Joel Mylin (Arlington Cardinals WC) Dec 3-2</li>\n<li>7th Place Match - Jesse Hahs (Herrin Jr WC) won by decision over Chase Hall (Triad Little Knights WC) Dec 3-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Nicholas Gonzalez (Gomez Wrestling Academy) won by decision over Andrew Herbst (Hawk WC) Dec 5-3</li>\n<li>5th Place Match - Charlie Farmer (Young Guns) won by decision over Kai Neumark (Arlington Cardinals WC) Dec 4-1</li>\n<li>7th Place Match - Joseph Knapp (Brawlers WC) won by decision over Tyler Bentley (Lemont Bears) Dec 7-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Blain Christie (Brawlers WC) won by decision over Marcel Bitner (Epic Wrestling) Dec 7-5</li>\n<li>5th Place Match - Jake Penzato (Izzy Style Wrestling) won by decision over Andrew Lizak (Celtic Elite) Dec 2-1</li>\n<li>7th Place Match - Caleb Tyus (Bulls WC) won by decision over Samuel Henkle (Crystal Lake Wizards) Dec 9-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Hayden Halter (The Wrestling Factory) won by decision over Jack Milos (Arlington Cardinals WC) Dec 9-2</li>\n<li>5th Place Match - Dayton Hall (Aces WC) won by fall over Christian Olsen (Crystal Lake Wizards) Fall 1:29</li>\n<li>7th Place Match - Michael D`orazio (SCN Youth WC) won by decision over Bryce Claypool (Team 1006 Wrestling) Dec 3-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Javen Estrada (Tinley Park Bulldogs WC) won by tech fall over Andrew Perez (Hinsdale Red Devil WC) TF 17-2</li>\n<li>5th Place Match - Marko Hennin (Barrington Broncos WC) won by decision over Zach Sato (Team 1006 Wrestling) Dec 3-0</li>\n<li>7th Place Match - Jake Tanquilut (Tinley Park Bulldogs WC) won by decision over Cole Ferguson (Force WC) Dec 7-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Joey Cape (Super Soldiers WC) won by decision over Andrew Lira (The Wrestling Factory) Dec 3-2</li>\n<li>5th Place Match - Mitchell Rudsinski (Tinley Park Bulldogs WC) won by decision over Tyler Milani (Tinley Park Bulldogs WC) Dec 9-3</li>\n<li>7th Place Match - Melvin Rogers (East St. Louis Wrestling) won by fall over John Baud (Brawlers WC) Fall 1:13</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Robert Major (Greg Gomez Trained Wrestling) won by decision over Riley Woods (Batavia WC) Dec 6-0</li>\n<li>5th Place Match - Adam Thebeau (East St. Louis Wrestling) won by major decision over Dathan Wickson (Da WC) Maj 13-0</li>\n<li>7th Place Match - Terrance Snapp (Will County Warriors) won by fall over Jack Villarreal (Lions WC) Fall 3:48</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Ryan Smith (Martinez Fox Valley Elite) won by major decision over Jack Coyle (Mustang WC) Maj 11-3</li>\n<li>5th Place Match - Brody Hallin (Crystal Lake Wizards) won by decision over Amir Johnson (Lincoln-Way WC) Dec 7-0</li>\n<li>7th Place Match - Raymond Hernandez (Little Huskies WC) won by major decision over Grant Hansen (Maddog Wrestling Academy) Maj 13-3</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Jake Viloria (Little Huskies WC) won by decision over William White (Mt. Vernon Lions WC) Dec 4-1</li>\n<li>5th Place Match - Kennedy Blades (Martinez Fox Valley Elite) won by decision over Tony Pacetti (Redhawk WC/Panther WC) Dec 6-0</li>\n<li>7th Place Match - Peyton Bechtold (Bulls WC) won by fall over Christopher Carr (Izzy Style Wrestling) Fall 2:43</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Antonio Torres (Martinez Fox Valley Elite) won by fall over Robert Gaylord (Redhawk WC/Panther WC) Fall 0:49</li>\n<li>5th Place Match - Andrew Wenzel (Dakota WC) won by fall over Adrian McDougle (Bulls WC) Fall 0:50</li>\n<li>7th Place Match - Jacob Mumm (Minooka Indians Elite) won by decision over Drew Gvillo (Edwardsville WC) Dec 8-3</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Mario Tormey (Tinley Park Bulldogs WC) won in sudden victory - 1 over Ricardo Salinas (Evanston School of Wrestling) SV-1 6-4</li>\n<li>5th Place Match - Cole Gaddis (Hoopeston Area WC) won by decision over Jack Hartman (Barrington Broncos WC) Dec 7-2</li>\n<li>7th Place Match - Joey Braunagel (O`Fallon Little Panthers WC) won by forfeit over Omarion Dixon (Panther WC) FF</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Mustafa St. Clair (Harvey Twisters) won by fall over Immanuel Cervantes (Yorkville WC) Fall 1:45</li>\n<li>5th Place Match - Brandon Navarro (Martinez Fox Valley Elite) won by fall over Michael Roath (SCN Youth WC) Fall 4:27</li>\n<li>7th Place Match - Elliott Lewis (Tinley Park Bulldogs WC) won by fall over Payton Cardin (Metamora Kids WC) Fall 3:28</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Trayson Young (East St. Louis Wrestling) won by decision over Kyle Franklin (Gomez Wrestling Academy) Dec 3-1</li>\n<li>5th Place Match - Ethan Yu (Tinley Park Bulldogs WC) won by fall over John Pacewic (Celtic Elite) Fall 2:17</li>\n<li>7th Place Match - Daniel Colunga (Hoopeston Area WC) won by tech fall over Dalton Riggle (Dakota WC) TF 18-3</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Dzhabrail Khurshidov (Blackhawk WC) won by decision over Ryan Golnick (Golden Eagles WC) Dec 11-5</li>\n<li>5th Place Match - Nicholas Lopez (Tinley Park Bulldogs WC) won by decision over Alexander Aguirre (Martinez Fox Valley Elite) Dec 3-2</li>\n<li>7th Place Match - Brock Donati (St. Charles WC) won by major decision over Evan Dluzak (Lincoln-Way WC) Maj 12-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Gabriel Taylor (Mt. Vernon Lions WC) won in sudden victory - 1 over Aydan Trueblood (TJ Trained) SV-1 6-4</li>\n<li>5th Place Match - Clay Cichowski (Maine Eagles WC) won by decision over Xander Schnake (Hononegah WC) Dec 3-1</li>\n<li>7th Place Match - Rewn Stearns (Murphysboro WC) won by decision over Alexis Aguirre (Martinez Fox Valley Elite) Dec 5-4</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Nathan Tomaso (Villa-Lombard Cougars) won by medical forfeit over Brock Neill (LP Crunching Cavs) MFF</li>\n<li>5th Place Match - Kyle Johnson (Will County Warriors) won by medical forfeit over Nikolas Mishka (Force WC) MFF</li>\n<li>7th Place Match - Andre Naydenov (The Wrestling Factory) won by fall over Jamison VanVickle (Oakwood Youth WC) Fall 1:21</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Dustin Olmstead (Belleville Little Devils WC) won by fall over Dreyden Shelton (Urbana Tigers WC) Fall 2:36</li>\n<li>5th Place Match - Cruz Quiroz (Blackhawk WC) won by decision over Ryan Hannah (Panther WC) Dec 5-1</li>\n<li>7th Place Match - Eric Grabavoy (Team 1006 Wrestling) won by fall over Connor Edge (The Law) Fall 0:53</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Dontae Jackson (East St. Louis Wrestling) won by fall over Kevin Martin (Tinley Park Bulldogs WC) Fall 1:22</li>\n<li>5th Place Match - Hunter Bogwill (Greg Gomez Trained Wrestling) won by decision over Paul Woo (Villa-Lombard Cougars) Dec 3-0</li>\n<li>7th Place Match - Caelan Riley (The Wrestling Factory) won by decision over J Guido Pigoni (SCN Youth WC) Dec 3-0</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Antonio Alvarado (Crystal Lake Wizards) won in sudden victory - 1 over Colin Young (Da WC) SV-1 5-3</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Tyler Guerra (Gomez Wrestling Academy) won by decision over Christopher Moore (Crystal Lake Wizards) Dec 2-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Nasir Bailey (Harvey Twisters) won by decision over Kannon Webster (Super Soldiers WC) Dec 2-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Damari Reed (Harvey Twisters) won by major decision over Joseph Fernau (Izzy Style Wrestling) Maj 11-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Vincent Robinson (Harvey Twisters) won by decision over Jordan Blew (Force WC) Dec 2-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Braulio Flores (Team 1006 Wrestling) won by decision over Michael Kelly (Tinley Park Bulldogs WC) Dec 2-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Tavius Hosley (Unity Youth WC) won by fall over Kole Brower (Moline WC) Fall 3:32</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Jared Gumila (Force WC) won by tech fall over Aidan O`Connor (Celtic Elite) TF 17-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Bradley Gillum (Martinez Fox Valley Elite) won by fall over Braden Stauffenberg (Izzy Style Wrestling) Fall 4:29</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Michael Mosier (Barrington Broncos WC) won by fall over Montres Reed (Urbana Tigers WC) Fall 4:26</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Eathin Diveley (Red Raiders Wrestling Team) won by decision over Jokiah Sewell (Hawk WC) Dec 10-3</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Khamari Jones (Crosstown Spartan Elite WC) won by decision over Rylee Edwards (Storm Youth WC) Dec 5-1</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Nathan Wemstrom (Arlington Cardinals WC) won by major decision over Charlie Jagusah (Junior Pioneer WC) Maj 15-2</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Ryan Boersma (Tinley Park Bulldogs WC) won by fall over Mason Kelly (Granite City Wrestling Association) Fall 2:52</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Nore Turner (Lincoln-Way WC) won by decision over Donny Pigoni (SCN Youth WC) Dec 4-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Bryce Durlacher (The Wrestling Factory) won by decision over Benjamin Davino (SCN Youth WC) Dec 2-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Seth Mendoza (Contender Wrestling) won by tech fall over Jameson Garcia (Gomez Wrestling Academy) TF 16-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Owen Dunlap (Tinley Park Bulldogs WC) won by decision over Jason Shaw (Roxana Outlaws) Dec 4-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Tommy Curran (Martinez Fox Valley Elite) won by decision over Joshua Koderhandt (Crusaders` Elite) Dec 10-3</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Grant Matarelli (Edwardsville WC) won by decision over Danny Curran (Martinez Fox Valley Elite) Dec 7-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Dean Hamiti (Celtic Elite) won by decision over Diego Sotelo (Martinez Fox Valley Elite) Dec 7-3</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Nain Vazquez (Martinez Fox Valley Elite) won by decision over Kylan Montgomery (Team Mascoutah WC) Dec 10-5</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Vincent Zerban (Bulls WC) won by decision over Michael Caliendo (Batavia WC) Dec 9-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Connor Gaynor (Tinley Park Bulldogs WC) won by fall over Joel Vandervere (The Wrestling Factory) Fall 2:48</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Jake Matthews (Headlock Wrestling Academy) won by decision over Jack Patting (Young Guns) Dec 1-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Bryan Smith (Martinez Fox Valley Elite) won by decision over Austin Abitua (Da WC) Dec 10-5</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Dylan Connell (The Wrestling Factory) won by decision over Christopher Worcester (Villa-Lombard Cougars) Dec 8-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Isaiah Parker (The Wrestling Factory) won by decision over Joey Gaskill (Elk Grove Junior Grens) Dec 9-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Antonio Figueroa (Hononegah WC) won by decision over Benjamin Harvey (Rochelle WC) Dec 2-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Tommy Evans (Wolves WC) won by injury default over Matthew Ramirez (Barrington Broncos WC) Inj. 0:00</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Apollo Gothard (Lemont Bears) won by fall over Louie Cretsinger (Xtreme WC) Fall 1:21</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Brandon Hoselton (Prairie Central Hawks) won by major decision over Tyson Heerman (Peoria Razorbacks WC) Maj 12-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Tyler Williams (Riverton/Williamsville Youth Wrestling) won by decision over Colin Baker (Lions WC) Dec 2-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Hayden Copass (Storm Youth WC) won by fall over Andrew Kaltmayer (Edwardsville WC) Fall 1:44</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Samuel Hayes (Contender Wrestling) won in tie breaker - 1 over Phoenix Mordick (Dakota WC) TB-1 1-0</li>\n</ul>\n</section>"
}
