{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Max Munn (Celtics WC) won by fall over Jermaine Cail (Urbana Tigers WC) Fall 1:57</li>\n<li>Champ. Round 1 - Chase Dyer (SCN Youth WC) won by decision over Dalton Meluch (Team 312) Dec 8-2</li>\n<li>Champ. Round 1 - Deegan Kirschke (SCN Youth WC) won by major decision over Landon Cornwell (Crawford County WC) Maj 9-1</li>\n<li>Champ. Round 1 - Brennan O`Donnell (Barrington Broncos WC) won by major decision over Gage Martin (Rantoul Junior Wrestling) Maj 9-0</li>\n<li>Champ. Round 1 - Keagan Steen (Stockton Renegades) won by fall over Nadeem Haleem (Lincoln-Way WC) Fall 0:18</li>\n<li>Champ. Round 1 - Aiden Larsen (Team 1006 Wrestling) won by decision over Kavel Moore (Harvey Twisters) Dec 5-1</li>\n<li>Champ. Round 1 - Anthony Sutton (Lockport Junior Porters WC) won by fall over Elio Gil (Tinley Park Bulldogs) Fall 0:49</li>\n<li>Champ. Round 1 - Augustus Swanson (Tiger Town Tanglers WC) won by decision over Jackson Olson (Hononegah WC) Dec 6-4</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Brayden Edwards (Storm Youth WC) won by fall over Bryson Nuttall (Olney Cubs WC) Fall 1:12</li>\n<li>Champ. Round 1 - Carmelo Palumbo (Southside Outlaws WC) won by fall over Jesus Martinez (Streator WC) Fall 1:50</li>\n<li>Champ. Round 1 - Charlie Flores (Hoopeston Area WC) won by decision over Jayden Pontanini (Yorkville WC) Dec 7-4</li>\n<li>Champ. Round 1 - Eyson Van Eycke (Mt. Vernon Lions WC) won by fall over Griff Powell (Lions WC) Fall 0:53</li>\n<li>Champ. Round 1 - Allen Woo (Villa-Lombard Cougars) won by fall over Vincent Perucho (Scorpion WC) Fall 4:09</li>\n<li>Champ. Round 1 - Isaac Zimmerman (Lockport Junior Porters WC) won by fall over Jake Lowitzki (Wolves WC) Fall 2:11</li>\n<li>Champ. Round 1 - Luca Poeta (The Wrestling Factory) won by tech fall over Brandon White (The Law) TF 15-0</li>\n<li>Champ. Round 1 - Kaidreaus Richardson (Lincoln-Way WC) won by fall over Liam Aye (St. Charles WC) Fall 2:00</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Aaron Camacho (Bolingbrook Junior Raiders) won by major decision over Jack Ajster (Storm Youth WC) Maj 14-0</li>\n<li>Champ. Round 1 - Maxwell Wade (Gladiator Elite) won by decision over Devan Hornback (Junior Pioneer WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jakob Siwinski (Celtics WC) won by fall over Jackson Graff (Murphysboro WC) Fall 3:00</li>\n<li>Champ. Round 1 - Jack Platt (Team 1006 Wrestling) won by fall over Ronnie Weeks (Monticello Youth WC) Fall 2:26</li>\n<li>Champ. Round 1 - Kalani Khiev (Villa-Lombard Cougars) won by decision over Nicholas Marchese (Crystal Lake Wizards) Dec 6-0</li>\n<li>Champ. Round 1 - Brayden Mortell (Tinley Park Bulldogs) won by fall over Samuel Sikorsky (Geneva Junior Vikings) Fall 4:27</li>\n<li>Champ. Round 1 - Austin Hagevold (Red Raiders Wrestling Team) won by tech fall over Michael Anderson (Fox Valley WC) TF 22-5</li>\n<li>Champ. Round 1 - Chazz Robinson (Harvey Twisters) won by decision over Evan Gosz (Arlington Cardinals WC) Dec 14-12</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - George Marinopoulos (Mustang WC) won by major decision over Cameron Borneman (Brawlers WC) Maj 15-4</li>\n<li>Champ. Round 1 - Garrett VerHeecke (Mt. Zion Kids WC) won by major decision over Bradan Garcia (Batavia WC) Maj 8-0</li>\n<li>Champ. Round 1 - Juvontae Williams (Lionheart Intense Wrestling) won by injury default over Nolan Vogel (Force Elite) Inj. 1:30</li>\n<li>Champ. Round 1 - Zev Koransky (Little Huskies WC) won by major decision over Evan Matkovich (Batavia WC) Maj 11-0</li>\n<li>Champ. Round 1 - Deven Casey (Izzy Style Wrestling) won by decision over Drew Sadler (AJ Junior Wildcats WC) Dec 4-0</li>\n<li>Champ. Round 1 - Koletyn Zanoni (DAWC) won by major decision over Ace Christiansen (Tiger Town Tanglers WC) Maj 11-3</li>\n<li>Champ. Round 1 - Jackson Bassett (O`Fallon Little Panthers WC) won by fall over Brody Baker (Quincy Cyclones WC) Fall 3:19</li>\n<li>Champ. Round 1 - Kameron Luif (Villa-Lombard Cougars) won by fall over Hunter Lenz (Crystal Lake Wizards) Fall 3:45</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Erik Rodriguez (Fox Lake WC) won by fall over Clinton VerHeecke (Mt. Zion Kids WC) Fall 2:39</li>\n<li>Champ. Round 1 - Jalen Byrd (Lincoln-Way WC) won by decision over Gabriel Robb (Peoria Razorbacks WC) Dec 8-2</li>\n<li>Champ. Round 1 - Dylan Crouch (Pontiac WC) won in sudden victory - 1 over Dillon Griffin (Team 1006 Wrestling) SV-1 13-11</li>\n<li>Champ. Round 1 - Saki Yoshikawa (Arlington Cardinals WC) won by decision over Vincent Skedel (Force Elite) Dec 6-0</li>\n<li>Champ. Round 1 - Brody Sendele (Hononegah WC) won in sudden victory - 1 over Ashton Hobson (Batavia WC) SV-1 5-3</li>\n<li>Champ. Round 1 - Robye Williams (Harvey Twisters) won by major decision over Noah Harper (Edwardsville WC) Maj 14-2</li>\n<li>Champ. Round 1 - Ian Hawkins (Gomez Wrestling Academy) won by decision over Mackenzie Pratt (Granite City Wrestling Association) Dec 4-0</li>\n<li>Champ. Round 1 - Jair Jackson-Bey (Harvey Twisters) won by fall over David Miranda (Crystal Lake Wizards) Fall 3:57</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Michael Meade (Wolves WC) won by major decision over Kaden Wyland (Team 1006 Wrestling) Maj 12-2</li>\n<li>Champ. Round 1 - Liam Kelly (Tinley Park Bulldogs) won by fall over Aiden Bell (Hoopeston Area WC) Fall 4:05</li>\n<li>Champ. Round 1 - Luke Zook (Yorkville WC) won by tech fall over Ethan Fordham (TJ Trained-Springfield) TF 19-4</li>\n<li>Champ. Round 1 - Robert Conway (Mustang WC) won by decision over Dominic Vitale (Crystal Lake Wizards) Dec 6-1</li>\n<li>Champ. Round 1 - Nicholas Herman (Celtics WC) won by decision over Moses Yanez (Greg Gomez Trained Wrestling) Dec 6-4</li>\n<li>Champ. Round 1 - Brodey Durbin (Just Wrestling) won by decision over Conner Zacarias (Pitbull Wrestling Alliance) Dec 9-2</li>\n<li>Champ. Round 1 - Callen Kirchner (Arlington Cardinals WC) won by fall over Tyler Bartley (Lincoln-Way WC) Fall 3:20</li>\n<li>Champ. Round 1 - Colin Thompson (SCN Youth WC) won by decision over Aiden Colbert (Belleville Little Devils WC) Dec 11-5</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Kye Weinzierl (Junior Pioneer WC) won by decision over Hunter Shike (Unity Youth WC) Dec 6-3</li>\n<li>Champ. Round 1 - Brock Ross (Belleville Little Devils WC) won by fall over Alexander Tack (Batavia WC) Fall 3:33</li>\n<li>Champ. Round 1 - Aj Demos (Champaign WC) won by major decision over Dj Guagliardo (Batavia WC) Maj 8-0</li>\n<li>Champ. Round 1 - Daniel Kelly (Sauk Valley WC) won by fall over Blake Mink (Edwardsville WC) Fall 3:34</li>\n<li>Champ. Round 1 - Jayden Gallagly (DAWC) won by major decision over Joseph Knackstedt (Little Huskies WC) Maj 14-3</li>\n<li>Champ. Round 1 - Thomas Mcdermott (Force Elite) won by fall over Anthony Koza (Fox Lake WC) Fall 1:26</li>\n<li>Champ. Round 1 - David Burchett Jr. (Mustang WC) won by decision over Justin Cobbs Jr (Lincoln-Way WC) Dec 4-1</li>\n<li>Champ. Round 1 - Luis Medina (Toss Em Up Wrestling Academy) won by fall over Malachi Cannon (DAWC) Fall 2:17</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Royce Lopez (Toss Em Up Wrestling Academy) won by decision over Philip Christhilf (Champaign WC) Dec 4-3</li>\n<li>Champ. Round 1 - Jaxson Soliz (Moline WC) won by fall over Cooper Murray (SCN Youth WC) Fall 2:54</li>\n<li>Champ. Round 1 - David Fajardo (Toss Em Up Wrestling Academy) won by tech fall over Jonathan Moss (Quincy Cyclones WC) TF 17-1</li>\n<li>Champ. Round 1 - Matthew Plumb (SCN Youth WC) won by tech fall over Boden Brooks (Pontiac WC) TF 15-0</li>\n<li>Champ. Round 1 - Chase Pierceall (Plainfield WC) won by decision over Romahd Johnson (Harvey Twisters) Dec 9-8</li>\n<li>Champ. Round 1 - Zac Pitre (Belleville Little Devils WC) won by fall over Brandyn Metzger (Rochelle WC) Fall 2:57</li>\n<li>Champ. Round 1 - Connor Diemel (Hononegah WC) won by fall over Luke Siwinski (Celtics WC) Fall 4:20</li>\n<li>Champ. Round 1 - Luis Dial (Springs Elite) won by decision over Lucas Archer (Saukee Youth WC) Dec 6-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Jameson Remole (Storm Youth WC) won by fall over Gabriel Bolivar (Villa-Lombard Cougars) Fall 1:07</li>\n<li>Champ. Round 1 - Trevon Williams (Harvey Twisters) won by fall over Dimitri Owens (Frankfort Wildcats Wrestling) Fall 0:44</li>\n<li>Champ. Round 1 - Timothy Mckeon (Panther WC) won by fall over Matthew Steinberg (Champaign WC) Fall 0:42</li>\n<li>Champ. Round 1 - Benjamin Vazquez (Toss Em Up Wrestling Academy) won by fall over Aiden Hennings (Celtics WC) Fall 2:18</li>\n<li>Champ. Round 1 - Gunner Hefley (Hillsboro Jr Toppers) won by decision over Cole Latimer (DeKalb WC) Dec 6-5</li>\n<li>Champ. Round 1 - Kayden Marolf (Champbuilders Wrestling) won by decision over Robert Bohr (Batavia WC) Dec 9-2</li>\n<li>Champ. Round 1 - Cayden Parks (Crystal Lake Wizards) won by decision over Zachary Pomatto (Team 1006 Wrestling) Dec 4-2</li>\n<li>Champ. Round 1 - Parker Ray (Vandalia Jr WC) won by decision over Sean Lane (SCN Youth WC) Dec 4-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Caleb Baczek (The Wrestling Factory) won by decision over Emmoni Lopez (Tomcat WC) Dec 8-2</li>\n<li>Champ. Round 1 - Michael Jones (Bismarck-Henning Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Brock Hoselton (SOT-C) won by decision over Fintan Helm (Elmhurst WC) Dec 10-8</li>\n<li>Champ. Round 1 - King Liggins (Harvey Twisters) won by major decision over Joseph Burton (Fox Lake WC) Maj 10-2</li>\n<li>Champ. Round 1 - De`marizon Graham (Carbondale WC) won by decision over Antione Gilford (Team 1006 Wrestling) Dec 7-3</li>\n<li>Champ. Round 1 - Lawrence Stringham (Plainfield WC) won by fall over Michael Brannigan (Red Raiders Wrestling Team) Fall 0:56</li>\n<li>Champ. Round 1 - Keith Grim (Mendota Mat Masters) won by fall over Aidan Baluch (Hononegah WC) Fall 2:27</li>\n<li>Champ. Round 1 - Cole Turner (Force Elite) won by major decision over Knox Verbais (Edwardsville WC) Maj 10-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Brendan Landau (Edwardsville WC) won by major decision over Nathaniel Webb (Cumberland Youth WC) Maj 15-2</li>\n<li>Champ. Round 1 - Joseph Weeks (Super Soldiers WC) won by decision over Gage Robles (Bolingbrook Junior Raiders) Dec 12-9</li>\n<li>Champ. Round 1 - Michael Grazzini (Elmhurst WC) won in sudden victory - 1 over Brock VanDeveer (Champaign WC) SV-1 9-7</li>\n<li>Champ. Round 1 - Jarron Haberer (Highland Bulldog Jr. WC) won by decision over Jack Nowicki (Plainfield WC) Dec 5-0</li>\n<li>Champ. Round 1 - Shawn Watkins (Charger WC) won by fall over Quinn Nelligan (Panther WC) Fall 2:53</li>\n<li>Champ. Round 1 - Jaxon Lane (Villa-Lombard Cougars) won by fall over Connor Sacco (Marengo Youth WC) Fall 3:41</li>\n<li>Champ. Round 1 - John McAuliffe (Tinley Park Bulldogs) won by fall over Maximo Nepomuceno (The Wrestling Factory) Fall 2:44</li>\n<li>Champ. Round 1 - Trentin Rowe (Moline WC) won by decision over Brady Stewart (Stillman Valley WC) Dec 8-2</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Reid Roberts (Golden Eagles WC) won by major decision over Carson McConnell (Lincoln Youth WC) Maj 9-0</li>\n<li>Champ. Round 1 - Jesus Barriga (Peoria Razorbacks WC) won by fall over Aidan Baez (Blackhawk WC) Fall 4:24</li>\n<li>Champ. Round 1 - Joseph Pettit (Geneva Junior Vikings) won by fall over Ashton Lewis (Cumberland Youth WC) Fall 1:11</li>\n<li>Champ. Round 1 - Brock Needs (Stillman Valley WC) won by fall over Dalton Oakman (TJ Trained Wrestling) Fall 3:11</li>\n<li>Champ. Round 1 - John Keigher (Elk Grove Junior Grens) won by fall over Roman Janek (Granite City Wrestling Association) Fall 0:36</li>\n<li>Champ. Round 1 - Dj Freeman (Celtics WC) won by decision over Dylan Wilms (Lemont Bears WC) Dec 5-0</li>\n<li>Champ. Round 1 - Austin Reading (Contender Wrestling) won by fall over Tucker Cook (Saukee Youth WC) Fall 0:57</li>\n<li>Champ. Round 1 - Xavier Bitner (Rams WC) won by decision over Hector Soto (Fox Lake WC) Dec 6-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Joe Zimmer (Tinley Park Bulldogs) won by major decision over Jared Park (Unity Youth WC) Maj 8-0</li>\n<li>Champ. Round 1 - Daniel Mahoney (Mustang WC) won by fall over Connor McBride (Moline WC) Fall 4:09</li>\n<li>Champ. Round 1 - Bryson Reeves (Lockport Junior Porters WC) won by decision over August Rottman (Highland Bulldog Jr. WC) Dec 5-2</li>\n<li>Champ. Round 1 - Andrew Banaszak (Badger WC) won by fall over Reese Lane (Mendota WC) Fall 0:32</li>\n<li>Champ. Round 1 - Juan Cervantes (Belvidere Bandits WC) won by fall over Brittney Moran (Blackhawk WC) Fall 1:21</li>\n<li>Champ. Round 1 - Dylan Berkowitz (Elk Grove Junior Grens) won by fall over Jeremy Henson (West Frankfort Jr. Redbirds) Fall 2:20</li>\n<li>Champ. Round 1 - Lucas Burton (Fox Lake WC) won by fall over Kelley Gassner (Red Raiders Wrestling Team) Fall 2:52</li>\n<li>Champ. Round 1 - Wyatt Dothager (Vandalia Jr WC) won by fall over Frank Jass (DAWC) Fall 0:17</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - Sable Taylor (Clinton WC) won by fall over Ronnell Newbern (Beat the Streets-Chicago) Fall 4:01</li>\n<li>Champ. Round 1 - Joe Herbert (Maine Eagles WC) won by fall over Brandon Turner (West Frankfort Jr. Redbirds) Fall 0:56</li>\n<li>Champ. Round 1 - Anthony Soto (Toss Em Up Wrestling Academy) won by fall over Terry Ferguson (Rams WC) Fall 0:50</li>\n<li>Champ. Round 1 - Aaron Sheffer (AJ Junior Wildcats WC) won by fall over Nathan Madrigal (Pitbull Wrestling Alliance) Fall 0:41</li>\n<li>Champ. Round 1 - Sargent Maubach (Peoria Razorbacks WC) won by fall over Brian Diser (Belleville Little Devils WC) Fall 1:19</li>\n<li>Champ. Round 1 - Asher Sheldon (Batavia WC) won by fall over Jarett Ross (Xtreme WC) Fall 3:00</li>\n<li>Champ. Round 1 - Sean Thornton (Super Soldiers WC) won by fall over Dawson Boyd (Stillman Valley WC) Fall 1:20</li>\n<li>Champ. Round 1 - Tyler Fortis (Izzy Style Wrestling) won by fall over Dylan Cerny (Red Raiders Wrestling Team) Fall 1:02</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Andrew Owen (Saber WC) won by decision over Ethan Dixon (Limestone Blue Crew Wrestling) Dec 3-0</li>\n<li>Champ. Round 1 - Triston Abram (Edwardsville WC) won by fall over Gage Carey (Jersey Junior Panthers Wrestling) Fall 1:23</li>\n<li>Champ. Round 1 - Jayvier Hollis (Gladiator Elite) won by fall over Malik Mosley (Urbana Tigers WC) Fall 3:13</li>\n<li>Champ. Round 1 - Manuel Chavez (Blackhawk WC) won in sudden victory - 1 over Ayden Goodwin (Harlem Cougars WC) SV-1 3-1</li>\n<li>Champ. Round 1 - Jayvin Savoie (Brawlers WC) won by fall over Jaylen Torres (nWo WC) Fall 0:46</li>\n<li>Champ. Round 1 - Matthew Wolfe (Sauk Valley WC) won by fall over Ryan Stingliy (Frankfort Wildcats Wrestling) Fall 1:53</li>\n<li>Champ. Round 1 - Robbie Murphy (Minooka Indians Elite Wrestling) won by fall over Jeremy Marshall (Evanston School of Wrestling) Fall 0:34</li>\n<li>Champ. Round 1 - Mason Monce (Batavia WC) won by fall over Josh Hoffer (Super Soldiers WC) Fall 2:11</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Keagen Goff (Falcon Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Dominic Palusinski (Riverton/Williamsville Youth Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Trevor Nelson (Yorkville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Xyon Thomas (Harvey Twisters) received a bye   () Bye</li>\n<li>Champ. Round 1 - Hayden David Volz (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jayden Bleisch (Team Mascoutah WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Alyas Ivery (Chicago Park District) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 - Gage DeLaval (Murphysboro WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Keegan Barnes (Super Soldiers WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Colton Manes (Riverton/Williamsville Youth Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Angilberto Serrano (Mendota Mat Masters) received a bye   () Bye</li>\n<li>Champ. Round 1 - Joseph Carter (Roughnecks WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Roy Phelps (Beat the Streets-Chicago) received a bye   () Bye</li>\n<li>Champ. Round 1 - Braxton Forshey (Saukee Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jackson Hochgraber (Panther WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Cayden Amico (Plainfield WC) won by fall over Joseph Meyers (Elmhurst WC) Fall 1:56</li>\n<li>Champ. Round 1 - Caleb Scott (Granite City Wrestling Association) won by decision over Louie Delpage (Force Elite) Dec 8-2</li>\n<li>Champ. Round 1 - Liam Zimmerman (Lockport Junior Porters WC) won by fall over Camden Pierce (Trico WC) Fall 1:30</li>\n<li>Champ. Round 1 - Peter Young (DAWC) won by tech fall over Joseph Young (DAWC) TF 15-0</li>\n<li>Champ. Round 1 - Ezekiel Schroeder (Golden Eagles WC) won by major decision over Jonathan Theodor (Oswego WC) Maj 11-2</li>\n<li>Champ. Round 1 - Max Siegel (Tinley Park Bulldogs) won by major decision over Zachary Mally (Naperville WC) Maj 15-1</li>\n<li>Champ. Round 1 - Thomas Tourdot (Rochelle WC) won by decision over Zachary Koschnitzki (Oak Forest Warriors) Dec 7-1</li>\n<li>Champ. Round 1 - Carter Mikolajczak (Lemont Bears WC) won by fall over Richard Madison (Edwardsville WC) Fall 0:51</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Guillermo Rivera (Oak Forest Warriors) won by decision over Rudy Silva (Ano Kato FS.GR.) Dec 5-1</li>\n<li>Champ. Round 1 - Zachary Parisi (Elmhurst WC) won by tech fall over Henry Warfel (Cumberland Youth WC) TF 19-4</li>\n<li>Champ. Round 1 - Tyson Zvonar (Lincoln-Way WC) won by decision over Brogan Sons (SCN Youth WC) Dec 4-0</li>\n<li>Champ. Round 1 - Casey Griffin (Tinley Park Bulldogs) won by fall over Colin McCloskey (Greg Gomez Trained Wrestling) Fall 4:08</li>\n<li>Champ. Round 1 - Theodore Flores (Maine Eagles WC) won by fall over Brandon Newcombe (Triad Knights WC) Fall 0:10</li>\n<li>Champ. Round 1 - Tommy Hammond (Crystal Lake Wizards) won by fall over Glenn Donohue (Crystal Lake Wizards) Fall 1:20</li>\n<li>Champ. Round 1 - Damien Flores (Southside Outlaws WC) won by major decision over Daireus VanDyke (Edwardsville WC) Maj 13-4</li>\n<li>Champ. Round 1 - Olin Walker (Team 312) won by decision over Camden Weirich (Marengo Youth WC) Dec 10-4</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Gunnar Garelli (Izzy Style Wrestling) won by tech fall over Jujuan Williams Jr (Lionheart Intense Wrestling) TF 16-0</li>\n<li>Champ. Round 1 - Noah Dial (Bolingbrook Junior Raiders) won by decision over Charlie Fitzgerald (Crystal Lake Wizards) Dec 11-5</li>\n<li>Champ. Round 1 - Sebastian Leon (Lincoln-Way WC) won by fall over Connor Park (Riverton/Williamsville Youth Wrestling) Fall 1:22</li>\n<li>Champ. Round 1 - Benjamin Dunne (Izzy Style Wrestling) won by fall over Grant Stender (Hawk WC) Fall 2:46</li>\n<li>Champ. Round 1 - Aidan Huck (Batavia WC) won by decision over Liam Fox (Murphysboro WC) Dec 2-1</li>\n<li>Champ. Round 1 - Evan Willock (TJ Trained Wrestling) won by major decision over Josyah Holland (Harvey Twisters) Maj 11-2</li>\n<li>Champ. Round 1 - Chase Hampton (Greg Gomez Trained Wrestling) won by fall over Jesus Herrera (Mustang WC) Fall 1:14</li>\n<li>Champ. Round 1 - Brady Grennan (Sauk Valley WC) won by fall over Isaac Middendorf (Gladiator Elite) Fall 0:35</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Caden Kirchner (Arlington Cardinals WC) won by fall over Kaden Inman (Unity Youth WC) Fall 2:52</li>\n<li>Champ. Round 1 - Jermaine Butler (Crosstown Spartan Elite WC) won by decision over Dominick Coronado (Yorkville WC) Dec 5-3</li>\n<li>Champ. Round 1 - Carter Rude (Sauk Valley WC) won by fall over Keynon Shaw (Urbana Tigers WC) Fall 1:59</li>\n<li>Champ. Round 1 - Jacob Crandall (Arlington Cardinals WC) won by decision over Justus Snapp (Force Elite) Dec 5-0</li>\n<li>Champ. Round 1 - James Wright (Golden Eagles WC) won by decision over Christian Chavez (Gomez Wrestling Academy) Dec 9-2</li>\n<li>Champ. Round 1 - Trevor Silzer (Tinley Park Bulldogs) won by major decision over Blue Bishop (Wrestling Inc) Maj 9-0</li>\n<li>Champ. Round 1 - Nicholas Fetters (Belleville Little Devils WC) won by fall over Colden Dyer (SCN Youth WC) Fall 4:18</li>\n<li>Champ. Round 1 - Jackson Smith (Lemont Bears WC) won by decision over Cadence Diduch (Dakota WC) Dec 6-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Brendan Tunink (Sauk Valley WC) won by fall over Tyler Evans (Wolves WC) Fall 4:10</li>\n<li>Champ. Round 1 - Sean Larkin (Panther WC) won by tech fall over Brayden Sanders (Champaign WC) TF 16-0</li>\n<li>Champ. Round 1 - Noah Quintana (Team 1006 Wrestling) won by tech fall over Dalton Rutherford (Sycamore WC) TF 15-0</li>\n<li>Champ. Round 1 - Sam Schuit (Lemont Bears WC) won by tech fall over Gunner Quatroke (Marengo Youth WC) TF 15-0</li>\n<li>Champ. Round 1 - Ryan Mohler (Fox Valley WC) won by decision over Matthew Cornfield (Frankfort Wildcats Wrestling) Dec 3-0</li>\n<li>Champ. Round 1 - Caleb Nobiling (The Wrestling Factory) won by decision over Isaac Smith (Carbondale WC) Dec 8-1</li>\n<li>Champ. Round 1 - Alexander Marre (Izzy Style Wrestling) won by decision over Zac Ritter (Contender Wrestling) Dec 10-5</li>\n<li>Champ. Round 1 - Kaden Fetterolf (Batavia WC) won in sudden victory - 1 over Dylan Boyd (Granite City Wrestling Association) SV-1 7-5</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Jackson Gillen (Team 1006 Wrestling) won by fall over Dontrell Dugar (Champaign WC) Fall 0:45</li>\n<li>Champ. Round 1 - Brody Murray (SCN Youth WC) won by decision over Caleb Ohnesorge (Gladiator Elite) Dec 4-2</li>\n<li>Champ. Round 1 - Francisco Solis (Greg Gomez Trained Wrestling) won by fall over Bryson Capansky (Storm Youth WC) Fall 0:43</li>\n<li>Champ. Round 1 - Noah Manuel Tapia (Moline WC) won by tech fall over Tyson Seibel (Belleville Little Devils WC) TF 15-0</li>\n<li>Champ. Round 1 - Thomas Silva (DAWC) won by fall over Camden Rogers (Oak Forest Warriors) Fall 3:54</li>\n<li>Champ. Round 1 - Connor Koehler (Contender Wrestling) won by fall over Grant Gentile (Izzy Style Wrestling) Fall 0:47</li>\n<li>Champ. Round 1 - Henry Coughlin (Tinley Park Bulldogs) won by major decision over Marcus Godfrey (Lincoln-Way WC) Maj 12-3</li>\n<li>Champ. Round 1 - Solomon Gilliam (Villa-Lombard Cougars) won in sudden victory - 1 over Ethan Struck (Crystal Lake Wizards) SV-1 6-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Polo Ramon (Headlock Wrestling Academy) won by fall over Marquan Shaw (Lionheart Intense Wrestling) Fall 2:09</li>\n<li>Champ. Round 1 - Dillon Raab (The Law) won by decision over Drew Landau (Edwardsville WC) Dec 12-6</li>\n<li>Champ. Round 1 - Michael Calcagno (Izzy Style Wrestling) won by fall over Nile Chotner (AJ Junior Wildcats WC) Fall 3:53</li>\n<li>Champ. Round 1 - Max Astacio (Crystal Lake Wizards) won by fall over Nathaniel Hopkins (Unity Youth WC) Fall 0:38</li>\n<li>Champ. Round 1 - Matthew Janiak (Team 1006 Wrestling) won by decision over Connor Thompson (SCN Youth WC) Dec 7-0</li>\n<li>Champ. Round 1 - Dimitrios Lalezas (Lemont Bears WC) won by tech fall over Boden Bielik (Contender Wrestling) TF 17-1</li>\n<li>Champ. Round 1 - Caden Muselman (Tinley Park Bulldogs) won by fall over Braden Baker (Super Soldiers WC) Fall 3:32</li>\n<li>Champ. Round 1 - Santino Scolaro (SCN Youth WC) won by decision over Michael O`Connor (Celtics WC) Dec 7-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Marco Avelar (Elk Grove Junior Grens) won by fall over Phillip Shaw (Lionheart Intense Wrestling) Fall 2:07</li>\n<li>Champ. Round 1 - William Jacobson (Tinley Park Bulldogs) won in sudden victory - 1 over Luke Barham (Contender Wrestling) SV-1 5-3</li>\n<li>Champ. Round 1 - John O`Connor (Lemont Bears WC) won by tech fall over Grant Brewer (Storm Youth WC) TF 16-0</li>\n<li>Champ. Round 1 - Collin Carrigan (Izzy Style Wrestling) won by fall over Anthony Gulino (Force Elite) Fall 2:51</li>\n<li>Champ. Round 1 - Caleb Mays (AJ Junior Wildcats WC) won by fall over Lane Robinson (Kaneland Knights WC) Fall 3:37</li>\n<li>Champ. Round 1 - Drew Torza (Team 1006 Wrestling) won by major decision over Jesse Clayton (Batavia WC) Maj 14-2</li>\n<li>Champ. Round 1 - Caden Casimino (Crystal Lake Wizards) won by fall over Nick Mueller (Super Soldiers WC) Fall 0:53</li>\n<li>Champ. Round 1 - Aidan Postma (Triad Knights WC) won by decision over Michael Phillips (SCN Youth WC) Dec 4-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Skip Rozanski (Pitbull Wrestling Alliance) won by decision over Shane Carr (Martinez Fox Valley Elite) Dec 5-0</li>\n<li>Champ. Round 1 - Kyle Lindsey (Oak Forest Warriors) won by major decision over Griffin Goddard (Champaign WC) Maj 11-1</li>\n<li>Champ. Round 1 - Jack Lesher (SCN Youth WC) won by tech fall over Alaynia Bryant (Charleston WC) TF 15-0</li>\n<li>Champ. Round 1 - Aj Heeg (Southside Outlaws WC) won by fall over Daniel Spandiary (Maine Eagles WC) Fall 1:56</li>\n<li>Champ. Round 1 - Eric Gustafson (Moline WC) won by tech fall over Samuel Han (Carbondale WC) TF 17-2</li>\n<li>Champ. Round 1 - Aiden Zacharuk (Harlem Cougars WC) won by major decision over Dublin Gleason (Force Elite) Maj 10-0</li>\n<li>Champ. Round 1 - Griffin Luke (Stockton Renegades) won by fall over Blake Hinrichsen (Super Soldiers WC) Fall 2:39</li>\n<li>Champ. Round 1 - Eric McKinney (Vandalia Jr WC) won by fall over Caleb Dickens (Brawlers WC) Fall 2:34</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Braden Kelly (Granite City Wrestling Association) won by fall over Jordan Griggs (Saber WC) Fall 4:05</li>\n<li>Champ. Round 1 - Seth Stevens (Hawk WC) won by decision over Joshua Taylor (Scorpion WC) Dec 8-2</li>\n<li>Champ. Round 1 - Anthony Alansari (Scorpion WC) won by fall over Tayshaun Coleman (Champaign WC) Fall 1:10</li>\n<li>Champ. Round 1 - Ben Butler (Crystal Lake Wizards) won by decision over Bryce Mikos (O`Fallon Little Panthers WC) Dec 7-4</li>\n<li>Champ. Round 1 - Elijah Munoz (Team 1006 Wrestling) won by fall over Jonas Carter (Astro WC) Fall 3:26</li>\n<li>Champ. Round 1 - William Prater (Izzy Style Wrestling) won by fall over Gabe Eckerd (Hawk WC) Fall 4:10</li>\n<li>Champ. Round 1 - Jaydon Robinson (Harvey Twisters) won by decision over Quinn Herbert (Maine Eagles WC) Dec 8-4</li>\n<li>Champ. Round 1 - Louden Schnake (Hononegah WC) won by decision over Mason Sarnes (Pekin Boys &amp; Girls Club) Dec 8-3</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Jace Phillips (Stockton Renegades) won by decision over Harlin Cuppernell (Saber WC) Dec 3-0</li>\n<li>Champ. Round 1 - Hunter Janeczko (Yorkville WC) won by decision over Evan Grazzini (Elmhurst WC) Dec 8-5</li>\n<li>Champ. Round 1 - William Vega (Martinez Fox Valley Elite) won by fall over Henry Wurl (Saber WC) Fall 2:46</li>\n<li>Champ. Round 1 - Shamon Handegan (Pekin Boys &amp; Girls Club) won by decision over Morgan Bartlett (Hononegah WC) Dec 6-2</li>\n<li>Champ. Round 1 - Matthew Kubas (Grayslake WC) won by major decision over Mason Randall (Mt. Vernon Lions WC) Maj 10-1</li>\n<li>Champ. Round 1 - Andrew Dado (Bolingbrook Junior Raiders) won by fall over William Strelow (Oak Forest Warriors) Fall 3:12</li>\n<li>Champ. Round 1 - Brandon Theres (Force Elite) won by fall over Antwan Strong (East St. Louis WC) Fall 1:02</li>\n<li>Champ. Round 1 - Domanic Abeja (Tinley Park Bulldogs) won by fall over Patrick Gilchrist (North Shore Edge) Fall 0:45</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Gabino Perez (Southside Outlaws WC) won by fall over Skander Tahri (Elmhurst WC) Fall 3:46</li>\n<li>Champ. Round 1 - Sebastian Cardenas (Hawk WC) won by fall over Dalton Brown (Storm Youth WC) Fall 2:35</li>\n<li>Champ. Round 1 - Roberto Patino (Lemont Bears WC) won by decision over Brayden Oberreiter (Riverton/Williamsville Youth Wrestling) Dec 11-4</li>\n<li>Champ. Round 1 - Joseph Scrivani (Golden Eagles WC) won by fall over Grant Larkin (Fox Valley WC) Fall 0:49</li>\n<li>Champ. Round 1 - Matthew Jens (Grayslake WC) won by decision over Jovon Johnson (Lincoln-Way WC) Dec 15-8</li>\n<li>Champ. Round 1 - Christopher Durbin (Team 1006 Wrestling) won by fall over Leo Garner (Edwardsville WC) Fall 2:42</li>\n<li>Champ. Round 1 - Moisey Trimble (Belleville Little Devils WC) won by fall over Michael Kopecky (Maine Eagles WC) Fall 4:17</li>\n<li>Champ. Round 1 - Colten Stevens (Yorkville WC) won by decision over Max Hrvatin (Joliet Area WC) Dec 9-6</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Anthony Gaik (G2 WC) won by fall over Ettavias Holmen-Anderson (Urbana Tigers WC) Fall 0:24</li>\n<li>Champ. Round 1 - Ethan Rivera (Mt. Vernon Lions WC) won by decision over George Allen (Notre Dame WC) Dec 2-1</li>\n<li>Champ. Round 1 - Micheal Brown (Harvey Twisters) won by fall over Jacob Acevedo (Junior Cougar WC) Fall 0:40</li>\n<li>Champ. Round 1 - Garner Libbra (Edwardsville WC) won by fall over Cael Terronez (Moline WC) Fall 0:10</li>\n<li>Champ. Round 1 - Edward Phillips (Super Soldiers WC) won by fall over Marko Ivanisevic (Hinsdale Red Devil WC) Fall 4:03</li>\n<li>Champ. Round 1 - William Ardson (Greg Gomez Trained Wrestling) won by fall over Joshua Crandall (Hawk WC) Fall 0:57</li>\n<li>Champ. Round 1 - Ethan Graham (Golden Eagles WC) won by major decision over Zane Mills (Champbuilders Wrestling) Maj 10-0</li>\n<li>Champ. Round 1 - Brian Petrancosta (Gomez Wrestling Academy) won by fall over Christian DuPlayee (Vandalia Jr WC) Fall 0:45</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Craig Johnson (Storm Youth WC) won by fall over Raymond Hughes (Golden Eagles WC) Fall 1:08</li>\n<li>Champ. Round 1 - Michael Rydell (Tinley Park Bulldogs) won by fall over Zach Oster (Roughnecks WC) Fall 0:17</li>\n<li>Champ. Round 1 - Landon Freeman (Unity Youth WC) won by fall over Matthew Hobbs (Triad Knights WC) Fall 2:22</li>\n<li>Champ. Round 1 - Paulie Rudolph (Golden Eagles WC) won by fall over Nickolas Naujokas (Mustang WC) Fall 0:42</li>\n<li>Champ. Round 1 - Karl Schmalz (Greg Gomez Trained Wrestling) won by fall over Dalton Mrazek (Timber Wolves WC) Fall 2:11</li>\n<li>Champ. Round 1 - Armando Hernandez (Junior Cougar WC) won by fall over Anthony Bauer (Hawk WC) Fall 0:27</li>\n<li>Champ. Round 1 - Tanner Clasen (Crosstown Spartan Elite WC) won by fall over Alexandre Perez (Wolfpak WC) Fall 0:47</li>\n<li>Champ. Round 1 - David Stewart (Blackhawk WC) won by fall over Andrew Torres (Junior Pioneer WC) Fall 1:12</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Sean Scheck (Batavia WC) won by fall over Michael Milovich (Elk Grove Junior Grens) Fall 1:54</li>\n<li>Champ. Round 1 - Jackson Barnhart (Champaign WC) won by fall over Alex Shoulders (Olney Cubs WC) Fall 1:22</li>\n<li>Champ. Round 1 - Jonathon Barrick (Crystal Lake Wizards) won by fall over Haidyn Hendricks (Unity Youth WC) Fall 0:55</li>\n<li>Champ. Round 1 - Tommy Isitt (Team 1006 Wrestling) won by decision over Brandon Rodriguez (Toss Em Up Wrestling Academy) Dec 7-0</li>\n<li>Champ. Round 1 - Daniel Cushing (Oak Forest Warriors) won by fall over Michael Cash (Frankfort Wildcats Wrestling) Fall 1:13</li>\n<li>Champ. Round 1 - Aidan Avilez (Martinez Fox Valley Elite) won by fall over Connor Dean (Benton WC) Fall 0:56</li>\n<li>Champ. Round 1 - Austin Hargrave (Crawford County WC) won by fall over Anthony Garcia (Badger WC) Fall 1:09</li>\n<li>Champ. Round 1 - Edward Perry (SCN Youth WC) won by decision over Ryan Deist (Frankfort Gladiator Wrestling) Dec 8-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Takyla Watkins (Danville Chargers) won by decision over Alex Lotito (Sycamore WC) Dec 4-3</li>\n<li>Champ. Round 1 - Chase Enfield (Naperville WC) won by fall over Mekhi McDowell (East St. Louis WC) Fall 0:39</li>\n<li>Champ. Round 1 - Alexander Poholik (Lincoln-Way WC) won by fall over Daveyon Starks (Centralia WC) Fall 0:21</li>\n<li>Champ. Round 1 - Max Brannam (Wolves WC) won by fall over Kiara Ganey (Belleville Little Devils WC) Fall 4:02</li>\n<li>Champ. Round 1 - Christopher Bates (Carbondale WC) won by fall over Emiliano Lopez (Guerrero`s Garage Wrestling) Fall 1:30</li>\n<li>Champ. Round 1 - Cooper King (Lions WC) won by decision over Makya Seibel (Belleville Little Devils WC) Dec 3-2</li>\n<li>Champ. Round 1 - Braden Hunter (Team 1006 Wrestling) won by fall over Tyler Olmstead (Effingham Youth WC) Fall 0:09</li>\n<li>Champ. Round 1 - Carmello Taylor (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Braylen Lewis (Champaign WC) won by fall over Riley Randolph (Gladiator Elite) Fall 2:16</li>\n<li>Champ. Round 1 - Eddie Solis (Marengo Youth WC) won by fall over Noah Barnes (Contender Wrestling) Fall 0:47</li>\n<li>Champ. Round 1 - Jarveion Brown (Force Elite) won by fall over Nathaniel Gnaden (Bismarck-Henning Youth WC) Fall 0:35</li>\n<li>Champ. Round 1 - Patrick Sepanski (Edwardsville WC) won by fall over Sebastian Martinez (Whips WC) Fall 2:46</li>\n<li>Champ. Round 1 - Wojtek Chrobak (Lemont Bears WC) won by fall over Samuel Morgan (Super Soldiers WC) Fall 3:28</li>\n<li>Champ. Round 1 - Sampson Price (Downers Grove WC) won by decision over Ricardo Townsend (Lionheart Intense Wrestling) Dec 5-0</li>\n<li>Champ. Round 1 - Lilijana Reyes (Maddog Wrestling Academy) won by fall over David Sumrall (Tinley Park Bulldogs) Fall 0:57</li>\n<li>Champ. Round 1 - Taylor Dixon (Limestone Blue Crew Wrestling) won by injury default over Nate Diaz (Kaneland Knights WC) Inj. 3:11</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Jacob Shingleton (Rantoul Junior Wrestling) won by fall over Mark Benson (Olney Cubs WC) Fall 2:59</li>\n<li>Champ. Round 1 - Ali Haroun (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Bryan Romero (Tomcat WC) won by decision over Kaitelyine Tolbert (Murphysboro WC) Dec 2-0</li>\n<li>Champ. Round 1 - Vincent Ruyle (Trico WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Dawson Rull (Edwardsville WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Jacob Herrin (Bulls WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Eric Jenkins (Hazel Crest Park District Thunder WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Dionte Turner (Team 1006 Wrestling) won by fall over Carter Schmith (Edwardsville WC) Fall 3:26</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Joshua Stedwill (Super Soldiers WC) won by decision over Max Munn (Celtics WC) Dec 6-0</li>\n<li>Champ. Round 2 - Morgan Turner (Harvey Twisters) won by fall over Chase Dyer (SCN Youth WC) Fall 0:49</li>\n<li>Champ. Round 2 - Dylan Weber (Contender Wrestling) won by fall over Deegan Kirschke (SCN Youth WC) Fall 2:52</li>\n<li>Champ. Round 2 - Domenic Munaretto (Crystal Lake Wizards) won by fall over Brennan O`Donnell (Barrington Broncos WC) Fall 0:36</li>\n<li>Champ. Round 2 - Gavin Pardilla (Arlington Cardinals WC) won by major decision over Keagan Steen (Stockton Renegades) Maj 10-2</li>\n<li>Champ. Round 2 - Nicholas Garcia (Gomez Wrestling Academy) won by fall over Aiden Larsen (Team 1006 Wrestling) Fall 1:26</li>\n<li>Champ. Round 2 - Anthony Sutton (Lockport Junior Porters WC) won by fall over Zane Skelton (Roughnecks WC) Fall 2:12</li>\n<li>Champ. Round 2 - Augustus Swanson (Tiger Town Tanglers WC) won by decision over Tristan Porter (Mattoon Youth WC) Dec 7-5</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Jason Hampton (Force Elite) won by decision over Brayden Edwards (Storm Youth WC) Dec 4-0</li>\n<li>Champ. Round 2 - Brayden Teunissen (DAWC) won by fall over Carmelo Palumbo (Southside Outlaws WC) Fall 2:38</li>\n<li>Champ. Round 2 - Brady Phelps (Arlington Cardinals WC) won by fall over Charlie Flores (Hoopeston Area WC) Fall 1:24</li>\n<li>Champ. Round 2 - Maxwell Cumbee (Gomez Wrestling Academy) won by fall over Eyson Van Eycke (Mt. Vernon Lions WC) Fall 0:29</li>\n<li>Champ. Round 2 - Allen Woo (Villa-Lombard Cougars) won by decision over Harrison Dea (Morton Youth WC) Dec 6-1</li>\n<li>Champ. Round 2 - Cory Zator (Lemont Bears WC) won by major decision over Isaac Zimmerman (Lockport Junior Porters WC) Maj 15-5</li>\n<li>Champ. Round 2 - Luca Poeta (The Wrestling Factory) won by decision over Rocky Seibel (Belleville Little Devils WC) Dec 7-1</li>\n<li>Champ. Round 2 - Kaidreaus Richardson (Lincoln-Way WC) won by decision over Nicolas Litchfield (Champaign WC) Dec 7-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Aaron Camacho (Bolingbrook Junior Raiders) won by fall over Jack Duraski (Batavia WC) Fall 2:35</li>\n<li>Champ. Round 2 - Dawveed Holland (Harvey Twisters) won by decision over Maxwell Wade (Gladiator Elite) Dec 9-5</li>\n<li>Champ. Round 2 - Jeremy Huf (Arlington Cardinals WC) won by injury default over Jakob Siwinski (Celtics WC) Inj. 4:27</li>\n<li>Champ. Round 2 - Xavier Villalobos (Rochelle WC) won by major decision over Jack Platt (Team 1006 Wrestling) Maj 15-2</li>\n<li>Champ. Round 2 - Kalani Khiev (Villa-Lombard Cougars) won by decision over Caiden Robison (TJ Trained Wrestling) Dec 5-4</li>\n<li>Champ. Round 2 - Brayden Mortell (Tinley Park Bulldogs) won by decision over Kobe Cali (Benton WC) Dec 8-4</li>\n<li>Champ. Round 2 - Madden Parker (Contender Wrestling) won by fall over Austin Hagevold (Red Raiders Wrestling Team) Fall 0:25</li>\n<li>Champ. Round 2 - Chazz Robinson (Harvey Twisters) won by decision over Ty Rangel (Storm Youth WC) Dec 6-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - George Marinopoulos (Mustang WC) won by decision over James Hemmila (Arlington Cardinals WC) Dec 9-5</li>\n<li>Champ. Round 2 - Bruno Cassioppi (Hononegah WC) won by tech fall over Garrett VerHeecke (Mt. Zion Kids WC) TF 18-3</li>\n<li>Champ. Round 2 - Juvontae Williams (Lionheart Intense Wrestling) won by decision over Dominick Diaz (Moline WC) Dec 11-6</li>\n<li>Champ. Round 2 - Lyndon Thies (Roughnecks WC) won by decision over Zev Koransky (Little Huskies WC) Dec 1-0</li>\n<li>Champ. Round 2 - Deven Casey (Izzy Style Wrestling) won by decision over Zachary Stewart (SCN Youth WC) Dec 11-4</li>\n<li>Champ. Round 2 - Michael Esteban (Southside Outlaws WC) won by major decision over Koletyn Zanoni (DAWC) Maj 11-3</li>\n<li>Champ. Round 2 - Carson Weber (Plainfield WC) won by decision over Jackson Bassett (O`Fallon Little Panthers WC) Dec 9-2</li>\n<li>Champ. Round 2 - Holden Brazelton (Champaign WC) won by major decision over Kameron Luif (Villa-Lombard Cougars) Maj 12-2</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Joseph Baranski (Oak Forest Warriors) won by fall over Erik Rodriguez (Fox Lake WC) Fall 0:55</li>\n<li>Champ. Round 2 - Rocco Cassioppi (Hononegah WC) won by fall over Jalen Byrd (Lincoln-Way WC) Fall 0:40</li>\n<li>Champ. Round 2 - Chase Osborne (Batavia WC) won by decision over Dylan Crouch (Pontiac WC) Dec 7-0</li>\n<li>Champ. Round 2 - Sophie Bowers (Vandalia Jr WC) won by decision over Saki Yoshikawa (Arlington Cardinals WC) Dec 2-0</li>\n<li>Champ. Round 2 - Brody Sendele (Hononegah WC) won by decision over Brody Kelly (Arlington Cardinals WC) Dec 7-5</li>\n<li>Champ. Round 2 - Ryan Hinger (Contender Wrestling) won by fall over Robye Williams (Harvey Twisters) Fall 0:59</li>\n<li>Champ. Round 2 - Ian Hawkins (Gomez Wrestling Academy) won by decision over Dominic Recchia (Yorkville WC) Dec 3-2</li>\n<li>Champ. Round 2 - Ronald Baker (Champaign WC) won in tie breaker - 1 over Jair Jackson-Bey (Harvey Twisters) TB-1 5-4</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Michael Meade (Wolves WC) won by decision over Brayden Swanson (Oswego WC) Dec 8-6</li>\n<li>Champ. Round 2 - Carson Bissey (Respect Wrestling) won by decision over Liam Kelly (Tinley Park Bulldogs) Dec 7-2</li>\n<li>Champ. Round 2 - Aaron Stewart (Toss Em Up Wrestling Academy) won by decision over Luke Zook (Yorkville WC) Dec 7-1</li>\n<li>Champ. Round 2 - Justin Wardlow (Force Elite) won by decision over Robert Conway (Mustang WC) Dec 3-1</li>\n<li>Champ. Round 2 - Donavon Allen (Harvey Twisters) won by decision over Nicholas Herman (Celtics WC) Dec 8-5</li>\n<li>Champ. Round 2 - Elias Koonce (Rochelle WC) won by decision over Brodey Durbin (Just Wrestling) Dec 7-0</li>\n<li>Champ. Round 2 - Zachary Montez (Junior Pioneer WC) won by decision over Callen Kirchner (Arlington Cardinals WC) Dec 5-0</li>\n<li>Champ. Round 2 - Pedro Antonio Rangel (Storm Youth WC) won by decision over Colin Thompson (SCN Youth WC) Dec 8-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Dominic Serio (Headlock Wrestling Academy) won by fall over Kye Weinzierl (Junior Pioneer WC) Fall 0:15</li>\n<li>Champ. Round 2 - William Denny (Celtics WC) won by major decision over Brock Ross (Belleville Little Devils WC) Maj 12-0</li>\n<li>Champ. Round 2 - David Ogunsanya (Harvey Twisters) won by fall over Aj Demos (Champaign WC) Fall 0:46</li>\n<li>Champ. Round 2 - Vance Williams (Red Raiders Wrestling Team) won by decision over Daniel Kelly (Sauk Valley WC) Dec 10-5</li>\n<li>Champ. Round 2 - Michael Major (Greg Gomez Trained Wrestling) won by decision over Jayden Gallagly (DAWC) Dec 4-0</li>\n<li>Champ. Round 2 - Tyson Rakers (Highland Bulldog Jr. WC) won by major decision over Thomas Mcdermott (Force Elite) Maj 11-1</li>\n<li>Champ. Round 2 - Jack Ferguson (Yorkville WC) won by decision over David Burchett Jr. (Mustang WC) Dec 5-0</li>\n<li>Champ. Round 2 - Owen Mcginnis (Cumberland Youth WC) won by fall over Luis Medina (Toss Em Up Wrestling Academy) Fall 4:08</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Jimmy Mastny (Dakota WC) won by fall over Royce Lopez (Toss Em Up Wrestling Academy) Fall 3:22</li>\n<li>Champ. Round 2 - Gavin Beeler (Edwardsville WC) won by fall over Jaxson Soliz (Moline WC) Fall 1:14</li>\n<li>Champ. Round 2 - Alexander Lizak (Tinley Park Bulldogs) won by decision over David Fajardo (Toss Em Up Wrestling Academy) Dec 3-0</li>\n<li>Champ. Round 2 - Rory Moran (Frankfort Wildcats Wrestling) won by decision over Matthew Plumb (SCN Youth WC) Dec 2-0</li>\n<li>Champ. Round 2 - Vincenzo Testa (Gomez Wrestling Academy) won by decision over Chase Pierceall (Plainfield WC) Dec 7-0</li>\n<li>Champ. Round 2 - Trevion Gilford (Team 1006 Wrestling) won by decision over Zac Pitre (Belleville Little Devils WC) Dec 5-2</li>\n<li>Champ. Round 2 - Thomas Verrette (Izzy Style Wrestling) won by decision over Connor Diemel (Hononegah WC) Dec 4-1</li>\n<li>Champ. Round 2 - Ryan Rink (Unity Youth WC) won by decision over Luis Dial (Springs Elite) Dec 6-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Ryan Mcgovern (SCN Youth WC) won by major decision over Jameson Remole (Storm Youth WC) Maj 8-0</li>\n<li>Champ. Round 2 - Dylan Baitinger (TJ Trained Wrestling) won by tech fall over Trevon Williams (Harvey Twisters) TF 18-2</li>\n<li>Champ. Round 2 - Caleb Eklund (Harlem Cougars WC) won by decision over Timothy Mckeon (Panther WC) Dec 3-1</li>\n<li>Champ. Round 2 - Benjamin Vazquez (Toss Em Up Wrestling Academy) won by fall over Coy Bender (Crawford County WC) Fall 2:16</li>\n<li>Champ. Round 2 - Ricky Ericksen (Vittum Cats of SKT) won by fall over Gunner Hefley (Hillsboro Jr Toppers) Fall 0:48</li>\n<li>Champ. Round 2 - Colin Bickett (Plainfield WC) won by fall over Kayden Marolf (Champbuilders Wrestling) Fall 4:07</li>\n<li>Champ. Round 2 - Jaxon Penovich (Arlington Cardinals WC) won by fall over Cayden Parks (Crystal Lake Wizards) Fall 2:12</li>\n<li>Champ. Round 2 - Parker Ray (Vandalia Jr WC) won by fall over Ray Ruiz-Ely (Mattoon Youth WC) Fall 2:52</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Bryce Edwards (Murphysboro WC) won by major decision over Caleb Baczek (The Wrestling Factory) Maj 9-0</li>\n<li>Champ. Round 2 - Rocco Powell (Force Elite) won by major decision over Michael Jones (Bismarck-Henning Youth WC) Maj 14-0</li>\n<li>Champ. Round 2 - Noah Rooney (Belvidere Bandits WC) won by decision over Brock Hoselton (SOT-C) Dec 8-7</li>\n<li>Champ. Round 2 - Tyus Almasy (TJ Trained Wrestling) won by major decision over King Liggins (Harvey Twisters) Maj 8-0</li>\n<li>Champ. Round 2 - Mattthew Sullivan (Panther WC) won by fall over De`marizon Graham (Carbondale WC) Fall 2:35</li>\n<li>Champ. Round 2 - Anthony Gutierrez (Izzy Style Wrestling) won by injury default over Lawrence Stringham (Plainfield WC) Inj. 1:33</li>\n<li>Champ. Round 2 - Mateusz Nycz (SCN Youth WC) won by fall over Keith Grim (Mendota Mat Masters) Fall 0:48</li>\n<li>Champ. Round 2 - Cole Turner (Force Elite) won by fall over Dakari Hawthorne (Urbana Tigers WC) Fall 2:43</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Brendan Landau (Edwardsville WC) won by fall over Kurtis Smith (Hononegah WC) Fall 3:19</li>\n<li>Champ. Round 2 - Bowden Delaney (TJ Trained Wrestling) won by fall over Joseph Weeks (Super Soldiers WC) Fall 0:49</li>\n<li>Champ. Round 2 - Caden O`Rourke (Oak Forest Warriors) won by fall over Michael Grazzini (Elmhurst WC) Fall 0:20</li>\n<li>Champ. Round 2 - Jarron Haberer (Highland Bulldog Jr. WC) won by fall over Erik Villa (Fox Lake WC) Fall 2:20</li>\n<li>Champ. Round 2 - Terence Willis (Belleville Little Devils WC) won by major decision over Shawn Watkins (Charger WC) Maj 8-0</li>\n<li>Champ. Round 2 - Nathan Elstner (Celtics WC) won by fall over Jaxon Lane (Villa-Lombard Cougars) Fall 0:29</li>\n<li>Champ. Round 2 - John McAuliffe (Tinley Park Bulldogs) won by decision over Donovan Avila (Guerrero`s Garage Wrestling) Dec 5-0</li>\n<li>Champ. Round 2 - Hunter Eastin (Unity Youth WC) won by fall over Trentin Rowe (Moline WC) Fall 2:26</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Durango Valles (Apex Stallions) won by decision over Reid Roberts (Golden Eagles WC) Dec 13-8</li>\n<li>Champ. Round 2 - Tyler Ott (Maddog Wrestling Academy) won by major decision over Jesus Barriga (Peoria Razorbacks WC) Maj 13-0</li>\n<li>Champ. Round 2 - Drake Champlin (Roughnecks WC) won by major decision over Joseph Pettit (Geneva Junior Vikings) Maj 10-2</li>\n<li>Champ. Round 2 - Thomas Jones (Force Elite) won by fall over Brock Needs (Stillman Valley WC) Fall 0:58</li>\n<li>Champ. Round 2 - Thomas Mcneil (Crystal Lake Wizards) won by fall over John Keigher (Elk Grove Junior Grens) Fall 2:49</li>\n<li>Champ. Round 2 - Tyler Humphrey (Super Soldiers WC) won by decision over Dj Freeman (Celtics WC) Dec 8-2</li>\n<li>Champ. Round 2 - Santino Milazzo (Martinez Fox Valley Elite) won by decision over Austin Reading (Contender Wrestling) Dec 9-6</li>\n<li>Champ. Round 2 - Xavier Bitner (Rams WC) won by decision over Carlito Lattin (Pontiac WC) Dec 8-3</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Sean Bechtold (Bulls WC) won by decision over Joe Zimmer (Tinley Park Bulldogs) Dec 6-3</li>\n<li>Champ. Round 2 - Evan Jocic (Izzy Style Wrestling) won by fall over Daniel Mahoney (Mustang WC) Fall 0:43</li>\n<li>Champ. Round 2 - Samuel Davison (Golden Eagles WC) won by decision over Bryson Reeves (Lockport Junior Porters WC) Dec 1-0</li>\n<li>Champ. Round 2 - Andrew Banaszak (Badger WC) won by major decision over Eric Gonzalez (Batavia WC) Maj 12-2</li>\n<li>Champ. Round 2 - Christopher Yirsa (Lockport Junior Porters WC) won by fall over Juan Cervantes (Belvidere Bandits WC) Fall 0:51</li>\n<li>Champ. Round 2 - Dylan Berkowitz (Elk Grove Junior Grens) won by major decision over Ryan Darnell (Quincy Cyclones WC) Maj 13-0</li>\n<li>Champ. Round 2 - Jake Sulzberger (Lemont Bears WC) won by decision over Lucas Burton (Fox Lake WC) Dec 8-2</li>\n<li>Champ. Round 2 - Wyatt Dothager (Vandalia Jr WC) won by major decision over Ethan Miller (Storm Youth WC) Maj 14-3</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - Avery Bowers (Dakota WC) won by decision over Sable Taylor (Clinton WC) Dec 4-0</li>\n<li>Champ. Round 2 - Joe Herbert (Maine Eagles WC) won by fall over Jack Rossi (Downers Grove WC) Fall 1:55</li>\n<li>Champ. Round 2 - Anthony Soto (Toss Em Up Wrestling Academy) won by fall over Tyler Drexel (Frankfort Wildcats Wrestling) Fall 0:45</li>\n<li>Champ. Round 2 - Caleb Fortson (Team 1006 Wrestling) won by fall over Aaron Sheffer (AJ Junior Wildcats WC) Fall 0:31</li>\n<li>Champ. Round 2 - Sargent Maubach (Peoria Razorbacks WC) won by decision over Owen Shaw (Saukee Youth WC) Dec 8-1</li>\n<li>Champ. Round 2 - Kai Calcutt (Arlington Cardinals WC) won by fall over Asher Sheldon (Batavia WC) Fall 0:55</li>\n<li>Champ. Round 2 - Dario Williams (Lions WC) won by major decision over Sean Thornton (Super Soldiers WC) Maj 10-2</li>\n<li>Champ. Round 2 - Tyler Fortis (Izzy Style Wrestling) won by major decision over Max Wiezorek (Central Illinois Academy of Wrestling) Maj 11-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Isaiah Logan (Team 1006 Wrestling) won by fall over Andrew Owen (Saber WC) Fall 1:11</li>\n<li>Champ. Round 2 - Triston Abram (Edwardsville WC) won by fall over Daniel Violante (Wolfpak WC) Fall 1:20</li>\n<li>Champ. Round 2 - Alonnah Nance (Force Elite) won by fall over Jayvier Hollis (Gladiator Elite) Fall 4:05</li>\n<li>Champ. Round 2 - Jonnie Palomarez (Blackhawk WC) won by decision over Manuel Chavez (Blackhawk WC) Dec 7-1</li>\n<li>Champ. Round 2 - Ethan Hofmeister (Belleville Little Devils WC) won by fall over Jayvin Savoie (Brawlers WC) Fall 0:40</li>\n<li>Champ. Round 2 - Matthew Wolfe (Sauk Valley WC) won by fall over Lucas Stuckert (Wolfpak WC) Fall 2:23</li>\n<li>Champ. Round 2 - Kaiden Morris (Rochelle WC) won by fall over Robbie Murphy (Minooka Indians Elite Wrestling) Fall 2:05</li>\n<li>Champ. Round 2 - Raul Martinez (Fisher WC) won by fall over Mason Monce (Batavia WC) Fall 1:17</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Diego Gutierrez (Bolingbrook Junior Raiders) received a bye   () Bye</li>\n<li>Champ. Round 2 - Keagen Goff (Falcon Youth WC) won by decision over Jordan Collins (Arlington Cardinals WC) Dec 6-4</li>\n<li>Champ. Round 2 - Ashton Zobrist (Highland Bulldog Jr. WC) won by fall over Dominic Palusinski (Riverton/Williamsville Youth Wrestling) Fall 2:05</li>\n<li>Champ. Round 2 - Zion Carter (Astro WC) won by fall over Trevor Nelson (Yorkville WC) Fall 0:42</li>\n<li>Champ. Round 2 - Jose Del Toro (TJ Trained Wrestling) won by fall over Xyon Thomas (Harvey Twisters) Fall 0:22</li>\n<li>Champ. Round 2 - Jace Wolf (Maddog Wrestling Academy) won by fall over Hayden David Volz (Edwardsville WC) Fall 0:35</li>\n<li>Champ. Round 2 - Matthew Vasquez (O`Fallon Little Panthers WC) won by fall over Jayden Bleisch (Team Mascoutah WC) Fall 2:10</li>\n<li>Champ. Round 2 - James Schmidt (Urbana Tigers WC) won by fall over Alyas Ivery (Chicago Park District) Fall 5:13</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Michael McDonough (Tinley Park Bulldogs) won by fall over Gage DeLaval (Murphysboro WC) Fall 1:03</li>\n<li>Champ. Round 2 - Keegan Barnes (Super Soldiers WC) won by fall over Kyren Johnson (Lionheart Intense Wrestling) Fall 1:07</li>\n<li>Champ. Round 2 - Jonathan Rulo (Belleville Little Devils WC) won by fall over Colton Manes (Riverton/Williamsville Youth Wrestling) Fall 0:25</li>\n<li>Champ. Round 2 - Noah Runnels (Hazel Crest Park District Thunder WC) won by fall over Angilberto Serrano (Mendota Mat Masters) Fall 1:11</li>\n<li>Champ. Round 2 - Francisco Puga (Harvard WC) won by fall over Joseph Carter (Roughnecks WC) Fall 5:48</li>\n<li>Champ. Round 2 - Jenaro Sepeda (Moline WC) won by fall over Roy Phelps (Beat the Streets-Chicago) Fall 0:20</li>\n<li>Champ. Round 2 - Hiran Lopez Marquez (Tomcat WC) won by fall over Braxton Forshey (Saukee Youth WC) Fall 0:22</li>\n<li>Champ. Round 2 - Amarion Ellison (Storm Youth WC) won by fall over Jackson Hochgraber (Panther WC) Fall 1:24</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Donny Pigoni (SCN Youth WC) won by tech fall over Cayden Amico (Plainfield WC) TF 16-1</li>\n<li>Champ. Round 2 - Nore Turner (Harvey Twisters) won by major decision over Caleb Scott (Granite City Wrestling Association) Maj 8-0</li>\n<li>Champ. Round 2 - Grant Madl (Elk Grove Junior Grens) won by fall over Liam Zimmerman (Lockport Junior Porters WC) Fall 2:10</li>\n<li>Champ. Round 2 - Kamron Scholl (Kaneland Knights WC) won by decision over Peter Young (DAWC) Dec 2-0</li>\n<li>Champ. Round 2 - Ty Edwards (Team 1006 Wrestling) won by major decision over Ezekiel Schroeder (Golden Eagles WC) Maj 8-0</li>\n<li>Champ. Round 2 - Tony Keene (Gladiator Elite) won by fall over Max Siegel (Tinley Park Bulldogs) Fall 0:51</li>\n<li>Champ. Round 2 - Jase Salin (Celtics WC) won by major decision over Thomas Tourdot (Rochelle WC) Maj 8-0</li>\n<li>Champ. Round 2 - Carter Mikolajczak (Lemont Bears WC) won by decision over Joseph Sikorsky (Geneva Junior Vikings) Dec 6-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Guillermo Rivera (Oak Forest Warriors) won by decision over Bryson Spaulding (Izzy Style Wrestling) Dec 7-5</li>\n<li>Champ. Round 2 - Kaden Harman (Golden Eagles WC) won by major decision over Zachary Parisi (Elmhurst WC) Maj 12-2</li>\n<li>Champ. Round 2 - Raymond Cavey (SCN Youth WC) won by decision over Tyson Zvonar (Lincoln-Way WC) Dec 1-0</li>\n<li>Champ. Round 2 - Joseph Lathwood (Bulls WC) won by tech fall over Casey Griffin (Tinley Park Bulldogs) TF 15-0</li>\n<li>Champ. Round 2 - William Hupke (SCN Youth WC) won by decision over Theodore Flores (Maine Eagles WC) Dec 7-0</li>\n<li>Champ. Round 2 - Deion Johnson (Harvey Twisters) won by fall over Tommy Hammond (Crystal Lake Wizards) Fall 2:40</li>\n<li>Champ. Round 2 - Inocencio Garcia (Force Elite) won by fall over Damien Flores (Southside Outlaws WC) Fall 2:33</li>\n<li>Champ. Round 2 - Olin Walker (Team 312) won by major decision over Tallen Pawlak (Champaign WC) Maj 9-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Payton Murphy (TJ Trained Wrestling) won in sudden victory - 1 over Gunnar Garelli (Izzy Style Wrestling) SV-1 5-3</li>\n<li>Champ. Round 2 - Mason Tieffel (Wrestling Inc) won by decision over Noah Dial (Bolingbrook Junior Raiders) Dec 4-0</li>\n<li>Champ. Round 2 - Benjamin Davino (SCN Youth WC) won by major decision over Sebastian Leon (Lincoln-Way WC) Maj 13-3</li>\n<li>Champ. Round 2 - Benjamin Dunne (Izzy Style Wrestling) won by decision over Javin Jackson-Bey (Harvey Twisters) Dec 12-8</li>\n<li>Champ. Round 2 - Karter Guzman (Headlock Wrestling Academy) won by decision over Aidan Huck (Batavia WC) Dec 7-2</li>\n<li>Champ. Round 2 - Dominic Ducato (Golden Eagles WC) won by decision over Evan Willock (TJ Trained Wrestling) Dec 3-1</li>\n<li>Champ. Round 2 - Seth Mendoza (Contender Wrestling) won by tech fall over Chase Hampton (Greg Gomez Trained Wrestling) TF 17-2</li>\n<li>Champ. Round 2 - Brady Grennan (Sauk Valley WC) won by fall over Talan Gredy-Nelson (Hoopeston Area WC) Fall 1:13</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Edmund Enright (Mustang WC) won by fall over Caden Kirchner (Arlington Cardinals WC) Fall 2:26</li>\n<li>Champ. Round 2 - Colin Young (DAWC) won by decision over Jermaine Butler (Crosstown Spartan Elite WC) Dec 7-0</li>\n<li>Champ. Round 2 - Jameson Garcia (Gomez Wrestling Academy) won by decision over Carter Rude (Sauk Valley WC) Dec 6-3</li>\n<li>Champ. Round 2 - Bryce Griffin (Bulls WC) won in tie breaker - 1 over Jacob Crandall (Arlington Cardinals WC) TB-1 3-2</li>\n<li>Champ. Round 2 - Joshua Vazquez (Izzy Style Wrestling) won by major decision over James Wright (Golden Eagles WC) Maj 13-1</li>\n<li>Champ. Round 2 - Trevor Silzer (Tinley Park Bulldogs) won by decision over Colin Kacena (Bolingbrook Junior Raiders) Dec 6-0</li>\n<li>Champ. Round 2 - Collin Altensey (Moline WC) won by major decision over Nicholas Fetters (Belleville Little Devils WC) Maj 8-0</li>\n<li>Champ. Round 2 - Jackson Smith (Lemont Bears WC) won by fall over Reef Pacot (Storm Youth WC) Fall 1:59</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Tyler Aters (SCN Youth WC) won by major decision over Brendan Tunink (Sauk Valley WC) Maj 10-0</li>\n<li>Champ. Round 2 - Colby Crouch (Combative Sports Athletic Center) won by fall over Sean Larkin (Panther WC) Fall 0:11</li>\n<li>Champ. Round 2 - William Baysingar (Arlington Cardinals WC) won by tech fall over Noah Quintana (Team 1006 Wrestling) TF 15-0</li>\n<li>Champ. Round 2 - Sam Schuit (Lemont Bears WC) won by decision over Harrison Konder (Bolingbrook Junior Raiders) Dec 7-2</li>\n<li>Champ. Round 2 - Eduardo Nunez (Southside Outlaws WC) won by decision over Ryan Mohler (Fox Valley WC) Dec 7-4</li>\n<li>Champ. Round 2 - Garrett Luke (Stockton Renegades) won by decision over Caleb Nobiling (The Wrestling Factory) Dec 3-2</li>\n<li>Champ. Round 2 - Alexander Marre (Izzy Style Wrestling) won by decision over Paul Ishikawa (TJ Trained Wrestling) Dec 5-2</li>\n<li>Champ. Round 2 - Kaden Fetterolf (Batavia WC) won by decision over Carter Chambliss (Storm Youth WC) Dec 3-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Tyler Guerra (Izzy Style Wrestling) won by decision over Jackson Gillen (Team 1006 Wrestling) Dec 3-2</li>\n<li>Champ. Round 2 - Gylon Sims (Force Elite) won by major decision over Brody Murray (SCN Youth WC) Maj 18-5</li>\n<li>Champ. Round 2 - Francisco Solis (Greg Gomez Trained Wrestling) won by decision over Matthew Starzyk (Mustang WC) Dec 3-2</li>\n<li>Champ. Round 2 - Noah Manuel Tapia (Moline WC) won by major decision over Jason Bowers (Dakota WC) Maj 11-3</li>\n<li>Champ. Round 2 - Michael DiBenedetto (Elmhurst WC) won by decision over Thomas Silva (DAWC) Dec 6-3</li>\n<li>Champ. Round 2 - Connor Koehler (Contender Wrestling) won by decision over Zeke Rhodes (Roughnecks WC) Dec 5-4</li>\n<li>Champ. Round 2 - Kannon Webster (Super Soldiers WC) won by fall over Henry Coughlin (Tinley Park Bulldogs) Fall 2:58</li>\n<li>Champ. Round 2 - Solomon Gilliam (Villa-Lombard Cougars) won by major decision over Blake Barney (Storm Youth WC) Maj 9-0</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Nasir Bailey (Harvey Twisters) won by tech fall over Polo Ramon (Headlock Wrestling Academy) TF 20-5</li>\n<li>Champ. Round 2 - Tyler Starr (Brawlers WC) won by decision over Dillon Raab (The Law) Dec 9-6</li>\n<li>Champ. Round 2 - Michael Calcagno (Izzy Style Wrestling) won by decision over Tegan Chumbley (SCN Youth WC) Dec 4-3</li>\n<li>Champ. Round 2 - Max Astacio (Crystal Lake Wizards) won by decision over Joseph Griffin (Team 1006 Wrestling) Dec 6-5</li>\n<li>Champ. Round 2 - Christopher Moore (Crystal Lake Wizards) won by major decision over Matthew Janiak (Team 1006 Wrestling) Maj 9-0</li>\n<li>Champ. Round 2 - Richard Wade (Gladiator Elite) won by fall over Dimitrios Lalezas (Lemont Bears WC) Fall 2:51</li>\n<li>Champ. Round 2 - Caden Muselman (Tinley Park Bulldogs) won by decision over Saul Trejo (Izzy Style Wrestling) Dec 7-4</li>\n<li>Champ. Round 2 - Damarion Moore (Storm Youth WC) won by decision over Santino Scolaro (SCN Youth WC) Dec 9-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Adan Rocha (Batavia WC) won by fall over Marco Avelar (Elk Grove Junior Grens) Fall 4:13</li>\n<li>Champ. Round 2 - William Jacobson (Tinley Park Bulldogs) won by decision over Tyler Martinez (Team 1006 Wrestling) Dec 4-2</li>\n<li>Champ. Round 2 - Antonio Alvarado (Belvidere WC) won by major decision over John O`Connor (Lemont Bears WC) Maj 10-1</li>\n<li>Champ. Round 2 - Collin Carrigan (Izzy Style Wrestling) won by major decision over Antonio Briagas (Granite City Wrestling Association) Maj 10-0</li>\n<li>Champ. Round 2 - Vincent Robinson (Harvey Twisters) won by major decision over Caleb Mays (AJ Junior Wildcats WC) Maj 12-2</li>\n<li>Champ. Round 2 - Luis Bazan (Bolingbrook Junior Raiders) won by major decision over Drew Torza (Team 1006 Wrestling) Maj 11-1</li>\n<li>Champ. Round 2 - Mark Martinez (Toss Em Up Wrestling Academy) won by major decision over Caden Casimino (Crystal Lake Wizards) Maj 12-2</li>\n<li>Champ. Round 2 - Aidan Postma (Triad Knights WC) won by decision over Hayden Weaver (Storm Youth WC) Dec 8-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Skip Rozanski (Pitbull Wrestling Alliance) won by decision over Mylze Cammack (Mt. Vernon Lions WC) Dec 8-1</li>\n<li>Champ. Round 2 - Kyle Lindsey (Oak Forest Warriors) won by decision over Luke Christie (Brawlers WC) Dec 3-2</li>\n<li>Champ. Round 2 - Garrett Vincent (Dakota WC) won by decision over Jack Lesher (SCN Youth WC) Dec 6-5</li>\n<li>Champ. Round 2 - Aj Heeg (Southside Outlaws WC) won by decision over Carlos Munoz-Flores (Team 1006 Wrestling) Dec 8-3</li>\n<li>Champ. Round 2 - Jayden Colon (Harvey Twisters) won by major decision over Eric Gustafson (Moline WC) Maj 15-4</li>\n<li>Champ. Round 2 - Ethan Stiles (Izzy Style Wrestling) won by tech fall over Aiden Zacharuk (Harlem Cougars WC) TF 21-4</li>\n<li>Champ. Round 2 - Nolan Allen (Guerrero`s Garage Wrestling) won by decision over Griffin Luke (Stockton Renegades) Dec 4-1</li>\n<li>Champ. Round 2 - Chris Macklin (Rochester WC) won by decision over Eric McKinney (Vandalia Jr WC) Dec 7-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Braden Kelly (Granite City Wrestling Association) won by decision over Hunter Britz (Sycamore WC) Dec 8-2</li>\n<li>Champ. Round 2 - Troy Mutz (Team 1006 Wrestling) won by fall over Seth Stevens (Hawk WC) Fall 2:16</li>\n<li>Champ. Round 2 - Billy Lindsey (Oak Forest Warriors) won by tech fall over Anthony Alansari (Scorpion WC) TF 16-1</li>\n<li>Champ. Round 2 - David Mayora (Izzy Style Wrestling) won by fall over Ben Butler (Crystal Lake Wizards) Fall 1:00</li>\n<li>Champ. Round 2 - Elijah Munoz (Team 1006 Wrestling) won by fall over Dayton Hoffman (Murphysboro WC) Fall 2:24</li>\n<li>Champ. Round 2 - William Prater (Izzy Style Wrestling) won by tech fall over Connor Cumbee (Force Elite) TF 17-0</li>\n<li>Champ. Round 2 - Drew Surges (SCN Youth WC) won by decision over Jaydon Robinson (Harvey Twisters) Dec 8-2</li>\n<li>Champ. Round 2 - Nicholas Nosler (Unity Youth WC) won by decision over Louden Schnake (Hononegah WC) Dec 2-1</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Kamron Beal (Vittum Cats of SKT) won by major decision over Jace Phillips (Stockton Renegades) Maj 15-5</li>\n<li>Champ. Round 2 - Patrick Downing (North Shore Edge) won by fall over Hunter Janeczko (Yorkville WC) Fall 1:12</li>\n<li>Champ. Round 2 - Logan Nance (Vandalia Jr WC) won by decision over William Vega (Martinez Fox Valley Elite) Dec 6-3</li>\n<li>Champ. Round 2 - Joshua Franklin (UP Town WC) won by major decision over Shamon Handegan (Pekin Boys &amp; Girls Club) Maj 10-1</li>\n<li>Champ. Round 2 - Jack Seacrist (Belvidere Bandits WC) won by major decision over Matthew Kubas (Grayslake WC) Maj 14-4</li>\n<li>Champ. Round 2 - Andrew Dado (Bolingbrook Junior Raiders) won by decision over Logan Swaw (Team 1006 Wrestling) Dec 3-2</li>\n<li>Champ. Round 2 - Cruz Ibarra (nWo WC) won by decision over Brandon Theres (Force Elite) Dec 4-0</li>\n<li>Champ. Round 2 - Domanic Abeja (Tinley Park Bulldogs) won by decision over Colin Ripperda (Riverton/Williamsville Youth Wrestling) Dec 1-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Devin Medina (Bolingbrook Junior Raiders) won by fall over Gabino Perez (Southside Outlaws WC) Fall 3:28</li>\n<li>Champ. Round 2 - Sebastian Cardenas (Hawk WC) won by fall over Hunter Luyando (Sauk Valley WC) Fall 3:33</li>\n<li>Champ. Round 2 - Abraham Wojcikiewicz (Bulls WC) won by decision over Roberto Patino (Lemont Bears WC) Dec 6-0</li>\n<li>Champ. Round 2 - Jack Smialowicz (Pitbull Wrestling Alliance) won by decision over Joseph Scrivani (Golden Eagles WC) Dec 3-2</li>\n<li>Champ. Round 2 - Gus Cambier (Sycamore WC) won by fall over Matthew Jens (Grayslake WC) Fall 3:26</li>\n<li>Champ. Round 2 - Jalen Curtis (Greg Gomez Trained Wrestling) won by decision over Christopher Durbin (Team 1006 Wrestling) Dec 5-3</li>\n<li>Champ. Round 2 - Moisey Trimble (Belleville Little Devils WC) won by decision over Alexander Jackson (Springs Elite) Dec 5-3</li>\n<li>Champ. Round 2 - Gabriel Orosco (TJ Trained-Springfield) won by fall over Colten Stevens (Yorkville WC) Fall 0:57</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Gable Carrick (Sycamore WC) won by fall over Anthony Gaik (G2 WC) Fall 1:45</li>\n<li>Champ. Round 2 - Ryan Whitwell (Batavia WC) won by fall over Ethan Rivera (Mt. Vernon Lions WC) Fall 1:28</li>\n<li>Champ. Round 2 - Micheal Brown (Harvey Twisters) won by tech fall over John Fennell (Force Elite) TF 17-2</li>\n<li>Champ. Round 2 - Benjamin Alvarez (Team 1006 Wrestling) won by fall over Garner Libbra (Edwardsville WC) Fall 0:26</li>\n<li>Champ. Round 2 - Dominic Thebeau (Belleville Little Devils WC) won by decision over Edward Phillips (Super Soldiers WC) Dec 8-2</li>\n<li>Champ. Round 2 - Aaron Hernandez (Pitbull Wrestling Alliance) won by decision over William Ardson (Greg Gomez Trained Wrestling) Dec 5-3</li>\n<li>Champ. Round 2 - Conor Phelan (Badger WC) won by fall over Ethan Graham (Golden Eagles WC) Fall 0:59</li>\n<li>Champ. Round 2 - Cory West (Rochester WC) won by fall over Brian Petrancosta (Gomez Wrestling Academy) Fall 0:50</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Robert Gonzalez (Team 1006 Wrestling) won by fall over Craig Johnson (Storm Youth WC) Fall 2:55</li>\n<li>Champ. Round 2 - Michael Rydell (Tinley Park Bulldogs) won by fall over Giovanni Hernandez (Team 312) Fall 1:30</li>\n<li>Champ. Round 2 - Jc Piker (Brawlers WC) won by fall over Landon Freeman (Unity Youth WC) Fall 3:14</li>\n<li>Champ. Round 2 - Jack Brozny (Batavia WC) won by decision over Paulie Rudolph (Golden Eagles WC) Dec 6-0</li>\n<li>Champ. Round 2 - Karl Schmalz (Greg Gomez Trained Wrestling) won by decision over Wyatt Kolnsberg (Edwardsville WC) Dec 6-1</li>\n<li>Champ. Round 2 - Gavin Brown (Oak Forest Warriors) won by fall over Armando Hernandez (Junior Cougar WC) Fall 2:32</li>\n<li>Champ. Round 2 - Noah Wenzel (Dakota WC) won by fall over Tanner Clasen (Crosstown Spartan Elite WC) Fall 1:30</li>\n<li>Champ. Round 2 - David Stewart (Blackhawk WC) won by major decision over Hudson McMann (Junior Cyclones WC) Maj 9-0</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Griffin Carr (Force Elite) won by fall over Sean Scheck (Batavia WC) Fall 1:17</li>\n<li>Champ. Round 2 - Gabriel Kaminski (Push Wrestling) won by decision over Jackson Barnhart (Champaign WC) Dec 6-0</li>\n<li>Champ. Round 2 - Jonathon Barrick (Crystal Lake Wizards) won by major decision over Luke Williams (Edwardsville WC) Maj 9-0</li>\n<li>Champ. Round 2 - Tommy Isitt (Team 1006 Wrestling) won by fall over Alex Pasquale (Lemont Bears WC) Fall 1:56</li>\n<li>Champ. Round 2 - Justin Hoffer (Super Soldiers WC) won by fall over Daniel Cushing (Oak Forest Warriors) Fall 2:02</li>\n<li>Champ. Round 2 - Aidan Avilez (Martinez Fox Valley Elite) won by fall over Tyler Michelini (Elk Grove Junior Grens) Fall 1:20</li>\n<li>Champ. Round 2 - Porter Leith (Dundee Highlanders WC) won by decision over Austin Hargrave (Crawford County WC) Dec 3-1</li>\n<li>Champ. Round 2 - Calvin Hempel (Storm Youth WC) won by decision over Edward Perry (SCN Youth WC) Dec 6-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Aiden Taylor (Carbondale WC) won by fall over Takyla Watkins (Danville Chargers) Fall 0:57</li>\n<li>Champ. Round 2 - Kellan Knop (Lions WC) won by decision over Chase Enfield (Naperville WC) Dec 5-0</li>\n<li>Champ. Round 2 - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by fall over Alexander Poholik (Lincoln-Way WC) Fall 0:22</li>\n<li>Champ. Round 2 - Jonathan Moreno (Blackhawk WC) won by decision over Max Brannam (Wolves WC) Dec 6-2</li>\n<li>Champ. Round 2 - Hunter Powell (Force Elite) won by fall over Christopher Bates (Carbondale WC) Fall 0:29</li>\n<li>Champ. Round 2 - Thomas Roath (Scorpion WC) won by fall over Cooper King (Lions WC) Fall 0:22</li>\n<li>Champ. Round 2 - Braden Hunter (Team 1006 Wrestling) won by fall over Hunter Smith (Marengo Youth WC) Fall 2:46</li>\n<li>Champ. Round 2 - Carmello Taylor (Edwardsville WC) won by fall over Alexander Stout (Charleston WC) Fall 2:38</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Seth Skamra (Headlock Wrestling Academy) won by fall over Braylen Lewis (Champaign WC) Fall 3:50</li>\n<li>Champ. Round 2 - Morley Coval (Greg Gomez Trained Wrestling) won by fall over Eddie Solis (Marengo Youth WC) Fall 1:00</li>\n<li>Champ. Round 2 - Charlie Jagusah (Junior Pioneer WC) won by fall over Jarveion Brown (Force Elite) Fall 0:46</li>\n<li>Champ. Round 2 - Zion Nix (Badger WC) won by tech fall over Patrick Sepanski (Edwardsville WC) TF 23-5</li>\n<li>Champ. Round 2 - Dillan Johnson (Force Elite) won by tech fall over Wojtek Chrobak (Lemont Bears WC) TF 16-0</li>\n<li>Champ. Round 2 - Lee Smith Jr. (DAWC) won by fall over Sampson Price (Downers Grove WC) Fall 2:18</li>\n<li>Champ. Round 2 - Cameron Love (Edwardsville WC) won by fall over Lilijana Reyes (Maddog Wrestling Academy) Fall 2:23</li>\n<li>Champ. Round 2 - Noah Carl (Cumberland Youth WC) won by decision over Taylor Dixon (Limestone Blue Crew Wrestling) Dec 6-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Lucas Armstrong (Peoria Razorbacks WC) won by fall over Jacob Shingleton (Rantoul Junior Wrestling) Fall 0:18</li>\n<li>Champ. Round 2 - Alexis Correa (Guerrero`s Garage Wrestling) won by fall over Ali Haroun (Edwardsville WC) Fall 0:41</li>\n<li>Champ. Round 2 - Ryan Clancy (Crosstown Spartan Elite WC) won by decision over Bryan Romero (Tomcat WC) Dec 4-1</li>\n<li>Champ. Round 2 - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Vincent Ruyle (Trico WC) Fall 0:46</li>\n<li>Champ. Round 2 - Dawson Rull (Edwardsville WC) won by fall over Padraig O`Malley (Hononegah WC) Fall 1:06</li>\n<li>Champ. Round 2 - Tyler Johnston (Blackhawk WC) won by fall over Jacob Herrin (Bulls WC) Fall 0:07</li>\n<li>Champ. Round 2 - Dorian Arguelles (Granite City Wrestling Association) won by fall over Eric Jenkins (Hazel Crest Park District Thunder WC) Fall 0:34</li>\n<li>Champ. Round 2 - Robert Rigg (Charleston WC) won by fall over Dionte Turner (Team 1006 Wrestling) Fall 2:01</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Morgan Turner (Harvey Twisters) won by fall over Joshua Stedwill (Super Soldiers WC) Fall 2:36</li>\n<li>Quarterfinal - Domenic Munaretto (Crystal Lake Wizards) won by fall over Dylan Weber (Contender Wrestling) Fall 1:06</li>\n<li>Quarterfinal - Nicholas Garcia (Gomez Wrestling Academy) won by major decision over Gavin Pardilla (Arlington Cardinals WC) Maj 8-0</li>\n<li>Quarterfinal - Anthony Sutton (Lockport Junior Porters WC) won by fall over Augustus Swanson (Tiger Town Tanglers WC) Fall 0:33</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Brayden Teunissen (DAWC) won by tech fall over Jason Hampton (Force Elite) TF 15-0</li>\n<li>Quarterfinal - Brady Phelps (Arlington Cardinals WC) won by decision over Maxwell Cumbee (Gomez Wrestling Academy) Dec 4-0</li>\n<li>Quarterfinal - Cory Zator (Lemont Bears WC) won by decision over Allen Woo (Villa-Lombard Cougars) Dec 9-3</li>\n<li>Quarterfinal - Kaidreaus Richardson (Lincoln-Way WC) won by decision over Luca Poeta (The Wrestling Factory) Dec 4-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Aaron Camacho (Bolingbrook Junior Raiders) won by decision over Dawveed Holland (Harvey Twisters) Dec 7-0</li>\n<li>Quarterfinal - Xavier Villalobos (Rochelle WC) won by decision over Jeremy Huf (Arlington Cardinals WC) Dec 6-4</li>\n<li>Quarterfinal - Kalani Khiev (Villa-Lombard Cougars) won by decision over Brayden Mortell (Tinley Park Bulldogs) Dec 8-2</li>\n<li>Quarterfinal - Madden Parker (Contender Wrestling) won by decision over Chazz Robinson (Harvey Twisters) Dec 8-7</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Bruno Cassioppi (Hononegah WC) won by fall over George Marinopoulos (Mustang WC) Fall 2:36</li>\n<li>Quarterfinal - Lyndon Thies (Roughnecks WC) won by decision over Juvontae Williams (Lionheart Intense Wrestling) Dec 11-5</li>\n<li>Quarterfinal - Michael Esteban (Southside Outlaws WC) won by decision over Deven Casey (Izzy Style Wrestling) Dec 2-0</li>\n<li>Quarterfinal - Holden Brazelton (Champaign WC) won by decision over Carson Weber (Plainfield WC) Dec 2-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Rocco Cassioppi (Hononegah WC) won by fall over Joseph Baranski (Oak Forest Warriors) Fall 4:29</li>\n<li>Quarterfinal - Chase Osborne (Batavia WC) won by decision over Sophie Bowers (Vandalia Jr WC) Dec 7-0</li>\n<li>Quarterfinal - Ryan Hinger (Contender Wrestling) won by decision over Brody Sendele (Hononegah WC) Dec 5-1</li>\n<li>Quarterfinal - Ronald Baker (Champaign WC) won by decision over Ian Hawkins (Gomez Wrestling Academy) Dec 7-6</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Carson Bissey (Respect Wrestling) won by fall over Michael Meade (Wolves WC) Fall 2:38</li>\n<li>Quarterfinal - Aaron Stewart (Toss Em Up Wrestling Academy) won by decision over Justin Wardlow (Force Elite) Dec 7-3</li>\n<li>Quarterfinal - Donavon Allen (Harvey Twisters) won by decision over Elias Koonce (Rochelle WC) Dec 10-3</li>\n<li>Quarterfinal - Pedro Antonio Rangel (Storm Youth WC) won by decision over Zachary Montez (Junior Pioneer WC) Dec 5-4</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Dominic Serio (Headlock Wrestling Academy) won by major decision over William Denny (Celtics WC) Maj 13-4</li>\n<li>Quarterfinal - Vance Williams (Red Raiders Wrestling Team) won by decision over David Ogunsanya (Harvey Twisters) Dec 11-5</li>\n<li>Quarterfinal - Michael Major (Greg Gomez Trained Wrestling) won by major decision over Tyson Rakers (Highland Bulldog Jr. WC) Maj 11-0</li>\n<li>Quarterfinal - Jack Ferguson (Yorkville WC) won by fall over Owen Mcginnis (Cumberland Youth WC) Fall 2:21</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Jimmy Mastny (Dakota WC) won by tech fall over Gavin Beeler (Edwardsville WC) TF 19-3</li>\n<li>Quarterfinal - Alexander Lizak (Tinley Park Bulldogs) won by major decision over Rory Moran (Frankfort Wildcats Wrestling) Maj 10-0</li>\n<li>Quarterfinal - Vincenzo Testa (Gomez Wrestling Academy) won by fall over Trevion Gilford (Team 1006 Wrestling) Fall 1:49</li>\n<li>Quarterfinal - Thomas Verrette (Izzy Style Wrestling) won by tech fall over Ryan Rink (Unity Youth WC) TF 17-2</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Dylan Baitinger (TJ Trained Wrestling) won by major decision over Ryan Mcgovern (SCN Youth WC) Maj 11-1</li>\n<li>Quarterfinal - Benjamin Vazquez (Toss Em Up Wrestling Academy) won by fall over Caleb Eklund (Harlem Cougars WC) Fall 1:15</li>\n<li>Quarterfinal - Ricky Ericksen (Vittum Cats of SKT) won by fall over Colin Bickett (Plainfield WC) Fall 1:59</li>\n<li>Quarterfinal - Jaxon Penovich (Arlington Cardinals WC) won by fall over Parker Ray (Vandalia Jr WC) Fall 1:16</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Bryce Edwards (Murphysboro WC) won by fall over Rocco Powell (Force Elite) Fall 2:20</li>\n<li>Quarterfinal - Tyus Almasy (TJ Trained Wrestling) won by major decision over Noah Rooney (Belvidere Bandits WC) Maj 8-0</li>\n<li>Quarterfinal - Anthony Gutierrez (Izzy Style Wrestling) won by fall over Mattthew Sullivan (Panther WC) Fall 1:30</li>\n<li>Quarterfinal - Mateusz Nycz (SCN Youth WC) won by fall over Cole Turner (Force Elite) Fall 2:11</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Brendan Landau (Edwardsville WC) won by decision over Bowden Delaney (TJ Trained Wrestling) Dec 4-1</li>\n<li>Quarterfinal - Caden O`Rourke (Oak Forest Warriors) won by major decision over Jarron Haberer (Highland Bulldog Jr. WC) Maj 9-0</li>\n<li>Quarterfinal - Terence Willis (Belleville Little Devils WC) won by decision over Nathan Elstner (Celtics WC) Dec 7-4</li>\n<li>Quarterfinal - John McAuliffe (Tinley Park Bulldogs) won by fall over Hunter Eastin (Unity Youth WC) Fall 2:25</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Durango Valles (Apex Stallions) won by decision over Tyler Ott (Maddog Wrestling Academy) Dec 8-4</li>\n<li>Quarterfinal - Thomas Jones (Force Elite) won by major decision over Drake Champlin (Roughnecks WC) Maj 12-1</li>\n<li>Quarterfinal - Tyler Humphrey (Super Soldiers WC) won by decision over Thomas Mcneil (Crystal Lake Wizards) Dec 2-0</li>\n<li>Quarterfinal - Santino Milazzo (Martinez Fox Valley Elite) won by fall over Xavier Bitner (Rams WC) Fall 0:25</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Sean Bechtold (Bulls WC) won by fall over Evan Jocic (Izzy Style Wrestling) Fall 1:38</li>\n<li>Quarterfinal - Samuel Davison (Golden Eagles WC) won by fall over Andrew Banaszak (Badger WC) Fall 2:00</li>\n<li>Quarterfinal - Dylan Berkowitz (Elk Grove Junior Grens) won by decision over Christopher Yirsa (Lockport Junior Porters WC) Dec 10-9</li>\n<li>Quarterfinal - Wyatt Dothager (Vandalia Jr WC) won in sudden victory - 1 over Jake Sulzberger (Lemont Bears WC) SV-1 7-5</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - Joe Herbert (Maine Eagles WC) won by fall over Avery Bowers (Dakota WC) Fall 2:02</li>\n<li>Quarterfinal - Anthony Soto (Toss Em Up Wrestling Academy) won by fall over Caleb Fortson (Team 1006 Wrestling) Fall 3:44</li>\n<li>Quarterfinal - Kai Calcutt (Arlington Cardinals WC) won by fall over Sargent Maubach (Peoria Razorbacks WC) Fall 0:50</li>\n<li>Quarterfinal - Tyler Fortis (Izzy Style Wrestling) won by decision over Dario Williams (Lions WC) Dec 5-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Isaiah Logan (Team 1006 Wrestling) won by fall over Triston Abram (Edwardsville WC) Fall 1:06</li>\n<li>Quarterfinal - Jonnie Palomarez (Blackhawk WC) won by decision over Alonnah Nance (Force Elite) Dec 6-1</li>\n<li>Quarterfinal - Ethan Hofmeister (Belleville Little Devils WC) won by fall over Matthew Wolfe (Sauk Valley WC) Fall 0:31</li>\n<li>Quarterfinal - Kaiden Morris (Rochelle WC) won by tech fall over Raul Martinez (Fisher WC) TF 15-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Diego Gutierrez (Bolingbrook Junior Raiders) won by decision over Keagen Goff (Falcon Youth WC) Dec 6-2</li>\n<li>Quarterfinal - Zion Carter (Astro WC) won by fall over Ashton Zobrist (Highland Bulldog Jr. WC) Fall 3:58</li>\n<li>Quarterfinal - Jace Wolf (Maddog Wrestling Academy) won by fall over Jose Del Toro (TJ Trained Wrestling) Fall 3:30</li>\n<li>Quarterfinal - James Schmidt (Urbana Tigers WC) won by fall over Matthew Vasquez (O`Fallon Little Panthers WC) Fall 0:54</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Michael McDonough (Tinley Park Bulldogs) won by fall over Keegan Barnes (Super Soldiers WC) Fall 0:29</li>\n<li>Quarterfinal - Jonathan Rulo (Belleville Little Devils WC) won by fall over Noah Runnels (Hazel Crest Park District Thunder WC) Fall 0:49</li>\n<li>Quarterfinal - Jenaro Sepeda (Moline WC) won by fall over Francisco Puga (Harvard WC) Fall 2:08</li>\n<li>Quarterfinal - Amarion Ellison (Storm Youth WC) won by fall over Hiran Lopez Marquez (Tomcat WC) Fall 0:20</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Nore Turner (Harvey Twisters) won in sudden victory - 1 over Donny Pigoni (SCN Youth WC) SV-1 5-3</li>\n<li>Quarterfinal - Grant Madl (Elk Grove Junior Grens) won by fall over Kamron Scholl (Kaneland Knights WC) Fall 3:32</li>\n<li>Quarterfinal - Tony Keene (Gladiator Elite) won by fall over Ty Edwards (Team 1006 Wrestling) Fall 0:43</li>\n<li>Quarterfinal - Jase Salin (Celtics WC) won by major decision over Carter Mikolajczak (Lemont Bears WC) Maj 12-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Kaden Harman (Golden Eagles WC) won by decision over Guillermo Rivera (Oak Forest Warriors) Dec 4-0</li>\n<li>Quarterfinal - Raymond Cavey (SCN Youth WC) won by decision over Joseph Lathwood (Bulls WC) Dec 3-2</li>\n<li>Quarterfinal - Deion Johnson (Harvey Twisters) won by decision over William Hupke (SCN Youth WC) Dec 8-2</li>\n<li>Quarterfinal - Inocencio Garcia (Force Elite) won by fall over Olin Walker (Team 312) Fall 0:39</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Mason Tieffel (Wrestling Inc) won by decision over Payton Murphy (TJ Trained Wrestling) Dec 1-0</li>\n<li>Quarterfinal - Benjamin Davino (SCN Youth WC) won by decision over Benjamin Dunne (Izzy Style Wrestling) Dec 3-1</li>\n<li>Quarterfinal - Dominic Ducato (Golden Eagles WC) won by decision over Karter Guzman (Headlock Wrestling Academy) Dec 5-3</li>\n<li>Quarterfinal - Seth Mendoza (Contender Wrestling) won by tech fall over Brady Grennan (Sauk Valley WC) TF 20-5</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Edmund Enright (Mustang WC) won by major decision over Colin Young (DAWC) Maj 11-0</li>\n<li>Quarterfinal - Bryce Griffin (Bulls WC) won by decision over Jameson Garcia (Gomez Wrestling Academy) Dec 9-2</li>\n<li>Quarterfinal - Joshua Vazquez (Izzy Style Wrestling) won by decision over Trevor Silzer (Tinley Park Bulldogs) Dec 3-2</li>\n<li>Quarterfinal - Jackson Smith (Lemont Bears WC) won by decision over Collin Altensey (Moline WC) Dec 8-6</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Colby Crouch (Combative Sports Athletic Center) won by fall over Tyler Aters (SCN Youth WC) Fall 0:53</li>\n<li>Quarterfinal - William Baysingar (Arlington Cardinals WC) won by major decision over Sam Schuit (Lemont Bears WC) Maj 13-0</li>\n<li>Quarterfinal - Garrett Luke (Stockton Renegades) won by tech fall over Eduardo Nunez (Southside Outlaws WC) TF 17-0</li>\n<li>Quarterfinal - Alexander Marre (Izzy Style Wrestling) won by major decision over Kaden Fetterolf (Batavia WC) Maj 13-4</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Gylon Sims (Force Elite) won by decision over Tyler Guerra (Izzy Style Wrestling) Dec 5-0</li>\n<li>Quarterfinal - Noah Manuel Tapia (Moline WC) won by decision over Francisco Solis (Greg Gomez Trained Wrestling) Dec 5-2</li>\n<li>Quarterfinal - Michael DiBenedetto (Elmhurst WC) won by decision over Connor Koehler (Contender Wrestling) Dec 5-2</li>\n<li>Quarterfinal - Kannon Webster (Super Soldiers WC) won by fall over Solomon Gilliam (Villa-Lombard Cougars) Fall 0:53</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Nasir Bailey (Harvey Twisters) won by tech fall over Tyler Starr (Brawlers WC) TF 21-6</li>\n<li>Quarterfinal - Michael Calcagno (Izzy Style Wrestling) won by tech fall over Max Astacio (Crystal Lake Wizards) TF 16-0</li>\n<li>Quarterfinal - Christopher Moore (Crystal Lake Wizards) won by decision over Richard Wade (Gladiator Elite) Dec 3-1</li>\n<li>Quarterfinal - Caden Muselman (Tinley Park Bulldogs) won by fall over Damarion Moore (Storm Youth WC) Fall 0:28</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - William Jacobson (Tinley Park Bulldogs) won by major decision over Adan Rocha (Batavia WC) Maj 14-4</li>\n<li>Quarterfinal - Antonio Alvarado (Belvidere WC) won by major decision over Collin Carrigan (Izzy Style Wrestling) Maj 11-0</li>\n<li>Quarterfinal - Vincent Robinson (Harvey Twisters) won by decision over Luis Bazan (Bolingbrook Junior Raiders) Dec 5-2</li>\n<li>Quarterfinal - Aidan Postma (Triad Knights WC) won by decision over Mark Martinez (Toss Em Up Wrestling Academy) Dec 8-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Kyle Lindsey (Oak Forest Warriors) won by fall over Skip Rozanski (Pitbull Wrestling Alliance) Fall 3:46</li>\n<li>Quarterfinal - Aj Heeg (Southside Outlaws WC) won by fall over Garrett Vincent (Dakota WC) Fall 1:16</li>\n<li>Quarterfinal - Ethan Stiles (Izzy Style Wrestling) won by decision over Jayden Colon (Harvey Twisters) Dec 10-4</li>\n<li>Quarterfinal - Nolan Allen (Guerrero`s Garage Wrestling) won by fall over Chris Macklin (Rochester WC) Fall 4:13</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Troy Mutz (Team 1006 Wrestling) won by major decision over Braden Kelly (Granite City Wrestling Association) Maj 16-3</li>\n<li>Quarterfinal - David Mayora (Izzy Style Wrestling) won by fall over Billy Lindsey (Oak Forest Warriors) Fall 1:12</li>\n<li>Quarterfinal - Elijah Munoz (Team 1006 Wrestling) won by decision over William Prater (Izzy Style Wrestling) Dec 16-11</li>\n<li>Quarterfinal - Drew Surges (SCN Youth WC) won by decision over Nicholas Nosler (Unity Youth WC) Dec 3-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Patrick Downing (North Shore Edge) won by fall over Kamron Beal (Vittum Cats of SKT) Fall 3:53</li>\n<li>Quarterfinal - Joshua Franklin (UP Town WC) won by major decision over Logan Nance (Vandalia Jr WC) Maj 10-0</li>\n<li>Quarterfinal - Jack Seacrist (Belvidere Bandits WC) won by fall over Andrew Dado (Bolingbrook Junior Raiders) Fall 4:22</li>\n<li>Quarterfinal - Cruz Ibarra (nWo WC) won by decision over Domanic Abeja (Tinley Park Bulldogs) Dec 8-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Devin Medina (Bolingbrook Junior Raiders) won by fall over Sebastian Cardenas (Hawk WC) Fall 2:23</li>\n<li>Quarterfinal - Abraham Wojcikiewicz (Bulls WC) won by decision over Jack Smialowicz (Pitbull Wrestling Alliance) Dec 4-0</li>\n<li>Quarterfinal - Gus Cambier (Sycamore WC) won by fall over Jalen Curtis (Greg Gomez Trained Wrestling) Fall 2:59</li>\n<li>Quarterfinal - Moisey Trimble (Belleville Little Devils WC) won by decision over Gabriel Orosco (TJ Trained-Springfield) Dec 5-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Gable Carrick (Sycamore WC) won by fall over Ryan Whitwell (Batavia WC) Fall 2:31</li>\n<li>Quarterfinal - Benjamin Alvarez (Team 1006 Wrestling) won by decision over Micheal Brown (Harvey Twisters) Dec 9-4</li>\n<li>Quarterfinal - Dominic Thebeau (Belleville Little Devils WC) won by decision over Aaron Hernandez (Pitbull Wrestling Alliance) Dec 3-1</li>\n<li>Quarterfinal - Cory West (Rochester WC) won by decision over Conor Phelan (Badger WC) Dec 8-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Robert Gonzalez (Team 1006 Wrestling) won by fall over Michael Rydell (Tinley Park Bulldogs) Fall 1:11</li>\n<li>Quarterfinal - Jc Piker (Brawlers WC) won by decision over Jack Brozny (Batavia WC) Dec 8-6</li>\n<li>Quarterfinal - Karl Schmalz (Greg Gomez Trained Wrestling) won by fall over Gavin Brown (Oak Forest Warriors) Fall 1:26</li>\n<li>Quarterfinal - Noah Wenzel (Dakota WC) won by decision over David Stewart (Blackhawk WC) Dec 5-2</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Gabriel Kaminski (Push Wrestling) won by fall over Griffin Carr (Force Elite) Fall 1:05</li>\n<li>Quarterfinal - Jonathon Barrick (Crystal Lake Wizards) won by fall over Tommy Isitt (Team 1006 Wrestling) Fall 2:03</li>\n<li>Quarterfinal - Aidan Avilez (Martinez Fox Valley Elite) won by fall over Justin Hoffer (Super Soldiers WC) Fall 1:27</li>\n<li>Quarterfinal - Calvin Hempel (Storm Youth WC) won by major decision over Porter Leith (Dundee Highlanders WC) Maj 10-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Aiden Taylor (Carbondale WC) won by fall over Kellan Knop (Lions WC) Fall 2:22</li>\n<li>Quarterfinal - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by fall over Jonathan Moreno (Blackhawk WC) Fall 0:30</li>\n<li>Quarterfinal - Hunter Powell (Force Elite) won by fall over Thomas Roath (Scorpion WC) Fall 0:45</li>\n<li>Quarterfinal - Braden Hunter (Team 1006 Wrestling) won by decision over Carmello Taylor (Edwardsville WC) Dec 1-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Morley Coval (Greg Gomez Trained Wrestling) won by fall over Seth Skamra (Headlock Wrestling Academy) Fall 4:08</li>\n<li>Quarterfinal - Charlie Jagusah (Junior Pioneer WC) won by fall over Zion Nix (Badger WC) Fall 2:10</li>\n<li>Quarterfinal - Lee Smith Jr. (DAWC) won by decision over Dillan Johnson (Force Elite) Dec 2-1</li>\n<li>Quarterfinal - Cameron Love (Edwardsville WC) won by decision over Noah Carl (Cumberland Youth WC) Dec 6-5</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Lucas Armstrong (Peoria Razorbacks WC) won by fall over Alexis Correa (Guerrero`s Garage Wrestling) Fall 1:45</li>\n<li>Quarterfinal - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Ryan Clancy (Crosstown Spartan Elite WC) Fall 2:42</li>\n<li>Quarterfinal - Tyler Johnston (Blackhawk WC) won by fall over Dawson Rull (Edwardsville WC) Fall 0:10</li>\n<li>Quarterfinal - Robert Rigg (Charleston WC) won by fall over Dorian Arguelles (Granite City Wrestling Association) Fall 1:26</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Chase Dyer (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brennan O`Donnell (Barrington Broncos WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aiden Larsen (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zane Skelton (Roughnecks WC) won by fall over Elio Gil (Tinley Park Bulldogs) Fall 0:53</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Carmelo Palumbo (Southside Outlaws WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Charlie Flores (Hoopeston Area WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Isaac Zimmerman (Lockport Junior Porters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicolas Litchfield (Champaign WC) won by tech fall over Liam Aye (St. Charles WC) TF 16-0</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Jack Duraski (Batavia WC) won in sudden victory - 1 over Jack Ajster (Storm Youth WC) SV-1 7-5</li>\n<li>Cons. Round 1 - Jack Platt (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caiden Robison (TJ Trained Wrestling) won by decision over Nicholas Marchese (Crystal Lake Wizards) Dec 6-3</li>\n<li>Cons. Round 1 - Austin Hagevold (Red Raiders Wrestling Team) received a bye   () Bye</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Garrett VerHeecke (Mt. Zion Kids WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zev Koransky (Little Huskies WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Koletyn Zanoni (DAWC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kameron Luif (Villa-Lombard Cougars) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Jalen Byrd (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dylan Crouch (Pontiac WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Robye Williams (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jair Jackson-Bey (Harvey Twisters) received a bye   () Bye</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Liam Kelly (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Luke Zook (Yorkville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Herman (Celtics WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colin Thompson (SCN Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Kye Weinzierl (Junior Pioneer WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Daniel Kelly (Sauk Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jayden Gallagly (DAWC) received a bye   () Bye</li>\n<li>Cons. Round 1 - David Burchett Jr. (Mustang WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Royce Lopez (Toss Em Up Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - David Fajardo (Toss Em Up Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chase Pierceall (Plainfield WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Connor Diemel (Hononegah WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Trevon Williams (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Coy Bender (Crawford County WC) won by tech fall over Aiden Hennings (Celtics WC) TF 17-2</li>\n<li>Cons. Round 1 - Gunner Hefley (Hillsboro Jr Toppers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cayden Parks (Crystal Lake Wizards) received a bye   () Bye</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Caleb Baczek (The Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - King Liggins (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Lawrence Stringham (Plainfield WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Keith Grim (Mendota Mat Masters) received a bye   () Bye</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Kurtis Smith (Hononegah WC) won by fall over Nathaniel Webb (Cumberland Youth WC) Fall 1:05</li>\n<li>Cons. Round 1 - Michael Grazzini (Elmhurst WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Shawn Watkins (Charger WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Donovan Avila (Guerrero`s Garage Wrestling) won by decision over Maximo Nepomuceno (The Wrestling Factory) Dec 2-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Reid Roberts (Golden Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brock Needs (Stillman Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dj Freeman (Celtics WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Reading (Contender Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Joe Zimmer (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Bryson Reeves (Lockport Junior Porters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jeremy Henson (West Frankfort Jr. Redbirds) won by major decision over Ryan Darnell (Quincy Cyclones WC) Maj 8-0</li>\n<li>Cons. Round 1 - Ethan Miller (Storm Youth WC) won by fall over Frank Jass (DAWC) Fall 2:23</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Brandon Turner (West Frankfort Jr. Redbirds) won by decision over Jack Rossi (Downers Grove WC) Dec 5-0</li>\n<li>Cons. Round 1 - Terry Ferguson (Rams WC) won by major decision over Tyler Drexel (Frankfort Wildcats Wrestling) Maj 8-0</li>\n<li>Cons. Round 1 - Asher Sheldon (Batavia WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Max Wiezorek (Central Illinois Academy of Wrestling) won by fall over Dylan Cerny (Red Raiders Wrestling Team) Fall 0:41</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Andrew Owen (Saber WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Manuel Chavez (Blackhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jayvin Savoie (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Robbie Murphy (Minooka Indians Elite Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n<li>Cons. Round 1 - Trevor Nelson (Yorkville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hayden David Volz (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alyas Ivery (Chicago Park District) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Gage DeLaval (Murphysboro WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colton Manes (Riverton/Williamsville Youth Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Roy Phelps (Beat the Streets-Chicago) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jackson Hochgraber (Panther WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Caleb Scott (Granite City Wrestling Association) received a bye   () Bye</li>\n<li>Cons. Round 1 - Liam Zimmerman (Lockport Junior Porters WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Max Siegel (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Tourdot (Rochelle WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Zachary Parisi (Elmhurst WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyson Zvonar (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tommy Hammond (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Damien Flores (Southside Outlaws WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Noah Dial (Bolingbrook Junior Raiders) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sebastian Leon (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Evan Willock (TJ Trained Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chase Hampton (Greg Gomez Trained Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Caden Kirchner (Arlington Cardinals WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Crandall (Arlington Cardinals WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - James Wright (Golden Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Reef Pacot (Storm Youth WC) won by major decision over Cadence Diduch (Dakota WC) Maj 10-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Sean Larkin (Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Noah Quintana (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caleb Nobiling (The Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Paul Ishikawa (TJ Trained Wrestling) won by tech fall over Zac Ritter (Contender Wrestling) TF 17-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Brody Murray (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyson Seibel (Belleville Little Devils WC) won by decision over Jason Bowers (Dakota WC) Dec 2-0</li>\n<li>Cons. Round 1 - Thomas Silva (DAWC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Henry Coughlin (Tinley Park Bulldogs) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Polo Ramon (Headlock Wrestling Academy) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tegan Chumbley (SCN Youth WC) won by major decision over Nile Chotner (AJ Junior Wildcats WC) Maj 14-1</li>\n<li>Cons. Round 1 - Matthew Janiak (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Saul Trejo (Izzy Style Wrestling) won by tech fall over Braden Baker (Super Soldiers WC) TF 16-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Tyler Martinez (Team 1006 Wrestling) won by decision over Luke Barham (Contender Wrestling) Dec 2-1</li>\n<li>Cons. Round 1 - John O`Connor (Lemont Bears WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caleb Mays (AJ Junior Wildcats WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Phillips (SCN Youth WC) won by decision over Hayden Weaver (Storm Youth WC) Dec 4-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Luke Christie (Brawlers WC) won by tech fall over Griffin Goddard (Champaign WC) TF 17-2</li>\n<li>Cons. Round 1 - Carlos Munoz-Flores (Team 1006 Wrestling) won by fall over Daniel Spandiary (Maine Eagles WC) Fall 4:18</li>\n<li>Cons. Round 1 - Aiden Zacharuk (Harlem Cougars WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Griffin Luke (Stockton Renegades) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Seth Stevens (Hawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ben Butler (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jonas Carter (Astro WC) won by decision over Dayton Hoffman (Murphysboro WC) Dec 4-3</li>\n<li>Cons. Round 1 - Jaydon Robinson (Harvey Twisters) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Hunter Janeczko (Yorkville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Shamon Handegan (Pekin Boys &amp; Girls Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Kubas (Grayslake WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brandon Theres (Force Elite) received a bye   () Bye</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Gabino Perez (Southside Outlaws WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Roberto Patino (Lemont Bears WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Jens (Grayslake WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Kopecky (Maine Eagles WC) won by injury default over Alexander Jackson (Springs Elite) Inj. 0:00</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Anthony Gaik (G2 WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Garner Libbra (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Edward Phillips (Super Soldiers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brian Petrancosta (Gomez Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Craig Johnson (Storm Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Landon Freeman (Unity Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Wyatt Kolnsberg (Edwardsville WC) won by decision over Dalton Mrazek (Timber Wolves WC) Dec 6-0</li>\n<li>Cons. Round 1 - Tanner Clasen (Crosstown Spartan Elite WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Jackson Barnhart (Champaign WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Haidyn Hendricks (Unity Youth WC) won by fall over Luke Williams (Edwardsville WC) Fall 0:58</li>\n<li>Cons. Round 1 - Tyler Michelini (Elk Grove Junior Grens) won by fall over Connor Dean (Benton WC) Fall 1:14</li>\n<li>Cons. Round 1 - Edward Perry (SCN Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Takyla Watkins (Danville Chargers) received a bye   () Bye</li>\n<li>Cons. Round 1 - Alexander Poholik (Lincoln-Way WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Christopher Bates (Carbondale WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Hunter Smith (Marengo Youth WC) won by fall over Tyler Olmstead (Effingham Youth WC) Fall 0:29</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - Eddie Solis (Marengo Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jarveion Brown (Force Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sampson Price (Downers Grove WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Lilijana Reyes (Maddog Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Jacob Shingleton (Rantoul Junior Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Vincent Ruyle (Trico WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Herrin (Bulls WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dionte Turner (Team 1006 Wrestling) received a bye   () Bye</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Joshua Stedwill (Super Soldiers WC) won in sudden victory - 1 over Chase Dyer (SCN Youth WC) SV-1 3-1</li>\n<li>Cons. Round 2 - Dylan Weber (Contender Wrestling) won by tech fall over Brennan O`Donnell (Barrington Broncos WC) TF 17-0</li>\n<li>Cons. Round 2 - Gavin Pardilla (Arlington Cardinals WC) won by major decision over Aiden Larsen (Team 1006 Wrestling) Maj 10-0</li>\n<li>Cons. Round 2 - Augustus Swanson (Tiger Town Tanglers WC) won by decision over Zane Skelton (Roughnecks WC) Dec 9-3</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Jason Hampton (Force Elite) won by decision over Carmelo Palumbo (Southside Outlaws WC) Dec 3-1</li>\n<li>Cons. Round 2 - Maxwell Cumbee (Gomez Wrestling Academy) won by fall over Charlie Flores (Hoopeston Area WC) Fall 2:11</li>\n<li>Cons. Round 2 - Allen Woo (Villa-Lombard Cougars) won by fall over Isaac Zimmerman (Lockport Junior Porters WC) Fall 4:26</li>\n<li>Cons. Round 2 - Luca Poeta (The Wrestling Factory) won by decision over Nicolas Litchfield (Champaign WC) Dec 6-1</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Dawveed Holland (Harvey Twisters) won by decision over Jack Duraski (Batavia WC) Dec 11-4</li>\n<li>Cons. Round 2 - Jeremy Huf (Arlington Cardinals WC) won by fall over Jack Platt (Team 1006 Wrestling) Fall 0:53</li>\n<li>Cons. Round 2 - Brayden Mortell (Tinley Park Bulldogs) won by decision over Caiden Robison (TJ Trained Wrestling) Dec 6-2</li>\n<li>Cons. Round 2 - Chazz Robinson (Harvey Twisters) won by fall over Austin Hagevold (Red Raiders Wrestling Team) Fall 2:18</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - George Marinopoulos (Mustang WC) won by major decision over Garrett VerHeecke (Mt. Zion Kids WC) Maj 14-5</li>\n<li>Cons. Round 2 - Juvontae Williams (Lionheart Intense Wrestling) won in sudden victory - 1 over Zev Koransky (Little Huskies WC) SV-1 6-4</li>\n<li>Cons. Round 2 - Koletyn Zanoni (DAWC) won by decision over Deven Casey (Izzy Style Wrestling) Dec 9-3</li>\n<li>Cons. Round 2 - Carson Weber (Plainfield WC) won by major decision over Kameron Luif (Villa-Lombard Cougars) Maj 12-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Joseph Baranski (Oak Forest Warriors) won by decision over Jalen Byrd (Lincoln-Way WC) Dec 4-2</li>\n<li>Cons. Round 2 - Dylan Crouch (Pontiac WC) won by decision over Sophie Bowers (Vandalia Jr WC) Dec 8-2</li>\n<li>Cons. Round 2 - Brody Sendele (Hononegah WC) won by fall over Robye Williams (Harvey Twisters) Fall 4:00</li>\n<li>Cons. Round 2 - Jair Jackson-Bey (Harvey Twisters) won by decision over Ian Hawkins (Gomez Wrestling Academy) Dec 3-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Liam Kelly (Tinley Park Bulldogs) won by decision over Michael Meade (Wolves WC) Dec 7-0</li>\n<li>Cons. Round 2 - Luke Zook (Yorkville WC) won in tie breaker - 1 over Justin Wardlow (Force Elite) TB-1 2-1</li>\n<li>Cons. Round 2 - Elias Koonce (Rochelle WC) won by decision over Nicholas Herman (Celtics WC) Dec 5-3</li>\n<li>Cons. Round 2 - Zachary Montez (Junior Pioneer WC) won by decision over Colin Thompson (SCN Youth WC) Dec 7-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - William Denny (Celtics WC) won by fall over Kye Weinzierl (Junior Pioneer WC) Fall 0:11</li>\n<li>Cons. Round 2 - Daniel Kelly (Sauk Valley WC) won by decision over David Ogunsanya (Harvey Twisters) Dec 5-4</li>\n<li>Cons. Round 2 - Tyson Rakers (Highland Bulldog Jr. WC) won by major decision over Jayden Gallagly (DAWC) Maj 10-0</li>\n<li>Cons. Round 2 - Owen Mcginnis (Cumberland Youth WC) won in tie breaker - 1 over David Burchett Jr. (Mustang WC) TB-1 2-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Royce Lopez (Toss Em Up Wrestling Academy) won by fall over Gavin Beeler (Edwardsville WC) Fall 1:30</li>\n<li>Cons. Round 2 - David Fajardo (Toss Em Up Wrestling Academy) won by major decision over Rory Moran (Frankfort Wildcats Wrestling) Maj 12-3</li>\n<li>Cons. Round 2 - Chase Pierceall (Plainfield WC) won by decision over Trevion Gilford (Team 1006 Wrestling) Dec 3-2</li>\n<li>Cons. Round 2 - Connor Diemel (Hononegah WC) won by fall over Ryan Rink (Unity Youth WC) Fall 1:50</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Trevon Williams (Harvey Twisters) won by fall over Ryan Mcgovern (SCN Youth WC) Fall 1:59</li>\n<li>Cons. Round 2 - Coy Bender (Crawford County WC) won by decision over Caleb Eklund (Harlem Cougars WC) Dec 3-1</li>\n<li>Cons. Round 2 - Colin Bickett (Plainfield WC) won by major decision over Gunner Hefley (Hillsboro Jr Toppers) Maj 11-1</li>\n<li>Cons. Round 2 - Cayden Parks (Crystal Lake Wizards) won by major decision over Parker Ray (Vandalia Jr WC) Maj 10-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Caleb Baczek (The Wrestling Factory) won in sudden victory - 1 over Rocco Powell (Force Elite) SV-1 7-5</li>\n<li>Cons. Round 2 - Noah Rooney (Belvidere Bandits WC) won by decision over King Liggins (Harvey Twisters) Dec 9-2</li>\n<li>Cons. Round 2 - Mattthew Sullivan (Panther WC) won by injury default over Lawrence Stringham (Plainfield WC) Inj. 0:00</li>\n<li>Cons. Round 2 - Keith Grim (Mendota Mat Masters) won by decision over Cole Turner (Force Elite) Dec 2-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Kurtis Smith (Hononegah WC) won in sudden victory - 1 over Bowden Delaney (TJ Trained Wrestling) SV-1 6-4</li>\n<li>Cons. Round 2 - Jarron Haberer (Highland Bulldog Jr. WC) won by fall over Michael Grazzini (Elmhurst WC) Fall 0:51</li>\n<li>Cons. Round 2 - Nathan Elstner (Celtics WC) won by major decision over Shawn Watkins (Charger WC) Maj 13-0</li>\n<li>Cons. Round 2 - Hunter Eastin (Unity Youth WC) won by fall over Donovan Avila (Guerrero`s Garage Wrestling) Fall 2:29</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Ott (Maddog Wrestling Academy) won by decision over Reid Roberts (Golden Eagles WC) Dec 6-4</li>\n<li>Cons. Round 2 - Drake Champlin (Roughnecks WC) won by fall over Brock Needs (Stillman Valley WC) Fall 1:27</li>\n<li>Cons. Round 2 - Dj Freeman (Celtics WC) won in sudden victory - 1 over Thomas Mcneil (Crystal Lake Wizards) SV-1 2-0</li>\n<li>Cons. Round 2 - Austin Reading (Contender Wrestling) won by fall over Xavier Bitner (Rams WC) Fall 1:11</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Evan Jocic (Izzy Style Wrestling) won by fall over Joe Zimmer (Tinley Park Bulldogs) Fall 1:23</li>\n<li>Cons. Round 2 - Bryson Reeves (Lockport Junior Porters WC) won by decision over Andrew Banaszak (Badger WC) Dec 5-0</li>\n<li>Cons. Round 2 - Christopher Yirsa (Lockport Junior Porters WC) won by fall over Jeremy Henson (West Frankfort Jr. Redbirds) Fall 3:40</li>\n<li>Cons. Round 2 - Jake Sulzberger (Lemont Bears WC) won by fall over Ethan Miller (Storm Youth WC) Fall 3:29</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Avery Bowers (Dakota WC) won by fall over Brandon Turner (West Frankfort Jr. Redbirds) Fall 2:40</li>\n<li>Cons. Round 2 - Caleb Fortson (Team 1006 Wrestling) won by decision over Terry Ferguson (Rams WC) Dec 5-4</li>\n<li>Cons. Round 2 - Asher Sheldon (Batavia WC) won by decision over Sargent Maubach (Peoria Razorbacks WC) Dec 6-3</li>\n<li>Cons. Round 2 - Max Wiezorek (Central Illinois Academy of Wrestling) won by fall over Dario Williams (Lions WC) Fall 2:42</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Andrew Owen (Saber WC) won by fall over Triston Abram (Edwardsville WC) Fall 3:35</li>\n<li>Cons. Round 2 - Alonnah Nance (Force Elite) won by decision over Manuel Chavez (Blackhawk WC) Dec 5-0</li>\n<li>Cons. Round 2 - Jayvin Savoie (Brawlers WC) won by major decision over Matthew Wolfe (Sauk Valley WC) Maj 15-4</li>\n<li>Cons. Round 2 - Raul Martinez (Fisher WC) won by fall over Robbie Murphy (Minooka Indians Elite Wrestling) Fall 2:32</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Keagen Goff (Falcon Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Ashton Zobrist (Highland Bulldog Jr. WC) won by fall over Trevor Nelson (Yorkville WC) Fall 2:09</li>\n<li>Cons. Round 2 - Jose Del Toro (TJ Trained Wrestling) won by fall over Hayden David Volz (Edwardsville WC) Fall 2:08</li>\n<li>Cons. Round 2 - Matthew Vasquez (O`Fallon Little Panthers WC) won by fall over Alyas Ivery (Chicago Park District) Fall 3:17</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Keegan Barnes (Super Soldiers WC) won by fall over Gage DeLaval (Murphysboro WC) Fall 0:47</li>\n<li>Cons. Round 2 - Noah Runnels (Hazel Crest Park District Thunder WC) won by fall over Colton Manes (Riverton/Williamsville Youth Wrestling) Fall 2:15</li>\n<li>Cons. Round 2 - Roy Phelps (Beat the Streets-Chicago) won by fall over Francisco Puga (Harvard WC) Fall 0:43</li>\n<li>Cons. Round 2 - Jackson Hochgraber (Panther WC) won by fall over Hiran Lopez Marquez (Tomcat WC) Fall 2:51</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Donny Pigoni (SCN Youth WC) won by decision over Caleb Scott (Granite City Wrestling Association) Dec 4-0</li>\n<li>Cons. Round 2 - Kamron Scholl (Kaneland Knights WC) won by decision over Liam Zimmerman (Lockport Junior Porters WC) Dec 2-0</li>\n<li>Cons. Round 2 - Ty Edwards (Team 1006 Wrestling) won by decision over Max Siegel (Tinley Park Bulldogs) Dec 8-1</li>\n<li>Cons. Round 2 - Thomas Tourdot (Rochelle WC) won by fall over Carter Mikolajczak (Lemont Bears WC) Fall 3:45</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Zachary Parisi (Elmhurst WC) won by fall over Guillermo Rivera (Oak Forest Warriors) Fall 3:25</li>\n<li>Cons. Round 2 - Joseph Lathwood (Bulls WC) won by major decision over Tyson Zvonar (Lincoln-Way WC) Maj 9-0</li>\n<li>Cons. Round 2 - William Hupke (SCN Youth WC) won by fall over Tommy Hammond (Crystal Lake Wizards) Fall 4:23</li>\n<li>Cons. Round 2 - Olin Walker (Team 312) won by major decision over Damien Flores (Southside Outlaws WC) Maj 9-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Payton Murphy (TJ Trained Wrestling) won by decision over Noah Dial (Bolingbrook Junior Raiders) Dec 3-0</li>\n<li>Cons. Round 2 - Benjamin Dunne (Izzy Style Wrestling) won by fall over Sebastian Leon (Lincoln-Way WC) Fall 1:24</li>\n<li>Cons. Round 2 - Karter Guzman (Headlock Wrestling Academy) won by decision over Evan Willock (TJ Trained Wrestling) Dec 3-1</li>\n<li>Cons. Round 2 - Chase Hampton (Greg Gomez Trained Wrestling) won by decision over Brady Grennan (Sauk Valley WC) Dec 10-6</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Colin Young (DAWC) won by decision over Caden Kirchner (Arlington Cardinals WC) Dec 5-4</li>\n<li>Cons. Round 2 - Jacob Crandall (Arlington Cardinals WC) won by decision over Jameson Garcia (Gomez Wrestling Academy) Dec 7-4</li>\n<li>Cons. Round 2 - James Wright (Golden Eagles WC) won by decision over Trevor Silzer (Tinley Park Bulldogs) Dec 4-2</li>\n<li>Cons. Round 2 - Collin Altensey (Moline WC) won in sudden victory - 1 over Reef Pacot (Storm Youth WC) SV-1 4-2</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Aters (SCN Youth WC) won by major decision over Sean Larkin (Panther WC) Maj 9-0</li>\n<li>Cons. Round 2 - Sam Schuit (Lemont Bears WC) won in tie breaker - 1 over Noah Quintana (Team 1006 Wrestling) TB-1 2-1</li>\n<li>Cons. Round 2 - Eduardo Nunez (Southside Outlaws WC) won by fall over Caleb Nobiling (The Wrestling Factory) Fall 2:27</li>\n<li>Cons. Round 2 - Paul Ishikawa (TJ Trained Wrestling) won by decision over Kaden Fetterolf (Batavia WC) Dec 7-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Guerra (Izzy Style Wrestling) won by major decision over Brody Murray (SCN Youth WC) Maj 18-6</li>\n<li>Cons. Round 2 - Francisco Solis (Greg Gomez Trained Wrestling) won by major decision over Tyson Seibel (Belleville Little Devils WC) Maj 10-2</li>\n<li>Cons. Round 2 - Thomas Silva (DAWC) won by decision over Connor Koehler (Contender Wrestling) Dec 6-4</li>\n<li>Cons. Round 2 - Henry Coughlin (Tinley Park Bulldogs) won by decision over Solomon Gilliam (Villa-Lombard Cougars) Dec 8-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Polo Ramon (Headlock Wrestling Academy) won by decision over Tyler Starr (Brawlers WC) Dec 6-0</li>\n<li>Cons. Round 2 - Tegan Chumbley (SCN Youth WC) won by decision over Max Astacio (Crystal Lake Wizards) Dec 6-0</li>\n<li>Cons. Round 2 - Matthew Janiak (Team 1006 Wrestling) won by fall over Richard Wade (Gladiator Elite) Fall 1:24</li>\n<li>Cons. Round 2 - Damarion Moore (Storm Youth WC) won by decision over Saul Trejo (Izzy Style Wrestling) Dec 7-6</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Tyler Martinez (Team 1006 Wrestling) won by decision over Adan Rocha (Batavia WC) Dec 2-0</li>\n<li>Cons. Round 2 - Collin Carrigan (Izzy Style Wrestling) won by major decision over John O`Connor (Lemont Bears WC) Maj 16-5</li>\n<li>Cons. Round 2 - Luis Bazan (Bolingbrook Junior Raiders) won by major decision over Caleb Mays (AJ Junior Wildcats WC) Maj 16-5</li>\n<li>Cons. Round 2 - Michael Phillips (SCN Youth WC) won by decision over Mark Martinez (Toss Em Up Wrestling Academy) Dec 6-5</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Luke Christie (Brawlers WC) won by decision over Skip Rozanski (Pitbull Wrestling Alliance) Dec 7-0</li>\n<li>Cons. Round 2 - Carlos Munoz-Flores (Team 1006 Wrestling) won by decision over Garrett Vincent (Dakota WC) Dec 8-3</li>\n<li>Cons. Round 2 - Jayden Colon (Harvey Twisters) won by decision over Aiden Zacharuk (Harlem Cougars WC) Dec 6-2</li>\n<li>Cons. Round 2 - Griffin Luke (Stockton Renegades) won by fall over Chris Macklin (Rochester WC) Fall 0:53</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Seth Stevens (Hawk WC) won by decision over Braden Kelly (Granite City Wrestling Association) Dec 5-4</li>\n<li>Cons. Round 2 - Billy Lindsey (Oak Forest Warriors) won by major decision over Ben Butler (Crystal Lake Wizards) Maj 9-0</li>\n<li>Cons. Round 2 - William Prater (Izzy Style Wrestling) won by decision over Jonas Carter (Astro WC) Dec 8-6</li>\n<li>Cons. Round 2 - Jaydon Robinson (Harvey Twisters) won by decision over Nicholas Nosler (Unity Youth WC) Dec 6-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Hunter Janeczko (Yorkville WC) won by fall over Kamron Beal (Vittum Cats of SKT) Fall 2:10</li>\n<li>Cons. Round 2 - Shamon Handegan (Pekin Boys &amp; Girls Club) won by decision over Logan Nance (Vandalia Jr WC) Dec 6-4</li>\n<li>Cons. Round 2 - Andrew Dado (Bolingbrook Junior Raiders) won by decision over Matthew Kubas (Grayslake WC) Dec 8-3</li>\n<li>Cons. Round 2 - Brandon Theres (Force Elite) won by decision over Domanic Abeja (Tinley Park Bulldogs) Dec 6-3</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Sebastian Cardenas (Hawk WC) won by fall over Gabino Perez (Southside Outlaws WC) Fall 2:51</li>\n<li>Cons. Round 2 - Jack Smialowicz (Pitbull Wrestling Alliance) won by fall over Roberto Patino (Lemont Bears WC) Fall 1:21</li>\n<li>Cons. Round 2 - Jalen Curtis (Greg Gomez Trained Wrestling) won by major decision over Matthew Jens (Grayslake WC) Maj 16-5</li>\n<li>Cons. Round 2 - Gabriel Orosco (TJ Trained-Springfield) won by fall over Michael Kopecky (Maine Eagles WC) Fall 2:23</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Ryan Whitwell (Batavia WC) won by fall over Anthony Gaik (G2 WC) Fall 0:39</li>\n<li>Cons. Round 2 - Micheal Brown (Harvey Twisters) won by fall over Garner Libbra (Edwardsville WC) Fall 3:35</li>\n<li>Cons. Round 2 - Edward Phillips (Super Soldiers WC) won by decision over Aaron Hernandez (Pitbull Wrestling Alliance) Dec 9-4</li>\n<li>Cons. Round 2 - Conor Phelan (Badger WC) won by fall over Brian Petrancosta (Gomez Wrestling Academy) Fall 2:05</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Craig Johnson (Storm Youth WC) won by fall over Michael Rydell (Tinley Park Bulldogs) Fall 3:22</li>\n<li>Cons. Round 2 - Jack Brozny (Batavia WC) won by major decision over Landon Freeman (Unity Youth WC) Maj 10-0</li>\n<li>Cons. Round 2 - Gavin Brown (Oak Forest Warriors) won by fall over Wyatt Kolnsberg (Edwardsville WC) Fall 2:25</li>\n<li>Cons. Round 2 - David Stewart (Blackhawk WC) won by tech fall over Tanner Clasen (Crosstown Spartan Elite WC) TF 20-4</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Jackson Barnhart (Champaign WC) won by fall over Griffin Carr (Force Elite) Fall 1:53</li>\n<li>Cons. Round 2 - Tommy Isitt (Team 1006 Wrestling) won by fall over Haidyn Hendricks (Unity Youth WC) Fall 2:05</li>\n<li>Cons. Round 2 - Tyler Michelini (Elk Grove Junior Grens) won by fall over Justin Hoffer (Super Soldiers WC) Fall 0:48</li>\n<li>Cons. Round 2 - Porter Leith (Dundee Highlanders WC) won by decision over Edward Perry (SCN Youth WC) Dec 7-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Kellan Knop (Lions WC) won by fall over Takyla Watkins (Danville Chargers) Fall 3:47</li>\n<li>Cons. Round 2 - Alexander Poholik (Lincoln-Way WC) won by decision over Jonathan Moreno (Blackhawk WC) Dec 11-5</li>\n<li>Cons. Round 2 - Thomas Roath (Scorpion WC) won by fall over Christopher Bates (Carbondale WC) Fall 3:37</li>\n<li>Cons. Round 2 - Carmello Taylor (Edwardsville WC) won by major decision over Hunter Smith (Marengo Youth WC) Maj 12-3</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Seth Skamra (Headlock Wrestling Academy) won by fall over Eddie Solis (Marengo Youth WC) Fall 3:18</li>\n<li>Cons. Round 2 - Jarveion Brown (Force Elite) won by fall over Zion Nix (Badger WC) Fall 2:58</li>\n<li>Cons. Round 2 - Dillan Johnson (Force Elite) won by fall over Sampson Price (Downers Grove WC) Fall 4:18</li>\n<li>Cons. Round 2 - Noah Carl (Cumberland Youth WC) won by fall over Lilijana Reyes (Maddog Wrestling Academy) Fall 0:47</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Alexis Correa (Guerrero`s Garage Wrestling) won by fall over Jacob Shingleton (Rantoul Junior Wrestling) Fall 0:31</li>\n<li>Cons. Round 2 - Vincent Ruyle (Trico WC) won by decision over Ryan Clancy (Crosstown Spartan Elite WC) Dec 5-2</li>\n<li>Cons. Round 2 - Dawson Rull (Edwardsville WC) won by fall over Jacob Herrin (Bulls WC) Fall 2:18</li>\n<li>Cons. Round 2 - Dorian Arguelles (Granite City Wrestling Association) won by fall over Dionte Turner (Team 1006 Wrestling) Fall 0:55</li>\n</ul>\n</section>",
  "Champ Semi`s & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semi`s &amp; Con Quarterfinal</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Morgan Turner (Harvey Twisters) won in sudden victory - 1 over Domenic Munaretto (Crystal Lake Wizards) SV-1 6-4</li>\n<li>Semifinal - Nicholas Garcia (Gomez Wrestling Academy) won by decision over Anthony Sutton (Lockport Junior Porters WC) Dec 4-2</li>\n<li>Cons. Round 3 - Dylan Weber (Contender Wrestling) won by fall over Joshua Stedwill (Super Soldiers WC) Fall 2:57</li>\n<li>Cons. Round 3 - Gavin Pardilla (Arlington Cardinals WC) won by tech fall over Augustus Swanson (Tiger Town Tanglers WC) TF 16-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Brayden Teunissen (DAWC) won by fall over Brady Phelps (Arlington Cardinals WC) Fall 4:21</li>\n<li>Semifinal - Kaidreaus Richardson (Lincoln-Way WC) won by major decision over Cory Zator (Lemont Bears WC) Maj 11-1</li>\n<li>Cons. Round 3 - Jason Hampton (Force Elite) won by decision over Maxwell Cumbee (Gomez Wrestling Academy) Dec 6-2</li>\n<li>Cons. Round 3 - Allen Woo (Villa-Lombard Cougars) won by decision over Luca Poeta (The Wrestling Factory) Dec 6-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Aaron Camacho (Bolingbrook Junior Raiders) won by fall over Xavier Villalobos (Rochelle WC) Fall 1:30</li>\n<li>Semifinal - Madden Parker (Contender Wrestling) won by fall over Kalani Khiev (Villa-Lombard Cougars) Fall 1:42</li>\n<li>Cons. Round 3 - Jeremy Huf (Arlington Cardinals WC) won by decision over Dawveed Holland (Harvey Twisters) Dec 7-0</li>\n<li>Cons. Round 3 - Chazz Robinson (Harvey Twisters) won by major decision over Brayden Mortell (Tinley Park Bulldogs) Maj 14-6</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - Bruno Cassioppi (Hononegah WC) won by tech fall over Lyndon Thies (Roughnecks WC) TF 15-0</li>\n<li>Semifinal - Michael Esteban (Southside Outlaws WC) won by decision over Holden Brazelton (Champaign WC) Dec 3-1</li>\n<li>Cons. Round 3 - George Marinopoulos (Mustang WC) won by major decision over Juvontae Williams (Lionheart Intense Wrestling) Maj 9-0</li>\n<li>Cons. Round 3 - Carson Weber (Plainfield WC) won in sudden victory - 1 over Koletyn Zanoni (DAWC) SV-1 8-6</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Rocco Cassioppi (Hononegah WC) won by fall over Chase Osborne (Batavia WC) Fall 3:51</li>\n<li>Semifinal - Ryan Hinger (Contender Wrestling) won by decision over Ronald Baker (Champaign WC) Dec 6-2</li>\n<li>Cons. Round 3 - Joseph Baranski (Oak Forest Warriors) won by fall over Dylan Crouch (Pontiac WC) Fall 2:43</li>\n<li>Cons. Round 3 - Jair Jackson-Bey (Harvey Twisters) won by fall over Brody Sendele (Hononegah WC) Fall 4:10</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Aaron Stewart (Toss Em Up Wrestling Academy) won by decision over Carson Bissey (Respect Wrestling) Dec 6-4</li>\n<li>Semifinal - Donavon Allen (Harvey Twisters) won by fall over Pedro Antonio Rangel (Storm Youth WC) Fall 4:15</li>\n<li>Cons. Round 3 - Liam Kelly (Tinley Park Bulldogs) won by decision over Luke Zook (Yorkville WC) Dec 4-3</li>\n<li>Cons. Round 3 - Elias Koonce (Rochelle WC) won by decision over Zachary Montez (Junior Pioneer WC) Dec 4-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Dominic Serio (Headlock Wrestling Academy) won by major decision over Vance Williams (Red Raiders Wrestling Team) Maj 8-0</li>\n<li>Semifinal - Michael Major (Greg Gomez Trained Wrestling) won by decision over Jack Ferguson (Yorkville WC) Dec 3-0</li>\n<li>Cons. Round 3 - William Denny (Celtics WC) won by decision over Daniel Kelly (Sauk Valley WC) Dec 7-0</li>\n<li>Cons. Round 3 - Tyson Rakers (Highland Bulldog Jr. WC) won by decision over Owen Mcginnis (Cumberland Youth WC) Dec 7-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Jimmy Mastny (Dakota WC) won by decision over Alexander Lizak (Tinley Park Bulldogs) Dec 7-2</li>\n<li>Semifinal - Thomas Verrette (Izzy Style Wrestling) won by major decision over Vincenzo Testa (Gomez Wrestling Academy) Maj 16-6</li>\n<li>Cons. Round 3 - David Fajardo (Toss Em Up Wrestling Academy) won by fall over Royce Lopez (Toss Em Up Wrestling Academy) Fall 4:22</li>\n<li>Cons. Round 3 - Connor Diemel (Hononegah WC) won by major decision over Chase Pierceall (Plainfield WC) Maj 10-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Benjamin Vazquez (Toss Em Up Wrestling Academy) won by fall over Dylan Baitinger (TJ Trained Wrestling) Fall 2:14</li>\n<li>Semifinal - Jaxon Penovich (Arlington Cardinals WC) won by decision over Ricky Ericksen (Vittum Cats of SKT) Dec 3-2</li>\n<li>Cons. Round 3 - Trevon Williams (Harvey Twisters) won by decision over Coy Bender (Crawford County WC) Dec 10-3</li>\n<li>Cons. Round 3 - Cayden Parks (Crystal Lake Wizards) won by fall over Colin Bickett (Plainfield WC) Fall 4:09</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Bryce Edwards (Murphysboro WC) won by fall over Tyus Almasy (TJ Trained Wrestling) Fall 4:08</li>\n<li>Semifinal - Anthony Gutierrez (Izzy Style Wrestling) won by fall over Mateusz Nycz (SCN Youth WC) Fall 1:27</li>\n<li>Cons. Round 3 - Caleb Baczek (The Wrestling Factory) won by decision over Noah Rooney (Belvidere Bandits WC) Dec 10-4</li>\n<li>Cons. Round 3 - Mattthew Sullivan (Panther WC) won by fall over Keith Grim (Mendota Mat Masters) Fall 0:38</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Caden O`Rourke (Oak Forest Warriors) won by major decision over Brendan Landau (Edwardsville WC) Maj 10-1</li>\n<li>Semifinal - Terence Willis (Belleville Little Devils WC) won by decision over John McAuliffe (Tinley Park Bulldogs) Dec 2-0</li>\n<li>Cons. Round 3 - Jarron Haberer (Highland Bulldog Jr. WC) won by fall over Kurtis Smith (Hononegah WC) Fall 1:25</li>\n<li>Cons. Round 3 - Nathan Elstner (Celtics WC) won by fall over Hunter Eastin (Unity Youth WC) Fall 0:59</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Thomas Jones (Force Elite) won by fall over Durango Valles (Apex Stallions) Fall 0:55</li>\n<li>Semifinal - Santino Milazzo (Martinez Fox Valley Elite) won by tech fall over Tyler Humphrey (Super Soldiers WC) TF 15-0</li>\n<li>Cons. Round 3 - Drake Champlin (Roughnecks WC) won by fall over Tyler Ott (Maddog Wrestling Academy) Fall 1:28</li>\n<li>Cons. Round 3 - Austin Reading (Contender Wrestling) won by decision over Dj Freeman (Celtics WC) Dec 4-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Sean Bechtold (Bulls WC) won by fall over Samuel Davison (Golden Eagles WC) Fall 0:18</li>\n<li>Semifinal - Dylan Berkowitz (Elk Grove Junior Grens) won by fall over Wyatt Dothager (Vandalia Jr WC) Fall 2:11</li>\n<li>Cons. Round 3 - Evan Jocic (Izzy Style Wrestling) won by fall over Bryson Reeves (Lockport Junior Porters WC) Fall 1:00</li>\n<li>Cons. Round 3 - Jake Sulzberger (Lemont Bears WC) won by fall over Christopher Yirsa (Lockport Junior Porters WC) Fall 2:36</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Anthony Soto (Toss Em Up Wrestling Academy) won by major decision over Joe Herbert (Maine Eagles WC) Maj 15-1</li>\n<li>Semifinal - Kai Calcutt (Arlington Cardinals WC) won by fall over Tyler Fortis (Izzy Style Wrestling) Fall 1:46</li>\n<li>Cons. Round 3 - Caleb Fortson (Team 1006 Wrestling) won by fall over Avery Bowers (Dakota WC) Fall 1:24</li>\n<li>Cons. Round 3 - Max Wiezorek (Central Illinois Academy of Wrestling) won by fall over Asher Sheldon (Batavia WC) Fall 3:54</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Isaiah Logan (Team 1006 Wrestling) won in tie breaker - 1 over Jonnie Palomarez (Blackhawk WC) TB-1 1-0</li>\n<li>Semifinal - Kaiden Morris (Rochelle WC) won by fall over Ethan Hofmeister (Belleville Little Devils WC) Fall 2:46</li>\n<li>Cons. Round 3 - Alonnah Nance (Force Elite) won by fall over Andrew Owen (Saber WC) Fall 2:23</li>\n<li>Cons. Round 3 - Raul Martinez (Fisher WC) won by fall over Jayvin Savoie (Brawlers WC) Fall 4:03</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Zion Carter (Astro WC) won by decision over Diego Gutierrez (Bolingbrook Junior Raiders) Dec 2-1</li>\n<li>Semifinal - Jace Wolf (Maddog Wrestling Academy) won by fall over James Schmidt (Urbana Tigers WC) Fall 1:02</li>\n<li>Cons. Round 3 - Ashton Zobrist (Highland Bulldog Jr. WC) won in sudden victory - 1 over Keagen Goff (Falcon Youth WC) SV-1 7-5</li>\n<li>Cons. Round 3 - Matthew Vasquez (O`Fallon Little Panthers WC) won by fall over Jose Del Toro (TJ Trained Wrestling) Fall 3:29</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Jonathan Rulo (Belleville Little Devils WC) won by fall over Michael McDonough (Tinley Park Bulldogs) Fall 0:12</li>\n<li>Semifinal - Jenaro Sepeda (Moline WC) won by fall over Amarion Ellison (Storm Youth WC) Fall 0:42</li>\n<li>Cons. Round 3 - Noah Runnels (Hazel Crest Park District Thunder WC) won by fall over Keegan Barnes (Super Soldiers WC) Fall 0:07</li>\n<li>Cons. Round 3 - Jackson Hochgraber (Panther WC) won by fall over Roy Phelps (Beat the Streets-Chicago) Fall 1:54</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Nore Turner (Harvey Twisters) won by decision over Grant Madl (Elk Grove Junior Grens) Dec 11-4</li>\n<li>Semifinal - Tony Keene (Gladiator Elite) won by decision over Jase Salin (Celtics WC) Dec 8-2</li>\n<li>Cons. Round 3 - Donny Pigoni (SCN Youth WC) won by major decision over Kamron Scholl (Kaneland Knights WC) Maj 11-1</li>\n<li>Cons. Round 3 - Ty Edwards (Team 1006 Wrestling) won by decision over Thomas Tourdot (Rochelle WC) Dec 7-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Raymond Cavey (SCN Youth WC) won by decision over Kaden Harman (Golden Eagles WC) Dec 4-1</li>\n<li>Semifinal - Deion Johnson (Harvey Twisters) won by decision over Inocencio Garcia (Force Elite) Dec 6-2</li>\n<li>Cons. Round 3 - Joseph Lathwood (Bulls WC) won by fall over Zachary Parisi (Elmhurst WC) Fall 0:45</li>\n<li>Cons. Round 3 - William Hupke (SCN Youth WC) won by major decision over Olin Walker (Team 312) Maj 13-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Benjamin Davino (SCN Youth WC) won by decision over Mason Tieffel (Wrestling Inc) Dec 2-1</li>\n<li>Semifinal - Seth Mendoza (Contender Wrestling) won by tech fall over Dominic Ducato (Golden Eagles WC) TF 23-8</li>\n<li>Cons. Round 3 - Benjamin Dunne (Izzy Style Wrestling) won by major decision over Payton Murphy (TJ Trained Wrestling) Maj 9-1</li>\n<li>Cons. Round 3 - Karter Guzman (Headlock Wrestling Academy) won by decision over Chase Hampton (Greg Gomez Trained Wrestling) Dec 7-0</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Edmund Enright (Mustang WC) won by decision over Bryce Griffin (Bulls WC) Dec 6-5</li>\n<li>Semifinal - Joshua Vazquez (Izzy Style Wrestling) won by major decision over Jackson Smith (Lemont Bears WC) Maj 18-4</li>\n<li>Cons. Round 3 - Colin Young (DAWC) won by fall over Jacob Crandall (Arlington Cardinals WC) Fall 1:30</li>\n<li>Cons. Round 3 - James Wright (Golden Eagles WC) won by fall over Collin Altensey (Moline WC) Fall 3:00</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Colby Crouch (Combative Sports Athletic Center) won by fall over William Baysingar (Arlington Cardinals WC) Fall 5:34</li>\n<li>Semifinal - Garrett Luke (Stockton Renegades) won by fall over Alexander Marre (Izzy Style Wrestling) Fall 3:32</li>\n<li>Cons. Round 3 - Tyler Aters (SCN Youth WC) won by fall over Sam Schuit (Lemont Bears WC) Fall 2:24</li>\n<li>Cons. Round 3 - Paul Ishikawa (TJ Trained Wrestling) won by decision over Eduardo Nunez (Southside Outlaws WC) Dec 6-4</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Noah Manuel Tapia (Moline WC) won by decision over Gylon Sims (Force Elite) Dec 4-2</li>\n<li>Semifinal - Kannon Webster (Super Soldiers WC) won by major decision over Michael DiBenedetto (Elmhurst WC) Maj 16-4</li>\n<li>Cons. Round 3 - Tyler Guerra (Izzy Style Wrestling) won by major decision over Francisco Solis (Greg Gomez Trained Wrestling) Maj 11-2</li>\n<li>Cons. Round 3 - Thomas Silva (DAWC) won by fall over Henry Coughlin (Tinley Park Bulldogs) Fall 2:50</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Nasir Bailey (Harvey Twisters) won by tech fall over Michael Calcagno (Izzy Style Wrestling) TF 17-2</li>\n<li>Semifinal - Christopher Moore (Crystal Lake Wizards) won by decision over Caden Muselman (Tinley Park Bulldogs) Dec 9-4</li>\n<li>Cons. Round 3 - Polo Ramon (Headlock Wrestling Academy) won by decision over Tegan Chumbley (SCN Youth WC) Dec 5-3</li>\n<li>Cons. Round 3 - Damarion Moore (Storm Youth WC) won by decision over Matthew Janiak (Team 1006 Wrestling) Dec 5-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Antonio Alvarado (Belvidere WC) won by fall over William Jacobson (Tinley Park Bulldogs) Fall 1:21</li>\n<li>Semifinal - Vincent Robinson (Harvey Twisters) won by tech fall over Aidan Postma (Triad Knights WC) TF 23-8</li>\n<li>Cons. Round 3 - Collin Carrigan (Izzy Style Wrestling) won by decision over Tyler Martinez (Team 1006 Wrestling) Dec 6-0</li>\n<li>Cons. Round 3 - Luis Bazan (Bolingbrook Junior Raiders) won by fall over Michael Phillips (SCN Youth WC) Fall 2:43</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Aj Heeg (Southside Outlaws WC) won by decision over Kyle Lindsey (Oak Forest Warriors) Dec 4-0</li>\n<li>Semifinal - Ethan Stiles (Izzy Style Wrestling) won by decision over Nolan Allen (Guerrero`s Garage Wrestling) Dec 9-2</li>\n<li>Cons. Round 3 - Carlos Munoz-Flores (Team 1006 Wrestling) won by decision over Luke Christie (Brawlers WC) Dec 5-2</li>\n<li>Cons. Round 3 - Jayden Colon (Harvey Twisters) won by tech fall over Griffin Luke (Stockton Renegades) TF 17-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - David Mayora (Izzy Style Wrestling) won by fall over Troy Mutz (Team 1006 Wrestling) Fall 3:49</li>\n<li>Semifinal - Elijah Munoz (Team 1006 Wrestling) won by decision over Drew Surges (SCN Youth WC) Dec 9-3</li>\n<li>Cons. Round 3 - Billy Lindsey (Oak Forest Warriors) won by major decision over Seth Stevens (Hawk WC) Maj 16-5</li>\n<li>Cons. Round 3 - Jaydon Robinson (Harvey Twisters) won by major decision over William Prater (Izzy Style Wrestling) Maj 16-3</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Joshua Franklin (UP Town WC) won by major decision over Patrick Downing (North Shore Edge) Maj 10-1</li>\n<li>Semifinal - Jack Seacrist (Belvidere Bandits WC) won by decision over Cruz Ibarra (nWo WC) Dec 6-0</li>\n<li>Cons. Round 3 - Hunter Janeczko (Yorkville WC) won by decision over Shamon Handegan (Pekin Boys &amp; Girls Club) Dec 4-3</li>\n<li>Cons. Round 3 - Andrew Dado (Bolingbrook Junior Raiders) won by major decision over Brandon Theres (Force Elite) Maj 10-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Abraham Wojcikiewicz (Bulls WC) won by decision over Devin Medina (Bolingbrook Junior Raiders) Dec 2-0</li>\n<li>Semifinal - Gus Cambier (Sycamore WC) won by fall over Moisey Trimble (Belleville Little Devils WC) Fall 2:23</li>\n<li>Cons. Round 3 - Jack Smialowicz (Pitbull Wrestling Alliance) won by decision over Sebastian Cardenas (Hawk WC) Dec 6-0</li>\n<li>Cons. Round 3 - Jalen Curtis (Greg Gomez Trained Wrestling) won by major decision over Gabriel Orosco (TJ Trained-Springfield) Maj 10-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Benjamin Alvarez (Team 1006 Wrestling) won by decision over Gable Carrick (Sycamore WC) Dec 3-2</li>\n<li>Semifinal - Cory West (Rochester WC) won by fall over Dominic Thebeau (Belleville Little Devils WC) Fall 1:05</li>\n<li>Cons. Round 3 - Micheal Brown (Harvey Twisters) won by fall over Ryan Whitwell (Batavia WC) Fall 2:43</li>\n<li>Cons. Round 3 - Conor Phelan (Badger WC) won by major decision over Edward Phillips (Super Soldiers WC) Maj 12-2</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Robert Gonzalez (Team 1006 Wrestling) won by fall over Jc Piker (Brawlers WC) Fall 1:25</li>\n<li>Semifinal - Karl Schmalz (Greg Gomez Trained Wrestling) won in sudden victory - 1 over Noah Wenzel (Dakota WC) SV-1 6-4</li>\n<li>Cons. Round 3 - Jack Brozny (Batavia WC) won by decision over Craig Johnson (Storm Youth WC) Dec 11-7</li>\n<li>Cons. Round 3 - Gavin Brown (Oak Forest Warriors) won by decision over David Stewart (Blackhawk WC) Dec 5-3</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - Gabriel Kaminski (Push Wrestling) won by decision over Jonathon Barrick (Crystal Lake Wizards) Dec 8-3</li>\n<li>Semifinal - Calvin Hempel (Storm Youth WC) won by fall over Aidan Avilez (Martinez Fox Valley Elite) Fall 0:57</li>\n<li>Cons. Round 3 - Jackson Barnhart (Champaign WC) won by fall over Tommy Isitt (Team 1006 Wrestling) Fall 3:19</li>\n<li>Cons. Round 3 - Porter Leith (Dundee Highlanders WC) won by fall over Tyler Michelini (Elk Grove Junior Grens) Fall 3:44</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by major decision over Aiden Taylor (Carbondale WC) Maj 11-0</li>\n<li>Semifinal - Braden Hunter (Team 1006 Wrestling) won by decision over Hunter Powell (Force Elite) Dec 4-1</li>\n<li>Cons. Round 3 - Kellan Knop (Lions WC) won by fall over Alexander Poholik (Lincoln-Way WC) Fall 1:30</li>\n<li>Cons. Round 3 - Carmello Taylor (Edwardsville WC) won by fall over Thomas Roath (Scorpion WC) Fall 1:57</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Charlie Jagusah (Junior Pioneer WC) won by decision over Morley Coval (Greg Gomez Trained Wrestling) Dec 11-7</li>\n<li>Semifinal - Lee Smith Jr. (DAWC) won by fall over Cameron Love (Edwardsville WC) Fall 1:17</li>\n<li>Cons. Round 3 - Seth Skamra (Headlock Wrestling Academy) won by forfeit over Jarveion Brown (Force Elite) FF</li>\n<li>Cons. Round 3 - Dillan Johnson (Force Elite) won by fall over Noah Carl (Cumberland Youth WC) Fall 2:36</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Lucas Armstrong (Peoria Razorbacks WC) won by decision over Joey Ochoa (Red Raiders Wrestling Team) Dec 4-1</li>\n<li>Semifinal - Robert Rigg (Charleston WC) won by fall over Tyler Johnston (Blackhawk WC) Fall 1:19</li>\n<li>Cons. Round 3 - Alexis Correa (Guerrero`s Garage Wrestling) won by major decision over Vincent Ruyle (Trico WC) Maj 10-0</li>\n<li>Cons. Round 3 - Dawson Rull (Edwardsville WC) won by decision over Dorian Arguelles (Granite City Wrestling Association) Dec 5-2</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Domenic Munaretto (Crystal Lake Wizards) won by fall over Dylan Weber (Contender Wrestling) Fall 1:06</li>\n<li>Cons. Semi - Gavin Pardilla (Arlington Cardinals WC) won by fall over Anthony Sutton (Lockport Junior Porters WC) Fall 2:38</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Brady Phelps (Arlington Cardinals WC) won by decision over Jason Hampton (Force Elite) Dec 6-4</li>\n<li>Cons. Semi - Cory Zator (Lemont Bears WC) won by decision over Allen Woo (Villa-Lombard Cougars) Dec 9-3</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Xavier Villalobos (Rochelle WC) won by decision over Jeremy Huf (Arlington Cardinals WC) Dec 6-4</li>\n<li>Cons. Semi - Chazz Robinson (Harvey Twisters) won by major decision over Kalani Khiev (Villa-Lombard Cougars) Maj 11-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - George Marinopoulos (Mustang WC) won by major decision over Lyndon Thies (Roughnecks WC) Maj 13-0</li>\n<li>Cons. Semi - Holden Brazelton (Champaign WC) won by decision over Carson Weber (Plainfield WC) Dec 2-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Joseph Baranski (Oak Forest Warriors) won by decision over Chase Osborne (Batavia WC) Dec 8-4</li>\n<li>Cons. Semi - Ronald Baker (Champaign WC) won by fall over Jair Jackson-Bey (Harvey Twisters) Fall 3:57</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Carson Bissey (Respect Wrestling) won by decision over Liam Kelly (Tinley Park Bulldogs) Dec 7-2</li>\n<li>Cons. Semi - Elias Koonce (Rochelle WC) won by decision over Pedro Antonio Rangel (Storm Youth WC) Dec 11-9</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - William Denny (Celtics WC) won by decision over Vance Williams (Red Raiders Wrestling Team) Dec 6-4</li>\n<li>Cons. Semi - Jack Ferguson (Yorkville WC) won by fall over Tyson Rakers (Highland Bulldog Jr. WC) Fall 2:04</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Alexander Lizak (Tinley Park Bulldogs) won by decision over David Fajardo (Toss Em Up Wrestling Academy) Dec 3-0</li>\n<li>Cons. Semi - Vincenzo Testa (Gomez Wrestling Academy) won by decision over Connor Diemel (Hononegah WC) Dec 6-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Dylan Baitinger (TJ Trained Wrestling) won by tech fall over Trevon Williams (Harvey Twisters) TF 18-2</li>\n<li>Cons. Semi - Ricky Ericksen (Vittum Cats of SKT) won by fall over Cayden Parks (Crystal Lake Wizards) Fall 1:04</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Tyus Almasy (TJ Trained Wrestling) won by decision over Caleb Baczek (The Wrestling Factory) Dec 9-3</li>\n<li>Cons. Semi - Mateusz Nycz (SCN Youth WC) won by fall over Mattthew Sullivan (Panther WC) Fall 3:23</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Jarron Haberer (Highland Bulldog Jr. WC) won by fall over Brendan Landau (Edwardsville WC) Fall 1:56</li>\n<li>Cons. Semi - John McAuliffe (Tinley Park Bulldogs) won by major decision over Nathan Elstner (Celtics WC) Maj 12-3</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Drake Champlin (Roughnecks WC) won by fall over Durango Valles (Apex Stallions) Fall 3:42</li>\n<li>Cons. Semi - Austin Reading (Contender Wrestling) won in sudden victory - 1 over Tyler Humphrey (Super Soldiers WC) SV-1 8-6</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Evan Jocic (Izzy Style Wrestling) won by decision over Samuel Davison (Golden Eagles WC) Dec 3-1</li>\n<li>Cons. Semi - Wyatt Dothager (Vandalia Jr WC) won in sudden victory - 1 over Jake Sulzberger (Lemont Bears WC) SV-1 7-5</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Joe Herbert (Maine Eagles WC) won by major decision over Caleb Fortson (Team 1006 Wrestling) Maj 9-0</li>\n<li>Cons. Semi - Tyler Fortis (Izzy Style Wrestling) won by major decision over Max Wiezorek (Central Illinois Academy of Wrestling) Maj 11-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Jonnie Palomarez (Blackhawk WC) won by decision over Alonnah Nance (Force Elite) Dec 7-1</li>\n<li>Cons. Semi - Raul Martinez (Fisher WC) won by decision over Ethan Hofmeister (Belleville Little Devils WC) Dec 11-5</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Ashton Zobrist (Highland Bulldog Jr. WC) won by decision over Diego Gutierrez (Bolingbrook Junior Raiders) Dec 3-2</li>\n<li>Cons. Semi - James Schmidt (Urbana Tigers WC) won by fall over Matthew Vasquez (O`Fallon Little Panthers WC) Fall 0:54</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Noah Runnels (Hazel Crest Park District Thunder WC) won by fall over Michael McDonough (Tinley Park Bulldogs) Fall 3:26</li>\n<li>Cons. Semi - Amarion Ellison (Storm Youth WC) won by fall over Jackson Hochgraber (Panther WC) Fall 1:24</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Donny Pigoni (SCN Youth WC) won by decision over Grant Madl (Elk Grove Junior Grens) Dec 7-0</li>\n<li>Cons. Semi - Jase Salin (Celtics WC) won by decision over Ty Edwards (Team 1006 Wrestling) Dec 4-3</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Joseph Lathwood (Bulls WC) won by decision over Kaden Harman (Golden Eagles WC) Dec 2-0</li>\n<li>Cons. Semi - Inocencio Garcia (Force Elite) won by decision over William Hupke (SCN Youth WC) Dec 5-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Mason Tieffel (Wrestling Inc) won by decision over Benjamin Dunne (Izzy Style Wrestling) Dec 4-0</li>\n<li>Cons. Semi - Dominic Ducato (Golden Eagles WC) won by decision over Karter Guzman (Headlock Wrestling Academy) Dec 5-3</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Bryce Griffin (Bulls WC) won by major decision over Colin Young (DAWC) Maj 9-0</li>\n<li>Cons. Semi - James Wright (Golden Eagles WC) won by major decision over Jackson Smith (Lemont Bears WC) Maj 10-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - William Baysingar (Arlington Cardinals WC) won by major decision over Tyler Aters (SCN Youth WC) Maj 11-3</li>\n<li>Cons. Semi - Alexander Marre (Izzy Style Wrestling) won by decision over Paul Ishikawa (TJ Trained Wrestling) Dec 5-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Gylon Sims (Force Elite) won by decision over Tyler Guerra (Izzy Style Wrestling) Dec 5-0</li>\n<li>Cons. Semi - Michael DiBenedetto (Elmhurst WC) won by decision over Thomas Silva (DAWC) Dec 6-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Polo Ramon (Headlock Wrestling Academy) won by decision over Michael Calcagno (Izzy Style Wrestling) Dec 9-7</li>\n<li>Cons. Semi - Caden Muselman (Tinley Park Bulldogs) won by decision over Damarion Moore (Storm Youth WC) Dec 7-4</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Collin Carrigan (Izzy Style Wrestling) won by major decision over William Jacobson (Tinley Park Bulldogs) Maj 14-2</li>\n<li>Cons. Semi - Luis Bazan (Bolingbrook Junior Raiders) won by major decision over Aidan Postma (Triad Knights WC) Maj 13-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Carlos Munoz-Flores (Team 1006 Wrestling) won by decision over Kyle Lindsey (Oak Forest Warriors) Dec 6-2</li>\n<li>Cons. Semi - Jayden Colon (Harvey Twisters) won by fall over Nolan Allen (Guerrero`s Garage Wrestling) Fall 2:24</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Troy Mutz (Team 1006 Wrestling) won by fall over Billy Lindsey (Oak Forest Warriors) Fall 2:21</li>\n<li>Cons. Semi - Drew Surges (SCN Youth WC) won by decision over Jaydon Robinson (Harvey Twisters) Dec 8-2</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Patrick Downing (North Shore Edge) won by fall over Hunter Janeczko (Yorkville WC) Fall 1:12</li>\n<li>Cons. Semi - Andrew Dado (Bolingbrook Junior Raiders) won by decision over Cruz Ibarra (nWo WC) Dec 7-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Jack Smialowicz (Pitbull Wrestling Alliance) won in sudden victory - 1 over Devin Medina (Bolingbrook Junior Raiders) SV-1 6-2</li>\n<li>Cons. Semi - Moisey Trimble (Belleville Little Devils WC) won in sudden victory - 1 over Jalen Curtis (Greg Gomez Trained Wrestling) SV-1 13-8</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Gable Carrick (Sycamore WC) won by major decision over Micheal Brown (Harvey Twisters) Maj 13-5</li>\n<li>Cons. Semi - Dominic Thebeau (Belleville Little Devils WC) won by major decision over Conor Phelan (Badger WC) Maj 9-1</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Jc Piker (Brawlers WC) won by decision over Jack Brozny (Batavia WC) Dec 8-6</li>\n<li>Cons. Semi - Gavin Brown (Oak Forest Warriors) won by decision over Noah Wenzel (Dakota WC) Dec 3-2</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Jackson Barnhart (Champaign WC) won by decision over Jonathon Barrick (Crystal Lake Wizards) Dec 4-2</li>\n<li>Cons. Semi - Porter Leith (Dundee Highlanders WC) won by decision over Aidan Avilez (Martinez Fox Valley Elite) Dec 7-6</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Aiden Taylor (Carbondale WC) won by fall over Kellan Knop (Lions WC) Fall 2:22</li>\n<li>Cons. Semi - Hunter Powell (Force Elite) won by fall over Carmello Taylor (Edwardsville WC) Fall 1:24</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Morley Coval (Greg Gomez Trained Wrestling) won by fall over Seth Skamra (Headlock Wrestling Academy) Fall 4:08</li>\n<li>Cons. Semi - Dillan Johnson (Force Elite) won by major decision over Cameron Love (Edwardsville WC) Maj 11-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Alexis Correa (Guerrero`s Garage Wrestling) Fall 0:53</li>\n<li>Cons. Semi - Tyler Johnston (Blackhawk WC) won by fall over Dawson Rull (Edwardsville WC) Fall 0:10</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Domenic Munaretto (Crystal Lake Wizards) won by fall over Gavin Pardilla (Arlington Cardinals WC) Fall 4:30</li>\n<li>5th Place Match - Dylan Weber (Contender Wrestling) won by major decision over Anthony Sutton (Lockport Junior Porters WC) Maj 9-0</li>\n<li>7th Place Match - Joshua Stedwill (Super Soldiers WC) won by decision over Augustus Swanson (Tiger Town Tanglers WC) Dec 5-0</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Brady Phelps (Arlington Cardinals WC) won by major decision over Cory Zator (Lemont Bears WC) Maj 14-2</li>\n<li>5th Place Match - Jason Hampton (Force Elite) won by decision over Allen Woo (Villa-Lombard Cougars) Dec 5-1</li>\n<li>7th Place Match - Luca Poeta (The Wrestling Factory) won by decision over Maxwell Cumbee (Gomez Wrestling Academy) Dec 6-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Xavier Villalobos (Rochelle WC) won by decision over Chazz Robinson (Harvey Twisters) Dec 2-1</li>\n<li>5th Place Match - Jeremy Huf (Arlington Cardinals WC) won by decision over Kalani Khiev (Villa-Lombard Cougars) Dec 6-1</li>\n<li>7th Place Match - Dawveed Holland (Harvey Twisters) won by decision over Brayden Mortell (Tinley Park Bulldogs) Dec 13-6</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - George Marinopoulos (Mustang WC) won by decision over Holden Brazelton (Champaign WC) Dec 6-4</li>\n<li>5th Place Match - Carson Weber (Plainfield WC) won by major decision over Lyndon Thies (Roughnecks WC) Maj 10-2</li>\n<li>7th Place Match - Koletyn Zanoni (DAWC) won by major decision over Juvontae Williams (Lionheart Intense Wrestling) Maj 11-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Ronald Baker (Champaign WC) won by decision over Joseph Baranski (Oak Forest Warriors) Dec 3-2</li>\n<li>5th Place Match - Jair Jackson-Bey (Harvey Twisters) won by fall over Chase Osborne (Batavia WC) Fall 4:24</li>\n<li>7th Place Match - Brody Sendele (Hononegah WC) won by fall over Dylan Crouch (Pontiac WC) Fall 3:40</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Carson Bissey (Respect Wrestling) won by decision over Elias Koonce (Rochelle WC) Dec 7-0</li>\n<li>5th Place Match - Liam Kelly (Tinley Park Bulldogs) won by decision over Pedro Antonio Rangel (Storm Youth WC) Dec 5-2</li>\n<li>7th Place Match - Luke Zook (Yorkville WC) won by decision over Zachary Montez (Junior Pioneer WC) Dec 4-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - William Denny (Celtics WC) won by decision over Jack Ferguson (Yorkville WC) Dec 9-4</li>\n<li>5th Place Match - Tyson Rakers (Highland Bulldog Jr. WC) won by decision over Vance Williams (Red Raiders Wrestling Team) Dec 4-1</li>\n<li>7th Place Match - Daniel Kelly (Sauk Valley WC) won by decision over Owen Mcginnis (Cumberland Youth WC) Dec 4-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Alexander Lizak (Tinley Park Bulldogs) won by major decision over Vincenzo Testa (Gomez Wrestling Academy) Maj 10-0</li>\n<li>5th Place Match - David Fajardo (Toss Em Up Wrestling Academy) won by decision over Connor Diemel (Hononegah WC) Dec 6-3</li>\n<li>7th Place Match - Royce Lopez (Toss Em Up Wrestling Academy) won by major decision over Chase Pierceall (Plainfield WC) Maj 10-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Ricky Ericksen (Vittum Cats of SKT) won by decision over Dylan Baitinger (TJ Trained Wrestling) Dec 5-1</li>\n<li>5th Place Match - Trevon Williams (Harvey Twisters) won by decision over Cayden Parks (Crystal Lake Wizards) Dec 6-3</li>\n<li>7th Place Match - Colin Bickett (Plainfield WC) won by fall over Coy Bender (Crawford County WC) Fall 3:40</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Tyus Almasy (TJ Trained Wrestling) won by major decision over Mateusz Nycz (SCN Youth WC) Maj 12-2</li>\n<li>5th Place Match - Caleb Baczek (The Wrestling Factory) won by fall over Mattthew Sullivan (Panther WC) Fall 0:19</li>\n<li>7th Place Match - Keith Grim (Mendota Mat Masters) won in sudden victory - 1 over Noah Rooney (Belvidere Bandits WC) SV-1 4-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - John McAuliffe (Tinley Park Bulldogs) won by major decision over Jarron Haberer (Highland Bulldog Jr. WC) Maj 12-1</li>\n<li>5th Place Match - Brendan Landau (Edwardsville WC) won by decision over Nathan Elstner (Celtics WC) Dec 6-5</li>\n<li>7th Place Match - Kurtis Smith (Hononegah WC) won by fall over Hunter Eastin (Unity Youth WC) Fall 1:17</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Austin Reading (Contender Wrestling) won by fall over Drake Champlin (Roughnecks WC) Fall 3:32</li>\n<li>5th Place Match - Tyler Humphrey (Super Soldiers WC) won by major decision over Durango Valles (Apex Stallions) Maj 12-2</li>\n<li>7th Place Match - Dj Freeman (Celtics WC) won by fall over Tyler Ott (Maddog Wrestling Academy) Fall 2:12</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Evan Jocic (Izzy Style Wrestling) won by fall over Wyatt Dothager (Vandalia Jr WC) Fall 2:39</li>\n<li>5th Place Match - Jake Sulzberger (Lemont Bears WC) won by decision over Samuel Davison (Golden Eagles WC) Dec 8-2</li>\n<li>7th Place Match - Christopher Yirsa (Lockport Junior Porters WC) won by decision over Bryson Reeves (Lockport Junior Porters WC) Dec 6-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Joe Herbert (Maine Eagles WC) won by major decision over Tyler Fortis (Izzy Style Wrestling) Maj 11-2</li>\n<li>5th Place Match - Max Wiezorek (Central Illinois Academy of Wrestling) won by fall over Caleb Fortson (Team 1006 Wrestling) Fall 3:53</li>\n<li>7th Place Match - Avery Bowers (Dakota WC) won by fall over Asher Sheldon (Batavia WC) Fall 1:58</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Jonnie Palomarez (Blackhawk WC) won by fall over Raul Martinez (Fisher WC) Fall 3:28</li>\n<li>5th Place Match - Alonnah Nance (Force Elite) won by decision over Ethan Hofmeister (Belleville Little Devils WC) Dec 5-3</li>\n<li>7th Place Match - Jayvin Savoie (Brawlers WC) won by decision over Andrew Owen (Saber WC) Dec 3-2</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - James Schmidt (Urbana Tigers WC) won by fall over Ashton Zobrist (Highland Bulldog Jr. WC) Fall 1:17</li>\n<li>5th Place Match - Matthew Vasquez (O`Fallon Little Panthers WC) won by fall over Diego Gutierrez (Bolingbrook Junior Raiders) Fall 2:33</li>\n<li>7th Place Match - Jose Del Toro (TJ Trained Wrestling) won by fall over Keagen Goff (Falcon Youth WC) Fall 0:51</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Amarion Ellison (Storm Youth WC) won by fall over Noah Runnels (Hazel Crest Park District Thunder WC) Fall 0:28</li>\n<li>5th Place Match - Michael McDonough (Tinley Park Bulldogs) won by fall over Jackson Hochgraber (Panther WC) Fall 2:32</li>\n<li>7th Place Match - Roy Phelps (Beat the Streets-Chicago) won by fall over Keegan Barnes (Super Soldiers WC) Fall 3:16</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Donny Pigoni (SCN Youth WC) won in sudden victory - 1 over Jase Salin (Celtics WC) SV-1 3-1</li>\n<li>5th Place Match - Ty Edwards (Team 1006 Wrestling) won by major decision over Grant Madl (Elk Grove Junior Grens) Maj 9-0</li>\n<li>7th Place Match - Kamron Scholl (Kaneland Knights WC) won by decision over Thomas Tourdot (Rochelle WC) Dec 5-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Inocencio Garcia (Force Elite) won by decision over Joseph Lathwood (Bulls WC) Dec 2-0</li>\n<li>5th Place Match - Kaden Harman (Golden Eagles WC) won by fall over William Hupke (SCN Youth WC) Fall 0:39</li>\n<li>7th Place Match - Zachary Parisi (Elmhurst WC) won by decision over Olin Walker (Team 312) Dec 7-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Mason Tieffel (Wrestling Inc) won by decision over Dominic Ducato (Golden Eagles WC) Dec 6-2</li>\n<li>5th Place Match - Benjamin Dunne (Izzy Style Wrestling) won by decision over Karter Guzman (Headlock Wrestling Academy) Dec 1-0</li>\n<li>7th Place Match - Payton Murphy (TJ Trained Wrestling) won by decision over Chase Hampton (Greg Gomez Trained Wrestling) Dec 6-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Bryce Griffin (Bulls WC) won by fall over James Wright (Golden Eagles WC) Fall 3:40</li>\n<li>5th Place Match - Colin Young (DAWC) won by injury default over Jackson Smith (Lemont Bears WC) Inj. 0:00</li>\n<li>7th Place Match - Jacob Crandall (Arlington Cardinals WC) won in double overtime over Collin Altensey (Moline WC) 2-OT 1-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Alexander Marre (Izzy Style Wrestling) won in sudden victory - 1 over William Baysingar (Arlington Cardinals WC) SV-1 3-1</li>\n<li>5th Place Match - Paul Ishikawa (TJ Trained Wrestling) won by decision over Tyler Aters (SCN Youth WC) Dec 3-1</li>\n<li>7th Place Match - Sam Schuit (Lemont Bears WC) won by decision over Eduardo Nunez (Southside Outlaws WC) Dec 3-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Gylon Sims (Force Elite) won by decision over Michael DiBenedetto (Elmhurst WC) Dec 7-0</li>\n<li>5th Place Match - Tyler Guerra (Izzy Style Wrestling) won by fall over Thomas Silva (DAWC) Fall 1:23</li>\n<li>7th Place Match - Francisco Solis (Greg Gomez Trained Wrestling) won by fall over Henry Coughlin (Tinley Park Bulldogs) Fall 1:30</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Caden Muselman (Tinley Park Bulldogs) won by tech fall over Polo Ramon (Headlock Wrestling Academy) TF 16-1</li>\n<li>5th Place Match - Damarion Moore (Storm Youth WC) won by decision over Michael Calcagno (Izzy Style Wrestling) Dec 5-4</li>\n<li>7th Place Match - Matthew Janiak (Team 1006 Wrestling) won by decision over Tegan Chumbley (SCN Youth WC) Dec 5-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Luis Bazan (Bolingbrook Junior Raiders) won in sudden victory - 1 over Collin Carrigan (Izzy Style Wrestling) SV-1 12-7</li>\n<li>5th Place Match - Aidan Postma (Triad Knights WC) won by decision over William Jacobson (Tinley Park Bulldogs) Dec 7-4</li>\n<li>7th Place Match - Tyler Martinez (Team 1006 Wrestling) won by decision over Michael Phillips (SCN Youth WC) Dec 2-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Jayden Colon (Harvey Twisters) won by decision over Carlos Munoz-Flores (Team 1006 Wrestling) Dec 5-2</li>\n<li>5th Place Match - Nolan Allen (Guerrero`s Garage Wrestling) won by decision over Kyle Lindsey (Oak Forest Warriors) Dec 2-1</li>\n<li>7th Place Match - Luke Christie (Brawlers WC) won by fall over Griffin Luke (Stockton Renegades) Fall 4:00</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Drew Surges (SCN Youth WC) won by decision over Troy Mutz (Team 1006 Wrestling) Dec 7-5</li>\n<li>5th Place Match - Jaydon Robinson (Harvey Twisters) won by decision over Billy Lindsey (Oak Forest Warriors) Dec 4-3</li>\n<li>7th Place Match - William Prater (Izzy Style Wrestling) won by major decision over Seth Stevens (Hawk WC) Maj 14-6</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Andrew Dado (Bolingbrook Junior Raiders) won by decision over Patrick Downing (North Shore Edge) Dec 11-5</li>\n<li>5th Place Match - Cruz Ibarra (nWo WC) won by decision over Hunter Janeczko (Yorkville WC) Dec 7-0</li>\n<li>7th Place Match - Brandon Theres (Force Elite) won by decision over Shamon Handegan (Pekin Boys &amp; Girls Club) Dec 4-3</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Moisey Trimble (Belleville Little Devils WC) won by decision over Jack Smialowicz (Pitbull Wrestling Alliance) Dec 3-1</li>\n<li>5th Place Match - Devin Medina (Bolingbrook Junior Raiders) won by decision over Jalen Curtis (Greg Gomez Trained Wrestling) Dec 8-4</li>\n<li>7th Place Match - Gabriel Orosco (TJ Trained-Springfield) won by fall over Sebastian Cardenas (Hawk WC) Fall 4:05</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Dominic Thebeau (Belleville Little Devils WC) won by fall over Gable Carrick (Sycamore WC) Fall 2:30</li>\n<li>5th Place Match - Conor Phelan (Badger WC) won by fall over Micheal Brown (Harvey Twisters) Fall 3:34</li>\n<li>7th Place Match - Edward Phillips (Super Soldiers WC) won by decision over Ryan Whitwell (Batavia WC) Dec 13-7</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Jc Piker (Brawlers WC) won by fall over Gavin Brown (Oak Forest Warriors) Fall 1:23</li>\n<li>5th Place Match - Noah Wenzel (Dakota WC) won by decision over Jack Brozny (Batavia WC) Dec 4-1</li>\n<li>7th Place Match - David Stewart (Blackhawk WC) won by decision over Craig Johnson (Storm Youth WC) Dec 12-10</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Porter Leith (Dundee Highlanders WC) won by decision over Jackson Barnhart (Champaign WC) Dec 1-0</li>\n<li>5th Place Match - Jonathon Barrick (Crystal Lake Wizards) won by decision over Aidan Avilez (Martinez Fox Valley Elite) Dec 7-2</li>\n<li>7th Place Match - Tyler Michelini (Elk Grove Junior Grens) won by fall over Tommy Isitt (Team 1006 Wrestling) Fall 2:06</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Hunter Powell (Force Elite) won by decision over Aiden Taylor (Carbondale WC) Dec 3-1</li>\n<li>5th Place Match - Carmello Taylor (Edwardsville WC) won by fall over Kellan Knop (Lions WC) Fall 1:03</li>\n<li>7th Place Match - Alexander Poholik (Lincoln-Way WC) won by fall over Thomas Roath (Scorpion WC) Fall 0:31</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Dillan Johnson (Force Elite) won by decision over Morley Coval (Greg Gomez Trained Wrestling) Dec 1-0</li>\n<li>5th Place Match - Seth Skamra (Headlock Wrestling Academy) won by fall over Cameron Love (Edwardsville WC) Fall 0:33</li>\n<li>7th Place Match - Noah Carl (Cumberland Youth WC) won by forfeit over Jarveion Brown (Force Elite) FF</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Tyler Johnston (Blackhawk WC) Fall 0:46</li>\n<li>5th Place Match - Dawson Rull (Edwardsville WC) won by decision over Alexis Correa (Guerrero`s Garage Wrestling) Dec 7-3</li>\n<li>7th Place Match - Dorian Arguelles (Granite City Wrestling Association) won by fall over Vincent Ruyle (Trico WC) Fall 1:03</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Nicholas Garcia (Gomez Wrestling Academy) won by decision over Morgan Turner (Harvey Twisters) Dec 4-2</li>\n</ul>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Brayden Teunissen (DAWC) won by fall over Kaidreaus Richardson (Lincoln-Way WC) Fall 1:23</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Madden Parker (Contender Wrestling) won by decision over Aaron Camacho (Bolingbrook Junior Raiders) Dec 5-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Bruno Cassioppi (Hononegah WC) won by fall over Michael Esteban (Southside Outlaws WC) Fall 3:25</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Ryan Hinger (Contender Wrestling) won by fall over Rocco Cassioppi (Hononegah WC) Fall 5:03</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Donavon Allen (Harvey Twisters) won by decision over Aaron Stewart (Toss Em Up Wrestling Academy) Dec 4-2</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Michael Major (Greg Gomez Trained Wrestling) won by decision over Dominic Serio (Headlock Wrestling Academy) Dec 3-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Thomas Verrette (Izzy Style Wrestling) won by decision over Jimmy Mastny (Dakota WC) Dec 6-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Jaxon Penovich (Arlington Cardinals WC) won by tech fall over Benjamin Vazquez (Toss Em Up Wrestling Academy) TF 16-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - Anthony Gutierrez (Izzy Style Wrestling) won by decision over Bryce Edwards (Murphysboro WC) Dec 12-10</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Caden O`Rourke (Oak Forest Warriors) won by decision over Terence Willis (Belleville Little Devils WC) Dec 3-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Thomas Jones (Force Elite) won by major decision over Santino Milazzo (Martinez Fox Valley Elite) Maj 10-2</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Sean Bechtold (Bulls WC) won by decision over Dylan Berkowitz (Elk Grove Junior Grens) Dec 9-6</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Kai Calcutt (Arlington Cardinals WC) won by fall over Anthony Soto (Toss Em Up Wrestling Academy) Fall 1:05</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Kaiden Morris (Rochelle WC) won by fall over Isaiah Logan (Team 1006 Wrestling) Fall 2:40</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Zion Carter (Astro WC) won by decision over Jace Wolf (Maddog Wrestling Academy) Dec 10-6</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Jonathan Rulo (Belleville Little Devils WC) won by fall over Jenaro Sepeda (Moline WC) Fall 0:27</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Tony Keene (Gladiator Elite) won by decision over Nore Turner (Harvey Twisters) Dec 12-5</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - Deion Johnson (Harvey Twisters) won by major decision over Raymond Cavey (SCN Youth WC) Maj 13-3</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Seth Mendoza (Contender Wrestling) won by tech fall over Benjamin Davino (SCN Youth WC) TF 20-5</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Joshua Vazquez (Izzy Style Wrestling) won by decision over Edmund Enright (Mustang WC) Dec 5-1</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Colby Crouch (Combative Sports Athletic Center) won by decision over Garrett Luke (Stockton Renegades) Dec 6-0</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Kannon Webster (Super Soldiers WC) won by decision over Noah Manuel Tapia (Moline WC) Dec 4-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Nasir Bailey (Harvey Twisters) won by tech fall over Christopher Moore (Crystal Lake Wizards) TF 17-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Vincent Robinson (Harvey Twisters) won by decision over Antonio Alvarado (Belvidere WC) Dec 10-5</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Ethan Stiles (Izzy Style Wrestling) won by decision over Aj Heeg (Southside Outlaws WC) Dec 9-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - David Mayora (Izzy Style Wrestling) won by major decision over Elijah Munoz (Team 1006 Wrestling) Maj 12-4</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Jack Seacrist (Belvidere Bandits WC) won by decision over Joshua Franklin (UP Town WC) Dec 10-3</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Abraham Wojcikiewicz (Bulls WC) won by fall over Gus Cambier (Sycamore WC) Fall 3:29</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Cory West (Rochester WC) won by fall over Benjamin Alvarez (Team 1006 Wrestling) Fall 0:59</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Robert Gonzalez (Team 1006 Wrestling) won by major decision over Karl Schmalz (Greg Gomez Trained Wrestling) Maj 12-2</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - Gabriel Kaminski (Push Wrestling) won by fall over Calvin Hempel (Storm Youth WC) Fall 2:58</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by decision over Braden Hunter (Team 1006 Wrestling) Dec 4-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Charlie Jagusah (Junior Pioneer WC) won by decision over Lee Smith Jr. (DAWC) Dec 8-5</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Lucas Armstrong (Peoria Razorbacks WC) won by fall over Robert Rigg (Charleston WC) Fall 3:42</li>\n</ul>\n</section>"
}
