{
  "Championship Preliminary": "<section class=\"tw-list\">\n<h1>Championship Preliminary</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 1 - Deven Casey (Izzy Style Wrestling) won by decision over Brody Baker (Quincy Cyclones WC) Dec 2-1</li>\n<li>Champ. Round 1 - Michael Esteban (Beat the Streets-Chicago) won by major decision over Kaiden Richards (Murphysboro WC) Maj 17-3</li>\n<li>Champ. Round 1 - Caleb Lenning (Morton Youth WC) won by disqualification over Nathaniel Lecrone (Team Cuff Wrestling Tigers) DQ</li>\n<li>Champ. Round 1 - Robye Williams (Harvey Twisters) won by major decision over Kalani Khiev (Villa-Lombard Cougars) Maj 12-2</li>\n<li>Champ. Round 1 - Donald Cannon (DA WC) won by fall over Tyson Bruce (Contender Wrestling) Fall 2:08</li>\n<li>Champ. Round 1 - Juvontae Williams (Lionheart Intense Wrestling) won by decision over Joey Sikorsky (Geneva Junior Vikings) Dec 6-1</li>\n<li>Champ. Round 1 - Holden Brazelton (Champaign WC) won by major decision over Peter Young (DA WC) Maj 9-0</li>\n<li>Champ. Round 1 - Madden Parker (Contender Wrestling) won by fall over Zachary Mally (Naperville WC) Fall 2:10</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 1 - Dominic Recchia (Yorkville WC) won by decision over Olin Walker (Team 312) Dec 4-1</li>\n<li>Champ. Round 1 - Raymond Cavey (SCN Youth WC) won by major decision over Tyler Huchel (Oakwood Youth WC) Maj 10-0</li>\n<li>Champ. Round 1 - Ashton Hobson (Batavia WC) won by decision over James Hemmila (Arlington Cardinals WC) Dec 5-4</li>\n<li>Champ. Round 1 - Ivan Acevedo (Team 1006 Wrestling) won by decision over Pedro Antonio Rangel (Storm Youth WC) Dec 7-5</li>\n<li>Champ. Round 1 - Joseph Lathwood (Bulls WC) won by decision over Jair Jackson-Bey (Harvey Twisters) Dec 4-2</li>\n<li>Champ. Round 1 - Thomas Tourdot (Rochelle WC) won by major decision over Tyson Zvonar (Lincoln-Way WC) Maj 8-0</li>\n<li>Champ. Round 1 - Carson Bissey (Respect Wrestling) won by decision over Emmett Nelson (Richmond WC) Dec 9-2</li>\n<li>Champ. Round 1 - Carson Weber (Plainfield WC) won by decision over George Marinopoulos (Mustang WC) Dec 4-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 1 - Dominick Coronado (Yorkville WC) won by fall over Damian Valdez (Headlock Wrestling Academy) Fall 0:35</li>\n<li>Champ. Round 1 - Tommy Hammond (Crystal Lake Wizards) won in sudden victory - 1 over Ameer Alamawi (Celtics WC) SV-1 4-2</li>\n<li>Champ. Round 1 - Colin Kacena (Bolingbrook Junior Raiders) won by decision over Aaron Meenen (Sauk Valley WC) Dec 7-4</li>\n<li>Champ. Round 1 - Joel Muehlenbeck (Arlington Cardinals WC) won by major decision over Netavia Wickson (DA WC) Maj 8-0</li>\n<li>Champ. Round 1 - Colin Thompson (SCN Youth WC) won by major decision over Dylan Crouch (Pontiac WC) Maj 13-5</li>\n<li>Champ. Round 1 - Josyah Holland (Harvey Twisters) won by tech fall over Kenyon Smith (O`Fallon Little Panthers WC) TF 16-0</li>\n<li>Champ. Round 1 - Jovan Williams (Harvey Twisters) won by fall over Blaine Howell (Mattoon Youth WC) Fall 3:27</li>\n<li>Champ. Round 1 - Liam Fox (Murphysboro WC) won by fall over Mukhammad Khurshidov (Blackhawk WC) Fall 0:25</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 1 - Tyson Rakers (Highland Bulldog Jr WC) won by decision over Grant Gensler (Rochelle WC) Dec 4-1</li>\n<li>Champ. Round 1 - Jack Ferguson (Yorkville WC) won by fall over Brayden Swanson (Team No Ego WC) Fall 3:24</li>\n<li>Champ. Round 1 - Evan Willock (TJ Trained Wrestling) won by decision over Mason Tieffel (Gladiator Elite) Dec 4-2</li>\n<li>Champ. Round 1 - Tyler Aters (SCN Youth WC) won by fall over Elias Koonce (Rochelle WC) Fall 3:23</li>\n<li>Champ. Round 1 - Gunnar Garelli (Izzy Style Wrestling) won by fall over Zion Laws (Lionheart Intense Wrestling) Fall 1:17</li>\n<li>Champ. Round 1 - Sean Larkin (Panther WC) won by fall over Jackson Jeck (Brawlers WC) Fall 1:30</li>\n<li>Champ. Round 1 - Jameson Garcia (Gomez Wrestling Academy) won by major decision over Matthew Cornfield (Frankfort Wildcats Wrestling) Maj 12-1</li>\n<li>Champ. Round 1 - Liam Kelly (Tinley Park Bulldogs) won by fall over Keynon Shaw (Urbana Tigers WC) Fall 2:33</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 1 - Landen Gunnison (Junior Pioneer WC) won by decision over Ean Freeman (Mattoon Youth WC) Dec 4-0</li>\n<li>Champ. Round 1 - Sam Schuit (Lemont Bears WC) won by decision over Tyson Seibel (Belleville Little Devils WC) Dec 8-7</li>\n<li>Champ. Round 1 - Jake Schwartz (Carlinville WC) won by decision over Ryder Janeczko (Yorkville WC) Dec 8-2</li>\n<li>Champ. Round 1 - Camden Rogers (Oak Forest Warriors) won by major decision over Brayden Kull (Iguana WC) Maj 16-2</li>\n<li>Champ. Round 1 - Caleb Nobiling (Lakeland Predators WC) won by fall over Ryan Mohler (Fox Valley WC) Fall 2:57</li>\n<li>Champ. Round 1 - James Wright (Golden Eagles WC) won by decision over Jermaine Butler (Crosstown Spartan Elite WC) Dec 7-5</li>\n<li>Champ. Round 1 - Zach Kruse (Hinsdale Red Devil WC) won by decision over Quinn Drews (Crystal Lake Wizards) Dec 6-2</li>\n<li>Champ. Round 1 - Alexander Marre (Izzy Style Wrestling) won by major decision over Maxwell Becker (Lincoln-Way WC) Maj 12-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 1 - Noah Manuel Tapia (Young Guns) won by fall over Brayden Sanders (Argenta-Oreana Kids Club) Fall 1:30</li>\n<li>Champ. Round 1 - Owen Miller (Vandalia Jr WC) won by decision over Michael O`Connor (Celtics WC) Dec 4-1</li>\n<li>Champ. Round 1 - Joseph Griffin (Team 1006 Wrestling) won by fall over Boden Bielik (Contender Wrestling) Fall 1:20</li>\n<li>Champ. Round 1 - Zeke Rhodes (Sudden Victory Athletic Center) won by decision over Dontrell Dugar (Champaign WC) Dec 7-0</li>\n<li>Champ. Round 1 - Ryan Wojcik (Tinley Park Bulldogs) won by decision over Sean VanSleet (Elmhurst WC) Dec 7-3</li>\n<li>Champ. Round 1 - Connor Munn (Pitbull Wrestling Alliance) won by fall over Pedro Jimenez (Crystal Lake Wizards) Fall 1:07</li>\n<li>Champ. Round 1 - Renzo Morgan (The Wrestling Factory) won by decision over Brandon Krier (nWo WC) Dec 3-0</li>\n<li>Champ. Round 1 - Alexander Lizak (Tinley Park Bulldogs) won by decision over Jimmy Mastny (Dakota WC) Dec 2-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Starr (Brawlers WC) won by decision over Charles Connolly (Mustang WC) Dec 5-3</li>\n<li>Champ. Round 1 - Drew Torza (Team 1006 Wrestling) won by decision over Carsen Behn (Xtreme WC) Dec 8-5</li>\n<li>Champ. Round 1 - Zane Hulet (Super Soldiers WC) won by decision over Niko Duggan (Force WC) Dec 2-0</li>\n<li>Champ. Round 1 - Aiden Livingston (Stillman Valley WC) won by decision over Noah Cozzolino (Tinley Park Bulldogs) Dec 5-0</li>\n<li>Champ. Round 1 - Drew Landau (Edwardsville WC) won by fall over Santino Milazzo (Martinez Fox Valley Elite) Fall 1:56</li>\n<li>Champ. Round 1 - Polo Ramon (Headlock Wrestling Academy) won by fall over August Christhilf (Champaign WC) Fall 1:11</li>\n<li>Champ. Round 1 - Samuel Han (Carbondale WC) won by decision over Cale Kimbro (Mattoon Youth WC) Dec 7-1</li>\n<li>Champ. Round 1 - Brody Murray (SCN Youth WC) won in sudden victory - 1 over Jack McGowean (The Wrestling Factory) SV-1 2-0</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 1 - Eric Gustafson (Moline WC) won by decision over Samuel Mcarthur (Champaign WC) Dec 7-1</li>\n<li>Champ. Round 1 - Thomas Jones (Force WC) won by fall over William Adamczyk (Batavia WC) Fall 4:30</li>\n<li>Champ. Round 1 - Marquan Shaw (Lionheart Intense Wrestling) won by fall over Christian Wilson (SCN Youth WC) Fall 2:37</li>\n<li>Champ. Round 1 - Jeremy Loomis (Team 1006 Wrestling) won by decision over Benjamin Brown (Batavia WC) Dec 6-3</li>\n<li>Champ. Round 1 - Dillon Raab (The Law) won by fall over Brenden Banz (Carbondale WC) Fall 0:43</li>\n<li>Champ. Round 1 - Nathan Beltran (Maine Eagles WC) won by major decision over William Jacobson (Tinley Park Bulldogs) Maj 12-3</li>\n<li>Champ. Round 1 - Colin Kelly (Tinley Park Bulldogs) won by fall over Eric McKinney (Vandalia Jr WC) Fall 0:49</li>\n<li>Champ. Round 1 - Andre Rios (Z`s Team Pena) won by fall over Jacob Elsner (Elk Grove Junior Grens) Fall 2:14</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 1 - Jackson Godinez (Super Soldiers WC) won by decision over Phillip Shaw (Lionheart Intense Wrestling) Dec 3-2</li>\n<li>Champ. Round 1 - Quinn Herbert (Maine Eagles WC) won by decision over Drew Largen (Vittum Cats of SKT) Dec 7-3</li>\n<li>Champ. Round 1 - Skip Rozanski (Pitbull Wrestling Alliance) won by fall over Griffin Goddard (Champaign WC) Fall 1:04</li>\n<li>Champ. Round 1 - Joshua Tanquilut (Tinley Park Bulldogs) won by decision over Owen Uppinghouse (Quincy Cyclones WC) Dec 1-0</li>\n<li>Champ. Round 1 - Matthew Janiak (Force WC) won by fall over Ryan Gura (Scorpion WC) Fall 2:51</li>\n<li>Champ. Round 1 - Caden Casimino (Crystal Lake Wizards) won by decision over Antonio Briagas (Granite City Wrestling Association) Dec 8-4</li>\n<li>Champ. Round 1 - Garrett Vincent (Dakota WC) won by fall over Lynel Billups (UP Town WC) Fall 2:13</li>\n<li>Champ. Round 1 - Silvano Spatafora (Fox Valley WC) won by decision over Hudson Lathrop (Olney Cubs WC) Dec 12-5</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 1 - Blake Hinrichsen (Super Soldiers WC) won by major decision over Grant Brewer (Storm Youth WC) Maj 8-0</li>\n<li>Champ. Round 1 - Antwan Strong (East St. Louis Wrestling) won by decision over Jaden Cochran (Sycamore WC) Dec 5-2</li>\n<li>Champ. Round 1 - Gabe Eckerd (Hawk WC) won by decision over Dyami Martinez (Moline WC) Dec 6-0</li>\n<li>Champ. Round 1 - Jordan Griggs (Saber WC) won by decision over Corrieon Midgett (East St. Louis Wrestling) Dec 13-10</li>\n<li>Champ. Round 1 - Domanic Abeja (Tinley Park Bulldogs) won by decision over Jared Werner (Pitbull Wrestling Alliance) Dec 4-1</li>\n<li>Champ. Round 1 - Shane Carr (Martinez Fox Valley Elite) won by fall over Caleb Dickens (Brawlers WC) Fall 3:53</li>\n<li>Champ. Round 1 - Kamron Beal (Tinley Park Bulldogs) won by fall over Luke Kelly (Lockport Junior Porters WC) Fall 1:03</li>\n<li>Champ. Round 1 - Anthony Alansari (Scorpion WC) won by fall over Thomas Burton (Fox Lake Wresting Club) Fall 2:45</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 1 - Colin Ripperda (Riverton/Williamsville Youth Wrestling) won by fall over Cameron Siguenza (Evolution Wrestling Institute) Fall 3:48</li>\n<li>Champ. Round 1 - Mason Sarnes (Pekin Boys &amp; Girls Club) won by fall over Connar Penney (Harlem Cougars WC) Fall 1:00</li>\n<li>Champ. Round 1 - Joshua Taylor (Scorpion WC) won by decision over Syril Kiefner (Metamora Kids WC) Dec 11-7</li>\n<li>Champ. Round 1 - Dalton Brown (Storm Youth WC) won by decision over Ian Wallen (Crystal Lake Wizards) Dec 8-3</li>\n<li>Champ. Round 1 - Blake Maday (Gomez Wrestling Academy) won by decision over Connor Cumbee (Force WC) Dec 14-7</li>\n<li>Champ. Round 1 - Gabriel Alvarez (Beat the Streets-Chicago) won by fall over Andrew Eby (Crawford County WC) Fall 0:49</li>\n<li>Champ. Round 1 - Maxwell Corral (Oak Forest Warriors) won by decision over Christopher Yirsa (Lockport Junior Porters WC) Dec 6-2</li>\n<li>Champ. Round 1 - Javier Hurtado (Pitbull Wrestling Alliance) won by decision over Maddux Randall (Mt. Vernon Lions WC) Dec 7-4</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 1 - Kenwyn Horne (East St. Louis Wrestling) won by fall over Isaiah Logan (Team 1006 Wrestling) Fall 3:15</li>\n<li>Champ. Round 1 - Jovon Johnson (Lincoln-Way WC) won by fall over Grant Larkin (Fox Valley WC) Fall 2:49</li>\n<li>Champ. Round 1 - Skander Tahri (Elmhurst WC) won by tech fall over Zackary Clevenger (Dixon WC) TF 15-0</li>\n<li>Champ. Round 1 - Charles Koeppen (Panther WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Michael Kopecky (Maine Eagles WC) won by fall over Henry Wurl (Saber WC) Fall 2:38</li>\n<li>Champ. Round 1 - Mason Randall (Mt. Vernon Lions WC) won by fall over Kaiden Morris (Rochelle WC) Fall 2:27</li>\n<li>Champ. Round 1 - Matthew Jens (Grayslake WC) won by fall over Wendy Washington (East St. Louis Wrestling) Fall 4:20</li>\n<li>Champ. Round 1 - Joseph Scrivani (Golden Eagles WC) won by fall over Remington Hiser (Mt. Zion Kids WC) Fall 0:19</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 1 - David Stewart (Blackhawk WC) won by fall over Hudson Nevel (The Law) Fall 1:15</li>\n<li>Champ. Round 1 - Micheal Brown (Harvey Twisters) won by major decision over James Soliz (Moline WC) Maj 16-3</li>\n<li>Champ. Round 1 - Gable Carrick (Sycamore WC) won by fall over Colten Stevens (Yorkville WC) Fall 3:52</li>\n<li>Champ. Round 1 - Gavin Brown (Oak Forest Warriors) won by decision over Christopher Durbin (Tomcat WC) Dec 4-0</li>\n<li>Champ. Round 1 - James Herring (Roxana WC) won by fall over Jacob Bischoff (Unity Youth WC) Fall 1:15</li>\n<li>Champ. Round 1 - William Ardson (Izzy Style Wrestling) won by major decision over Colin Welsh (Celtics WC) Maj 11-0</li>\n<li>Champ. Round 1 - Brian Petrancosta (Gomez Wrestling Academy) won by fall over Raul Martinez (Fisher WC) Fall 2:06</li>\n<li>Champ. Round 1 - Dominic Thebeau (East St. Louis Wrestling) won by fall over Elizabeth Ruter (Hawk WC) Fall 0:45</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 1 - Tommy Isitt (Team 1006 Wrestling) won by fall over Justin Ramirez (Cary-Grove Matmen) Fall 2:34</li>\n<li>Champ. Round 1 - Tyrell Nailon (UP Town WC) won by fall over Oliver Cooley (Jacksonville Area Wrestling) Fall 2:22</li>\n<li>Champ. Round 1 - Connor Dean (Benton WC) won by tech fall over Taylor Dixon (Limestone Blue Crew Wrestling) TF 15-0</li>\n<li>Champ. Round 1 - Noah Wenzel (Dakota WC) won by fall over Ryan Deist (Frankfort Gladiator Wrestling) Fall 3:57</li>\n<li>Champ. Round 1 - Edward Perry (SCN Youth WC) won by fall over Anthony Garcia (Badger WC) Fall 0:54</li>\n<li>Champ. Round 1 - Calvin Hempel (Storm Youth WC) won by fall over Giovanni Hernandez (Team 312) Fall 0:53</li>\n<li>Champ. Round 1 - Jackson Barnhart (Champaign WC) won by fall over Alex Pasquale (Lemont Bears WC) Fall 0:30</li>\n<li>Champ. Round 1 - Montana Calderon (Tomcat WC) won by fall over Leonardo Vazquez (Toss Em Up Wrestling Academy) Fall 0:35</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 1 - Justin Hoffer (Super Soldiers WC) won by fall over Paulie Rudolph (Golden Eagles WC) Fall 3:17</li>\n<li>Champ. Round 1 - Amarion Ellison (Storm Youth WC) won by fall over Thomas Roath (Z`s Team Pena) Fall 0:29</li>\n<li>Champ. Round 1 - Mason Bernabe (Harlem Cougars WC) won by fall over Charlie Scott (Unity Youth WC) Fall 0:51</li>\n<li>Champ. Round 1 - Myles Reardon (Quincy Cyclones WC) won by fall over Jenaro Sepeda (Moline WC) Fall 0:26</li>\n<li>Champ. Round 1 - Kiara Ganey (Belleville Little Devils WC) won in the ultimate tie breaker over Nathaniel Gnaden (Bismarck-Henning Youth WC) UTB 8-6</li>\n<li>Champ. Round 1 - Hunter Peterson (Downers Grove WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Lincoln Cooley (Sycamore WC) won in sudden victory - 1 over Wojtek Chrobak (Lemont Bears WC) SV-1 9-7</li>\n<li>Champ. Round 1 - Mekhi McDowell (East St. Louis Wrestling) won by fall over Tyler Olmstead (Effingham Youth WC) Fall 1:15</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Nathan Macias (Greg Gomez Trained Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Noah Carl (Cumberland Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Reede Johnson (HF Elite WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Ricardo Townsend (Lionheart Intense Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 1 - Dean Wainwright (Riverdale Elite) won by major decision over Noah Ciolkosz (Tinley Park Bulldogs) Maj 11-0</li>\n<li>Champ. Round 1 - Maxwell Wade (Gladiator Elite) won by fall over Michael Anderson (Fox Valley WC) Fall 1:07</li>\n<li>Champ. Round 1 - Rocky Seibel (Belleville Little Devils WC) won by major decision over Aiden Larsen (Team 1006 Wrestling) Maj 9-1</li>\n<li>Champ. Round 1 - Cory Zator (Lemont Bears WC) won in sudden victory - 1 over Louie Delpage (Force WC) SV-1 4-2</li>\n<li>Champ. Round 1 - Rocco Hayes (Contender Wrestling) won by fall over Brayden Edwards (Storm Youth WC) Fall 3:00</li>\n<li>Champ. Round 1 - Evan Gosz (Arlington Cardinals WC) won by fall over Dana Wickson (DA WC) Fall 3:28</li>\n<li>Champ. Round 1 - Jase Salin (Celtics WC) won by tech fall over Joseph Young (DA WC) TF 15-0</li>\n<li>Champ. Round 1 - Nicholas Garcia (Gomez Wrestling Academy) won by tech fall over Emmitt Holt (Unity Youth WC) TF 15-0</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 1 - Caden Edwards (Villa-Lombard Cougars) won by decision over Robert Wyland (Team 1006 Wrestling) Dec 9-2</li>\n<li>Champ. Round 1 - Ayden Braddy (Road Warriors WC) won by decision over Owen Kaldenberger (Scorpion WC) Dec 4-2</li>\n<li>Champ. Round 1 - Dominic Schiavone (Izzy Style Wrestling) won by fall over Gaspare Filippelli (Scorpion WC) Fall 0:40</li>\n<li>Champ. Round 1 - Luke Burgess (Izzy Style Wrestling) won by fall over James Byrd (Midwest Central Youth WC) Fall 1:20</li>\n<li>Champ. Round 1 - Jaymz Young (East St. Louis Wrestling) won by decision over Keevin Hamilton (Harvey Twisters) Dec 4-2</li>\n<li>Champ. Round 1 - Grant Stender (Hawk WC) won by tech fall over Tyler Lyons (Lockport Junior Porters WC) TF 15-0</li>\n<li>Champ. Round 1 - Joshua Peterson (Wolfpak WC) won by fall over Dominick Tannler (Roughnecks WC) Fall 4:15</li>\n<li>Champ. Round 1 - Matthew Soltis (Lincoln-Way WC) won by decision over Carter Mikolajczak (Lemont Bears WC) Dec 5-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 1 - Benjamin Dunne (Izzy Style Wrestling) won by fall over Aidan Baker (Contender Wrestling) Fall 1:15</li>\n<li>Champ. Round 1 - Brandon Weber (Contender Wrestling) won by fall over Donavin Vanderheyden (Harlem Cougars WC) Fall 1:19</li>\n<li>Champ. Round 1 - Taggart Kazmierczak (Contender Wrestling) won by fall over Sean Berger (Elmhurst WC) Fall 2:53</li>\n<li>Champ. Round 1 - Jacob Crandall (Arlington Cardinals WC) won by major decision over Solomon Gilliam (Villa-Lombard Cougars) Maj 16-2</li>\n<li>Champ. Round 1 - Tomas Aguilar (Tomcat WC) won by tech fall over Brody Reagan (Gladiator Elite) TF 19-4</li>\n<li>Champ. Round 1 - Jack Summers (Edwardsville WC) won by fall over Cian Moran (Panther WC) Fall 2:30</li>\n<li>Champ. Round 1 - Nicholas Fetters (Belleville Little Devils WC) won by decision over Ryan Cahill (Naperville WC) Dec 10-5</li>\n<li>Champ. Round 1 - Dominic Federico (Belleville Little Devils WC) won by decision over Zachary Szuberla (Batavia WC) Dec 4-2</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 1 - Isaac Bourge (Team 1006 Wrestling) won by decision over Kurt Chapman (Highland Bulldog Jr WC) Dec 8-7</li>\n<li>Champ. Round 1 - Paul Woo (Villa-Lombard Cougars) won by decision over Cody Tavoso (Force WC) Dec 6-2</li>\n<li>Champ. Round 1 - Maddox Khalimsky (Arlington Cardinals WC) won by major decision over Aaron Niemeyer (Roughnecks WC) Maj 14-2</li>\n<li>Champ. Round 1 - Logan Kuhel-trimmer (Force WC) won by fall over Joshua Biagini (TJ Trained Wrestling) Fall 1:28</li>\n<li>Champ. Round 1 - Stevie Granat (G2 WC) won by decision over Karsten Nordlie (Hononegah WC) Dec 3-1</li>\n<li>Champ. Round 1 - Christopher Moore (Crystal Lake Wizards) won by fall over Garrett Dahn (Naperville WC) Fall 0:34</li>\n<li>Champ. Round 1 - Robert Bonilla (Vittum Cats of SKT) won by decision over Cael Andrews (Batavia WC) Dec 12-7</li>\n<li>Champ. Round 1 - Joshua Glover (Crystal Lake Wizards) won by decision over Matthew Starzyk (Mustang WC) Dec 11-4</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 1 - Nicolas Davidson (Crystal Lake Wizards) won by decision over David-Joseph Rice (Belvidere Bandits WC) Dec 6-0</li>\n<li>Champ. Round 1 - Tegan Chumbley (SCN Youth WC) won by decision over Samuel Ohl (Metamora Kids WC) Dec 7-2</li>\n<li>Champ. Round 1 - Ashton Rice (Super Soldiers WC) won by decision over Elias Thies (Roughnecks WC) Dec 7-2</li>\n<li>Champ. Round 1 - David Williams (nWo WC) won by decision over Zachary White (The Law) Dec 11-10</li>\n<li>Champ. Round 1 - Caelan Riley (The Wrestling Factory) won by fall over Peyton Hutchcraft (Rantoul Junior Eagles) Fall 0:13</li>\n<li>Champ. Round 1 - Evan Schiffman (Lemont Bears WC) won by fall over Davey Creamer (Frankfort Wildcats Wrestling) Fall 2:27</li>\n<li>Champ. Round 1 - Mason Alessio (Force WC) won by decision over Lennon Steinkuehler (Arlington Cardinals WC) Dec 6-0</li>\n<li>Champ. Round 1 - Griffin Duffin (Mustang WC) won by decision over Cajaun Johnson (Urbana Tigers WC) Dec 4-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 1 - Matthew Harris (Tiger Town Tanglers WC) won by major decision over Hayden Weaver (Storm Youth WC) Maj 13-1</li>\n<li>Champ. Round 1 - Caden Muselman (Tinley Park Bulldogs) won by major decision over Joseph Biciocchi (Junior Kahoks) Maj 14-1</li>\n<li>Champ. Round 1 - Shea Reisel (Somonauk Wrestlers Club) won by decision over Ben Skaggs (Bulls WC) Dec 5-3</li>\n<li>Champ. Round 1 - Henry Coughlin (Tinley Park Bulldogs) won by decision over Isaiah Moore (St. Joseph Ogden Youth WC) Dec 10-3</li>\n<li>Champ. Round 1 - Brian Beers (The Wrestling Factory) won by fall over Brendan Corbett (Greg Gomez Trained Wrestling) Fall 2:24</li>\n<li>Champ. Round 1 - Maddux Blakely (Dakota WC) won by decision over Joseph Mcdermott (Force WC) Dec 3-0</li>\n<li>Champ. Round 1 - Caleb Nadig (DA WC) won by major decision over Connor Thompson (SCN Youth WC) Maj 14-3</li>\n<li>Champ. Round 1 - Jacob Macatangay (Force WC) won by decision over Joel Jankowski (Team 312) Dec 8-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 1 - Julian Gonzalez (Team 1006 Wrestling) won by major decision over Zane Ray (Storm Youth WC) Maj 14-2</li>\n<li>Champ. Round 1 - Arojae Hart (AJ Junior Wildcats WC) won by fall over Bryce Mannix (Minooka Indians Elite) Fall 0:30</li>\n<li>Champ. Round 1 - Elias Medina (Bolingbrook Junior Raiders) won by decision over Mason Glaudel (Sauk Valley WC) Dec 8-6</li>\n<li>Champ. Round 1 - Austin Bauer (Edwardsville WC) won by tech fall over Liam Potenberg (Saber WC) TF 15-0</li>\n<li>Champ. Round 1 - Jake Zator (Lemont Bears WC) won by decision over David Jaffe (SCN Youth WC) Dec 5-3</li>\n<li>Champ. Round 1 - Sean Conway (Team 312) won by decision over Samuel Henkle (Crystal Lake Wizards) Dec 2-0</li>\n<li>Champ. Round 1 - James Marre (Gomez Wrestling Academy) won by major decision over Joseph Chiarelli (Martinez Fox Valley Elite) Maj 16-7</li>\n<li>Champ. Round 1 - Marcus Milianti (Panther WC) won by fall over Case Rockey (Dakota WC) Fall 0:44</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 1 - Tyler Casey (TJ Trained Wrestling) won by decision over Owen O`Connor (Celtics WC) Dec 3-2</li>\n<li>Champ. Round 1 - Cooper Schodrof (Izzy Style Wrestling) won by tech fall over Jack Reina (Fox Valley WC) TF 15-0</li>\n<li>Champ. Round 1 - Dillon Schueler (Sauk Valley WC) won by decision over Maddox Stieb (SCN Youth WC) Dec 7-0</li>\n<li>Champ. Round 1 - Matthew Boyer (North Shore Edge) won by major decision over Alexis Janiak (Force WC) Maj 9-1</li>\n<li>Champ. Round 1 - Aj Heeg (Beat the Streets-Chicago) won by tech fall over Elliott Diemel (Hononegah WC) TF 15-0</li>\n<li>Champ. Round 1 - Grover Mays (AJ Junior Wildcats WC) won by major decision over Joseph Lashuay (Storm Youth WC) Maj 10-1</li>\n<li>Champ. Round 1 - Caden Lendman (Belvidere Bandits WC) won by fall over Ian Freeman (Junior Kahoks) Fall 1:08</li>\n<li>Champ. Round 1 - Isaac Gaytan-Reilly (Mustang WC) won by major decision over Hunter Travis (Pontiac WC) Maj 9-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 1 - Andrew Johnson (Team 1006 Wrestling) won by major decision over Hunter Milam (Pontiac WC) Maj 13-0</li>\n<li>Champ. Round 1 - Logan Guerrero (Force WC) won by decision over Nicholas O`Keefe (Geneva Junior Vikings) Dec 6-3</li>\n<li>Champ. Round 1 - Pierce Leeman (Mattoon Youth WC) won by major decision over Vinnie Delpage (Force WC) Maj 13-4</li>\n<li>Champ. Round 1 - Alec Mihelic (Super Soldiers WC) won by fall over William Prater (Naperville Hammer Huskies) Fall 3:50</li>\n<li>Champ. Round 1 - William Dahm (Belleville Little Devils WC) won by fall over Adam Monteleone (DA WC) Fall 3:25</li>\n<li>Champ. Round 1 - Nate Pacetti (Panther WC) won in tie breaker - 1 over Nicholaus Lesch (Team 312) TB-1 3-2</li>\n<li>Champ. Round 1 - Michael Kelly (Tinley Park Bulldogs) won by fall over Luke Schultz (O`Fallon Little Panthers WC) Fall 2:49</li>\n<li>Champ. Round 1 - Rahmareon Roby (The Law) won by decision over Sazan Zaimi (Villa-Lombard Cougars) Dec 8-6</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 1 - Troy Mutz (Team 1006 Wrestling) won by fall over Thomas Shaw (Naperville WC) Fall 3:37</li>\n<li>Champ. Round 1 - Tommy McAuliffe (Tinley Park Bulldogs) won by decision over Christian Gilbert (Elk Grove Junior Grens) Dec 4-0</li>\n<li>Champ. Round 1 - Michael Kuehn (Pitbull Wrestling Alliance) won by decision over Gabriel Orosco (TJ Trained-Springfield) Dec 8-2</li>\n<li>Champ. Round 1 - Thomas Boland (Panther WC) won by tech fall over Ronaldo Gomez (Champbuilders Wrestling) TF 16-0</li>\n<li>Champ. Round 1 - Andrew Dado (Bolingbrook Junior Raiders) won by decision over Parr Schoolman (Naperville WC) Dec 5-4</li>\n<li>Champ. Round 1 - Benjamin Mitchell (Highland Bulldog Jr WC) won by major decision over Dylan Sayles (Hononegah WC) Maj 11-2</li>\n<li>Champ. Round 1 - Ryder Hunkins (Crystal Lake Wizards) won by decision over Gyrus Sims (Force WC) Dec 9-2</li>\n<li>Champ. Round 1 - Colton Carlisle (Bulls WC) won by fall over John Conover (Batavia WC) Fall 3:38</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 1 - Parker Terronez (Moline WC) won by tech fall over Jerod Carl (Cumberland Youth WC) TF 15-0</li>\n<li>Champ. Round 1 - Wade Abrams (Cary-Grove Matmen) won by fall over Jett McMillan (Effingham Youth WC) Fall 3:53</li>\n<li>Champ. Round 1 - Damien Lopez (Dekalb WC) won by fall over Hunter Janeczko (Yorkville WC) Fall 2:18</li>\n<li>Champ. Round 1 - Keddrick Terhune (Urbana Tigers WC) won by decision over Thomas Miller (Junior Kahoks) Dec 10-9</li>\n<li>Champ. Round 1 - Braden Stauffenberg (Izzy Style Wrestling) won by decision over Tommy Bennett (Panther WC) Dec 8-6</li>\n<li>Champ. Round 1 - Brandon Theres (Force WC) won in sudden victory - 1 over Nicholas Antonietti (nWo WC) SV-1 6-4</li>\n<li>Champ. Round 1 - Cole Brannigan (Lemont Bears WC) won by decision over Blake Jorgensen (Celtics WC) Dec 10-3</li>\n<li>Champ. Round 1 - Anthony Verges (Scorpion WC) won by decision over Patrick Downing (North Shore Edge) Dec 10-5</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 1 - Jose Velazquez (Tomcat WC) won by fall over Ayden Dukeman (Cumberland Youth WC) Fall 4:14</li>\n<li>Champ. Round 1 - Wyatt Raab (The Law) won by tech fall over Maverick Mcalpine (Team 1006 Wrestling) TF 15-0</li>\n<li>Champ. Round 1 - Elijah Chiaro (SCN Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Bradley Gillum (Dekalb WC) won by fall over Ivan Corral (Oak Forest Warriors) Fall 0:47</li>\n<li>Champ. Round 1 - Aidan O`Connor (Celtics WC) won by decision over Cody Dertz (Villa-Lombard Cougars) Dec 8-4</li>\n<li>Champ. Round 1 - Barry Johnson (AJ Junior Wildcats WC) won by decision over Vincent Mcdonald (Little Huskies WC) Dec 9-5</li>\n<li>Champ. Round 1 - Mannix Faworski (DA WC) won by fall over Connor Nelligan (Panther WC) Fall 1:05</li>\n<li>Champ. Round 1 - Quinn Fehrenbacher (Maine Eagles WC) won by fall over Kenny Taylor (Aces WC) Fall 1:12</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 1 - Nicolas Gagliani (Junior Cougar WC) won by fall over Gaige Murphy (Midwest Central Youth WC) Fall 1:04</li>\n<li>Champ. Round 1 - Jordan Clines (Triad Little Knights WC) won by fall over David Ridges (Fox Valley WC) Fall 3:41</li>\n<li>Champ. Round 1 - Jacob Bottarini (SCN Youth WC) won by fall over Joe Hoffer (Super Soldiers WC) Fall 0:52</li>\n<li>Champ. Round 1 - Armond Edwards (O`Fallon Little Panthers WC) won by major decision over Jack Downing (North Shore Edge) Maj 13-2</li>\n<li>Champ. Round 1 - Aidan Kyllonen (Brawlers WC) won by fall over Thomas Figueroa (Hononegah WC) Fall 1:51</li>\n<li>Champ. Round 1 - Justin Robinson (Harvey Twisters) won by fall over Colby Loftsgaard (Urbana Tigers WC) Fall 0:46</li>\n<li>Champ. Round 1 - Eathin Diveley (DA WC) won by major decision over Gustav Tosterud (Wolfpak WC) Maj 18-6</li>\n<li>Champ. Round 1 - Owen Jacobson (Tinley Park Bulldogs) won by fall over Alexandria Nance (Force WC) Fall 2:31</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 1 - Christopher Carr (Martinez Fox Valley Elite) won by fall over Jackson Funderburg (Sycamore WC) Fall 0:49</li>\n<li>Champ. Round 1 - Dakovion Kennedy (Moline WC) won by fall over Zachary Blaha (Junior Kahoks) Fall 0:18</li>\n<li>Champ. Round 1 - Jacob Bell (Belvidere Bandits WC) won by fall over Owen Keenan (Metamora Kids WC) Fall 4:26</li>\n<li>Champ. Round 1 - Nathan Pappas (Fox Valley WC) won by major decision over John McKeon (Panther WC) Maj 10-2</li>\n<li>Champ. Round 1 - Jordan Sommers (Waterloo Bulldog Wrestling) won by decision over Timothy Booth (Outlaws WC) Dec 8-2</li>\n<li>Champ. Round 1 - Jc Piker (Brawlers WC) won by fall over Donovan Torres (Bolingbrook Junior Raiders) Fall 3:54</li>\n<li>Champ. Round 1 - Thaddeus Gianaris (Maine Eagles WC) won by injury default over Dylan Brown (Storm Youth WC) Inj. 0:00</li>\n<li>Champ. Round 1 - Liam McDermott (Force WC) won by decision over Miguel Gonzalez (Bulls WC) Dec 6-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 1 - Connor Barnes (Peoria Heights Minutemen WC) won by fall over Daniel Dominguez (Hawk WC) Fall 2:34</li>\n<li>Champ. Round 1 - Hunter Powell (Force WC) won by fall over Skyler Wade (Belleville Little Devils WC) Fall 2:19</li>\n<li>Champ. Round 1 - Kaden Marmon (Triad Little Knights WC) won by fall over Jacob Sergen (Team 1006 Wrestling) Fall 3:35</li>\n<li>Champ. Round 1 - Maximus Blamey (Crystal Lake Wizards) won by fall over Jorge Contreras (Belvidere Bandits WC) Fall 1:38</li>\n<li>Champ. Round 1 - Giovanni Amaya (Blackhawk WC) won by fall over Zion Nix (Badger WC) Fall 3:13</li>\n<li>Champ. Round 1 - Xavier Godwin (Little Huskies WC) won by fall over Armando Hernandez (Junior Cougar WC) Fall 3:21</li>\n<li>Champ. Round 1 - Tyler Wilms (Lemont Bears WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Porter Leith (Dundee Highlanders WC) won by decision over Aodan O`Sullivan (Notre Dame WC) Dec 7-1</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 1 - Gavin Mason (Team 1006 Wrestling) won by fall over Allan Levites (Dundee Highlanders WC) Fall 3:33</li>\n<li>Champ. Round 1 - Henry Chang (Junior Cougar WC) won by decision over Jonathan Herron (Hoopeston Area WC) Dec 9-8</li>\n<li>Champ. Round 1 - Jonathon Barrick (Crystal Lake Wizards) won by fall over Nathan Lee (Sycamore WC) Fall 4:20</li>\n<li>Champ. Round 1 - Max Terlap (The Wrestling Factory) won by decision over Oscar Vergara (Champbuilders Wrestling) Dec 9-2</li>\n<li>Champ. Round 1 - Justin Thomas (HF Elite WC) won by fall over Tanner Fry (Waterloo Bulldog Wrestling) Fall 3:36</li>\n<li>Champ. Round 1 - Sampson Price (Downers Grove WC) won by major decision over Fernando Rodriguez (Little Huskies WC) Maj 10-1</li>\n<li>Champ. Round 1 - Roman Melnyk (Pitbull Wrestling Alliance) won by decision over Jacob Goodman (Tinley Park Bulldogs) Dec 7-6</li>\n<li>Champ. Round 1 - Luke Williams (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 1 - Gene Stringini (The Law) won by decision over Octavio Jacquez (Trico WC) Dec 10-3</li>\n<li>Champ. Round 1 - Jordan Logan (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Carlos Neri (Granite City Wrestling Association) received a bye   () Bye</li>\n<li>Champ. Round 1 - Julian Espinosa Lopez (Blackhawk WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Lilijana Reyes (Maddog Wrestling Academy) received a bye   () Bye</li>\n<li>Champ. Round 1 - Rodolfo Flores (Little Rams Wrestling) received a bye   () Bye</li>\n<li>Champ. Round 1 - Kevin Olson (Chicago Park District) received a bye   () Bye</li>\n<li>Champ. Round 1 - Austin Wolfe (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 1 - Alvin Hommel (Blackhawk WC) won by decision over Ian Englishharden (Yorkville WC) Dec 7-0</li>\n<li>Champ. Round 1 - John Davis (Thundercats) won by fall over Michael McCubbin (Trico WC) Fall 3:11</li>\n<li>Champ. Round 1 - Gabriel Smith (Harvey Twisters) won by decision over Lucas Armstrong (Peoria Razorbacks WC) Dec 7-0</li>\n<li>Champ. Round 1 - Keegan Keller (AJ Junior Wildcats WC) won by fall over Steven Weirich (Batavia WC) Fall 0:28</li>\n<li>Champ. Round 1 - Aidan Pinto (Team 1006 Wrestling) won by decision over Bryan West (Belvidere Bandits WC) Dec 4-1</li>\n<li>Champ. Round 1 - Morley Coval (Martinez Fox Valley Elite) won by fall over Ryan Yabi (Villa-Lombard Cougars) Fall 0:24</li>\n<li>Champ. Round 1 - Michael Williams (Rambler WC) won by fall over David Peters (Crystal Lake Wizards) Fall 0:40</li>\n<li>Champ. Round 1 - Jerred Durian (Fox Valley WC) won by fall over Jack Eberhart (O`Fallon Little Panthers WC) Fall 1:06</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 1 - Parker Schnoeker (Sparta Junior Bulldogs) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Kaitelyine Tolbert (Murphysboro WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Chance Ingleman (Unity Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 1 - Coltin Rau (Dakota WC) received a bye   () Bye</li>\n<li>Champ. Round 1 -   () received a bye   () Bye</li>\n<li>Champ. Round 1 - Jamison VanVickle (Oakwood Youth WC) received a bye   () Bye</li>\n</ul>\n</section>",
  "Championship 1st Round": "<section class=\"tw-list\">\n<h1>Championship 1st Round</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>Champ. Round 2 - Camren French (Mattoon Youth WC) won by decision over Deven Casey (Izzy Style Wrestling) Dec 7-2</li>\n<li>Champ. Round 2 - Donny Pigoni (SCN Youth WC) won by decision over Michael Esteban (Beat the Streets-Chicago) Dec 10-5</li>\n<li>Champ. Round 2 - Cayden Amico (Plainfield WC) won by fall over Caleb Lenning (Morton Youth WC) Fall 4:12</li>\n<li>Champ. Round 2 - Kaden Harman (Golden Eagles WC) won by fall over Robye Williams (Harvey Twisters) Fall 2:13</li>\n<li>Champ. Round 2 - Bradley Ruckman (Bulls WC) won in sudden victory - 1 over Donald Cannon (DA WC) SV-1 6-4</li>\n<li>Champ. Round 2 - Deion Johnson (Harvey Twisters) won by major decision over Juvontae Williams (Lionheart Intense Wrestling) Maj 9-0</li>\n<li>Champ. Round 2 - Jeremy Huf (Arlington Cardinals WC) won by fall over Holden Brazelton (Champaign WC) Fall 2:16</li>\n<li>Champ. Round 2 - Ty Edwards (Team 1006 Wrestling) won by fall over Madden Parker (Contender Wrestling) Fall 0:48</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Champ. Round 2 - Dominic Recchia (Yorkville WC) won in sudden victory - 1 over Justus Snapp (Force WC) SV-1 2-0</li>\n<li>Champ. Round 2 - Jerren Gille (DA WC) won by decision over Raymond Cavey (SCN Youth WC) Dec 3-2</li>\n<li>Champ. Round 2 - Tony Keene (Gladiator Elite) won by fall over Ashton Hobson (Batavia WC) Fall 3:48</li>\n<li>Champ. Round 2 - Javin Jackson-Bey (Harvey Twisters) won by fall over Ivan Acevedo (Team 1006 Wrestling) Fall 3:43</li>\n<li>Champ. Round 2 - Joseph Lathwood (Bulls WC) won by decision over Ronald Baker (Champaign WC) Dec 6-4</li>\n<li>Champ. Round 2 - Benjamin Davino (SCN Youth WC) won by fall over Thomas Tourdot (Rochelle WC) Fall 1:23</li>\n<li>Champ. Round 2 - Carson Bissey (Respect Wrestling) won by decision over Grant Madl (Elk Grove Junior Grens) Dec 2-1</li>\n<li>Champ. Round 2 - Damien Flores (Team 1006 Wrestling) won by decision over Carson Weber (Plainfield WC) Dec 5-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Champ. Round 2 - Dominick Coronado (Yorkville WC) won by decision over Blue Bishop (Wrestling Inc) Dec 6-1</li>\n<li>Champ. Round 2 - Tommy Hammond (Crystal Lake Wizards) won by decision over Donavon Allen (Harvey Twisters) Dec 7-6</li>\n<li>Champ. Round 2 - Colin Kacena (Bolingbrook Junior Raiders) won by decision over Peyton Cox (Champaign WC) Dec 5-4</li>\n<li>Champ. Round 2 - William Hupke (SCN Youth WC) won by decision over Joel Muehlenbeck (Arlington Cardinals WC) Dec 8-4</li>\n<li>Champ. Round 2 - Seth Mendoza (Contender Wrestling) won by fall over Colin Thompson (SCN Youth WC) Fall 1:29</li>\n<li>Champ. Round 2 - Josyah Holland (Harvey Twisters) won by major decision over Joshua Felton (Golden Eagles WC) Maj 9-0</li>\n<li>Champ. Round 2 - Bryce Durlacher (The Wrestling Factory) won in tie breaker - 1 over Jovan Williams (Harvey Twisters) TB-1 6-5</li>\n<li>Champ. Round 2 - Liam Fox (Murphysboro WC) won by decision over Luke Zook (Yorkville WC) Dec 8-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Champ. Round 2 - Tallen Pawlak (Champaign WC) won by major decision over Tyson Rakers (Highland Bulldog Jr WC) Maj 14-2</li>\n<li>Champ. Round 2 - Jack Ferguson (Yorkville WC) won by decision over Jackson Smith (Lemont Bears WC) Dec 7-5</li>\n<li>Champ. Round 2 - Gonzalo Camacho (Bolingbrook Junior Raiders) won by fall over Evan Willock (TJ Trained Wrestling) Fall 1:16</li>\n<li>Champ. Round 2 - Joshua Vazquez (Izzy Style Wrestling) won in tie breaker - 1 over Tyler Aters (SCN Youth WC) TB-1 3-2</li>\n<li>Champ. Round 2 - Michael DiBenedetto (Greg Gomez Trained Wrestling) won by decision over Gunnar Garelli (Izzy Style Wrestling) Dec 6-3</li>\n<li>Champ. Round 2 - Thomas Silva (DA WC) won by major decision over Sean Larkin (Panther WC) Maj 12-3</li>\n<li>Champ. Round 2 - Colby Crouch (Sudden Victory Athletic Center) won by fall over Jameson Garcia (Gomez Wrestling Academy) Fall 2:41</li>\n<li>Champ. Round 2 - Liam Kelly (Tinley Park Bulldogs) won by decision over Carter Rude (Sauk Valley WC) Dec 4-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Champ. Round 2 - Harrison Konder (Bolingbrook Junior Raiders) won by major decision over Landen Gunnison (Junior Pioneer WC) Maj 10-1</li>\n<li>Champ. Round 2 - Saul Trejo (Gomez Wrestling Academy) won by decision over Sam Schuit (Lemont Bears WC) Dec 5-0</li>\n<li>Champ. Round 2 - Jake Schwartz (Carlinville WC) won by fall over Aidan Huck (Batavia WC) Fall 4:14</li>\n<li>Champ. Round 2 - Colin Young (DA WC) won by fall over Camden Rogers (Oak Forest Warriors) Fall 2:03</li>\n<li>Champ. Round 2 - Caleb Nobiling (Lakeland Predators WC) won in sudden victory - 1 over Damarion Moore (Champaign WC) SV-1 2-0</li>\n<li>Champ. Round 2 - Edmund Enright (Mustang WC) won by fall over James Wright (Golden Eagles WC) Fall 1:56</li>\n<li>Champ. Round 2 - Bryce Griffin (Bulls WC) won by fall over Zach Kruse (Hinsdale Red Devil WC) Fall 2:02</li>\n<li>Champ. Round 2 - Alexander Marre (Izzy Style Wrestling) won by decision over Francisco Solis (Team 1006 Wrestling) Dec 13-7</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Champ. Round 2 - Garrett Luke (Stockton Renegades) won in sudden victory - 1 over Noah Manuel Tapia (Young Guns) SV-1 2-0</li>\n<li>Champ. Round 2 - Ricky Ericksen (Vittum Cats of SKT) won by fall over Owen Miller (Vandalia Jr WC) Fall 1:03</li>\n<li>Champ. Round 2 - Santino Scolaro (SCN Youth WC) won by decision over Joseph Griffin (Team 1006 Wrestling) Dec 7-5</li>\n<li>Champ. Round 2 - Tyler Guerra (Gomez Wrestling Academy) won by major decision over Zeke Rhodes (Sudden Victory Athletic Center) Maj 17-4</li>\n<li>Champ. Round 2 - Ryan Wojcik (Tinley Park Bulldogs) won by decision over Ryan Rink (Unity Youth WC) Dec 8-2</li>\n<li>Champ. Round 2 - Connor Munn (Pitbull Wrestling Alliance) won in sudden victory - 1 over Caleb Ohnesorge (Gladiator Elite) SV-1 2-0</li>\n<li>Champ. Round 2 - Renzo Morgan (The Wrestling Factory) won by fall over Marcus Godfrey (Lincoln-Way WC) Fall 2:16</li>\n<li>Champ. Round 2 - Brendan Tunink (Sauk Valley WC) won by major decision over Alexander Lizak (Tinley Park Bulldogs) Maj 10-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Champ. Round 2 - Collin Carrigan (Naperville WC) won by decision over Tyler Starr (Brawlers WC) Dec 8-7</li>\n<li>Champ. Round 2 - Michael Calcagno (Izzy Style Wrestling) won by fall over Drew Torza (Team 1006 Wrestling) Fall 1:08</li>\n<li>Champ. Round 2 - Zane Hulet (Super Soldiers WC) won by major decision over Angel Zamora (Hoopeston Area WC) Maj 16-2</li>\n<li>Champ. Round 2 - Richard Wade (Gladiator Elite) won by decision over Aiden Livingston (Stillman Valley WC) Dec 6-1</li>\n<li>Champ. Round 2 - Ethan Struck (Crystal Lake Wizards) won by decision over Drew Landau (Edwardsville WC) Dec 1-0</li>\n<li>Champ. Round 2 - Jaydon Robinson (Harvey Twisters) won by major decision over Polo Ramon (Headlock Wrestling Academy) Maj 18-5</li>\n<li>Champ. Round 2 - Cale Stonitsch (Celtics WC) won by decision over Samuel Han (Carbondale WC) Dec 1-0</li>\n<li>Champ. Round 2 - Jackson Gillen (Team 1006 Wrestling) won by fall over Brody Murray (SCN Youth WC) Fall 3:49</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Champ. Round 2 - Peter Marinopoulos (Mustang WC) won by decision over Eric Gustafson (Moline WC) Dec 5-0</li>\n<li>Champ. Round 2 - Jayden Colon (Gomez Wrestling Academy) won by fall over Thomas Jones (Force WC) Fall 0:26</li>\n<li>Champ. Round 2 - Zackary Crawford (Sycamore WC) won by fall over Marquan Shaw (Lionheart Intense Wrestling) Fall 2:04</li>\n<li>Champ. Round 2 - Jeremy Loomis (Team 1006 Wrestling) won by decision over Caleb Mays (AJ Junior Wildcats WC) Dec 6-0</li>\n<li>Champ. Round 2 - Drew Surges (SCN Youth WC) won by fall over Dillon Raab (The Law) Fall 4:16</li>\n<li>Champ. Round 2 - Nathan Beltran (Maine Eagles WC) won in sudden victory - 1 over Michael Jabaay (Contender Wrestling) SV-1 4-2</li>\n<li>Champ. Round 2 - Colin Kelly (Tinley Park Bulldogs) won by major decision over Isaiah Hayes (Mt. Zion Kids WC) Maj 8-0</li>\n<li>Champ. Round 2 - Andre Rios (Z`s Team Pena) won by decision over Tyler Martinez (Team 1006 Wrestling) Dec 4-1</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Champ. Round 2 - Griffin Luke (Stockton Renegades) won by fall over Jackson Godinez (Super Soldiers WC) Fall 3:47</li>\n<li>Champ. Round 2 - Quinn Herbert (Maine Eagles WC) won by decision over Braden Kelly (Granite City Wrestling Association) Dec 2-0</li>\n<li>Champ. Round 2 - Skip Rozanski (Pitbull Wrestling Alliance) won by decision over Michael Phillips (SCN Youth WC) Dec 5-1</li>\n<li>Champ. Round 2 - Luke Christie (Brawlers WC) won by decision over Joshua Tanquilut (Tinley Park Bulldogs) Dec 8-2</li>\n<li>Champ. Round 2 - Matthew Janiak (Force WC) won by decision over Rylan Breen (Tinley Park Bulldogs) Dec 5-4</li>\n<li>Champ. Round 2 - David Mayora (Izzy Style Wrestling) won by tech fall over Caden Casimino (Crystal Lake Wizards) TF 15-0</li>\n<li>Champ. Round 2 - Garrett Vincent (Dakota WC) won by injury default over Nicholas Nosler (Unity Youth WC) Inj. 2:52</li>\n<li>Champ. Round 2 - Logan Swaw (Team 1006 Wrestling) won by fall over Silvano Spatafora (Fox Valley WC) Fall 2:44</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Champ. Round 2 - Jack Lesher (SCN Youth WC) won by decision over Blake Hinrichsen (Super Soldiers WC) Dec 11-4</li>\n<li>Champ. Round 2 - Antwan Strong (East St. Louis Wrestling) won by fall over Edward Clark (UP Town WC) Fall 4:29</li>\n<li>Champ. Round 2 - Kyle Lindsey (Oak Forest Warriors) won by fall over Gabe Eckerd (Hawk WC) Fall 0:30</li>\n<li>Champ. Round 2 - Declan Fortuna (Izzy Style Wrestling) won by major decision over Jordan Griggs (Saber WC) Maj 9-1</li>\n<li>Champ. Round 2 - Jack Seacrist (Belvidere Bandits WC) won by fall over Domanic Abeja (Tinley Park Bulldogs) Fall 2:38</li>\n<li>Champ. Round 2 - Cor`ron Midgett (East St. Louis Wrestling) won by injury default over Shane Carr (Martinez Fox Valley Elite) Inj. 4:03</li>\n<li>Champ. Round 2 - Kamron Beal (Tinley Park Bulldogs) won by decision over Leo Meyer (Mattoon Youth WC) Dec 8-6</li>\n<li>Champ. Round 2 - Anthony Alansari (Scorpion WC) won by major decision over Andrew Fitzgerald (Team 1006 Wrestling) Maj 10-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Champ. Round 2 - Jack Smialowicz (Pitbull Wrestling Alliance) won by major decision over Colin Ripperda (Riverton/Williamsville Youth Wrestling) Maj 9-0</li>\n<li>Champ. Round 2 - Abraham Wojcikiewicz (Bulls WC) won by fall over Mason Sarnes (Pekin Boys &amp; Girls Club) Fall 3:46</li>\n<li>Champ. Round 2 - Billy Lindsey (Oak Forest Warriors) won by fall over Joshua Taylor (Scorpion WC) Fall 1:04</li>\n<li>Champ. Round 2 - Joshua Franklin (UP Town WC) won by fall over Dalton Brown (Storm Youth WC) Fall 4:07</li>\n<li>Champ. Round 2 - Blake Maday (Gomez Wrestling Academy) won by fall over Quentin Berry (Rochelle WC) Fall 3:17</li>\n<li>Champ. Round 2 - Aidan Blackburn (Mattoon Youth WC) won by decision over Gabriel Alvarez (Beat the Streets-Chicago) Dec 8-1</li>\n<li>Champ. Round 2 - Jalen Curtis (Greg Gomez Trained Wrestling) won by fall over Maxwell Corral (Oak Forest Warriors) Fall 0:21</li>\n<li>Champ. Round 2 - Elijah Munoz (Team 1006 Wrestling) won by fall over Javier Hurtado (Pitbull Wrestling Alliance) Fall 1:14</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Champ. Round 2 - Gus Cambier (Sycamore WC) won by fall over Kenwyn Horne (East St. Louis Wrestling) Fall 0:55</li>\n<li>Champ. Round 2 - Jovon Johnson (Lincoln-Way WC) won by fall over Harley Grimm (Oakwood Youth WC) Fall 3:45</li>\n<li>Champ. Round 2 - Matthew Kubas (Grayslake WC) won by decision over Skander Tahri (Elmhurst WC) Dec 5-2</li>\n<li>Champ. Round 2 - Logan Nance (Vandalia Jr WC) won by decision over Charles Koeppen (Panther WC) Dec 4-0</li>\n<li>Champ. Round 2 - William Strelow (Oak Forest Warriors) won by fall over Michael Kopecky (Maine Eagles WC) Fall 3:19</li>\n<li>Champ. Round 2 - Luke Liberatore (Bolingbrook Junior Raiders) won by decision over Mason Randall (Mt. Vernon Lions WC) Dec 4-0</li>\n<li>Champ. Round 2 - Devin Medina (Greg Gomez Trained Wrestling) won by major decision over Matthew Jens (Grayslake WC) Maj 12-3</li>\n<li>Champ. Round 2 - Joseph Scrivani (Golden Eagles WC) won by tech fall over Shamon Handegan (Pekin Boys &amp; Girls Club) TF 15-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Champ. Round 2 - David Stewart (Blackhawk WC) won by fall over Austin Hale (Granite City Wrestling Association) Fall 2:06</li>\n<li>Champ. Round 2 - Micheal Brown (Harvey Twisters) won by decision over Malik Salah (Lockport Junior Porters WC) Dec 8-6</li>\n<li>Champ. Round 2 - Ayden Salley (Barrington Broncos WC) won by decision over Gable Carrick (Sycamore WC) Dec 3-1</li>\n<li>Champ. Round 2 - Gavin Brown (Oak Forest Warriors) won by fall over Haidyn Hendricks (Unity Youth WC) Fall 0:12</li>\n<li>Champ. Round 2 - Conor Phelan (Badger WC) won by fall over James Herring (Roxana WC) Fall 2:20</li>\n<li>Champ. Round 2 - Daniel Gonzalez (Batavia WC) won by fall over William Ardson (Izzy Style Wrestling) Fall 0:32</li>\n<li>Champ. Round 2 - Brian Petrancosta (Gomez Wrestling Academy) won by decision over Ethan Graham (Golden Eagles WC) Dec 3-2</li>\n<li>Champ. Round 2 - Dominic Thebeau (East St. Louis Wrestling) won by fall over Benjamin Alvarez (Team 1006 Wrestling) Fall 2:33</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Champ. Round 2 - Aaron Hernandez (Pitbull Wrestling Alliance) won by fall over Tommy Isitt (Team 1006 Wrestling) Fall 1:24</li>\n<li>Champ. Round 2 - Hudson McMann (Junior Cyclones WC) won by fall over Tyrell Nailon (UP Town WC) Fall 0:20</li>\n<li>Champ. Round 2 - Josh Kroll (Dinamo Wrestling) won by fall over Connor Dean (Benton WC) Fall 0:26</li>\n<li>Champ. Round 2 - Sean Scheck (Batavia WC) won by decision over Noah Wenzel (Dakota WC) Dec 3-0</li>\n<li>Champ. Round 2 - Edward Perry (SCN Youth WC) won by fall over Trystin Crossen (O`Fallon Little Panthers WC) Fall 3:42</li>\n<li>Champ. Round 2 - Calvin Hempel (Storm Youth WC) won by decision over Tyler Finley (Lincoln-Way WC) Dec 5-2</li>\n<li>Champ. Round 2 - Jackson Barnhart (Champaign WC) won by decision over Raymond Hughes (Golden Eagles WC) Dec 8-1</li>\n<li>Champ. Round 2 - Montana Calderon (Tomcat WC) won by fall over Edward Phillips (Super Soldiers WC) Fall 4:09</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Champ. Round 2 - Justin Hoffer (Super Soldiers WC) won by decision over Cooper King (Lions WC) Dec 8-1</li>\n<li>Champ. Round 2 - Adam Lambaz (Scorpion WC) won by fall over Amarion Ellison (Storm Youth WC) Fall 0:22</li>\n<li>Champ. Round 2 - Mason Bernabe (Harlem Cougars WC) won by fall over Logan Maxey (Panther Powerhouse Wrestling) Fall 2:12</li>\n<li>Champ. Round 2 - Myles Reardon (Quincy Cyclones WC) won by decision over Jarvelon Brown (Lincoln-Way WC) Dec 1-0</li>\n<li>Champ. Round 2 - Tyler Michelini (Elk Grove Junior Grens) won by fall over Kiara Ganey (Belleville Little Devils WC) Fall 2:00</li>\n<li>Champ. Round 2 - Takyla Watkins (Danville Chargers) won by decision over Hunter Peterson (Downers Grove WC) Dec 9-8</li>\n<li>Champ. Round 2 - Lee Smith (DA WC) won by fall over Lincoln Cooley (Sycamore WC) Fall 2:53</li>\n<li>Champ. Round 2 - Braden Hunter (Team 1006 Wrestling) won by fall over Mekhi McDowell (East St. Louis Wrestling) Fall 1:25</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Champ. Round 2 - Jack Mosier (Barrington Broncos WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Nathan Macias (Greg Gomez Trained Wrestling) Fall 0:52</li>\n<li>Champ. Round 2 - Ryan Clancy (Crosstown Spartan Elite WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Robert Rigg (Charleston WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Noah Carl (Cumberland Youth WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Alexis Correa (DuPage WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Reede Johnson (HF Elite WC) received a bye   () Bye</li>\n<li>Champ. Round 2 - Ricardo Townsend (Lionheart Intense Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Champ. Round 2 - Brady Phelps (Arlington Cardinals WC) won by fall over Dean Wainwright (Riverdale Elite) Fall 0:44</li>\n<li>Champ. Round 2 - Brayden Teunissen (Belvidere Bandits WC) won by fall over Maxwell Wade (Gladiator Elite) Fall 2:22</li>\n<li>Champ. Round 2 - Nore Turner (Lincoln-Way WC) won by decision over Rocky Seibel (Belleville Little Devils WC) Dec 10-4</li>\n<li>Champ. Round 2 - Cory Zator (Lemont Bears WC) won by decision over Logan Roberts (Mt. Zion Kids WC) Dec 10-6</li>\n<li>Champ. Round 2 - Rocco Hayes (Contender Wrestling) won by decision over Caleb Scott (Bulls WC) Dec 2-1</li>\n<li>Champ. Round 2 - Evan Gosz (Arlington Cardinals WC) won by tech fall over Jonathan Theodor (Team No Ego WC) TF 18-2</li>\n<li>Champ. Round 2 - Jase Salin (Celtics WC) won by fall over Chazz Robinson (Harvey Twisters) Fall 4:07</li>\n<li>Champ. Round 2 - Nicholas Garcia (Gomez Wrestling Academy) won by decision over Keagan Steen (Young Guns) Dec 11-8</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Champ. Round 2 - Inocencio Garcia (Force WC) won by major decision over Caden Edwards (Villa-Lombard Cougars) Maj 13-0</li>\n<li>Champ. Round 2 - Dominic Ducato (Golden Eagles WC) won by fall over Ayden Braddy (Road Warriors WC) Fall 0:30</li>\n<li>Champ. Round 2 - Dominic Schiavone (Izzy Style Wrestling) won by decision over Isaac Middendorf (Gladiator Elite) Dec 6-4</li>\n<li>Champ. Round 2 - Trevor Silzer (Tinley Park Bulldogs) won by tech fall over Luke Burgess (Izzy Style Wrestling) TF 16-0</li>\n<li>Champ. Round 2 - Jaymz Young (East St. Louis Wrestling) won by tech fall over Henry Warfel (Cumberland Youth WC) TF 16-0</li>\n<li>Champ. Round 2 - Colden Dyer (SCN Youth WC) won by decision over Grant Stender (Hawk WC) Dec 8-1</li>\n<li>Champ. Round 2 - Karter Guzman (Headlock Wrestling Academy) won by fall over Joshua Peterson (Wolfpak WC) Fall 0:47</li>\n<li>Champ. Round 2 - Brady Grennan (Sauk Valley WC) won by fall over Matthew Soltis (Lincoln-Way WC) Fall 0:22</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Champ. Round 2 - Benjamin Dunne (Izzy Style Wrestling) won by decision over Dylan Boyd (Granite City Wrestling Association) Dec 5-0</li>\n<li>Champ. Round 2 - Pierre Baldwin (Proviso Power House WC) won by major decision over Brandon Weber (Contender Wrestling) Maj 13-2</li>\n<li>Champ. Round 2 - Reef Pacot (Storm Youth WC) won by decision over Taggart Kazmierczak (Contender Wrestling) Dec 6-0</li>\n<li>Champ. Round 2 - Jacob Crandall (Arlington Cardinals WC) won by decision over J Guido Pigoni (SCN Youth WC) Dec 7-3</li>\n<li>Champ. Round 2 - Shay Korhorn (Force WC) won by fall over Tomas Aguilar (Tomcat WC) Fall 2:44</li>\n<li>Champ. Round 2 - Tyler Evans (Wolves WC) won by decision over Jack Summers (Edwardsville WC) Dec 2-0</li>\n<li>Champ. Round 2 - William Baysingar (Arlington Cardinals WC) won by major decision over Nicholas Fetters (Belleville Little Devils WC) Maj 17-5</li>\n<li>Champ. Round 2 - Jesus Herrera (Mustang WC) won by decision over Dominic Federico (Belleville Little Devils WC) Dec 5-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Champ. Round 2 - Isaac Bourge (Team 1006 Wrestling) won in tie breaker - 1 over Kaden Fetterolf (Batavia WC) TB-1 4-3</li>\n<li>Champ. Round 2 - Phoenix Blakely (Dakota WC) won by decision over Paul Woo (Villa-Lombard Cougars) Dec 7-0</li>\n<li>Champ. Round 2 - Maddox Khalimsky (Arlington Cardinals WC) won by fall over Blake Barney (Storm Youth WC) Fall 2:00</li>\n<li>Champ. Round 2 - Logan Kuhel-trimmer (Force WC) won by decision over Owen Dunlap (Tinley Park Bulldogs) Dec 1-0</li>\n<li>Champ. Round 2 - Gylon Sims (Force WC) won by fall over Stevie Granat (G2 WC) Fall 4:19</li>\n<li>Champ. Round 2 - Daniel Sheen (Izzy Style Wrestling) won in tie breaker - 1 over Christopher Moore (Crystal Lake Wizards) TB-1 4-3</li>\n<li>Champ. Round 2 - Chase Hall (Triad Little Knights WC) won by fall over Robert Bonilla (Vittum Cats of SKT) Fall 2:05</li>\n<li>Champ. Round 2 - Joshua Glover (Crystal Lake Wizards) won by fall over Curtis Steinkamp (Quincy Cyclones WC) Fall 1:48</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Champ. Round 2 - Brady Foster (Mattoon Youth WC) won by decision over Nicolas Davidson (Crystal Lake Wizards) Dec 3-2</li>\n<li>Champ. Round 2 - Tegan Chumbley (SCN Youth WC) won in sudden victory - 1 over Damen Michicich (Beat the Streets-Chicago) SV-1 2-0</li>\n<li>Champ. Round 2 - Matthew Hollingsworth (Lincoln-Way WC) won by fall over Ashton Rice (Super Soldiers WC) Fall 0:52</li>\n<li>Champ. Round 2 - Kai Neumark (Arlington Cardinals WC) won by major decision over David Williams (nWo WC) Maj 12-4</li>\n<li>Champ. Round 2 - Caelan Riley (The Wrestling Factory) won by major decision over Thomas Porter (Naperville WC) Maj 10-0</li>\n<li>Champ. Round 2 - Antonio Alvarado (Crystal Lake Wizards) won by decision over Evan Schiffman (Lemont Bears WC) Dec 6-0</li>\n<li>Champ. Round 2 - Mason Alessio (Force WC) won by fall over Riley Maxey (Panther Powerhouse Wrestling) Fall 4:15</li>\n<li>Champ. Round 2 - Kannon Webster (Super Soldiers WC) won by fall over Griffin Duffin (Mustang WC) Fall 2:41</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Champ. Round 2 - Conor Smetana (Rogue Wrestling) won by fall over Matthew Harris (Tiger Town Tanglers WC) Fall 0:33</li>\n<li>Champ. Round 2 - Joseph Fernau (Izzy Style Wrestling) won by major decision over Caden Muselman (Tinley Park Bulldogs) Maj 12-3</li>\n<li>Champ. Round 2 - Kenneth Siwicki (Naperville WC) won by decision over Shea Reisel (Somonauk Wrestlers Club) Dec 6-5</li>\n<li>Champ. Round 2 - Dillon Carlson (Crystal Lake Wizards) won by major decision over Henry Coughlin (Tinley Park Bulldogs) Maj 9-0</li>\n<li>Champ. Round 2 - Brian Beers (The Wrestling Factory) won by decision over Dalton Wells (Storm Youth WC) Dec 7-0</li>\n<li>Champ. Round 2 - Nasir Bailey (Harvey Twisters) won by fall over Maddux Blakely (Dakota WC) Fall 1:57</li>\n<li>Champ. Round 2 - Santino Robinson (Wrestling 365) won by decision over Caleb Nadig (DA WC) Dec 4-0</li>\n<li>Champ. Round 2 - Jacob Macatangay (Force WC) won by fall over Paul Ishikawa (TJ Trained Wrestling) Fall 0:31</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Champ. Round 2 - Brayden Peet (Sycamore WC) won by decision over Julian Gonzalez (Team 1006 Wrestling) Dec 7-0</li>\n<li>Champ. Round 2 - Nicholas Renteria (Beat the Streets-Chicago) won by decision over Arojae Hart (AJ Junior Wildcats WC) Dec 5-2</li>\n<li>Champ. Round 2 - Tyler Perry (Batavia WC) won by fall over Elias Medina (Bolingbrook Junior Raiders) Fall 3:54</li>\n<li>Champ. Round 2 - Ethan Stiles (Izzy Style Wrestling) won by major decision over Austin Bauer (Edwardsville WC) Maj 12-4</li>\n<li>Champ. Round 2 - Carter Hall (Champaign WC) won by major decision over Jake Zator (Lemont Bears WC) Maj 10-1</li>\n<li>Champ. Round 2 - Sean Conway (Team 312) won in tie breaker - 1 over Jesse Hahs (Herrin Jr WC) TB-1 3-2</li>\n<li>Champ. Round 2 - Jordan Blew (Force WC) won by fall over James Marre (Gomez Wrestling Academy) Fall 2:44</li>\n<li>Champ. Round 2 - Marcus Milianti (Panther WC) won in SV-1 by fall over Anthony Montez (Junior Pioneer WC) SV-1 (Fall) 4:53</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Champ. Round 2 - Tyler Casey (TJ Trained Wrestling) won by decision over Cole Peters (TJ Trained-Springfield) Dec 11-5</li>\n<li>Champ. Round 2 - Dylan Gvillo (Edwardsville WC) won by decision over Cooper Schodrof (Izzy Style Wrestling) Dec 5-4</li>\n<li>Champ. Round 2 - Dillon Schueler (Sauk Valley WC) won by fall over Andrew Ryden (Harlem Cougars WC) Fall 2:44</li>\n<li>Champ. Round 2 - Vincent Robinson (Harvey Twisters) won by fall over Matthew Boyer (North Shore Edge) Fall 2:10</li>\n<li>Champ. Round 2 - Aj Heeg (Beat the Streets-Chicago) won by tech fall over Cruz Ibarra (nWo WC) TF 17-0</li>\n<li>Champ. Round 2 - Dominik Mallinder (Izzy Style Wrestling) won by decision over Grover Mays (AJ Junior Wildcats WC) Dec 10-3</li>\n<li>Champ. Round 2 - Luis Bazan (Bolingbrook Junior Raiders) won by decision over Caden Lendman (Belvidere Bandits WC) Dec 5-1</li>\n<li>Champ. Round 2 - Carlos Munoz-Flores (Team 1006 Wrestling) won by decision over Isaac Gaytan-Reilly (Mustang WC) Dec 6-3</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Champ. Round 2 - Andrew Johnson (Team 1006 Wrestling) won by decision over Kenyon Boyce (Harvey Twisters) Dec 7-4</li>\n<li>Champ. Round 2 - Joseph Olalde (Gomez Wrestling Academy) won by major decision over Logan Guerrero (Force WC) Maj 10-2</li>\n<li>Champ. Round 2 - Tyler Simmer (Dakota WC) won by major decision over Pierce Leeman (Mattoon Youth WC) Maj 11-0</li>\n<li>Champ. Round 2 - Shawn Minick (Bulls WC) won by decision over Alec Mihelic (Super Soldiers WC) Dec 8-3</li>\n<li>Champ. Round 2 - Korina Blades (Martinez Fox Valley Elite) won by tech fall over William Dahm (Belleville Little Devils WC) TF 17-0</li>\n<li>Champ. Round 2 - Nate Pacetti (Panther WC) won by decision over Shane McEntee (Lockport Junior Porters WC) Dec 4-1</li>\n<li>Champ. Round 2 - Michael Kelly (Tinley Park Bulldogs) won by decision over Tavius Hosley (Unity Youth WC) Dec 7-0</li>\n<li>Champ. Round 2 - Will Rude (Sauk Valley WC) won by fall over Rahmareon Roby (The Law) Fall 0:45</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Champ. Round 2 - Joaquin Miranda (Crystal Lake Wizards) won by fall over Troy Mutz (Team 1006 Wrestling) Fall 1:17</li>\n<li>Champ. Round 2 - Nathaniel Dampier (Gladiator Elite) won by decision over Tommy McAuliffe (Tinley Park Bulldogs) Dec 6-4</li>\n<li>Champ. Round 2 - Aidan Linden (nWo WC) won by fall over Michael Kuehn (Pitbull Wrestling Alliance) Fall 1:13</li>\n<li>Champ. Round 2 - Jared Gumila (Force WC) won by fall over Thomas Boland (Panther WC) Fall 1:16</li>\n<li>Champ. Round 2 - Michael Gentile (Beat the Streets-Chicago) won by fall over Andrew Dado (Bolingbrook Junior Raiders) Fall 3:30</li>\n<li>Champ. Round 2 - Jacob Whiting (Lake Zurich Cubs WC) won by fall over Benjamin Mitchell (Highland Bulldog Jr WC) Fall 0:26</li>\n<li>Champ. Round 2 - Rashon Allen (Urbana Tigers WC) won by decision over Ryder Hunkins (Crystal Lake Wizards) Dec 2-1</li>\n<li>Champ. Round 2 - Kole Brower (Moline WC) won by decision over Colton Carlisle (Bulls WC) Dec 6-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Champ. Round 2 - Parker Terronez (Moline WC) won by fall over Ayden Lutes (Naperville WC) Fall 4:08</li>\n<li>Champ. Round 2 - Owen Gerdes (Force WC) won by decision over Wade Abrams (Cary-Grove Matmen) Dec 8-3</li>\n<li>Champ. Round 2 - Damien Lopez (Dekalb WC) won by tech fall over Nathan Chirillo (Tinley Park Bulldogs) TF 21-6</li>\n<li>Champ. Round 2 - Will Collins (North Shore Edge) won by fall over Keddrick Terhune (Urbana Tigers WC) Fall 0:36</li>\n<li>Champ. Round 2 - Brody Hallin (Crystal Lake Wizards) won by decision over Braden Stauffenberg (Izzy Style Wrestling) Dec 7-1</li>\n<li>Champ. Round 2 - Alexander Miranda (Bulls WC) won by decision over Brandon Theres (Force WC) Dec 7-3</li>\n<li>Champ. Round 2 - Tyrin Newsome (Urbana Tigers WC) won by decision over Cole Brannigan (Lemont Bears WC) Dec 7-4</li>\n<li>Champ. Round 2 - Lance Belshaw (Quincy Cyclones WC) won by decision over Anthony Verges (Scorpion WC) Dec 7-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Champ. Round 2 - Mateo Villalobos (Zee-Bee Stingers) won by tech fall over Jose Velazquez (Tomcat WC) TF 16-1</li>\n<li>Champ. Round 2 - Wyatt Raab (The Law) won by major decision over Brandon Lloyd (Waterloo Bulldog Wrestling) Maj 14-3</li>\n<li>Champ. Round 2 - Elijah Chiaro (SCN Youth WC) won by fall over Christian Villasenor (Mustang WC) Fall 2:45</li>\n<li>Champ. Round 2 - Bradley Gillum (Dekalb WC) won by decision over Jacob Liberatore (Bolingbrook Junior Raiders) Dec 7-3</li>\n<li>Champ. Round 2 - Shane Moran (Crystal Lake Wizards) won by decision over Aidan O`Connor (Celtics WC) Dec 2-1</li>\n<li>Champ. Round 2 - Iysten Syfert (Cumberland Youth WC) won by fall over Barry Johnson (AJ Junior Wildcats WC) Fall 4:17</li>\n<li>Champ. Round 2 - Brayden Thompson (nWo WC) won by major decision over Mannix Faworski (DA WC) Maj 10-2</li>\n<li>Champ. Round 2 - Connor Brooker (Thundercats) won by fall over Quinn Fehrenbacher (Maine Eagles WC) Fall 1:11</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Champ. Round 2 - Alexander Tagler (Lemont Bears WC) won by fall over Nicolas Gagliani (Junior Cougar WC) Fall 0:21</li>\n<li>Champ. Round 2 - Evan Smith (Force WC) won by fall over Jordan Clines (Triad Little Knights WC) Fall 0:53</li>\n<li>Champ. Round 2 - Marshal Cunz (Harlem Cougars WC) won by fall over Jacob Bottarini (SCN Youth WC) Fall 0:46</li>\n<li>Champ. Round 2 - Armond Edwards (O`Fallon Little Panthers WC) won by tech fall over Colby Ryan (Cumberland Youth WC) TF 17-2</li>\n<li>Champ. Round 2 - Aidan Kyllonen (Brawlers WC) won by major decision over Ryan Gopin (Barrington Broncos WC) Maj 16-4</li>\n<li>Champ. Round 2 - Moisey Trimble (Belleville Little Devils WC) won by fall over Justin Robinson (Harvey Twisters) Fall 2:51</li>\n<li>Champ. Round 2 - Kennedy Blades (Martinez Fox Valley Elite) won by decision over Eathin Diveley (DA WC) Dec 6-3</li>\n<li>Champ. Round 2 - Owen Jacobson (Tinley Park Bulldogs) won by decision over Robert Gonzalez (Team 1006 Wrestling) Dec 5-0</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Champ. Round 2 - Christopher Carr (Martinez Fox Valley Elite) won by tech fall over Seth Brooks (Granite City Wrestling Association) TF 15-0</li>\n<li>Champ. Round 2 - Hakupo`mai Watson (Crosstown Spartan Elite WC) won by fall over Dakovion Kennedy (Moline WC) Fall 3:51</li>\n<li>Champ. Round 2 - Alexander Goworowski (Team 312) won by fall over Jacob Bell (Belvidere Bandits WC) Fall 2:36</li>\n<li>Champ. Round 2 - Craig Johnson (Danville Chargers) won by fall over Nathan Pappas (Fox Valley WC) Fall 2:26</li>\n<li>Champ. Round 2 - Jordan Sommers (Waterloo Bulldog Wrestling) won by decision over Michael Rydell (Tinley Park Bulldogs) Dec 5-2</li>\n<li>Champ. Round 2 - Antonio Torres (nWo WC) won by fall over Jc Piker (Brawlers WC) Fall 0:29</li>\n<li>Champ. Round 2 - Jokiah Sewell (Hawk WC) won by fall over Thaddeus Gianaris (Maine Eagles WC) Fall 4:01</li>\n<li>Champ. Round 2 - Tyler Haynes (Pekin Boys &amp; Girls Club) won by fall over Liam McDermott (Force WC) Fall 2:27</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Champ. Round 2 - Braeden Tosterud (Elk Grove Junior Grens) won in sudden victory - 1 over Connor Barnes (Peoria Heights Minutemen WC) SV-1 5-3</li>\n<li>Champ. Round 2 - Hunter Powell (Force WC) won by fall over Joshton Schwartz (Hoopeston Area WC) Fall 4:07</li>\n<li>Champ. Round 2 - Kaden Marmon (Triad Little Knights WC) won by fall over Jadon Mims (Maywood Bucs) Fall 3:50</li>\n<li>Champ. Round 2 - Brandon Navarro (nWo WC) won by major decision over Maximus Blamey (Crystal Lake Wizards) Maj 15-3</li>\n<li>Champ. Round 2 - Kylen Rose (Roughnecks WC) won by fall over Giovanni Amaya (Blackhawk WC) Fall 1:48</li>\n<li>Champ. Round 2 - Jake Ziemniarski (Force WC) won by fall over Xavier Godwin (Little Huskies WC) Fall 2:33</li>\n<li>Champ. Round 2 - Nathaniel Dutkin (Wolves WC) won by decision over Tyler Wilms (Lemont Bears WC) Dec 6-2</li>\n<li>Champ. Round 2 - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by fall over Porter Leith (Dundee Highlanders WC) Fall 1:46</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Champ. Round 2 - Elliott Lewis (Tinley Park Bulldogs) won by major decision over Gavin Mason (Team 1006 Wrestling) Maj 9-0</li>\n<li>Champ. Round 2 - Aidan Avilez (Martinez Fox Valley Elite) won by fall over Henry Chang (Junior Cougar WC) Fall 1:54</li>\n<li>Champ. Round 2 - Michael Bridgeman (Roughnecks WC) won by decision over Jonathon Barrick (Crystal Lake Wizards) Dec 6-4</li>\n<li>Champ. Round 2 - John Pacewic (Force WC) won by fall over Max Terlap (The Wrestling Factory) Fall 4:04</li>\n<li>Champ. Round 2 - Colin O`Neill (Wolfpak WC) won by fall over Justin Thomas (HF Elite WC) Fall 4:13</li>\n<li>Champ. Round 2 - Rylee Edwards (Storm Youth WC) won by fall over Sampson Price (Downers Grove WC) Fall 0:50</li>\n<li>Champ. Round 2 - Michael Macias (Marengo Youth WC) won by fall over Roman Melnyk (Pitbull Wrestling Alliance) Fall 0:48</li>\n<li>Champ. Round 2 - Karson Lamb (TJ Trained Wrestling) won by fall over Luke Williams (Edwardsville WC) Fall 1:03</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Champ. Round 2 - Daniel Colunga (Lionheart Intense Wrestling) won by fall over Gene Stringini (The Law) Fall 0:53</li>\n<li>Champ. Round 2 - Ghee Rachal (Harvey Twisters) won by tech fall over Jordan Logan (Team 1006 Wrestling) TF 17-2</li>\n<li>Champ. Round 2 - Dillan Johnson (Force WC) won by fall over Carlos Neri (Granite City Wrestling Association) Fall 2:09</li>\n<li>Champ. Round 2 - Paulie Robertson (Villa-Lombard Cougars) won by fall over Julian Espinosa Lopez (Blackhawk WC) Fall 2:18</li>\n<li>Champ. Round 2 - Jordan Lishman (Tomcat WC) won by decision over Lilijana Reyes (Maddog Wrestling Academy) Dec 9-2</li>\n<li>Champ. Round 2 - Eddie Solis (Marengo Youth WC) won by fall over Rodolfo Flores (Little Rams Wrestling) Fall 0:52</li>\n<li>Champ. Round 2 - Aiden Taylor (Carbondale WC) won by fall over Kevin Olson (Chicago Park District) Fall 2:59</li>\n<li>Champ. Round 2 - Aydan Trueblood (TJ Trained Wrestling) won by fall over Austin Wolfe (Edwardsville WC) Fall 0:18</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Champ. Round 2 - Mason Kelly (Granite City Wrestling Association) won by decision over Alvin Hommel (Blackhawk WC) Dec 4-2</li>\n<li>Champ. Round 2 - Jimmy Liston (Martinez Fox Valley Elite) won by fall over John Davis (Thundercats) Fall 1:19</li>\n<li>Champ. Round 2 - Isaiah Gonzalez (Izzy Style Wrestling) won by decision over Gabriel Smith (Harvey Twisters) Dec 3-2</li>\n<li>Champ. Round 2 - Zackary Hawkins (Harlem Cougars WC) won by fall over Keegan Keller (AJ Junior Wildcats WC) Fall 3:38</li>\n<li>Champ. Round 2 - Vicente Arebalo (Crosstown Spartan Elite WC) won in tie breaker - 1 over Aidan Pinto (Team 1006 Wrestling) TB-1 5-4</li>\n<li>Champ. Round 2 - Andre Hunt (Urbana Tigers WC) won by fall over Morley Coval (Martinez Fox Valley Elite) Fall 1:28</li>\n<li>Champ. Round 2 - Ryan Boersma (Tinley Park Bulldogs) won by fall over Michael Williams (Rambler WC) Fall 2:14</li>\n<li>Champ. Round 2 - Jerred Durian (Fox Valley WC) won by fall over Brian Kyle (Team 1006 Wrestling) Fall 4:28</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Champ. Round 2 - Sterling Campbell (Edwardsville WC) won by fall over Parker Schnoeker (Sparta Junior Bulldogs) Fall 0:21</li>\n<li>Champ. Round 2 - Enzo Martinez (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Champ. Round 2 - Alex Wright (Granite City Wrestling Association) received a bye   () Bye</li>\n<li>Champ. Round 2 - Oran Varela (Unity Youth WC) won by fall over Kaitelyine Tolbert (Murphysboro WC) Fall 0:15</li>\n<li>Champ. Round 2 - Isaiah Hill (O`Fallon Little Panthers WC) won by fall over Chance Ingleman (Unity Youth WC) Fall 1:16</li>\n<li>Champ. Round 2 - Coltin Rau (Dakota WC) won by decision over Anthony Lopez Marquez (Tomcat WC) Dec 5-2</li>\n<li>Champ. Round 2 - Robert Schneider (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Champ. Round 2 - Michael Esquivel (Team 1006 Wrestling) won by fall over Jamison VanVickle (Oakwood Youth WC) Fall 1:30</li>\n</ul>\n</section>",
  "Championship Quarterfinals": "<section class=\"tw-list\">\n<h1>Championship Quarterfinals</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>Quarterfinal - Donny Pigoni (SCN Youth WC) won by decision over Camren French (Mattoon Youth WC) Dec 5-2</li>\n<li>Quarterfinal - Kaden Harman (Golden Eagles WC) won by decision over Cayden Amico (Plainfield WC) Dec 6-0</li>\n<li>Quarterfinal - Deion Johnson (Harvey Twisters) won by decision over Bradley Ruckman (Bulls WC) Dec 5-0</li>\n<li>Quarterfinal - Ty Edwards (Team 1006 Wrestling) won by fall over Jeremy Huf (Arlington Cardinals WC) Fall 2:44</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Quarterfinal - Jerren Gille (DA WC) won by decision over Dominic Recchia (Yorkville WC) Dec 7-4</li>\n<li>Quarterfinal - Tony Keene (Gladiator Elite) won by decision over Javin Jackson-Bey (Harvey Twisters) Dec 7-4</li>\n<li>Quarterfinal - Benjamin Davino (SCN Youth WC) won by decision over Joseph Lathwood (Bulls WC) Dec 5-1</li>\n<li>Quarterfinal - Carson Bissey (Respect Wrestling) won by decision over Damien Flores (Team 1006 Wrestling) Dec 5-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Quarterfinal - Dominick Coronado (Yorkville WC) won by decision over Tommy Hammond (Crystal Lake Wizards) Dec 2-1</li>\n<li>Quarterfinal - William Hupke (SCN Youth WC) won by major decision over Colin Kacena (Bolingbrook Junior Raiders) Maj 12-1</li>\n<li>Quarterfinal - Seth Mendoza (Contender Wrestling) won by fall over Josyah Holland (Harvey Twisters) Fall 2:30</li>\n<li>Quarterfinal - Bryce Durlacher (The Wrestling Factory) won by fall over Liam Fox (Murphysboro WC) Fall 0:21</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Quarterfinal - Jack Ferguson (Yorkville WC) won by decision over Tallen Pawlak (Champaign WC) Dec 8-2</li>\n<li>Quarterfinal - Gonzalo Camacho (Bolingbrook Junior Raiders) won by decision over Joshua Vazquez (Izzy Style Wrestling) Dec 10-5</li>\n<li>Quarterfinal - Michael DiBenedetto (Greg Gomez Trained Wrestling) won by decision over Thomas Silva (DA WC) Dec 3-2</li>\n<li>Quarterfinal - Colby Crouch (Sudden Victory Athletic Center) won by fall over Liam Kelly (Tinley Park Bulldogs) Fall 0:59</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Quarterfinal - Saul Trejo (Gomez Wrestling Academy) won by decision over Harrison Konder (Bolingbrook Junior Raiders) Dec 10-6</li>\n<li>Quarterfinal - Colin Young (DA WC) won by decision over Jake Schwartz (Carlinville WC) Dec 6-2</li>\n<li>Quarterfinal - Edmund Enright (Mustang WC) won by fall over Caleb Nobiling (Lakeland Predators WC) Fall 1:18</li>\n<li>Quarterfinal - Bryce Griffin (Bulls WC) won by fall over Alexander Marre (Izzy Style Wrestling) Fall 3:49</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Quarterfinal - Ricky Ericksen (Vittum Cats of SKT) won by decision over Garrett Luke (Stockton Renegades) Dec 4-1</li>\n<li>Quarterfinal - Tyler Guerra (Gomez Wrestling Academy) won by major decision over Santino Scolaro (SCN Youth WC) Maj 14-4</li>\n<li>Quarterfinal - Connor Munn (Pitbull Wrestling Alliance) won by major decision over Ryan Wojcik (Tinley Park Bulldogs) Maj 14-1</li>\n<li>Quarterfinal - Renzo Morgan (The Wrestling Factory) won by decision over Brendan Tunink (Sauk Valley WC) Dec 3-1</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Quarterfinal - Michael Calcagno (Izzy Style Wrestling) won by major decision over Collin Carrigan (Naperville WC) Maj 10-2</li>\n<li>Quarterfinal - Richard Wade (Gladiator Elite) won by fall over Zane Hulet (Super Soldiers WC) Fall 3:25</li>\n<li>Quarterfinal - Ethan Struck (Crystal Lake Wizards) won by decision over Jaydon Robinson (Harvey Twisters) Dec 3-1</li>\n<li>Quarterfinal - Jackson Gillen (Team 1006 Wrestling) won by fall over Cale Stonitsch (Celtics WC) Fall 4:26</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Quarterfinal - Peter Marinopoulos (Mustang WC) won by decision over Jayden Colon (Gomez Wrestling Academy) Dec 5-4</li>\n<li>Quarterfinal - Zackary Crawford (Sycamore WC) won by decision over Jeremy Loomis (Team 1006 Wrestling) Dec 9-2</li>\n<li>Quarterfinal - Drew Surges (SCN Youth WC) won by fall over Nathan Beltran (Maine Eagles WC) Fall 3:29</li>\n<li>Quarterfinal - Colin Kelly (Tinley Park Bulldogs) won by major decision over Andre Rios (Z`s Team Pena) Maj 10-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Quarterfinal - Griffin Luke (Stockton Renegades) won by fall over Quinn Herbert (Maine Eagles WC) Fall 2:50</li>\n<li>Quarterfinal - Skip Rozanski (Pitbull Wrestling Alliance) won by decision over Luke Christie (Brawlers WC) Dec 3-2</li>\n<li>Quarterfinal - David Mayora (Izzy Style Wrestling) won by fall over Matthew Janiak (Force WC) Fall 3:35</li>\n<li>Quarterfinal - Logan Swaw (Team 1006 Wrestling) won by decision over Garrett Vincent (Dakota WC) Dec 9-6</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Quarterfinal - Jack Lesher (SCN Youth WC) won by decision over Antwan Strong (East St. Louis Wrestling) Dec 12-8</li>\n<li>Quarterfinal - Kyle Lindsey (Oak Forest Warriors) won by fall over Declan Fortuna (Izzy Style Wrestling) Fall 3:26</li>\n<li>Quarterfinal - Jack Seacrist (Belvidere Bandits WC) won by fall over Cor`ron Midgett (East St. Louis Wrestling) Fall 2:28</li>\n<li>Quarterfinal - Kamron Beal (Tinley Park Bulldogs) won by decision over Anthony Alansari (Scorpion WC) Dec 7-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Quarterfinal - Abraham Wojcikiewicz (Bulls WC) won by decision over Jack Smialowicz (Pitbull Wrestling Alliance) Dec 1-0</li>\n<li>Quarterfinal - Billy Lindsey (Oak Forest Warriors) won by major decision over Joshua Franklin (UP Town WC) Maj 14-0</li>\n<li>Quarterfinal - Aidan Blackburn (Mattoon Youth WC) won by tech fall over Blake Maday (Gomez Wrestling Academy) TF 16-0</li>\n<li>Quarterfinal - Elijah Munoz (Team 1006 Wrestling) won by fall over Jalen Curtis (Greg Gomez Trained Wrestling) Fall 2:10</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Quarterfinal - Gus Cambier (Sycamore WC) won by fall over Jovon Johnson (Lincoln-Way WC) Fall 1:28</li>\n<li>Quarterfinal - Logan Nance (Vandalia Jr WC) won by decision over Matthew Kubas (Grayslake WC) Dec 8-1</li>\n<li>Quarterfinal - William Strelow (Oak Forest Warriors) won by decision over Luke Liberatore (Bolingbrook Junior Raiders) Dec 3-2</li>\n<li>Quarterfinal - Devin Medina (Greg Gomez Trained Wrestling) won by decision over Joseph Scrivani (Golden Eagles WC) Dec 8-1</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Quarterfinal - David Stewart (Blackhawk WC) won by major decision over Micheal Brown (Harvey Twisters) Maj 9-0</li>\n<li>Quarterfinal - Ayden Salley (Barrington Broncos WC) won by fall over Gavin Brown (Oak Forest Warriors) Fall 2:21</li>\n<li>Quarterfinal - Daniel Gonzalez (Batavia WC) won by decision over Conor Phelan (Badger WC) Dec 6-4</li>\n<li>Quarterfinal - Dominic Thebeau (East St. Louis Wrestling) won by decision over Brian Petrancosta (Gomez Wrestling Academy) Dec 7-0</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Quarterfinal - Aaron Hernandez (Pitbull Wrestling Alliance) won by major decision over Hudson McMann (Junior Cyclones WC) Maj 12-2</li>\n<li>Quarterfinal - Sean Scheck (Batavia WC) won by decision over Josh Kroll (Dinamo Wrestling) Dec 11-5</li>\n<li>Quarterfinal - Edward Perry (SCN Youth WC) won by fall over Calvin Hempel (Storm Youth WC) Fall 4:07</li>\n<li>Quarterfinal - Jackson Barnhart (Champaign WC) won by decision over Montana Calderon (Tomcat WC) Dec 6-1</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Quarterfinal - Adam Lambaz (Scorpion WC) won by fall over Justin Hoffer (Super Soldiers WC) Fall 3:12</li>\n<li>Quarterfinal - Myles Reardon (Quincy Cyclones WC) won by decision over Mason Bernabe (Harlem Cougars WC) Dec 2-1</li>\n<li>Quarterfinal - Tyler Michelini (Elk Grove Junior Grens) won by fall over Takyla Watkins (Danville Chargers) Fall 0:45</li>\n<li>Quarterfinal - Lee Smith (DA WC) won by decision over Braden Hunter (Team 1006 Wrestling) Dec 1-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Quarterfinal - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Jack Mosier (Barrington Broncos WC) Fall 0:31</li>\n<li>Quarterfinal - Robert Rigg (Charleston WC) won by fall over Ryan Clancy (Crosstown Spartan Elite WC) Fall 2:18</li>\n<li>Quarterfinal - Noah Carl (Cumberland Youth WC) won by fall over Alexis Correa (DuPage WC) Fall 2:17</li>\n<li>Quarterfinal - Ricardo Townsend (Lionheart Intense Wrestling) won by fall over Reede Johnson (HF Elite WC) Fall 0:26</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Quarterfinal - Brayden Teunissen (Belvidere Bandits WC) won by decision over Brady Phelps (Arlington Cardinals WC) Dec 5-3</li>\n<li>Quarterfinal - Nore Turner (Lincoln-Way WC) won by major decision over Cory Zator (Lemont Bears WC) Maj 11-0</li>\n<li>Quarterfinal - Rocco Hayes (Contender Wrestling) won by major decision over Evan Gosz (Arlington Cardinals WC) Maj 11-2</li>\n<li>Quarterfinal - Jase Salin (Celtics WC) won by decision over Nicholas Garcia (Gomez Wrestling Academy) Dec 7-2</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Quarterfinal - Dominic Ducato (Golden Eagles WC) won in sudden victory - 1 over Inocencio Garcia (Force WC) SV-1 4-2</li>\n<li>Quarterfinal - Trevor Silzer (Tinley Park Bulldogs) won by decision over Dominic Schiavone (Izzy Style Wrestling) Dec 4-2</li>\n<li>Quarterfinal - Colden Dyer (SCN Youth WC) won by decision over Jaymz Young (East St. Louis Wrestling) Dec 1-0</li>\n<li>Quarterfinal - Brady Grennan (Sauk Valley WC) won by decision over Karter Guzman (Headlock Wrestling Academy) Dec 7-0</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Quarterfinal - Benjamin Dunne (Izzy Style Wrestling) won by decision over Pierre Baldwin (Proviso Power House WC) Dec 7-2</li>\n<li>Quarterfinal - Jacob Crandall (Arlington Cardinals WC) won in tie breaker - 1 over Reef Pacot (Storm Youth WC) TB-1 5-4</li>\n<li>Quarterfinal - Shay Korhorn (Force WC) won by major decision over Tyler Evans (Wolves WC) Maj 9-1</li>\n<li>Quarterfinal - William Baysingar (Arlington Cardinals WC) won by fall over Jesus Herrera (Mustang WC) Fall 4:20</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Quarterfinal - Phoenix Blakely (Dakota WC) won by decision over Isaac Bourge (Team 1006 Wrestling) Dec 7-0</li>\n<li>Quarterfinal - Logan Kuhel-trimmer (Force WC) won by decision over Maddox Khalimsky (Arlington Cardinals WC) Dec 3-0</li>\n<li>Quarterfinal - Daniel Sheen (Izzy Style Wrestling) won by decision over Gylon Sims (Force WC) Dec 7-4</li>\n<li>Quarterfinal - Chase Hall (Triad Little Knights WC) won by decision over Joshua Glover (Crystal Lake Wizards) Dec 3-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Quarterfinal - Brady Foster (Mattoon Youth WC) won by decision over Tegan Chumbley (SCN Youth WC) Dec 6-0</li>\n<li>Quarterfinal - Matthew Hollingsworth (Lincoln-Way WC) won by major decision over Kai Neumark (Arlington Cardinals WC) Maj 10-2</li>\n<li>Quarterfinal - Antonio Alvarado (Crystal Lake Wizards) won by decision over Caelan Riley (The Wrestling Factory) Dec 4-2</li>\n<li>Quarterfinal - Kannon Webster (Super Soldiers WC) won by decision over Mason Alessio (Force WC) Dec 6-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Quarterfinal - Joseph Fernau (Izzy Style Wrestling) won by decision over Conor Smetana (Rogue Wrestling) Dec 4-0</li>\n<li>Quarterfinal - Dillon Carlson (Crystal Lake Wizards) won by major decision over Kenneth Siwicki (Naperville WC) Maj 11-2</li>\n<li>Quarterfinal - Nasir Bailey (Harvey Twisters) won by fall over Brian Beers (The Wrestling Factory) Fall 2:21</li>\n<li>Quarterfinal - Santino Robinson (Wrestling 365) won by decision over Jacob Macatangay (Force WC) Dec 8-4</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Quarterfinal - Nicholas Renteria (Beat the Streets-Chicago) won by fall over Brayden Peet (Sycamore WC) Fall 3:46</li>\n<li>Quarterfinal - Ethan Stiles (Izzy Style Wrestling) won by decision over Tyler Perry (Batavia WC) Dec 5-0</li>\n<li>Quarterfinal - Carter Hall (Champaign WC) won by decision over Sean Conway (Team 312) Dec 6-5</li>\n<li>Quarterfinal - Jordan Blew (Force WC) won by decision over Marcus Milianti (Panther WC) Dec 9-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Quarterfinal - Dylan Gvillo (Edwardsville WC) won in tie breaker - 1 over Tyler Casey (TJ Trained Wrestling) TB-1 2-1</li>\n<li>Quarterfinal - Vincent Robinson (Harvey Twisters) won by decision over Dillon Schueler (Sauk Valley WC) Dec 10-3</li>\n<li>Quarterfinal - Aj Heeg (Beat the Streets-Chicago) won by fall over Dominik Mallinder (Izzy Style Wrestling) Fall 4:01</li>\n<li>Quarterfinal - Luis Bazan (Bolingbrook Junior Raiders) won by decision over Carlos Munoz-Flores (Team 1006 Wrestling) Dec 3-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Quarterfinal - Andrew Johnson (Team 1006 Wrestling) won by decision over Joseph Olalde (Gomez Wrestling Academy) Dec 6-3</li>\n<li>Quarterfinal - Shawn Minick (Bulls WC) won by decision over Tyler Simmer (Dakota WC) Dec 5-4</li>\n<li>Quarterfinal - Korina Blades (Martinez Fox Valley Elite) won by decision over Nate Pacetti (Panther WC) Dec 6-1</li>\n<li>Quarterfinal - Michael Kelly (Tinley Park Bulldogs) won by decision over Will Rude (Sauk Valley WC) Dec 3-2</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Quarterfinal - Joaquin Miranda (Crystal Lake Wizards) won by decision over Nathaniel Dampier (Gladiator Elite) Dec 6-5</li>\n<li>Quarterfinal - Jared Gumila (Force WC) won by fall over Aidan Linden (nWo WC) Fall 1:22</li>\n<li>Quarterfinal - Jacob Whiting (Lake Zurich Cubs WC) won in SV-1 by fall over Michael Gentile (Beat the Streets-Chicago) SV-1 (Fall) 5:08</li>\n<li>Quarterfinal - Kole Brower (Moline WC) won by major decision over Rashon Allen (Urbana Tigers WC) Maj 13-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Quarterfinal - Owen Gerdes (Force WC) won by decision over Parker Terronez (Moline WC) Dec 6-3</li>\n<li>Quarterfinal - Damien Lopez (Dekalb WC) won by decision over Will Collins (North Shore Edge) Dec 3-1</li>\n<li>Quarterfinal - Brody Hallin (Crystal Lake Wizards) won by fall over Alexander Miranda (Bulls WC) Fall 0:23</li>\n<li>Quarterfinal - Tyrin Newsome (Urbana Tigers WC) won by decision over Lance Belshaw (Quincy Cyclones WC) Dec 7-0</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Quarterfinal - Wyatt Raab (The Law) won by fall over Mateo Villalobos (Zee-Bee Stingers) Fall 2:16</li>\n<li>Quarterfinal - Bradley Gillum (Dekalb WC) won by decision over Elijah Chiaro (SCN Youth WC) Dec 3-1</li>\n<li>Quarterfinal - Shane Moran (Crystal Lake Wizards) won by decision over Iysten Syfert (Cumberland Youth WC) Dec 7-0</li>\n<li>Quarterfinal - Brayden Thompson (nWo WC) won by fall over Connor Brooker (Thundercats) Fall 4:05</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Quarterfinal - Alexander Tagler (Lemont Bears WC) won by decision over Evan Smith (Force WC) Dec 11-4</li>\n<li>Quarterfinal - Marshal Cunz (Harlem Cougars WC) won by major decision over Armond Edwards (O`Fallon Little Panthers WC) Maj 15-4</li>\n<li>Quarterfinal - Aidan Kyllonen (Brawlers WC) won by decision over Moisey Trimble (Belleville Little Devils WC) Dec 13-8</li>\n<li>Quarterfinal - Kennedy Blades (Martinez Fox Valley Elite) won by decision over Owen Jacobson (Tinley Park Bulldogs) Dec 8-3</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Quarterfinal - Christopher Carr (Martinez Fox Valley Elite) won by fall over Hakupo`mai Watson (Crosstown Spartan Elite WC) Fall 1:59</li>\n<li>Quarterfinal - Alexander Goworowski (Team 312) won by major decision over Craig Johnson (Danville Chargers) Maj 8-0</li>\n<li>Quarterfinal - Antonio Torres (nWo WC) won by fall over Jordan Sommers (Waterloo Bulldog Wrestling) Fall 1:00</li>\n<li>Quarterfinal - Jokiah Sewell (Hawk WC) won by decision over Tyler Haynes (Pekin Boys &amp; Girls Club) Dec 11-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Quarterfinal - Braeden Tosterud (Elk Grove Junior Grens) won by decision over Hunter Powell (Force WC) Dec 6-1</li>\n<li>Quarterfinal - Brandon Navarro (nWo WC) won by fall over Kaden Marmon (Triad Little Knights WC) Fall 4:21</li>\n<li>Quarterfinal - Kylen Rose (Roughnecks WC) won by fall over Jake Ziemniarski (Force WC) Fall 1:13</li>\n<li>Quarterfinal - Nathaniel Dutkin (Wolves WC) won by fall over Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) Fall 3:35</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Quarterfinal - Elliott Lewis (Tinley Park Bulldogs) won by fall over Aidan Avilez (Martinez Fox Valley Elite) Fall 4:10</li>\n<li>Quarterfinal - John Pacewic (Force WC) won by fall over Michael Bridgeman (Roughnecks WC) Fall 0:58</li>\n<li>Quarterfinal - Rylee Edwards (Storm Youth WC) won by fall over Colin O`Neill (Wolfpak WC) Fall 2:56</li>\n<li>Quarterfinal - Michael Macias (Marengo Youth WC) won in sudden victory - 1 over Karson Lamb (TJ Trained Wrestling) SV-1 3-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Quarterfinal - Ghee Rachal (Harvey Twisters) won by fall over Daniel Colunga (Lionheart Intense Wrestling) Fall 3:55</li>\n<li>Quarterfinal - Dillan Johnson (Force WC) won by decision over Paulie Robertson (Villa-Lombard Cougars) Dec 1-0</li>\n<li>Quarterfinal - Eddie Solis (Marengo Youth WC) won by major decision over Jordan Lishman (Tomcat WC) Maj 14-1</li>\n<li>Quarterfinal - Aydan Trueblood (TJ Trained Wrestling) won by fall over Aiden Taylor (Carbondale WC) Fall 1:14</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Quarterfinal - Jimmy Liston (Martinez Fox Valley Elite) won in tie breaker - 1 over Mason Kelly (Granite City Wrestling Association) TB-1 4-3</li>\n<li>Quarterfinal - Isaiah Gonzalez (Izzy Style Wrestling) won by fall over Zackary Hawkins (Harlem Cougars WC) Fall 3:53</li>\n<li>Quarterfinal - Vicente Arebalo (Crosstown Spartan Elite WC) won by decision over Andre Hunt (Urbana Tigers WC) Dec 3-0</li>\n<li>Quarterfinal - Ryan Boersma (Tinley Park Bulldogs) won by fall over Jerred Durian (Fox Valley WC) Fall 2:53</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Quarterfinal - Sterling Campbell (Edwardsville WC) won by fall over Enzo Martinez (Crystal Lake Wizards) Fall 0:58</li>\n<li>Quarterfinal - Oran Varela (Unity Youth WC) won by fall over Alex Wright (Granite City Wrestling Association) Fall 2:29</li>\n<li>Quarterfinal - Isaiah Hill (O`Fallon Little Panthers WC) won by fall over Coltin Rau (Dakota WC) Fall 2:46</li>\n<li>Quarterfinal - Robert Schneider (Tinley Park Bulldogs) won by fall over Michael Esquivel (Team 1006 Wrestling) Fall 2:46</li>\n</ul>\n</section>",
  "Consolation Preliminary": "<section class=\"tw-list\">\n<h1>Consolation Preliminary</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 1 - Michael Esteban (Beat the Streets-Chicago) received a bye   () Bye</li>\n<li>Cons. Round 1 - Robye Williams (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Juvontae Williams (Lionheart Intense Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Madden Parker (Contender Wrestling) received a bye   () Bye</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 1 - Raymond Cavey (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ashton Hobson (Batavia WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Tourdot (Rochelle WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Grant Madl (Elk Grove Junior Grens) won by decision over Emmett Nelson (Richmond WC) Dec 2-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 1 - Blue Bishop (Wrestling Inc) won by major decision over Damian Valdez (Headlock Wrestling Academy) Maj 9-0</li>\n<li>Cons. Round 1 - Joel Muehlenbeck (Arlington Cardinals WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colin Thompson (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jovan Williams (Harvey Twisters) received a bye   () Bye</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 1 - Jackson Smith (Lemont Bears WC) won by fall over Brayden Swanson (Team No Ego WC) Fall 0:58</li>\n<li>Cons. Round 1 - Evan Willock (TJ Trained Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gunnar Garelli (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jameson Garcia (Gomez Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 1 - Sam Schuit (Lemont Bears WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Camden Rogers (Oak Forest Warriors) received a bye   () Bye</li>\n<li>Cons. Round 1 - James Wright (Golden Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zach Kruse (Hinsdale Red Devil WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 1 - Owen Miller (Vandalia Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Zeke Rhodes (Sudden Victory Athletic Center) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caleb Ohnesorge (Gladiator Elite) won by fall over Pedro Jimenez (Crystal Lake Wizards) Fall 2:18</li>\n<li>Cons. Round 1 - Brandon Krier (nWo WC) won by decision over Marcus Godfrey (Lincoln-Way WC) Dec 6-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 1 - Drew Torza (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aiden Livingston (Stillman Valley WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Drew Landau (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Brody Murray (SCN Youth WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 1 - Eric Gustafson (Moline WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Marquan Shaw (Lionheart Intense Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Dillon Raab (The Law) received a bye   () Bye</li>\n<li>Cons. Round 1 - Isaiah Hayes (Mt. Zion Kids WC) won by fall over Eric McKinney (Vandalia Jr WC) Fall 3:29</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 1 - Jackson Godinez (Super Soldiers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Phillips (SCN Youth WC) won by decision over Griffin Goddard (Champaign WC) Dec 4-2</li>\n<li>Cons. Round 1 - Caden Casimino (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Silvano Spatafora (Fox Valley WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 1 - Blake Hinrichsen (Super Soldiers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gabe Eckerd (Hawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Domanic Abeja (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Leo Meyer (Mattoon Youth WC) won by fall over Luke Kelly (Lockport Junior Porters WC) Fall 0:44</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 1 - Mason Sarnes (Pekin Boys &amp; Girls Club) received a bye   () Bye</li>\n<li>Cons. Round 1 - Joshua Taylor (Scorpion WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gabriel Alvarez (Beat the Streets-Chicago) received a bye   () Bye</li>\n<li>Cons. Round 1 - Javier Hurtado (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 1 - Kenwyn Horne (East St. Louis Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Charles Koeppen (Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Kopecky (Maine Eagles WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Jens (Grayslake WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 1 - Austin Hale (Granite City Wrestling Association) won by fall over Hudson Nevel (The Law) Fall 0:42</li>\n<li>Cons. Round 1 - Gable Carrick (Sycamore WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - William Ardson (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Benjamin Alvarez (Team 1006 Wrestling) won by fall over Elizabeth Ruter (Hawk WC) Fall 0:24</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 1 - Tommy Isitt (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Noah Wenzel (Dakota WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Trystin Crossen (O`Fallon Little Panthers WC) won by fall over Anthony Garcia (Badger WC) Fall 0:20</li>\n<li>Cons. Round 1 - Raymond Hughes (Golden Eagles WC) won by decision over Alex Pasquale (Lemont Bears WC) Dec 5-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 1 - Amarion Ellison (Storm Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jarvelon Brown (Lincoln-Way WC) won by fall over Jenaro Sepeda (Moline WC) Fall 0:29</li>\n<li>Cons. Round 1 - Kiara Ganey (Belleville Little Devils WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Lincoln Cooley (Sycamore WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 1 - Nathan Macias (Greg Gomez Trained Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 1 - Maxwell Wade (Gladiator Elite) received a bye   () Bye</li>\n<li>Cons. Round 1 - Rocky Seibel (Belleville Little Devils WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caleb Scott (Bulls WC) won by major decision over Brayden Edwards (Storm Youth WC) Maj 13-1</li>\n<li>Cons. Round 1 - Chazz Robinson (Harvey Twisters) won by decision over Joseph Young (DA WC) Dec 8-4</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 1 - Ayden Braddy (Road Warriors WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Luke Burgess (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Grant Stender (Hawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Soltis (Lincoln-Way WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 1 - Dylan Boyd (Granite City Wrestling Association) won by decision over Aidan Baker (Contender Wrestling) Dec 8-2</li>\n<li>Cons. Round 1 - J Guido Pigoni (SCN Youth WC) won in sudden victory - 1 over Solomon Gilliam (Villa-Lombard Cougars) SV-1 6-4</li>\n<li>Cons. Round 1 - Tomas Aguilar (Tomcat WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nicholas Fetters (Belleville Little Devils WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 1 - Paul Woo (Villa-Lombard Cougars) received a bye   () Bye</li>\n<li>Cons. Round 1 - Owen Dunlap (Tinley Park Bulldogs) won by major decision over Joshua Biagini (TJ Trained Wrestling) Maj 11-0</li>\n<li>Cons. Round 1 - Christopher Moore (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Robert Bonilla (Vittum Cats of SKT) received a bye   () Bye</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 1 - Nicolas Davidson (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ashton Rice (Super Soldiers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Evan Schiffman (Lemont Bears WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Griffin Duffin (Mustang WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 1 - Caden Muselman (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Henry Coughlin (Tinley Park Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Maddux Blakely (Dakota WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Caleb Nadig (DA WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 1 - Arojae Hart (AJ Junior Wildcats WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Bauer (Edwardsville WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jake Zator (Lemont Bears WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - James Marre (Gomez Wrestling Academy) received a bye   () Bye</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 1 - Cooper Schodrof (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Matthew Boyer (North Shore Edge) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cruz Ibarra (nWo WC) won by decision over Elliott Diemel (Hononegah WC) Dec 5-3</li>\n<li>Cons. Round 1 - Caden Lendman (Belvidere Bandits WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 1 - Kenyon Boyce (Harvey Twisters) won by major decision over Hunter Milam (Pontiac WC) Maj 18-5</li>\n<li>Cons. Round 1 - Alec Mihelic (Super Soldiers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - William Dahm (Belleville Little Devils WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tavius Hosley (Unity Youth WC) won by fall over Luke Schultz (O`Fallon Little Panthers WC) Fall 0:32</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 1 - Troy Mutz (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thomas Boland (Panther WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Benjamin Mitchell (Highland Bulldog Jr WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Colton Carlisle (Bulls WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 1 - Wade Abrams (Cary-Grove Matmen) received a bye   () Bye</li>\n<li>Cons. Round 1 - Nathan Chirillo (Tinley Park Bulldogs) won by major decision over Hunter Janeczko (Yorkville WC) Maj 16-3</li>\n<li>Cons. Round 1 - Braden Stauffenberg (Izzy Style Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Cole Brannigan (Lemont Bears WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 1 - Brandon Lloyd (Waterloo Bulldog Wrestling) won by major decision over Maverick Mcalpine (Team 1006 Wrestling) Maj 14-2</li>\n<li>Cons. Round 1 - Jacob Liberatore (Bolingbrook Junior Raiders) won by fall over Ivan Corral (Oak Forest Warriors) Fall 0:44</li>\n<li>Cons. Round 1 - Aidan O`Connor (Celtics WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Mannix Faworski (DA WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 1 - Nicolas Gagliani (Junior Cougar WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jacob Bottarini (SCN Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Ryan Gopin (Barrington Broncos WC) won by fall over Thomas Figueroa (Hononegah WC) Fall 2:09</li>\n<li>Cons. Round 1 - Eathin Diveley (DA WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 1 - Seth Brooks (Granite City Wrestling Association) won by fall over Jackson Funderburg (Sycamore WC) Fall 2:37</li>\n<li>Cons. Round 1 - Jacob Bell (Belvidere Bandits WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Jc Piker (Brawlers WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Thaddeus Gianaris (Maine Eagles WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 1 - Connor Barnes (Peoria Heights Minutemen WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Maximus Blamey (Crystal Lake Wizards) received a bye   () Bye</li>\n<li>Cons. Round 1 - Giovanni Amaya (Blackhawk WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Tyler Wilms (Lemont Bears WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 1 - Gavin Mason (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Max Terlap (The Wrestling Factory) received a bye   () Bye</li>\n<li>Cons. Round 1 - Sampson Price (Downers Grove WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Roman Melnyk (Pitbull Wrestling Alliance) received a bye   () Bye</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 1 - Jordan Logan (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Carlos Neri (Granite City Wrestling Association) received a bye   () Bye</li>\n<li>Cons. Round 1 - Rodolfo Flores (Little Rams Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Austin Wolfe (Edwardsville WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 1 - John Davis (Thundercats) received a bye   () Bye</li>\n<li>Cons. Round 1 - Gabriel Smith (Harvey Twisters) received a bye   () Bye</li>\n<li>Cons. Round 1 - Aidan Pinto (Team 1006 Wrestling) received a bye   () Bye</li>\n<li>Cons. Round 1 - Michael Williams (Rambler WC) received a bye   () Bye</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 1 - Parker Schnoeker (Sparta Junior Bulldogs) received a bye   () Bye</li>\n<li>Cons. Round 1 - Kaitelyine Tolbert (Murphysboro WC) received a bye   () Bye</li>\n<li>Cons. Round 1 - Chance Ingleman (Unity Youth WC) received a bye   () Bye</li>\n<li>Cons. Round 1 -   () received a bye   () Bye</li>\n</ul>\n</section>",
  "Consolation 1st Round": "<section class=\"tw-list\">\n<h1>Consolation 1st Round</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Round 2 - Camren French (Mattoon Youth WC) won by decision over Michael Esteban (Beat the Streets-Chicago) Dec 8-5</li>\n<li>Cons. Round 2 - Cayden Amico (Plainfield WC) won by fall over Robye Williams (Harvey Twisters) Fall 1:03</li>\n<li>Cons. Round 2 - Juvontae Williams (Lionheart Intense Wrestling) won in sudden victory - 1 over Bradley Ruckman (Bulls WC) SV-1 6-4</li>\n<li>Cons. Round 2 - Jeremy Huf (Arlington Cardinals WC) won by decision over Madden Parker (Contender Wrestling) Dec 9-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Round 2 - Raymond Cavey (SCN Youth WC) won by fall over Dominic Recchia (Yorkville WC) Fall 4:09</li>\n<li>Cons. Round 2 - Javin Jackson-Bey (Harvey Twisters) won by major decision over Ashton Hobson (Batavia WC) Maj 12-3</li>\n<li>Cons. Round 2 - Joseph Lathwood (Bulls WC) won by decision over Thomas Tourdot (Rochelle WC) Dec 4-2</li>\n<li>Cons. Round 2 - Grant Madl (Elk Grove Junior Grens) won by fall over Damien Flores (Team 1006 Wrestling) Fall 0:57</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Round 2 - Blue Bishop (Wrestling Inc) won by decision over Tommy Hammond (Crystal Lake Wizards) Dec 4-2</li>\n<li>Cons. Round 2 - Joel Muehlenbeck (Arlington Cardinals WC) won by decision over Colin Kacena (Bolingbrook Junior Raiders) Dec 3-2</li>\n<li>Cons. Round 2 - Josyah Holland (Harvey Twisters) won by decision over Colin Thompson (SCN Youth WC) Dec 4-2</li>\n<li>Cons. Round 2 - Liam Fox (Murphysboro WC) won by decision over Jovan Williams (Harvey Twisters) Dec 5-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Round 2 - Jackson Smith (Lemont Bears WC) won by fall over Tallen Pawlak (Champaign WC) Fall 2:27</li>\n<li>Cons. Round 2 - Joshua Vazquez (Izzy Style Wrestling) won by decision over Evan Willock (TJ Trained Wrestling) Dec 10-6</li>\n<li>Cons. Round 2 - Thomas Silva (DA WC) won by decision over Gunnar Garelli (Izzy Style Wrestling) Dec 6-2</li>\n<li>Cons. Round 2 - Jameson Garcia (Gomez Wrestling Academy) won by decision over Liam Kelly (Tinley Park Bulldogs) Dec 6-1</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Round 2 - Harrison Konder (Bolingbrook Junior Raiders) won by decision over Sam Schuit (Lemont Bears WC) Dec 6-0</li>\n<li>Cons. Round 2 - Jake Schwartz (Carlinville WC) won by fall over Camden Rogers (Oak Forest Warriors) Fall 3:42</li>\n<li>Cons. Round 2 - Caleb Nobiling (Lakeland Predators WC) won by decision over James Wright (Golden Eagles WC) Dec 3-0</li>\n<li>Cons. Round 2 - Alexander Marre (Izzy Style Wrestling) won by decision over Zach Kruse (Hinsdale Red Devil WC) Dec 9-3</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Round 2 - Garrett Luke (Stockton Renegades) won by fall over Owen Miller (Vandalia Jr WC) Fall 2:54</li>\n<li>Cons. Round 2 - Santino Scolaro (SCN Youth WC) won by fall over Zeke Rhodes (Sudden Victory Athletic Center) Fall 4:26</li>\n<li>Cons. Round 2 - Caleb Ohnesorge (Gladiator Elite) won by major decision over Ryan Wojcik (Tinley Park Bulldogs) Maj 10-2</li>\n<li>Cons. Round 2 - Brendan Tunink (Sauk Valley WC) won by major decision over Brandon Krier (nWo WC) Maj 14-0</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Round 2 - Collin Carrigan (Naperville WC) won by decision over Drew Torza (Team 1006 Wrestling) Dec 1-0</li>\n<li>Cons. Round 2 - Aiden Livingston (Stillman Valley WC) won by decision over Zane Hulet (Super Soldiers WC) Dec 3-2</li>\n<li>Cons. Round 2 - Jaydon Robinson (Harvey Twisters) won in sudden victory - 1 over Drew Landau (Edwardsville WC) SV-1 8-6</li>\n<li>Cons. Round 2 - Brody Murray (SCN Youth WC) won by decision over Cale Stonitsch (Celtics WC) Dec 5-4</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Round 2 - Eric Gustafson (Moline WC) won by injury default over Jayden Colon (Gomez Wrestling Academy) Inj. 0:00</li>\n<li>Cons. Round 2 - Jeremy Loomis (Team 1006 Wrestling) won by fall over Marquan Shaw (Lionheart Intense Wrestling) Fall 3:57</li>\n<li>Cons. Round 2 - Dillon Raab (The Law) won by injury default over Nathan Beltran (Maine Eagles WC) Inj. 1:54</li>\n<li>Cons. Round 2 - Isaiah Hayes (Mt. Zion Kids WC) won by decision over Andre Rios (Z`s Team Pena) Dec 5-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Round 2 - Quinn Herbert (Maine Eagles WC) won by decision over Jackson Godinez (Super Soldiers WC) Dec 4-3</li>\n<li>Cons. Round 2 - Luke Christie (Brawlers WC) won by major decision over Michael Phillips (SCN Youth WC) Maj 10-2</li>\n<li>Cons. Round 2 - Matthew Janiak (Force WC) won by decision over Caden Casimino (Crystal Lake Wizards) Dec 4-1</li>\n<li>Cons. Round 2 - Garrett Vincent (Dakota WC) won by tech fall over Silvano Spatafora (Fox Valley WC) TF 16-0</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Round 2 - Blake Hinrichsen (Super Soldiers WC) won by decision over Antwan Strong (East St. Louis Wrestling) Dec 10-3</li>\n<li>Cons. Round 2 - Declan Fortuna (Izzy Style Wrestling) won by decision over Gabe Eckerd (Hawk WC) Dec 11-4</li>\n<li>Cons. Round 2 - Domanic Abeja (Tinley Park Bulldogs) won in sudden victory - 1 over Cor`ron Midgett (East St. Louis Wrestling) SV-1 6-5</li>\n<li>Cons. Round 2 - Anthony Alansari (Scorpion WC) won by fall over Leo Meyer (Mattoon Youth WC) Fall 3:17</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Round 2 - Jack Smialowicz (Pitbull Wrestling Alliance) won by fall over Mason Sarnes (Pekin Boys &amp; Girls Club) Fall 1:04</li>\n<li>Cons. Round 2 - Joshua Franklin (UP Town WC) won by fall over Joshua Taylor (Scorpion WC) Fall 1:28</li>\n<li>Cons. Round 2 - Gabriel Alvarez (Beat the Streets-Chicago) won by decision over Blake Maday (Gomez Wrestling Academy) Dec 7-2</li>\n<li>Cons. Round 2 - Jalen Curtis (Greg Gomez Trained Wrestling) won by decision over Javier Hurtado (Pitbull Wrestling Alliance) Dec 6-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Round 2 - Jovon Johnson (Lincoln-Way WC) won by fall over Kenwyn Horne (East St. Louis Wrestling) Fall 3:57</li>\n<li>Cons. Round 2 - Matthew Kubas (Grayslake WC) won by fall over Charles Koeppen (Panther WC) Fall 3:55</li>\n<li>Cons. Round 2 - Luke Liberatore (Bolingbrook Junior Raiders) won by major decision over Michael Kopecky (Maine Eagles WC) Maj 10-0</li>\n<li>Cons. Round 2 - Joseph Scrivani (Golden Eagles WC) won by major decision over Matthew Jens (Grayslake WC) Maj 10-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Round 2 - Austin Hale (Granite City Wrestling Association) won by fall over Micheal Brown (Harvey Twisters) Fall 2:24</li>\n<li>Cons. Round 2 - Gavin Brown (Oak Forest Warriors) won by decision over Gable Carrick (Sycamore WC) Dec 3-1</li>\n<li>Cons. Round 2 - Conor Phelan (Badger WC) won by fall over William Ardson (Izzy Style Wrestling) Fall 2:25</li>\n<li>Cons. Round 2 - Benjamin Alvarez (Team 1006 Wrestling) won by decision over Brian Petrancosta (Gomez Wrestling Academy) Dec 4-2</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Round 2 - Hudson McMann (Junior Cyclones WC) won by fall over Tommy Isitt (Team 1006 Wrestling) Fall 1:29</li>\n<li>Cons. Round 2 - Josh Kroll (Dinamo Wrestling) won by decision over Noah Wenzel (Dakota WC) Dec 6-2</li>\n<li>Cons. Round 2 - Calvin Hempel (Storm Youth WC) won by fall over Trystin Crossen (O`Fallon Little Panthers WC) Fall 2:18</li>\n<li>Cons. Round 2 - Montana Calderon (Tomcat WC) won by fall over Raymond Hughes (Golden Eagles WC) Fall 3:35</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Round 2 - Justin Hoffer (Super Soldiers WC) won by fall over Amarion Ellison (Storm Youth WC) Fall 2:49</li>\n<li>Cons. Round 2 - Jarvelon Brown (Lincoln-Way WC) won by decision over Mason Bernabe (Harlem Cougars WC) Dec 2-1</li>\n<li>Cons. Round 2 - Takyla Watkins (Danville Chargers) won by fall over Kiara Ganey (Belleville Little Devils WC) Fall 2:22</li>\n<li>Cons. Round 2 - Braden Hunter (Team 1006 Wrestling) won by decision over Lincoln Cooley (Sycamore WC) Dec 1-0</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Round 2 - Jack Mosier (Barrington Broncos WC) won by fall over Nathan Macias (Greg Gomez Trained Wrestling) Fall 2:13</li>\n<li>Cons. Round 2 - Ryan Clancy (Crosstown Spartan Elite WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Alexis Correa (DuPage WC) received a bye   () Bye</li>\n<li>Cons. Round 2 - Reede Johnson (HF Elite WC) received a bye   () Bye</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Round 2 - Brady Phelps (Arlington Cardinals WC) won by decision over Maxwell Wade (Gladiator Elite) Dec 6-0</li>\n<li>Cons. Round 2 - Rocky Seibel (Belleville Little Devils WC) won by decision over Cory Zator (Lemont Bears WC) Dec 6-0</li>\n<li>Cons. Round 2 - Caleb Scott (Bulls WC) won by major decision over Evan Gosz (Arlington Cardinals WC) Maj 13-3</li>\n<li>Cons. Round 2 - Nicholas Garcia (Gomez Wrestling Academy) won by fall over Chazz Robinson (Harvey Twisters) Fall 3:41</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Round 2 - Inocencio Garcia (Force WC) won by fall over Ayden Braddy (Road Warriors WC) Fall 1:19</li>\n<li>Cons. Round 2 - Dominic Schiavone (Izzy Style Wrestling) won by decision over Luke Burgess (Izzy Style Wrestling) Dec 7-4</li>\n<li>Cons. Round 2 - Jaymz Young (East St. Louis Wrestling) won by decision over Grant Stender (Hawk WC) Dec 9-3</li>\n<li>Cons. Round 2 - Matthew Soltis (Lincoln-Way WC) won in sudden victory - 1 over Karter Guzman (Headlock Wrestling Academy) SV-1 3-1</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Round 2 - Pierre Baldwin (Proviso Power House WC) won by major decision over Dylan Boyd (Granite City Wrestling Association) Maj 18-4</li>\n<li>Cons. Round 2 - Reef Pacot (Storm Youth WC) won by decision over J Guido Pigoni (SCN Youth WC) Dec 4-2</li>\n<li>Cons. Round 2 - Tyler Evans (Wolves WC) won by fall over Tomas Aguilar (Tomcat WC) Fall 1:57</li>\n<li>Cons. Round 2 - Nicholas Fetters (Belleville Little Devils WC) won by fall over Jesus Herrera (Mustang WC) Fall 1:09</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Round 2 - Paul Woo (Villa-Lombard Cougars) won by decision over Isaac Bourge (Team 1006 Wrestling) Dec 7-0</li>\n<li>Cons. Round 2 - Owen Dunlap (Tinley Park Bulldogs) won by major decision over Maddox Khalimsky (Arlington Cardinals WC) Maj 8-0</li>\n<li>Cons. Round 2 - Gylon Sims (Force WC) won by decision over Christopher Moore (Crystal Lake Wizards) Dec 4-3</li>\n<li>Cons. Round 2 - Joshua Glover (Crystal Lake Wizards) won by fall over Robert Bonilla (Vittum Cats of SKT) Fall 1:25</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Round 2 - Nicolas Davidson (Crystal Lake Wizards) won by decision over Tegan Chumbley (SCN Youth WC) Dec 6-0</li>\n<li>Cons. Round 2 - Kai Neumark (Arlington Cardinals WC) won by tech fall over Ashton Rice (Super Soldiers WC) TF 16-1</li>\n<li>Cons. Round 2 - Evan Schiffman (Lemont Bears WC) won in tie breaker - 1 over Caelan Riley (The Wrestling Factory) TB-1 2-1</li>\n<li>Cons. Round 2 - Mason Alessio (Force WC) won by decision over Griffin Duffin (Mustang WC) Dec 5-3</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Round 2 - Conor Smetana (Rogue Wrestling) won by major decision over Caden Muselman (Tinley Park Bulldogs) Maj 11-0</li>\n<li>Cons. Round 2 - Kenneth Siwicki (Naperville WC) won by decision over Henry Coughlin (Tinley Park Bulldogs) Dec 6-1</li>\n<li>Cons. Round 2 - Brian Beers (The Wrestling Factory) won by fall over Maddux Blakely (Dakota WC) Fall 3:56</li>\n<li>Cons. Round 2 - Jacob Macatangay (Force WC) won by injury default over Caleb Nadig (DA WC) Inj. 3:24</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Round 2 - Brayden Peet (Sycamore WC) won by decision over Arojae Hart (AJ Junior Wildcats WC) Dec 6-5</li>\n<li>Cons. Round 2 - Tyler Perry (Batavia WC) won by decision over Austin Bauer (Edwardsville WC) Dec 3-2</li>\n<li>Cons. Round 2 - Sean Conway (Team 312) won by decision over Jake Zator (Lemont Bears WC) Dec 3-0</li>\n<li>Cons. Round 2 - Marcus Milianti (Panther WC) won by fall over James Marre (Gomez Wrestling Academy) Fall 2:51</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Round 2 - Cooper Schodrof (Izzy Style Wrestling) won by decision over Tyler Casey (TJ Trained Wrestling) Dec 3-1</li>\n<li>Cons. Round 2 - Matthew Boyer (North Shore Edge) won by fall over Dillon Schueler (Sauk Valley WC) Fall 2:48</li>\n<li>Cons. Round 2 - Dominik Mallinder (Izzy Style Wrestling) won by tech fall over Cruz Ibarra (nWo WC) TF 15-0</li>\n<li>Cons. Round 2 - Carlos Munoz-Flores (Team 1006 Wrestling) won by major decision over Caden Lendman (Belvidere Bandits WC) Maj 11-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Round 2 - Kenyon Boyce (Harvey Twisters) won by major decision over Joseph Olalde (Gomez Wrestling Academy) Maj 11-1</li>\n<li>Cons. Round 2 - Alec Mihelic (Super Soldiers WC) won by decision over Tyler Simmer (Dakota WC) Dec 3-0</li>\n<li>Cons. Round 2 - Nate Pacetti (Panther WC) won by decision over William Dahm (Belleville Little Devils WC) Dec 8-2</li>\n<li>Cons. Round 2 - Will Rude (Sauk Valley WC) won by fall over Tavius Hosley (Unity Youth WC) Fall 2:32</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Round 2 - Nathaniel Dampier (Gladiator Elite) won by fall over Troy Mutz (Team 1006 Wrestling) Fall 0:47</li>\n<li>Cons. Round 2 - Thomas Boland (Panther WC) won by fall over Aidan Linden (nWo WC) Fall 1:08</li>\n<li>Cons. Round 2 - Benjamin Mitchell (Highland Bulldog Jr WC) won by decision over Michael Gentile (Beat the Streets-Chicago) Dec 4-3</li>\n<li>Cons. Round 2 - Rashon Allen (Urbana Tigers WC) won by decision over Colton Carlisle (Bulls WC) Dec 4-1</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Round 2 - Wade Abrams (Cary-Grove Matmen) won by decision over Parker Terronez (Moline WC) Dec 9-4</li>\n<li>Cons. Round 2 - Will Collins (North Shore Edge) won by tech fall over Nathan Chirillo (Tinley Park Bulldogs) TF 17-1</li>\n<li>Cons. Round 2 - Braden Stauffenberg (Izzy Style Wrestling) won by fall over Alexander Miranda (Bulls WC) Fall 0:52</li>\n<li>Cons. Round 2 - Cole Brannigan (Lemont Bears WC) won in sudden victory - 1 over Lance Belshaw (Quincy Cyclones WC) SV-1 3-1</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Round 2 - Mateo Villalobos (Zee-Bee Stingers) won by fall over Brandon Lloyd (Waterloo Bulldog Wrestling) Fall 0:35</li>\n<li>Cons. Round 2 - Elijah Chiaro (SCN Youth WC) won by major decision over Jacob Liberatore (Bolingbrook Junior Raiders) Maj 11-3</li>\n<li>Cons. Round 2 - Iysten Syfert (Cumberland Youth WC) won by fall over Aidan O`Connor (Celtics WC) Fall 4:09</li>\n<li>Cons. Round 2 - Connor Brooker (Thundercats) won by decision over Mannix Faworski (DA WC) Dec 4-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Round 2 - Evan Smith (Force WC) won by fall over Nicolas Gagliani (Junior Cougar WC) Fall 1:22</li>\n<li>Cons. Round 2 - Jacob Bottarini (SCN Youth WC) won in sudden victory - 1 over Armond Edwards (O`Fallon Little Panthers WC) SV-1 2-1</li>\n<li>Cons. Round 2 - Moisey Trimble (Belleville Little Devils WC) won by major decision over Ryan Gopin (Barrington Broncos WC) Maj 16-8</li>\n<li>Cons. Round 2 - Owen Jacobson (Tinley Park Bulldogs) won by decision over Eathin Diveley (DA WC) Dec 3-2</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Round 2 - Seth Brooks (Granite City Wrestling Association) won by fall over Hakupo`mai Watson (Crosstown Spartan Elite WC) Fall 2:50</li>\n<li>Cons. Round 2 - Craig Johnson (Danville Chargers) won by fall over Jacob Bell (Belvidere Bandits WC) Fall 4:14</li>\n<li>Cons. Round 2 - Jc Piker (Brawlers WC) won by fall over Jordan Sommers (Waterloo Bulldog Wrestling) Fall 3:41</li>\n<li>Cons. Round 2 - Tyler Haynes (Pekin Boys &amp; Girls Club) won by fall over Thaddeus Gianaris (Maine Eagles WC) Fall 0:52</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Round 2 - Connor Barnes (Peoria Heights Minutemen WC) won by fall over Hunter Powell (Force WC) Fall 2:27</li>\n<li>Cons. Round 2 - Kaden Marmon (Triad Little Knights WC) won by major decision over Maximus Blamey (Crystal Lake Wizards) Maj 13-1</li>\n<li>Cons. Round 2 - Giovanni Amaya (Blackhawk WC) won by decision over Jake Ziemniarski (Force WC) Dec 3-2</li>\n<li>Cons. Round 2 - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by fall over Tyler Wilms (Lemont Bears WC) Fall 2:01</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Round 2 - Gavin Mason (Team 1006 Wrestling) won by fall over Aidan Avilez (Martinez Fox Valley Elite) Fall 3:14</li>\n<li>Cons. Round 2 - Max Terlap (The Wrestling Factory) won by decision over Michael Bridgeman (Roughnecks WC) Dec 3-2</li>\n<li>Cons. Round 2 - Colin O`Neill (Wolfpak WC) won by fall over Sampson Price (Downers Grove WC) Fall 0:36</li>\n<li>Cons. Round 2 - Karson Lamb (TJ Trained Wrestling) won by fall over Roman Melnyk (Pitbull Wrestling Alliance) Fall 4:19</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Round 2 - Daniel Colunga (Lionheart Intense Wrestling) won by fall over Jordan Logan (Team 1006 Wrestling) Fall 0:59</li>\n<li>Cons. Round 2 - Paulie Robertson (Villa-Lombard Cougars) won by fall over Carlos Neri (Granite City Wrestling Association) Fall 0:37</li>\n<li>Cons. Round 2 - Rodolfo Flores (Little Rams Wrestling) won by fall over Jordan Lishman (Tomcat WC) Fall 2:35</li>\n<li>Cons. Round 2 - Aiden Taylor (Carbondale WC) won by fall over Austin Wolfe (Edwardsville WC) Fall 3:53</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Round 2 - Mason Kelly (Granite City Wrestling Association) won by fall over John Davis (Thundercats) Fall 1:04</li>\n<li>Cons. Round 2 - Gabriel Smith (Harvey Twisters) won by decision over Zackary Hawkins (Harlem Cougars WC) Dec 5-1</li>\n<li>Cons. Round 2 - Andre Hunt (Urbana Tigers WC) won by decision over Aidan Pinto (Team 1006 Wrestling) Dec 1-0</li>\n<li>Cons. Round 2 - Jerred Durian (Fox Valley WC) won by decision over Michael Williams (Rambler WC) Dec 1-0</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Round 2 - Enzo Martinez (Crystal Lake Wizards) won by fall over Parker Schnoeker (Sparta Junior Bulldogs) Fall 0:35</li>\n<li>Cons. Round 2 - Alex Wright (Granite City Wrestling Association) won by fall over Kaitelyine Tolbert (Murphysboro WC) Fall 2:54</li>\n<li>Cons. Round 2 - Coltin Rau (Dakota WC) won by decision over Chance Ingleman (Unity Youth WC) Dec 6-3</li>\n<li>Cons. Round 2 - Michael Esquivel (Team 1006 Wrestling) received a bye   () Bye</li>\n</ul>\n</section>",
  "Champ Semi`s & Con Quarterfinal": "<section class=\"tw-list\">\n<h1>Champ Semi`s &amp; Con Quarterfinal</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>Semifinal - Donny Pigoni (SCN Youth WC) won by decision over Kaden Harman (Golden Eagles WC) Dec 2-0</li>\n<li>Semifinal - Deion Johnson (Harvey Twisters) won by decision over Ty Edwards (Team 1006 Wrestling) Dec 7-3</li>\n<li>Cons. Round 3 - Camren French (Mattoon Youth WC) won by major decision over Cayden Amico (Plainfield WC) Maj 9-0</li>\n<li>Cons. Round 3 - Jeremy Huf (Arlington Cardinals WC) won by decision over Juvontae Williams (Lionheart Intense Wrestling) Dec 11-6</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Semifinal - Tony Keene (Gladiator Elite) won by decision over Jerren Gille (DA WC) Dec 8-2</li>\n<li>Semifinal - Benjamin Davino (SCN Youth WC) won by decision over Carson Bissey (Respect Wrestling) Dec 2-0</li>\n<li>Cons. Round 3 - Javin Jackson-Bey (Harvey Twisters) won by major decision over Raymond Cavey (SCN Youth WC) Maj 8-0</li>\n<li>Cons. Round 3 - Joseph Lathwood (Bulls WC) won by fall over Grant Madl (Elk Grove Junior Grens) Fall 0:53</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Semifinal - William Hupke (SCN Youth WC) won by decision over Dominick Coronado (Yorkville WC) Dec 7-3</li>\n<li>Semifinal - Seth Mendoza (Contender Wrestling) won by tech fall over Bryce Durlacher (The Wrestling Factory) TF 21-6</li>\n<li>Cons. Round 3 - Joel Muehlenbeck (Arlington Cardinals WC) won by decision over Blue Bishop (Wrestling Inc) Dec 8-2</li>\n<li>Cons. Round 3 - Liam Fox (Murphysboro WC) won by decision over Josyah Holland (Harvey Twisters) Dec 5-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Semifinal - Gonzalo Camacho (Bolingbrook Junior Raiders) won by decision over Jack Ferguson (Yorkville WC) Dec 12-7</li>\n<li>Semifinal - Colby Crouch (Sudden Victory Athletic Center) won by fall over Michael DiBenedetto (Greg Gomez Trained Wrestling) Fall 4:06</li>\n<li>Cons. Round 3 - Jackson Smith (Lemont Bears WC) won by decision over Joshua Vazquez (Izzy Style Wrestling) Dec 9-4</li>\n<li>Cons. Round 3 - Jameson Garcia (Gomez Wrestling Academy) won by fall over Thomas Silva (DA WC) Fall 2:36</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Semifinal - Saul Trejo (Gomez Wrestling Academy) won by decision over Colin Young (DA WC) Dec 1-0</li>\n<li>Semifinal - Edmund Enright (Mustang WC) won by decision over Bryce Griffin (Bulls WC) Dec 3-0</li>\n<li>Cons. Round 3 - Harrison Konder (Bolingbrook Junior Raiders) won by decision over Jake Schwartz (Carlinville WC) Dec 5-2</li>\n<li>Cons. Round 3 - Alexander Marre (Izzy Style Wrestling) won by decision over Caleb Nobiling (Lakeland Predators WC) Dec 6-1</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Semifinal - Tyler Guerra (Gomez Wrestling Academy) won by decision over Ricky Ericksen (Vittum Cats of SKT) Dec 4-1</li>\n<li>Semifinal - Renzo Morgan (The Wrestling Factory) won by decision over Connor Munn (Pitbull Wrestling Alliance) Dec 5-0</li>\n<li>Cons. Round 3 - Garrett Luke (Stockton Renegades) won by decision over Santino Scolaro (SCN Youth WC) Dec 8-1</li>\n<li>Cons. Round 3 - Brendan Tunink (Sauk Valley WC) won by decision over Caleb Ohnesorge (Gladiator Elite) Dec 7-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Semifinal - Richard Wade (Gladiator Elite) won by decision over Michael Calcagno (Izzy Style Wrestling) Dec 7-2</li>\n<li>Semifinal - Jackson Gillen (Team 1006 Wrestling) won by decision over Ethan Struck (Crystal Lake Wizards) Dec 4-0</li>\n<li>Cons. Round 3 - Collin Carrigan (Naperville WC) won by decision over Aiden Livingston (Stillman Valley WC) Dec 9-4</li>\n<li>Cons. Round 3 - Jaydon Robinson (Harvey Twisters) won in tie breaker - 1 over Brody Murray (SCN Youth WC) TB-1 7-5</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Semifinal - Zackary Crawford (Sycamore WC) won by fall over Peter Marinopoulos (Mustang WC) Fall 6:00</li>\n<li>Semifinal - Colin Kelly (Tinley Park Bulldogs) won by decision over Drew Surges (SCN Youth WC) Dec 4-3</li>\n<li>Cons. Round 3 - Eric Gustafson (Moline WC) won by decision over Jeremy Loomis (Team 1006 Wrestling) Dec 9-2</li>\n<li>Cons. Round 3 - Isaiah Hayes (Mt. Zion Kids WC) won by major decision over Dillon Raab (The Law) Maj 9-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Semifinal - Griffin Luke (Stockton Renegades) won by fall over Skip Rozanski (Pitbull Wrestling Alliance) Fall 0:52</li>\n<li>Semifinal - David Mayora (Izzy Style Wrestling) won by fall over Logan Swaw (Team 1006 Wrestling) Fall 1:48</li>\n<li>Cons. Round 3 - Luke Christie (Brawlers WC) won by decision over Quinn Herbert (Maine Eagles WC) Dec 7-5</li>\n<li>Cons. Round 3 - Garrett Vincent (Dakota WC) won by decision over Matthew Janiak (Force WC) Dec 4-2</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Semifinal - Kyle Lindsey (Oak Forest Warriors) won by major decision over Jack Lesher (SCN Youth WC) Maj 9-0</li>\n<li>Semifinal - Jack Seacrist (Belvidere Bandits WC) won by tech fall over Kamron Beal (Tinley Park Bulldogs) TF 19-2</li>\n<li>Cons. Round 3 - Declan Fortuna (Izzy Style Wrestling) won by decision over Blake Hinrichsen (Super Soldiers WC) Dec 8-5</li>\n<li>Cons. Round 3 - Anthony Alansari (Scorpion WC) won by fall over Domanic Abeja (Tinley Park Bulldogs) Fall 1:01</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Semifinal - Billy Lindsey (Oak Forest Warriors) won by decision over Abraham Wojcikiewicz (Bulls WC) Dec 7-4</li>\n<li>Semifinal - Elijah Munoz (Team 1006 Wrestling) won by fall over Aidan Blackburn (Mattoon Youth WC) Fall 0:54</li>\n<li>Cons. Round 3 - Joshua Franklin (UP Town WC) won by major decision over Jack Smialowicz (Pitbull Wrestling Alliance) Maj 9-1</li>\n<li>Cons. Round 3 - Jalen Curtis (Greg Gomez Trained Wrestling) won by decision over Gabriel Alvarez (Beat the Streets-Chicago) Dec 5-0</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Semifinal - Gus Cambier (Sycamore WC) won by fall over Logan Nance (Vandalia Jr WC) Fall 0:38</li>\n<li>Semifinal - Devin Medina (Greg Gomez Trained Wrestling) won by decision over William Strelow (Oak Forest Warriors) Dec 5-0</li>\n<li>Cons. Round 3 - Jovon Johnson (Lincoln-Way WC) won by decision over Matthew Kubas (Grayslake WC) Dec 7-6</li>\n<li>Cons. Round 3 - Joseph Scrivani (Golden Eagles WC) won by decision over Luke Liberatore (Bolingbrook Junior Raiders) Dec 6-1</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Semifinal - Ayden Salley (Barrington Broncos WC) won by decision over David Stewart (Blackhawk WC) Dec 3-2</li>\n<li>Semifinal - Dominic Thebeau (East St. Louis Wrestling) won by decision over Daniel Gonzalez (Batavia WC) Dec 9-5</li>\n<li>Cons. Round 3 - Gavin Brown (Oak Forest Warriors) won by fall over Austin Hale (Granite City Wrestling Association) Fall 1:58</li>\n<li>Cons. Round 3 - Conor Phelan (Badger WC) won by decision over Benjamin Alvarez (Team 1006 Wrestling) Dec 9-4</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Semifinal - Aaron Hernandez (Pitbull Wrestling Alliance) won by fall over Sean Scheck (Batavia WC) Fall 1:26</li>\n<li>Semifinal - Edward Perry (SCN Youth WC) won by decision over Jackson Barnhart (Champaign WC) Dec 10-3</li>\n<li>Cons. Round 3 - Hudson McMann (Junior Cyclones WC) won in sudden victory - 1 over Josh Kroll (Dinamo Wrestling) SV-1 5-3</li>\n<li>Cons. Round 3 - Montana Calderon (Tomcat WC) won by decision over Calvin Hempel (Storm Youth WC) Dec 7-6</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Semifinal - Adam Lambaz (Scorpion WC) won by fall over Myles Reardon (Quincy Cyclones WC) Fall 2:17</li>\n<li>Semifinal - Lee Smith (DA WC) won by fall over Tyler Michelini (Elk Grove Junior Grens) Fall 1:55</li>\n<li>Cons. Round 3 - Jarvelon Brown (Lincoln-Way WC) won by decision over Justin Hoffer (Super Soldiers WC) Dec 4-2</li>\n<li>Cons. Round 3 - Braden Hunter (Team 1006 Wrestling) won by fall over Takyla Watkins (Danville Chargers) Fall 0:42</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Semifinal - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Robert Rigg (Charleston WC) Fall 1:15</li>\n<li>Semifinal - Noah Carl (Cumberland Youth WC) won by fall over Ricardo Townsend (Lionheart Intense Wrestling) Fall 3:55</li>\n<li>Cons. Round 3 - Ryan Clancy (Crosstown Spartan Elite WC) won by decision over Jack Mosier (Barrington Broncos WC) Dec 10-4</li>\n<li>Cons. Round 3 - Alexis Correa (DuPage WC) won by fall over Reede Johnson (HF Elite WC) Fall 0:50</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Semifinal - Nore Turner (Lincoln-Way WC) won by decision over Brayden Teunissen (Belvidere Bandits WC) Dec 6-1</li>\n<li>Semifinal - Jase Salin (Celtics WC) won by decision over Rocco Hayes (Contender Wrestling) Dec 3-2</li>\n<li>Cons. Round 3 - Brady Phelps (Arlington Cardinals WC) won by decision over Rocky Seibel (Belleville Little Devils WC) Dec 5-0</li>\n<li>Cons. Round 3 - Caleb Scott (Bulls WC) won by major decision over Nicholas Garcia (Gomez Wrestling Academy) Maj 16-4</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Semifinal - Dominic Ducato (Golden Eagles WC) won by decision over Trevor Silzer (Tinley Park Bulldogs) Dec 3-1</li>\n<li>Semifinal - Brady Grennan (Sauk Valley WC) won by major decision over Colden Dyer (SCN Youth WC) Maj 13-0</li>\n<li>Cons. Round 3 - Inocencio Garcia (Force WC) won by decision over Dominic Schiavone (Izzy Style Wrestling) Dec 9-2</li>\n<li>Cons. Round 3 - Matthew Soltis (Lincoln-Way WC) won by fall over Jaymz Young (East St. Louis Wrestling) Fall 1:14</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Semifinal - Jacob Crandall (Arlington Cardinals WC) won by decision over Benjamin Dunne (Izzy Style Wrestling) Dec 3-0</li>\n<li>Semifinal - William Baysingar (Arlington Cardinals WC) won by decision over Shay Korhorn (Force WC) Dec 1-0</li>\n<li>Cons. Round 3 - Pierre Baldwin (Proviso Power House WC) won by decision over Reef Pacot (Storm Youth WC) Dec 8-4</li>\n<li>Cons. Round 3 - Tyler Evans (Wolves WC) won by major decision over Nicholas Fetters (Belleville Little Devils WC) Maj 14-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Semifinal - Phoenix Blakely (Dakota WC) won by decision over Logan Kuhel-trimmer (Force WC) Dec 7-1</li>\n<li>Semifinal - Chase Hall (Triad Little Knights WC) won by decision over Daniel Sheen (Izzy Style Wrestling) Dec 1-0</li>\n<li>Cons. Round 3 - Owen Dunlap (Tinley Park Bulldogs) won by decision over Paul Woo (Villa-Lombard Cougars) Dec 3-0</li>\n<li>Cons. Round 3 - Joshua Glover (Crystal Lake Wizards) won in sudden victory - 1 over Gylon Sims (Force WC) SV-1 4-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Semifinal - Matthew Hollingsworth (Lincoln-Way WC) won by decision over Brady Foster (Mattoon Youth WC) Dec 11-7</li>\n<li>Semifinal - Kannon Webster (Super Soldiers WC) won in sudden victory - 1 over Antonio Alvarado (Crystal Lake Wizards) SV-1 4-3</li>\n<li>Cons. Round 3 - Kai Neumark (Arlington Cardinals WC) won by major decision over Nicolas Davidson (Crystal Lake Wizards) Maj 10-0</li>\n<li>Cons. Round 3 - Mason Alessio (Force WC) won by decision over Evan Schiffman (Lemont Bears WC) Dec 1-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Semifinal - Joseph Fernau (Izzy Style Wrestling) won in sudden victory - 1 over Dillon Carlson (Crystal Lake Wizards) SV-1 7-5</li>\n<li>Semifinal - Nasir Bailey (Harvey Twisters) won by decision over Santino Robinson (Wrestling 365) Dec 6-4</li>\n<li>Cons. Round 3 - Conor Smetana (Rogue Wrestling) won by fall over Kenneth Siwicki (Naperville WC) Fall 2:53</li>\n<li>Cons. Round 3 - Jacob Macatangay (Force WC) won by decision over Brian Beers (The Wrestling Factory) Dec 7-2</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Semifinal - Ethan Stiles (Izzy Style Wrestling) won by major decision over Nicholas Renteria (Beat the Streets-Chicago) Maj 8-0</li>\n<li>Semifinal - Jordan Blew (Force WC) won by major decision over Carter Hall (Champaign WC) Maj 13-2</li>\n<li>Cons. Round 3 - Brayden Peet (Sycamore WC) won by decision over Tyler Perry (Batavia WC) Dec 1-0</li>\n<li>Cons. Round 3 - Marcus Milianti (Panther WC) won by decision over Sean Conway (Team 312) Dec 7-4</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Semifinal - Vincent Robinson (Harvey Twisters) won by major decision over Dylan Gvillo (Edwardsville WC) Maj 14-4</li>\n<li>Semifinal - Aj Heeg (Beat the Streets-Chicago) won by tech fall over Luis Bazan (Bolingbrook Junior Raiders) TF 20-5</li>\n<li>Cons. Round 3 - Cooper Schodrof (Izzy Style Wrestling) won by fall over Matthew Boyer (North Shore Edge) Fall 2:35</li>\n<li>Cons. Round 3 - Dominik Mallinder (Izzy Style Wrestling) won by decision over Carlos Munoz-Flores (Team 1006 Wrestling) Dec 5-1</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Semifinal - Shawn Minick (Bulls WC) won by decision over Andrew Johnson (Team 1006 Wrestling) Dec 4-2</li>\n<li>Semifinal - Michael Kelly (Tinley Park Bulldogs) won by decision over Korina Blades (Martinez Fox Valley Elite) Dec 1-0</li>\n<li>Cons. Round 3 - Kenyon Boyce (Harvey Twisters) won by decision over Alec Mihelic (Super Soldiers WC) Dec 4-2</li>\n<li>Cons. Round 3 - Will Rude (Sauk Valley WC) won by decision over Nate Pacetti (Panther WC) Dec 7-3</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Semifinal - Joaquin Miranda (Crystal Lake Wizards) won by decision over Jared Gumila (Force WC) Dec 10-7</li>\n<li>Semifinal - Kole Brower (Moline WC) won by decision over Jacob Whiting (Lake Zurich Cubs WC) Dec 7-0</li>\n<li>Cons. Round 3 - Nathaniel Dampier (Gladiator Elite) won by fall over Thomas Boland (Panther WC) Fall 1:20</li>\n<li>Cons. Round 3 - Rashon Allen (Urbana Tigers WC) won by fall over Benjamin Mitchell (Highland Bulldog Jr WC) Fall 2:46</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Semifinal - Damien Lopez (Dekalb WC) won by fall over Owen Gerdes (Force WC) Fall 3:22</li>\n<li>Semifinal - Brody Hallin (Crystal Lake Wizards) won by fall over Tyrin Newsome (Urbana Tigers WC) Fall 1:57</li>\n<li>Cons. Round 3 - Will Collins (North Shore Edge) won by decision over Wade Abrams (Cary-Grove Matmen) Dec 6-3</li>\n<li>Cons. Round 3 - Braden Stauffenberg (Izzy Style Wrestling) won by fall over Cole Brannigan (Lemont Bears WC) Fall 2:40</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Semifinal - Bradley Gillum (Dekalb WC) won by major decision over Wyatt Raab (The Law) Maj 14-4</li>\n<li>Semifinal - Brayden Thompson (nWo WC) won by major decision over Shane Moran (Crystal Lake Wizards) Maj 8-0</li>\n<li>Cons. Round 3 - Elijah Chiaro (SCN Youth WC) won by fall over Mateo Villalobos (Zee-Bee Stingers) Fall 3:43</li>\n<li>Cons. Round 3 - Iysten Syfert (Cumberland Youth WC) won by decision over Connor Brooker (Thundercats) Dec 2-1</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Semifinal - Alexander Tagler (Lemont Bears WC) won by major decision over Marshal Cunz (Harlem Cougars WC) Maj 10-1</li>\n<li>Semifinal - Kennedy Blades (Martinez Fox Valley Elite) won by fall over Aidan Kyllonen (Brawlers WC) Fall 1:00</li>\n<li>Cons. Round 3 - Evan Smith (Force WC) won by decision over Jacob Bottarini (SCN Youth WC) Dec 11-5</li>\n<li>Cons. Round 3 - Owen Jacobson (Tinley Park Bulldogs) won by fall over Moisey Trimble (Belleville Little Devils WC) Fall 0:40</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Semifinal - Christopher Carr (Martinez Fox Valley Elite) won by fall over Alexander Goworowski (Team 312) Fall 2:56</li>\n<li>Semifinal - Antonio Torres (nWo WC) won by fall over Jokiah Sewell (Hawk WC) Fall 1:07</li>\n<li>Cons. Round 3 - Seth Brooks (Granite City Wrestling Association) won by fall over Craig Johnson (Danville Chargers) Fall 1:26</li>\n<li>Cons. Round 3 - Tyler Haynes (Pekin Boys &amp; Girls Club) won by major decision over Jc Piker (Brawlers WC) Maj 10-0</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Semifinal - Brandon Navarro (nWo WC) won by fall over Braeden Tosterud (Elk Grove Junior Grens) Fall 0:59</li>\n<li>Semifinal - Kylen Rose (Roughnecks WC) won in tie breaker - 1 over Nathaniel Dutkin (Wolves WC) TB-1 4-3</li>\n<li>Cons. Round 3 - Kaden Marmon (Triad Little Knights WC) won by fall over Connor Barnes (Peoria Heights Minutemen WC) Fall 3:30</li>\n<li>Cons. Round 3 - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by fall over Giovanni Amaya (Blackhawk WC) Fall 1:29</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Semifinal - John Pacewic (Force WC) won by decision over Elliott Lewis (Tinley Park Bulldogs) Dec 6-4</li>\n<li>Semifinal - Rylee Edwards (Storm Youth WC) won by fall over Michael Macias (Marengo Youth WC) Fall 2:23</li>\n<li>Cons. Round 3 - Gavin Mason (Team 1006 Wrestling) won by decision over Max Terlap (The Wrestling Factory) Dec 5-2</li>\n<li>Cons. Round 3 - Colin O`Neill (Wolfpak WC) won by decision over Karson Lamb (TJ Trained Wrestling) Dec 2-0</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Semifinal - Ghee Rachal (Harvey Twisters) won by fall over Dillan Johnson (Force WC) Fall 2:54</li>\n<li>Semifinal - Aydan Trueblood (TJ Trained Wrestling) won by fall over Eddie Solis (Marengo Youth WC) Fall 1:00</li>\n<li>Cons. Round 3 - Daniel Colunga (Lionheart Intense Wrestling) won by fall over Paulie Robertson (Villa-Lombard Cougars) Fall 3:18</li>\n<li>Cons. Round 3 - Aiden Taylor (Carbondale WC) won by major decision over Rodolfo Flores (Little Rams Wrestling) Maj 9-0</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Semifinal - Jimmy Liston (Martinez Fox Valley Elite) won in tie breaker - 1 over Isaiah Gonzalez (Izzy Style Wrestling) TB-1 3-0</li>\n<li>Semifinal - Ryan Boersma (Tinley Park Bulldogs) won by fall over Vicente Arebalo (Crosstown Spartan Elite WC) Fall 1:55</li>\n<li>Cons. Round 3 - Mason Kelly (Granite City Wrestling Association) won by decision over Gabriel Smith (Harvey Twisters) Dec 7-2</li>\n<li>Cons. Round 3 - Jerred Durian (Fox Valley WC) won by fall over Andre Hunt (Urbana Tigers WC) Fall 1:57</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Semifinal - Oran Varela (Unity Youth WC) won by fall over Sterling Campbell (Edwardsville WC) Fall 0:42</li>\n<li>Semifinal - Robert Schneider (Tinley Park Bulldogs) won by decision over Isaiah Hill (O`Fallon Little Panthers WC) Dec 10-4</li>\n<li>Cons. Round 3 - Enzo Martinez (Crystal Lake Wizards) won by fall over Alex Wright (Granite City Wrestling Association) Fall 3:54</li>\n<li>Cons. Round 3 - Michael Esquivel (Team 1006 Wrestling) won by fall over Coltin Rau (Dakota WC) Fall 3:36</li>\n</ul>\n</section>",
  "Consolation Semifinal": "<section class=\"tw-list\">\n<h1>Consolation Semifinal</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>Cons. Semi - Kaden Harman (Golden Eagles WC) won by decision over Camren French (Mattoon Youth WC) Dec 7-2</li>\n<li>Cons. Semi - Ty Edwards (Team 1006 Wrestling) won by fall over Jeremy Huf (Arlington Cardinals WC) Fall 2:44</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>Cons. Semi - Javin Jackson-Bey (Harvey Twisters) won by fall over Jerren Gille (DA WC) Fall 2:34</li>\n<li>Cons. Semi - Joseph Lathwood (Bulls WC) won by decision over Carson Bissey (Respect Wrestling) Dec 3-2</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>Cons. Semi - Joel Muehlenbeck (Arlington Cardinals WC) won by major decision over Dominick Coronado (Yorkville WC) Maj 10-1</li>\n<li>Cons. Semi - Bryce Durlacher (The Wrestling Factory) won by decision over Liam Fox (Murphysboro WC) Dec 2-0</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>Cons. Semi - Jack Ferguson (Yorkville WC) won by decision over Jackson Smith (Lemont Bears WC) Dec 7-5</li>\n<li>Cons. Semi - Jameson Garcia (Gomez Wrestling Academy) won by decision over Michael DiBenedetto (Greg Gomez Trained Wrestling) Dec 7-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>Cons. Semi - Colin Young (DA WC) won by fall over Harrison Konder (Bolingbrook Junior Raiders) Fall 1:27</li>\n<li>Cons. Semi - Bryce Griffin (Bulls WC) won by decision over Alexander Marre (Izzy Style Wrestling) Dec 3-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>Cons. Semi - Ricky Ericksen (Vittum Cats of SKT) won by decision over Garrett Luke (Stockton Renegades) Dec 4-1</li>\n<li>Cons. Semi - Brendan Tunink (Sauk Valley WC) won by fall over Connor Munn (Pitbull Wrestling Alliance) Fall 2:01</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>Cons. Semi - Michael Calcagno (Izzy Style Wrestling) won by major decision over Collin Carrigan (Naperville WC) Maj 10-2</li>\n<li>Cons. Semi - Ethan Struck (Crystal Lake Wizards) won by decision over Jaydon Robinson (Harvey Twisters) Dec 3-1</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>Cons. Semi - Peter Marinopoulos (Mustang WC) won by decision over Eric Gustafson (Moline WC) Dec 7-0</li>\n<li>Cons. Semi - Drew Surges (SCN Youth WC) won by major decision over Isaiah Hayes (Mt. Zion Kids WC) Maj 9-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>Cons. Semi - Skip Rozanski (Pitbull Wrestling Alliance) won by decision over Luke Christie (Brawlers WC) Dec 3-2</li>\n<li>Cons. Semi - Logan Swaw (Team 1006 Wrestling) won by decision over Garrett Vincent (Dakota WC) Dec 9-6</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>Cons. Semi - Jack Lesher (SCN Youth WC) won by fall over Declan Fortuna (Izzy Style Wrestling) Fall 1:51</li>\n<li>Cons. Semi - Kamron Beal (Tinley Park Bulldogs) won by decision over Anthony Alansari (Scorpion WC) Dec 7-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>Cons. Semi - Abraham Wojcikiewicz (Bulls WC) won by decision over Joshua Franklin (UP Town WC) Dec 3-2</li>\n<li>Cons. Semi - Jalen Curtis (Greg Gomez Trained Wrestling) won by fall over Aidan Blackburn (Mattoon Youth WC) Fall 1:13</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>Cons. Semi - Logan Nance (Vandalia Jr WC) won by fall over Jovon Johnson (Lincoln-Way WC) Fall 3:00</li>\n<li>Cons. Semi - Joseph Scrivani (Golden Eagles WC) won by decision over William Strelow (Oak Forest Warriors) Dec 4-3</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>Cons. Semi - Gavin Brown (Oak Forest Warriors) won by major decision over David Stewart (Blackhawk WC) Maj 10-2</li>\n<li>Cons. Semi - Daniel Gonzalez (Batavia WC) won by decision over Conor Phelan (Badger WC) Dec 6-4</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>Cons. Semi - Hudson McMann (Junior Cyclones WC) won by decision over Sean Scheck (Batavia WC) Dec 8-6</li>\n<li>Cons. Semi - Jackson Barnhart (Champaign WC) won by decision over Montana Calderon (Tomcat WC) Dec 6-1</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>Cons. Semi - Myles Reardon (Quincy Cyclones WC) won over Jarvelon Brown (Lincoln-Way WC) OTHR1</li>\n<li>Cons. Semi - Braden Hunter (Team 1006 Wrestling) won by fall over Tyler Michelini (Elk Grove Junior Grens) Fall 0:16</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>Cons. Semi - Robert Rigg (Charleston WC) won by fall over Ryan Clancy (Crosstown Spartan Elite WC) Fall 2:18</li>\n<li>Cons. Semi - Ricardo Townsend (Lionheart Intense Wrestling) won by fall over Alexis Correa (DuPage WC) Fall 1:55</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>Cons. Semi - Brayden Teunissen (Belvidere Bandits WC) won by decision over Brady Phelps (Arlington Cardinals WC) Dec 5-3</li>\n<li>Cons. Semi - Rocco Hayes (Contender Wrestling) won by decision over Caleb Scott (Bulls WC) Dec 2-1</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>Cons. Semi - Trevor Silzer (Tinley Park Bulldogs) won by decision over Inocencio Garcia (Force WC) Dec 3-2</li>\n<li>Cons. Semi - Matthew Soltis (Lincoln-Way WC) won by fall over Colden Dyer (SCN Youth WC) Fall 2:49</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>Cons. Semi - Benjamin Dunne (Izzy Style Wrestling) won by decision over Pierre Baldwin (Proviso Power House WC) Dec 7-2</li>\n<li>Cons. Semi - Shay Korhorn (Force WC) won by major decision over Tyler Evans (Wolves WC) Maj 9-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>Cons. Semi - Logan Kuhel-trimmer (Force WC) won by decision over Owen Dunlap (Tinley Park Bulldogs) Dec 1-0</li>\n<li>Cons. Semi - Daniel Sheen (Izzy Style Wrestling) won by decision over Joshua Glover (Crystal Lake Wizards) Dec 6-1</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>Cons. Semi - Kai Neumark (Arlington Cardinals WC) won by major decision over Brady Foster (Mattoon Youth WC) Maj 11-0</li>\n<li>Cons. Semi - Antonio Alvarado (Crystal Lake Wizards) won by fall over Mason Alessio (Force WC) Fall 3:49</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>Cons. Semi - Conor Smetana (Rogue Wrestling) won by decision over Dillon Carlson (Crystal Lake Wizards) Dec 7-0</li>\n<li>Cons. Semi - Santino Robinson (Wrestling 365) won by decision over Jacob Macatangay (Force WC) Dec 6-4</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>Cons. Semi - Nicholas Renteria (Beat the Streets-Chicago) won by fall over Brayden Peet (Sycamore WC) Fall 3:46</li>\n<li>Cons. Semi - Carter Hall (Champaign WC) won by decision over Marcus Milianti (Panther WC) Dec 8-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>Cons. Semi - Dylan Gvillo (Edwardsville WC) won by decision over Cooper Schodrof (Izzy Style Wrestling) Dec 5-4</li>\n<li>Cons. Semi - Dominik Mallinder (Izzy Style Wrestling) won in tie breaker - 1 over Luis Bazan (Bolingbrook Junior Raiders) TB-1 8-7</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>Cons. Semi - Andrew Johnson (Team 1006 Wrestling) won by decision over Kenyon Boyce (Harvey Twisters) Dec 7-4</li>\n<li>Cons. Semi - Will Rude (Sauk Valley WC) won by decision over Korina Blades (Martinez Fox Valley Elite) Dec 6-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>Cons. Semi - Jared Gumila (Force WC) won by fall over Nathaniel Dampier (Gladiator Elite) Fall 1:16</li>\n<li>Cons. Semi - Rashon Allen (Urbana Tigers WC) won by major decision over Jacob Whiting (Lake Zurich Cubs WC) Maj 13-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>Cons. Semi - Will Collins (North Shore Edge) won by decision over Owen Gerdes (Force WC) Dec 4-0</li>\n<li>Cons. Semi - Braden Stauffenberg (Izzy Style Wrestling) won by fall over Tyrin Newsome (Urbana Tigers WC) Fall 2:02</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>Cons. Semi - Elijah Chiaro (SCN Youth WC) won by major decision over Wyatt Raab (The Law) Maj 13-4</li>\n<li>Cons. Semi - Shane Moran (Crystal Lake Wizards) won by decision over Iysten Syfert (Cumberland Youth WC) Dec 7-0</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>Cons. Semi - Marshal Cunz (Harlem Cougars WC) won by fall over Evan Smith (Force WC) Fall 4:24</li>\n<li>Cons. Semi - Owen Jacobson (Tinley Park Bulldogs) won by tech fall over Aidan Kyllonen (Brawlers WC) TF 17-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>Cons. Semi - Seth Brooks (Granite City Wrestling Association) won by fall over Alexander Goworowski (Team 312) Fall 3:26</li>\n<li>Cons. Semi - Jokiah Sewell (Hawk WC) won by decision over Tyler Haynes (Pekin Boys &amp; Girls Club) Dec 11-5</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>Cons. Semi - Braeden Tosterud (Elk Grove Junior Grens) won by fall over Kaden Marmon (Triad Little Knights WC) Fall 2:57</li>\n<li>Cons. Semi - Nathaniel Dutkin (Wolves WC) won by fall over Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) Fall 3:35</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>Cons. Semi - Elliott Lewis (Tinley Park Bulldogs) won by major decision over Gavin Mason (Team 1006 Wrestling) Maj 9-0</li>\n<li>Cons. Semi - Colin O`Neill (Wolfpak WC) won by decision over Michael Macias (Marengo Youth WC) Dec 4-2</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>Cons. Semi - Daniel Colunga (Lionheart Intense Wrestling) won by fall over Dillan Johnson (Force WC) Fall 2:24</li>\n<li>Cons. Semi - Aiden Taylor (Carbondale WC) won by decision over Eddie Solis (Marengo Youth WC) Dec 8-4</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>Cons. Semi - Mason Kelly (Granite City Wrestling Association) won by decision over Isaiah Gonzalez (Izzy Style Wrestling) Dec 1-0</li>\n<li>Cons. Semi - Jerred Durian (Fox Valley WC) won by decision over Vicente Arebalo (Crosstown Spartan Elite WC) Dec 4-3</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>Cons. Semi - Sterling Campbell (Edwardsville WC) won by fall over Enzo Martinez (Crystal Lake Wizards) Fall 0:58</li>\n<li>Cons. Semi - Isaiah Hill (O`Fallon Little Panthers WC) won by fall over Michael Esquivel (Team 1006 Wrestling) Fall 1:10</li>\n</ul>\n</section>",
  "Place Bouts": "<section class=\"tw-list\">\n<h1>Place Bouts</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>3rd Place Match - Ty Edwards (Team 1006 Wrestling) won by decision over Kaden Harman (Golden Eagles WC) Dec 3-1</li>\n<li>5th Place Match - Camren French (Mattoon Youth WC) won by fall over Jeremy Huf (Arlington Cardinals WC) Fall 2:55</li>\n<li>7th Place Match - Juvontae Williams (Lionheart Intense Wrestling) won by fall over Cayden Amico (Plainfield WC) Fall 1:10</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>3rd Place Match - Javin Jackson-Bey (Harvey Twisters) won in sudden victory - 1 over Joseph Lathwood (Bulls WC) SV-1 7-5</li>\n<li>5th Place Match - Carson Bissey (Respect Wrestling) won by decision over Jerren Gille (DA WC) Dec 1-0</li>\n<li>7th Place Match - Raymond Cavey (SCN Youth WC) won by decision over Grant Madl (Elk Grove Junior Grens) Dec 3-0</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>3rd Place Match - Joel Muehlenbeck (Arlington Cardinals WC) won by decision over Bryce Durlacher (The Wrestling Factory) Dec 5-2</li>\n<li>5th Place Match - Dominick Coronado (Yorkville WC) won by decision over Liam Fox (Murphysboro WC) Dec 3-1</li>\n<li>7th Place Match - Blue Bishop (Wrestling Inc) won in sudden victory - 1 over Josyah Holland (Harvey Twisters) SV-1 6-4</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>3rd Place Match - Jameson Garcia (Gomez Wrestling Academy) won by decision over Jack Ferguson (Yorkville WC) Dec 8-6</li>\n<li>5th Place Match - Michael DiBenedetto (Greg Gomez Trained Wrestling) won by decision over Jackson Smith (Lemont Bears WC) Dec 8-5</li>\n<li>7th Place Match - Joshua Vazquez (Izzy Style Wrestling) won by decision over Thomas Silva (DA WC) Dec 7-2</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>3rd Place Match - Bryce Griffin (Bulls WC) won in tie breaker - 1 over Colin Young (DA WC) TB-1 2-1</li>\n<li>5th Place Match - Alexander Marre (Izzy Style Wrestling) won by decision over Harrison Konder (Bolingbrook Junior Raiders) Dec 9-4</li>\n<li>7th Place Match - Jake Schwartz (Carlinville WC) won by major decision over Caleb Nobiling (Lakeland Predators WC) Maj 8-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>3rd Place Match - Ricky Ericksen (Vittum Cats of SKT) won by decision over Brendan Tunink (Sauk Valley WC) Dec 2-1</li>\n<li>5th Place Match - Garrett Luke (Stockton Renegades) won by decision over Connor Munn (Pitbull Wrestling Alliance) Dec 7-0</li>\n<li>7th Place Match - Caleb Ohnesorge (Gladiator Elite) won in sudden victory - 1 over Santino Scolaro (SCN Youth WC) SV-1 4-2</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>3rd Place Match - Michael Calcagno (Izzy Style Wrestling) won by decision over Ethan Struck (Crystal Lake Wizards) Dec 9-2</li>\n<li>5th Place Match - Jaydon Robinson (Harvey Twisters) won by decision over Collin Carrigan (Naperville WC) Dec 6-2</li>\n<li>7th Place Match - Aiden Livingston (Stillman Valley WC) won by decision over Brody Murray (SCN Youth WC) Dec 7-3</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>3rd Place Match - Peter Marinopoulos (Mustang WC) won in sudden victory - 1 over Drew Surges (SCN Youth WC) SV-1 3-1</li>\n<li>5th Place Match - Eric Gustafson (Moline WC) won by decision over Isaiah Hayes (Mt. Zion Kids WC) Dec 6-4</li>\n<li>7th Place Match - Jeremy Loomis (Team 1006 Wrestling) won in sudden victory - 1 over Dillon Raab (The Law) SV-1 10-9</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>3rd Place Match - Logan Swaw (Team 1006 Wrestling) won by fall over Skip Rozanski (Pitbull Wrestling Alliance) Fall 1:14</li>\n<li>5th Place Match - Luke Christie (Brawlers WC) won by decision over Garrett Vincent (Dakota WC) Dec 6-5</li>\n<li>7th Place Match - Quinn Herbert (Maine Eagles WC) won in sudden victory - 1 over Matthew Janiak (Force WC) SV-1 5-3</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>3rd Place Match - Kamron Beal (Tinley Park Bulldogs) won by decision over Jack Lesher (SCN Youth WC) Dec 9-4</li>\n<li>5th Place Match - Declan Fortuna (Izzy Style Wrestling) won by major decision over Anthony Alansari (Scorpion WC) Maj 9-1</li>\n<li>7th Place Match - Blake Hinrichsen (Super Soldiers WC) won by decision over Domanic Abeja (Tinley Park Bulldogs) Dec 5-2</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>3rd Place Match - Jalen Curtis (Greg Gomez Trained Wrestling) won by decision over Abraham Wojcikiewicz (Bulls WC) Dec 4-1</li>\n<li>5th Place Match - Joshua Franklin (UP Town WC) won by major decision over Aidan Blackburn (Mattoon Youth WC) Maj 15-1</li>\n<li>7th Place Match - Jack Smialowicz (Pitbull Wrestling Alliance) won in sudden victory - 1 over Gabriel Alvarez (Beat the Streets-Chicago) SV-1 6-4</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>3rd Place Match - Joseph Scrivani (Golden Eagles WC) won by decision over Logan Nance (Vandalia Jr WC) Dec 4-0</li>\n<li>5th Place Match - William Strelow (Oak Forest Warriors) won by fall over Jovon Johnson (Lincoln-Way WC) Fall 1:13</li>\n<li>7th Place Match - Matthew Kubas (Grayslake WC) won by decision over Luke Liberatore (Bolingbrook Junior Raiders) Dec 6-0</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>3rd Place Match - Daniel Gonzalez (Batavia WC) won by fall over Gavin Brown (Oak Forest Warriors) Fall 0:30</li>\n<li>5th Place Match - Conor Phelan (Badger WC) won by decision over David Stewart (Blackhawk WC) Dec 11-8</li>\n<li>7th Place Match - Austin Hale (Granite City Wrestling Association) won by decision over Benjamin Alvarez (Team 1006 Wrestling) Dec 6-5</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>3rd Place Match - Hudson McMann (Junior Cyclones WC) won by fall over Jackson Barnhart (Champaign WC) Fall 1:54</li>\n<li>5th Place Match - Sean Scheck (Batavia WC) won by decision over Montana Calderon (Tomcat WC) Dec 3-2</li>\n<li>7th Place Match - Josh Kroll (Dinamo Wrestling) won by fall over Calvin Hempel (Storm Youth WC) Fall 1:10</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>3rd Place Match - Braden Hunter (Team 1006 Wrestling) won by decision over Myles Reardon (Quincy Cyclones WC) Dec 4-2</li>\n<li>5th Place Match - Jarvelon Brown (Lincoln-Way WC) won by fall over Tyler Michelini (Elk Grove Junior Grens) Fall 0:33</li>\n<li>7th Place Match - Justin Hoffer (Super Soldiers WC) won by fall over Takyla Watkins (Danville Chargers) Fall 1:23</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>3rd Place Match - Robert Rigg (Charleston WC) won by fall over Ricardo Townsend (Lionheart Intense Wrestling) Fall 0:39</li>\n<li>5th Place Match - Ryan Clancy (Crosstown Spartan Elite WC) won by decision over Alexis Correa (DuPage WC) Dec 2-0</li>\n<li>7th Place Match - Jack Mosier (Barrington Broncos WC) won by fall over Reede Johnson (HF Elite WC) Fall 0:19</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>3rd Place Match - Rocco Hayes (Contender Wrestling) won by decision over Brayden Teunissen (Belvidere Bandits WC) Dec 3-0</li>\n<li>5th Place Match - Brady Phelps (Arlington Cardinals WC) won by decision over Caleb Scott (Bulls WC) Dec 11-6</li>\n<li>7th Place Match - Nicholas Garcia (Gomez Wrestling Academy) won by decision over Rocky Seibel (Belleville Little Devils WC) Dec 9-5</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>3rd Place Match - Trevor Silzer (Tinley Park Bulldogs) won by decision over Matthew Soltis (Lincoln-Way WC) Dec 2-0</li>\n<li>5th Place Match - Inocencio Garcia (Force WC) won by decision over Colden Dyer (SCN Youth WC) Dec 8-3</li>\n<li>7th Place Match - Jaymz Young (East St. Louis Wrestling) won in sudden victory - 1 over Dominic Schiavone (Izzy Style Wrestling) SV-1 4-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>3rd Place Match - Shay Korhorn (Force WC) won by decision over Benjamin Dunne (Izzy Style Wrestling) Dec 8-2</li>\n<li>5th Place Match - Pierre Baldwin (Proviso Power House WC) won by decision over Tyler Evans (Wolves WC) Dec 6-0</li>\n<li>7th Place Match - Reef Pacot (Storm Youth WC) won by decision over Nicholas Fetters (Belleville Little Devils WC) Dec 6-1</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>3rd Place Match - Daniel Sheen (Izzy Style Wrestling) won by major decision over Logan Kuhel-trimmer (Force WC) Maj 16-6</li>\n<li>5th Place Match - Joshua Glover (Crystal Lake Wizards) won by decision over Owen Dunlap (Tinley Park Bulldogs) Dec 1-0</li>\n<li>7th Place Match - Gylon Sims (Force WC) won by decision over Paul Woo (Villa-Lombard Cougars) Dec 9-2</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>3rd Place Match - Antonio Alvarado (Crystal Lake Wizards) won by major decision over Kai Neumark (Arlington Cardinals WC) Maj 14-1</li>\n<li>5th Place Match - Mason Alessio (Force WC) won by decision over Brady Foster (Mattoon Youth WC) Dec 9-3</li>\n<li>7th Place Match - Nicolas Davidson (Crystal Lake Wizards) won by decision over Evan Schiffman (Lemont Bears WC) Dec 6-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>3rd Place Match - Santino Robinson (Wrestling 365) won by fall over Conor Smetana (Rogue Wrestling) Fall 2:48</li>\n<li>5th Place Match - Jacob Macatangay (Force WC) won by decision over Dillon Carlson (Crystal Lake Wizards) Dec 3-2</li>\n<li>7th Place Match - Brian Beers (The Wrestling Factory) won by decision over Kenneth Siwicki (Naperville WC) Dec 2-1</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>3rd Place Match - Nicholas Renteria (Beat the Streets-Chicago) won by decision over Carter Hall (Champaign WC) Dec 7-0</li>\n<li>5th Place Match - Brayden Peet (Sycamore WC) won by decision over Marcus Milianti (Panther WC) Dec 9-5</li>\n<li>7th Place Match - Sean Conway (Team 312) won by major decision over Tyler Perry (Batavia WC) Maj 10-1</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>3rd Place Match - Dylan Gvillo (Edwardsville WC) won by decision over Dominik Mallinder (Izzy Style Wrestling) Dec 3-0</li>\n<li>5th Place Match - Luis Bazan (Bolingbrook Junior Raiders) won by decision over Cooper Schodrof (Izzy Style Wrestling) Dec 4-3</li>\n<li>7th Place Match - Carlos Munoz-Flores (Team 1006 Wrestling) won by fall over Matthew Boyer (North Shore Edge) Fall 3:27</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>3rd Place Match - Will Rude (Sauk Valley WC) won by decision over Andrew Johnson (Team 1006 Wrestling) Dec 2-0</li>\n<li>5th Place Match - Kenyon Boyce (Harvey Twisters) won by decision over Korina Blades (Martinez Fox Valley Elite) Dec 6-4</li>\n<li>7th Place Match - Alec Mihelic (Super Soldiers WC) won by major decision over Nate Pacetti (Panther WC) Maj 8-0</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>3rd Place Match - Jared Gumila (Force WC) won by fall over Rashon Allen (Urbana Tigers WC) Fall 2:34</li>\n<li>5th Place Match - Nathaniel Dampier (Gladiator Elite) won by major decision over Jacob Whiting (Lake Zurich Cubs WC) Maj 10-2</li>\n<li>7th Place Match - Thomas Boland (Panther WC) won by major decision over Benjamin Mitchell (Highland Bulldog Jr WC) Maj 11-0</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>3rd Place Match - Will Collins (North Shore Edge) won by decision over Braden Stauffenberg (Izzy Style Wrestling) Dec 6-3</li>\n<li>5th Place Match - Owen Gerdes (Force WC) won by major decision over Tyrin Newsome (Urbana Tigers WC) Maj 12-2</li>\n<li>7th Place Match - Cole Brannigan (Lemont Bears WC) won by decision over Wade Abrams (Cary-Grove Matmen) Dec 5-3</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>3rd Place Match - Shane Moran (Crystal Lake Wizards) won by injury default over Elijah Chiaro (SCN Youth WC) Inj. 1:43</li>\n<li>5th Place Match - Wyatt Raab (The Law) won by decision over Iysten Syfert (Cumberland Youth WC) Dec 12-6</li>\n<li>7th Place Match - Connor Brooker (Thundercats) won by fall over Mateo Villalobos (Zee-Bee Stingers) Fall 2:52</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>3rd Place Match - Owen Jacobson (Tinley Park Bulldogs) won by decision over Marshal Cunz (Harlem Cougars WC) Dec 1-0</li>\n<li>5th Place Match - Aidan Kyllonen (Brawlers WC) won by decision over Evan Smith (Force WC) Dec 3-2</li>\n<li>7th Place Match - Jacob Bottarini (SCN Youth WC) won by decision over Moisey Trimble (Belleville Little Devils WC) Dec 2-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>3rd Place Match - Jokiah Sewell (Hawk WC) won by decision over Seth Brooks (Granite City Wrestling Association) Dec 6-4</li>\n<li>5th Place Match - Tyler Haynes (Pekin Boys &amp; Girls Club) won by decision over Alexander Goworowski (Team 312) Dec 9-5</li>\n<li>7th Place Match - Craig Johnson (Danville Chargers) won by fall over Jc Piker (Brawlers WC) Fall 0:30</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>3rd Place Match - Braeden Tosterud (Elk Grove Junior Grens) won by decision over Nathaniel Dutkin (Wolves WC) Dec 7-6</li>\n<li>5th Place Match - Connor Lorden (LaSalle Peru Crunching Cavs Youth WC) won by decision over Kaden Marmon (Triad Little Knights WC) Dec 6-5</li>\n<li>7th Place Match - Connor Barnes (Peoria Heights Minutemen WC) won by fall over Giovanni Amaya (Blackhawk WC) Fall 1:14</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>3rd Place Match - Elliott Lewis (Tinley Park Bulldogs) won by major decision over Colin O`Neill (Wolfpak WC) Maj 13-3</li>\n<li>5th Place Match - Michael Macias (Marengo Youth WC) won by decision over Gavin Mason (Team 1006 Wrestling) Dec 6-0</li>\n<li>7th Place Match - Karson Lamb (TJ Trained Wrestling) won in sudden victory - 1 over Max Terlap (The Wrestling Factory) SV-1 3-1</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>3rd Place Match - Daniel Colunga (Lionheart Intense Wrestling) won by major decision over Aiden Taylor (Carbondale WC) Maj 8-0</li>\n<li>5th Place Match - Dillan Johnson (Force WC) won by decision over Eddie Solis (Marengo Youth WC) Dec 9-2</li>\n<li>7th Place Match - Paulie Robertson (Villa-Lombard Cougars) won by fall over Rodolfo Flores (Little Rams Wrestling) Fall 2:43</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>3rd Place Match - Jerred Durian (Fox Valley WC) won by decision over Mason Kelly (Granite City Wrestling Association) Dec 2-0</li>\n<li>5th Place Match - Vicente Arebalo (Crosstown Spartan Elite WC) won by fall over Isaiah Gonzalez (Izzy Style Wrestling) Fall 1:05</li>\n<li>7th Place Match - Gabriel Smith (Harvey Twisters) won by decision over Andre Hunt (Urbana Tigers WC) Dec 7-5</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>3rd Place Match - Isaiah Hill (O`Fallon Little Panthers WC) won by fall over Sterling Campbell (Edwardsville WC) Fall 0:44</li>\n<li>5th Place Match - Michael Esquivel (Team 1006 Wrestling) won in tie breaker - 1 over Enzo Martinez (Crystal Lake Wizards) TB-1 3-2</li>\n<li>7th Place Match - Alex Wright (Granite City Wrestling Association) won by decision over Coltin Rau (Dakota WC) Dec 1-0</li>\n</ul>\n</section>",
  "Championship Bouts": "<section class=\"tw-list\">\n<h1>Championship Bouts</h1>\n<h2>Novice 66</h2>\n<ul>\n<li>1st Place Match - Deion Johnson (Harvey Twisters) won by decision over Donny Pigoni (SCN Youth WC) Dec 3-2</li>\n</ul>\n<h2>Novice 70</h2>\n<ul>\n<li>1st Place Match - Benjamin Davino (SCN Youth WC) won by decision over Tony Keene (Gladiator Elite) Dec 2-1</li>\n</ul>\n<h2>Novice 74</h2>\n<ul>\n<li>1st Place Match - Seth Mendoza (Contender Wrestling) won by fall over William Hupke (SCN Youth WC) Fall 4:07</li>\n</ul>\n<h2>Novice 79</h2>\n<ul>\n<li>1st Place Match - Colby Crouch (Sudden Victory Athletic Center) won by major decision over Gonzalo Camacho (Bolingbrook Junior Raiders) Maj 9-0</li>\n</ul>\n<h2>Novice 84</h2>\n<ul>\n<li>1st Place Match - Saul Trejo (Gomez Wrestling Academy) won by decision over Edmund Enright (Mustang WC) Dec 2-0</li>\n</ul>\n<h2>Novice 89</h2>\n<ul>\n<li>1st Place Match - Renzo Morgan (The Wrestling Factory) won in sudden victory - 1 over Tyler Guerra (Gomez Wrestling Academy) SV-1 5-3</li>\n</ul>\n<h2>Novice 95</h2>\n<ul>\n<li>1st Place Match - Richard Wade (Gladiator Elite) won by fall over Jackson Gillen (Team 1006 Wrestling) Fall 3:48</li>\n</ul>\n<h2>Novice 101</h2>\n<ul>\n<li>1st Place Match - Colin Kelly (Tinley Park Bulldogs) won by decision over Zackary Crawford (Sycamore WC) Dec 5-0</li>\n</ul>\n<h2>Novice 108</h2>\n<ul>\n<li>1st Place Match - David Mayora (Izzy Style Wrestling) won by major decision over Griffin Luke (Stockton Renegades) Maj 14-5</li>\n</ul>\n<h2>Novice 115</h2>\n<ul>\n<li>1st Place Match - Jack Seacrist (Belvidere Bandits WC) won in sudden victory - 1 over Kyle Lindsey (Oak Forest Warriors) SV-1 2-0</li>\n</ul>\n<h2>Novice 122</h2>\n<ul>\n<li>1st Place Match - Elijah Munoz (Team 1006 Wrestling) won by decision over Billy Lindsey (Oak Forest Warriors) Dec 5-4</li>\n</ul>\n<h2>Novice 130</h2>\n<ul>\n<li>1st Place Match - Gus Cambier (Sycamore WC) won by decision over Devin Medina (Greg Gomez Trained Wrestling) Dec 5-2</li>\n</ul>\n<h2>Novice 138</h2>\n<ul>\n<li>1st Place Match - Dominic Thebeau (East St. Louis Wrestling) won by major decision over Ayden Salley (Barrington Broncos WC) Maj 11-1</li>\n</ul>\n<h2>Novice 156</h2>\n<ul>\n<li>1st Place Match - Aaron Hernandez (Pitbull Wrestling Alliance) won by decision over Edward Perry (SCN Youth WC) Dec 4-0</li>\n</ul>\n<h2>Novice 177</h2>\n<ul>\n<li>1st Place Match - Lee Smith (DA WC) won by decision over Adam Lambaz (Scorpion WC) Dec 9-2</li>\n</ul>\n<h2>Novice 215</h2>\n<ul>\n<li>1st Place Match - Joey Ochoa (Red Raiders Wrestling Team) won by fall over Noah Carl (Cumberland Youth WC) Fall 1:16</li>\n</ul>\n<h2>Novice 62</h2>\n<ul>\n<li>1st Place Match - Nore Turner (Lincoln-Way WC) won by decision over Jase Salin (Celtics WC) Dec 6-1</li>\n</ul>\n<h2>Senior 74</h2>\n<ul>\n<li>1st Place Match - Dominic Ducato (Golden Eagles WC) won by decision over Brady Grennan (Sauk Valley WC) Dec 7-2</li>\n</ul>\n<h2>Senior 79</h2>\n<ul>\n<li>1st Place Match - William Baysingar (Arlington Cardinals WC) won by decision over Jacob Crandall (Arlington Cardinals WC) Dec 1-0</li>\n</ul>\n<h2>Senior 84</h2>\n<ul>\n<li>1st Place Match - Chase Hall (Triad Little Knights WC) won by decision over Phoenix Blakely (Dakota WC) Dec 4-3</li>\n</ul>\n<h2>Senior 89</h2>\n<ul>\n<li>1st Place Match - Kannon Webster (Super Soldiers WC) won by major decision over Matthew Hollingsworth (Lincoln-Way WC) Maj 8-0</li>\n</ul>\n<h2>Senior 95</h2>\n<ul>\n<li>1st Place Match - Nasir Bailey (Harvey Twisters) won by decision over Joseph Fernau (Izzy Style Wrestling) Dec 5-3</li>\n</ul>\n<h2>Senior 101</h2>\n<ul>\n<li>1st Place Match - Jordan Blew (Force WC) won in sudden victory - 1 over Ethan Stiles (Izzy Style Wrestling) SV-1 8-3</li>\n</ul>\n<h2>Senior 108</h2>\n<ul>\n<li>1st Place Match - Vincent Robinson (Harvey Twisters) won by major decision over Aj Heeg (Beat the Streets-Chicago) Maj 10-2</li>\n</ul>\n<h2>Senior 115</h2>\n<ul>\n<li>1st Place Match - Michael Kelly (Tinley Park Bulldogs) won by decision over Shawn Minick (Bulls WC) Dec 2-1</li>\n</ul>\n<h2>Senior 122</h2>\n<ul>\n<li>1st Place Match - Joaquin Miranda (Crystal Lake Wizards) won by decision over Kole Brower (Moline WC) Dec 3-2</li>\n</ul>\n<h2>Senior 130</h2>\n<ul>\n<li>1st Place Match - Damien Lopez (Dekalb WC) won by decision over Brody Hallin (Crystal Lake Wizards) Dec 7-1</li>\n</ul>\n<h2>Senior 138</h2>\n<ul>\n<li>1st Place Match - Brayden Thompson (nWo WC) won in tie breaker - 1 over Bradley Gillum (Dekalb WC) TB-1 3-2</li>\n</ul>\n<h2>Senior 147</h2>\n<ul>\n<li>1st Place Match - Alexander Tagler (Lemont Bears WC) won in sudden victory - 1 over Kennedy Blades (Martinez Fox Valley Elite) SV-1 3-1</li>\n</ul>\n<h2>Senior 156</h2>\n<ul>\n<li>1st Place Match - Antonio Torres (nWo WC) won by fall over Christopher Carr (Martinez Fox Valley Elite) Fall 2:57</li>\n</ul>\n<h2>Senior 166</h2>\n<ul>\n<li>1st Place Match - Kylen Rose (Roughnecks WC) won by fall over Brandon Navarro (nWo WC) Fall 4:21</li>\n</ul>\n<h2>Senior 177</h2>\n<ul>\n<li>1st Place Match - John Pacewic (Force WC) won by decision over Rylee Edwards (Storm Youth WC) Dec 6-3</li>\n</ul>\n<h2>Senior 189</h2>\n<ul>\n<li>1st Place Match - Ghee Rachal (Harvey Twisters) won by fall over Aydan Trueblood (TJ Trained Wrestling) Fall 3:28</li>\n</ul>\n<h2>Senior 215</h2>\n<ul>\n<li>1st Place Match - Ryan Boersma (Tinley Park Bulldogs) won by fall over Jimmy Liston (Martinez Fox Valley Elite) Fall 0:58</li>\n</ul>\n<h2>Senior 275</h2>\n<ul>\n<li>1st Place Match - Oran Varela (Unity Youth WC) won by fall over Robert Schneider (Tinley Park Bulldogs) Fall 2:35</li>\n</ul>\n</section>"
}
